{"id":14804,"name":"GTI Racing","slug":"gti-racing","url":"https:\/\/www.igdb.com\/games\/gti-racing","created_at":1449443899428,"updated_at":1515680785563,"summary":"GTI Racing uniquely blends a realistic and highly detailed car physics simulation with the pure fun of driving in a very dynamic way. Grab the wheel, push the pedal to the metal and gather the sensation for the incredible sense of speed and the power of all the real world cars. \n \nRealistic driving model: Lifelike car physics reflect the pure enjoyment of dynamic car driving using some of the best dynamic physics around. Detailed handling model with carefully adjusted parameters give you full control of the car and an incredible ease of driving whilst still being very fun to drive. \n \nCars: GTI Racing gives you the biggest collection of the legendary European Volkswagen Golf series cars. Choose one of the 15 GOLF models, representing all five generations from its original heritage through to the current day. Try out the GTI, G60 and the outstanding R32! Check out Volkswagens hottest concept cars and classics - along with the original Beetle and T1 \"Samba\" transporter. \n \nTuning: GTI Racing introduces you to the professional car customization world, thanks to the impressive and wide array of original visual and performance modding and tuning parts. Spoilers, xenon lights, wide body kits, exhausts and rims - everything you would ever need or desire for the visual aspect of tuning your car. Turbo's, nitro`s, sports transmissions, performance brake kits and wide tires - unlimited performance tuning possibilities. \n \nCareer: Over 70 races in 6 unique settings and scenarios against challenging AI opponents will keep the heat on. Time trial, Drift competition and Drag racing, wild Baja and new Legal Race modes. Finish all 25 Championships located in Germany, France, Italy, UK and USA, earn money and spend it on your ride. \n \nDynamic race surroundings: GTI Racing introduces a new level of intensity into the world of racing thanks to fully physics simulated hundreds of objects on the tracks. Use fully interactive objects to create your advantage - slow down your opponents or disable their cars completely. \n \nDemanding AI: drivers make full use of the driving and collision physics model. They will cut you off, run you off the road, use shortcuts to get to the finish line first, so be on your guard and watch out for them. \n \nDetailed car damage: every contact you make with and object or form of racing collision will leave a dent on your vehicle! Based on Xpand Rally experiences highly detailed damage and mechanical car part stress models this has ben used to great effect to enhance the experience with a very rich flavour. \n \nOnline drive: Race through LAN or on the Internet. Extremely playable Baja mode, closed circuits, highways, drift driving competitions and drag racing championship which will give the multi player racer something to shout about. Intense 4 player racing and action in each race.","popularity":1.333333333333333,"games":[1050,36662,22425,97,40470,19934,19290,98,54789,96],"tags":[268435466,268435469,536871647,536872060,536872070,536872590,536872695,536874007,536874824,536875046,536875061,536875069,536875271,536875356,536875456,536875559,536875593,536875955,536876108,536876419,536876698,536876788,536877744,536878319,536879193,536883729,536883983],"developers":[108],"publishers":[108],"category":0,"game_modes":[1,2],"keywords":[735,1148,1158,1678,1783,3095,3912,4134,4149,4157,4359,4444,4544,4647,4681,5043,5196,5507,5786,5876,6832,7407,8281,12817,13071],"genres":[10,13],"first_release_date":1151971200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1151971200000,"human":"2006-Jul-04","y":2006,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a9yrimz9qgvzar57wshe.jpg","cloudinary_id":"a9yrimz9qgvzar57wshe","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ri8geecfptav4ndv4vrj.jpg","cloudinary_id":"ri8geecfptav4ndv4vrj","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jlidvjbhljqivensn1we.jpg","cloudinary_id":"jlidvjbhljqivensn1we","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/thtrs194xs6ktsik6zon.jpg","cloudinary_id":"thtrs194xs6ktsik6zon","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lzslui8bzommcypriw9s.jpg","cloudinary_id":"lzslui8bzommcypriw9s","width":1024,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gsfiddxrsxa7xxfgyn8s.jpg","cloudinary_id":"gsfiddxrsxa7xxfgyn8s","width":460,"height":215},"external":{"steam":"3000"}}