{"id":18804,"name":"Blueprint","slug":"blueprint","url":"https:\/\/www.igdb.com\/games\/blueprint","created_at":1460937886700,"updated_at":1536863541284,"summary":"As in the arcade game of the same name, Blueprint gives you, as J.J., three chances to save the damsel in distress from a menacing creature chasing her across the top of the screen. Navigate J.J. through a maze of houses, which contain either a piece of the Rube-Goldberg-esque monster-fighting contraption whose blueprint lies at the bottom of the screen, or a bomb which must be disposed of in short order. Pressing the button will make J.J. run faster, but like so many who spend a lot of time sitting at the Atari 2600, he has a limited amount of \"Fast run time\" (as indicated by a handy bar graph). Smaller but still pesky monsters also pop out of the bomb disposal pit and try to prematurely start the machine (which shakes it to bits). Once that occurs, those monsters must be lured back to their pit, and the machine must be reassembled. Build the machine in time, and you can blast the creature who's chasing your girlfriend. The Atari 2600 edition simplifies the graphics drastically (though the most elaborate part of the playing field -- the blueprint itself -- is more or less intact), and drops the sound effects back to bare minimum (so much for the game's catchy little jazzy background tunes). There are no control issues, however, and the end result is still quite colorful and a lot of fun.","popularity":1.333333333333333,"games":[87728,90108,90788,100934,25646,83535,76253,103298,108082,27880],"tags":[1,268435465,268435489,1073741827],"developers":[9565],"publishers":[1436,6427,9556],"category":0,"player_perspectives":[3],"game_modes":[1,2],"themes":[1],"genres":[9,33],"first_release_date":410140800000,"platforms":[52,66,59,15],"release_dates":[{"category":2,"platform":52,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12},{"category":2,"platform":59,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12},{"category":2,"platform":66,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12},{"category":2,"platform":15,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/njfopc4iqn4wxtl7kxwv.jpg","cloudinary_id":"njfopc4iqn4wxtl7kxwv","width":1000,"height":1386}}