{"id":2504,"name":"Ravenloft: Stone Prophet","slug":"ravenloft-stone-prophet","url":"https:\/\/www.igdb.com\/games\/ravenloft-stone-prophet","created_at":1373216258739,"updated_at":1516160614526,"summary":"A space-time portal has suddenly appeared, and two brave adventures entered it. It led to Har'Akir, a scorched desert populated by vicious creatures who hold the few peaceful settlements in fear. The only way to escape this wretched place is to find the Stone Prophet, a wall of a obelisk with mysterious hieroglyphs written on it. The adventurers must find the path that leads to the Stone Prophet, but the cursed mummy of the ancient pharaoh Anhktepot is watching every step they make... \n \nRavenloft: Stone Prophet is a sequel to Ravenloft: Strahd's Possession. It utilizes the same graphical engine and gameplay system. Like its predecessor, character creation and combat follow the Advanced Dungeons & Dragons role-playing rules; exploration and combat are viewed from first-person perspective, and the battles occur in real time. The player can import two characters from the previous game, or create two new ones. Up to four additional characters can be met in the game world and recruited to the party. \n \nThe Egyptian-like desert setting of the game has brought an additional gameplay element: the necessity of regularly drinking water. The heroes must always carry enough water with them when they venture into the desert, or cast water-creating spells.","collection":3395,"franchise":43,"franchises":[43],"popularity":1.333333333333333,"games":[36534,36926,26766,47823,18398,25921,12632,17583,27092,11169],"tags":[17,268435468,268435471,268435487,536871170,536871208,536871237,536871254,536871277,536871610,536871648,536871938,536871939,536874694,536875738,536876301,536878358,1073741825],"developers":[606],"publishers":[528],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[258,296,325,342,365,698,736,1026,1027,3782,4826,5389,7446],"themes":[17],"genres":[12,15,31],"first_release_date":820368000000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":820368000000,"human":"1995","y":1995,"m":12}],"alternative_names":[{"name":"Ravenloft 2"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j1bqy4csttqsl5lfmomu.jpg","cloudinary_id":"j1bqy4csttqsl5lfmomu","width":2496,"height":2967}}