{"id":28004,"name":"Impossible Tracks Car Driving","slug":"impossible-tracks-car-driving","url":"https:\/\/www.igdb.com\/games\/impossible-tracks-car-driving","created_at":1490859050180,"updated_at":1490880496011,"summary":"Drive super speed stunt car on almost impossible tracks. Lots of jumps and obstacles on mid-air tracks are waiting for stunt ride with impossible car stunts drive. New car driving 2017 simulator with dreadful road tracks in car race driving stunt game. Impossible car driving tracks will provide you the airborne treacherous tracks for thrill drive. IMPOSSIBLE TRACKS CAR DRIVING with action packed sky-high stunt drive     \n     \nImpossible car racing with adventure vehicle driving on almost Xtreme impossible tracks with car games city driving top new free 2017 simulator 3d. Don’t stuck behind your competitors and become a skilled stunt driver by driving your top racing vehicle. Become a superhero car driver with superhero car games. Take your mid-air sky high stunt with nitro and furious motor car. Smash the dangerous impossible race with other stunt car drivers and racers, leave your skid-marks and beat hot wheels car racers in impossible stunt car driving tracks simulator. Thrill mid-air wreck stunts, unusual tracks and tricks with airborne cars through the impossible racing track against rival racers with impossible car game. Sharp turns on high driving asphalt tracks and obstacles with muscle stunt car with race car driving.      \n     \nEnjoy the stunt car revolution and upgrade your airborne car and perform huge stunts with riot ride! Buckle up, start the vehicle engine and ready to new extremely ultimate Top Car racing stunt 3D game. It’s time to perform driving stunts, huge jumps in this impossible car simulator. Avoiding obstacles on high tracks and compete other speed cars and racing rivals. Amazing and impossible car stunts provide you super dazzling offroad airborne car driving environment. Drive your car on impossible tricky racing tracks like physical vehicle driver or like a real stunt driver by riding furious car across the great challenges of adventure impossible racing.      \n     \nSuperhero Stunt Car Racing on Impossible Tracks Features:      \n     \n🚗 Mid-air stunts and driving tracks to beat racing foes.     \n🚗 Sports cars garage with amazing stunt cars inside in impossible tracks games.     \n🚗 Extreme car stunts and realistic car driving of 2017.     \n🚗 New free car driving game with amazing new high tracks.     \n🚗 Challenging tracks dangerous sharp turns with jumps and obstacles.     \n🚗 Real nitro engine sound with impossible car racing simulator.     \n     \nBlaze the tracks and accelerate your turbo engine in top free racing and driving game of 2017. Xtreme driving and stunts on difficult sliding tracks with top stunts. It’s time to get ready for the ultimate frantic road dash with top car driving and stunt racing simulation game. Download now IMPOSSIBLE TRACKS CAR DRIVING the top new free car stunt game of 2017.","storyline":"Drive super speed stunt car on almost impossible tracks. Lots of jumps and obstacles on mid-air tracks are waiting for stunt ride with impossible car stunts drive. New car driving 2017 simulator with dreadful road tracks in car race driving stunt game. Impossible car driving tracks will provide you the airborne treacherous tracks for thrill drive. IMPOSSIBLE TRACKS CAR DRIVING with action packed sky-high stunt drive","collection":2650,"franchise":987,"franchises":[987],"popularity":2.333333333333333,"games":[36608,34919,40524,23314,23175,28856,16468,1070,2940,68324],"tags":[1,268435466],"publishers":[12411],"category":0,"game_modes":[1],"themes":[1],"genres":[10],"status":2,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lpxr3dzpzsfdjc8udxcu.jpg","cloudinary_id":"lpxr3dzpzsfdjc8udxcu","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yn71cnndy7ogwqj0ject.jpg","cloudinary_id":"yn71cnndy7ogwqj0ject","width":1200,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ddaqgzqxzftk4xrm7bix.jpg","cloudinary_id":"ddaqgzqxzftk4xrm7bix","width":1200,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v3mcdqb4yknbjxdzgl8a.jpg","cloudinary_id":"v3mcdqb4yknbjxdzgl8a","width":1200,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ri33agsyo9bnwaret4nb.jpg","cloudinary_id":"ri33agsyo9bnwaret4nb","width":1200,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ia8mqslirlv8aja9xnoq.jpg","cloudinary_id":"ia8mqslirlv8aja9xnoq","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pqjc1qeslxpbd21qo94k.jpg","cloudinary_id":"pqjc1qeslxpbd21qo94k","width":512,"height":512}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bnevtd3vkojb5zmattu2.jpg","cloudinary_id":"bnevtd3vkojb5zmattu2","width":1024,"height":500},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.kookygames.impossible.tracks"},{"category":5,"url":"https:\/\/twitter.com\/kooky_games"},{"category":4,"url":"https:\/\/web.facebook.com\/kookygames\/"},{"category":1,"url":"http:\/\/kookygames.blogspot.com\/"}]}