{"id":39304,"name":"City Bomber","slug":"city-bomber","url":"https:\/\/www.igdb.com\/games\/city-bomber","created_at":1498123734655,"updated_at":1515819318929,"summary":"In City Bomber, the player is in pursuit of a gang of criminals. In order to keep the criminals from escaping, the player must reach checkpoints within a specified amount of time. At the start of the game, the player's car can shoot missiles at enemy vehicles and is also able to jump over enemies or obstacles. When some enemy cars are destroyed, power-ups are released that augment the car's abilities. Missiles improve the destructive power of the car's weaponry, wings extend the car's jumping distance, rocket boosters speed up the car and buzzsaws allow the car to ram obstacles without damage for a short time. \n \nCollisions with other cars are not generally harmful to the player, although they may slow down the car. Oil slicks dropped by enemies will spin out the car and slow it down significantly. Collisions with obstacles or falling off the course will destroy the player's car. While the player has an unlimited supply of cars, crashes will cost the player time and the new car will lose all previously-collected power-ups. If the player does not reach the checkpoint (shown by a map on the left side of the screen) in time, the game is over. \n \nPoints are scored by destroying enemy cars, with bonus points awarded at the end of each course for the amount of time remaining.","popularity":2,"games":[103298,103020,103281,95340,28029,32902,87728,10209,10039,90099],"tags":[1,268435461,268435466,268435489,536871078,1073741827],"developers":[129],"publishers":[129],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[166],"themes":[1],"genres":[5,10,33],"first_release_date":565315200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":565315200000,"region":5,"human":"1987-Dec-01","y":1987,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pz4nhjyy6iiittaqammf.jpg","cloudinary_id":"pz4nhjyy6iiittaqammf","width":1264,"height":850}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mdqfhrw7bcmqtmcjzcpj.jpg","cloudinary_id":"mdqfhrw7bcmqtmcjzcpj","width":850,"height":1198}}