{"id":54604,"name":"Savage XR","slug":"savage-xr","url":"https:\/\/www.igdb.com\/games\/savage-xr","created_at":1502367672856,"updated_at":1504275409665,"summary":"Be a Commander or a Warror - RTS meets FPS \n \nSavage: The Battle for Newerth is a science fiction game released by S2 Games on September 9th, 2003. It was a first of its kind; described by S2 as a real-time-strategy-shooter (RTSS). It brought together real-time strategy, first-person shooting, and third-person melee action into one cohesive experience. Set in a distant future when mankind has rebuilt society following an apocalypse, but is threatened by intelligent beasts, players must choose a side, elect their commander (RTS), and go to war (FPS). In 2006 Savage became freeware and its source code was made available to the public. One year later, a handful of dedicated players and modders began work on Savage XR, a project intended to update and overhaul the original game. Now after seven years of development Savage XR is finished and available for free to the public. \n \nXR breathes new life into a game that has held its own for a decade. New features include: in game tutorials, duel practice mode against Python based AI-bots and game-play demos, 500 new props, wide screen support and alternative FOVs, triggers and particle effects, improved models and textures, physics engine supporting realistic collisions, unique items for all competitive clans, a simpler user-friendly installer and automatic game updater, and more. Savage XR is awesome and free!","storyline":"Eons after the human civilization has crumbled upon itself, its nomadic descendants, known as the Legion of Man, are uncovering long-forgotten knowledge and technology. Devastating weapons help them fight a violent battle for their very existence, against a monstruous enemy, the Beast Horde. A race of beings evolved from the wildlife that survived the apocalyptic wars, they use brute force and the powerful magic of nature to punish the humans. \n \nSavage XR, the successor of the 2003 award winning PC game \"Savage: Battle for Newerth\", delivers a unique team-based gaming experience, defining a new genre: RTSS (Real Time Strategy Shooter). As a field player, you will master diverse weapons and units engaged in a fast paced battle. The FPS mode boasts a truly one-of-a-kind melee system, rewarding genuine player skill. In the RTS mode, as the commander of your team, you will manage your economy and resources, develop a robust tech tree, plan your assault and lead real human players to battle.","collection":455,"franchise":1086,"franchises":[1086],"popularity":1.333333333333333,"games":[55038,90099,25311,55029,36950,54775,75848,76424,78550,103282],"tags":[1,17,18,39,268435461,268435467,268435468,268435471,536871010,536871029,536872233,1073741826,1073741825],"developers":[13384],"publishers":[13384],"game_engines":[501],"category":0,"player_perspectives":[1,2],"game_modes":[2],"keywords":[98,117,1321],"themes":[1,17,18,39],"genres":[5,11,12,15],"first_release_date":1347840000000,"platforms":[6,14,3],"release_dates":[{"category":0,"platform":14,"date":1347840000000,"human":"2012-Sep-17","y":2012,"m":9},{"category":0,"platform":3,"date":1347840000000,"human":"2012-Sep-17","y":2012,"m":9},{"category":0,"platform":6,"date":1347840000000,"human":"2012-Sep-17","y":2012,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qhdnsj6nhszw11zqlnnj.jpg","cloudinary_id":"qhdnsj6nhszw11zqlnnj","width":940,"height":529},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e31ckyfzufuryerkctpm.jpg","cloudinary_id":"e31ckyfzufuryerkctpm","width":940,"height":529},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ju8irvf7w60sisjq4dut.jpg","cloudinary_id":"ju8irvf7w60sisjq4dut","width":940,"height":529},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kfue8qrgah2donu1e58a.jpg","cloudinary_id":"kfue8qrgah2donu1e58a","width":940,"height":529},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fjfldihylrvc5mwmfu5z.jpg","cloudinary_id":"fjfldihylrvc5mwmfu5z","width":940,"height":529}],"videos":[{"name":"Gameplay video","video_id":"ceKJ-btTPb4"},{"name":"Game intro","video_id":"iAPv_n55ahc"},{"name":"Trailer","video_id":"188xB0XBDLM"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yqudqnbtkbdghfkz4rif.jpg","cloudinary_id":"yqudqnbtkbdghfkz4rif","width":630,"height":900},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/user\/HurlyBurly3027"},{"category":5,"url":"https:\/\/twitter.com\/SavageXR"},{"category":4,"url":"https:\/\/www.facebook.com\/Newerth-192786134077722"},{"category":1,"url":"http:\/\/www.savagexr.com"}]}