{"id":40250,"name":"Stagger 1","slug":"stagger-1","url":"https:\/\/www.igdb.com\/games\/stagger-1","created_at":1498477094416,"updated_at":1500238037562,"summary":"Stagger 1 \/ Red Hawk is a 1997 vertical scrolling shooter arcade game created by Afega. \n \nStagger 1 \/ Red Hawk was Afega's big breakthrough. Even though its success was mostly expressed in the spreading of bootlegs in China, Afega still claimed to have exported more than 10,000 machines. In Korea, the game was originally published before the summer vacation of 1997, but called back for some reason, and not sold again until November the same year. At first sales were slow because of the low machine price of 250,000 Won (which lead arcade owners assume low quality), but after word-of-mouth had spread, the game became a hit in its home country, too6. \n \nWhile it didn't bring anything new on the shmup table, Red Hawk's biggest strength was its bombastic arsenal, throwing together all kinds of weapon systems that are seen in the genre. Besides the highly upgradeable standard weapon, planes can charge for a devastating, screen filling special attack. Those don't replace smart bombs, though, as those are available, too. Finally, there's a number of sattelites to further boost fire power. All weapons are unique for each of the four different pilots, too. \n \nThe game originally used an upright monitor, but for some reason some of the European releases swapped the horizontal and vertical resolution around for ordinary display orientation. This makes the game noticably harder, as enemies are seen later. In Japan, the game was distributed as Stagger I (with the upright screen resolution).","popularity":1.333333333333333,"games":[46892,41258,76246,19341,28029,32902,97018,96550,93794,88910],"tags":[268435461],"category":0,"genres":[5],"first_release_date":854755200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":854755200000,"region":8,"human":"1997-Feb-01","y":1997,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sqlfr80px4d8h6xmrho4.jpg","cloudinary_id":"sqlfr80px4d8h6xmrho4","width":850,"height":1098}}