{"id":53650,"name":"SpellForce 3: Collector's Edition","slug":"spellforce-3-collectors-edition","url":"https:\/\/www.igdb.com\/games\/spellforce-3-collectors-edition","created_at":1501609879677,"updated_at":1515493969383,"summary":"Spell Force is deeply rooted in the amalgamation of the real-time strategy (RTS) and the roleplaying game (RPG) genre. In Spell Force 3, players are taken back to the roots of the Spell Force saga and experience war-torn times in the world of Eo, leading up to a cataclysmic event after which the first two parts take place. Command your troops, level\/gear\/skill up your party of heroes, strengthen your armed forces, conquer pivotal zones to expand your sovereign territory, and experience the world-changing events that will lead up to the convocation ritual at close quarters. Collector's Edition Contents: 8\" High Quality Sentenza Figurine 2\" Godstone Amulet Spell Force 3 Art book Official Soundtrack Audio CD Premium Quality Display Box","storyline":"It is the year 518, before the Convocation. The rebellion of the four royal houses against the crown of Nortander instigated by a renegade mage has been quashed by the Queen with the help of a loyal house, but it was a Pyrrhic victory; the war has devastated the country and public order has broken down in many regions, where the law of the strongest now reigns. As if that wasn’t enough, the Queen was seriously injured in the last battle of the war and has been lying in a coma ever since, so the supreme commander of the royal forces is now in charge of affairs of state either until she awakens or dies, in which case her niece will step up as her successor. The Lord Marshal rules with an iron fist in his attempt to restore stability to the country and has, among other things, used magic, which is prohibited in Nortander unless under exceptional circumstances. \n \nBut there is a glimmer of light in these dark times. There are growing signs that Aonir, the Godfather, has returned to Eo. Increasing numbers of people are looking to Aonir as the only God, and pray he will lead Nortander to another golden age. \n \nAlthough your father was one of the rebel mages, as a member of the royal army you have remained loyal to the Queen. Will you uphold your responsibilities toward Nortander?","collection":961,"popularity":1.333333333333333,"version_parent":17583,"version_title":"Collector's Edition","games":[16468,5613,28010,25311,36608,37088,1221,47823,17583,12632],"tags":[1,17,268435467,268435468,268435471],"category":0,"themes":[1,17],"genres":[11,12,15],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m48ik4bueoc0q6hwgfgv.jpg","cloudinary_id":"m48ik4bueoc0q6hwgfgv","width":1500,"height":702}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uhebl0vdqiyrfbk1qzqp.jpg","cloudinary_id":"uhebl0vdqiyrfbk1qzqp","width":500,"height":333}}