{"id":2197,"name":"Archimedean Dynasty","slug":"archimedean-dynasty","url":"https:\/\/www.igdb.com\/games\/archimedean-dynasty","created_at":1372280535229,"updated_at":1528200811736,"summary":"The all consuming darkness has you battle-scarred submarine in a vice-like grip. As you navigate your sub through enemy waters, the only thing that protects you from a cold and premature death is six inches of solid steel. As if life itself, 5,700 metres below the ocean surface wasn’t difficult enough, the threat of impending conflict is about to challenge your very existence…\n\nIn the distance, a glimmer of light pierces the darkness and shock waves begin to roll your craft. An unknown object descends upon you. Systems indicate Torpedo! You act immediately to avoid destruction and lock your sights on the incoming torpedo. You release a Ripper missile and begin your descent, but you must go faster. DIVE! DIVE! DIVE!\n\nThe predecessor to the AquaNox series, Archimedean Dynasty is a submarine-simulation set in a post-apocalyptic world on the ocean floor. Assuming the role of mercenary, Emerald “Dead Eye” Flint, you must navigate the dangers that lurk below, including corrupt conglomerates, fanatical cults and cut-throat pirates. With a rich and atmospheric open-world, compelling narrative and dialogue interaction, and a deep customisation and combat system that rewards tactical thinking, Archimedean Dynasty is a submersive experience for nautical adventurers that like to talk the talk and sail the sail.","collection":370,"franchise":53,"franchises":[53],"popularity":1.333333333333333,"games":[68287,27314,36950,28029,25311,64204,19341,71455,23212,19301],"tags":[1,18,268435461,268435469,536870961,536871050,536871882,536872060,536875242,1073741825],"developers":[3117],"publishers":[646],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[49,138,970,1148,4330],"themes":[1,18],"genres":[5,13],"first_release_date":851990400000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":851990400000,"human":"1996","y":1996,"m":12}],"alternative_names":[{"name":"Schleichfahrt","comment":"German title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lj7dqltcdg9lzuepfgeg.jpg","cloudinary_id":"lj7dqltcdg9lzuepfgeg","width":1600,"height":740}}