{"id":22697,"name":"G.I. Joe: Cobra Strike","slug":"gi-joe-cobra-strike","url":"https:\/\/www.igdb.com\/games\/gi-joe-cobra-strike","created_at":1471408932795,"updated_at":1517270830195,"summary":"In the single-player mode, the player controls a G.I. Joe training camp on the bottom of the screen protected by a barrier and armed with two laser cannons. In this mode the goal is to keep the giant Cobra-operated robot snake from destroying the shield and thus the training camp by hitting it eight times. The Cobra robot shoots venom and laser beams. \nIn two-player cooperative mode control of the G.I. Joe training game is split between two players as they work to destroy the Cobra robot. In the two-player competition mode one player controls the Cobra robot and another player controls the training camp. \nCobra Strike was the first video game to use the G.I. Joe license. The U.K. version of the game was renamed Action Man: Action Force. \n \nSynopsis: \n\"The Action Force training camp is under siege from a giant Cobra Combat Machine built by the evil Baron Ironblood. As the Cobra looms over the camp the Action Force recruits run to shelter from its vaporizing venom and piercing laser beams. Man your positions! Defend the camp! Use missile attack cannons and atomic-powered energy shields to fight the deadly Cobra.\"","collection":3998,"franchise":301,"franchises":[301],"popularity":1.333333333333333,"games":[28029,76246,10039,19341,68287,32902,68142,28751,51485,36950],"tags":[1,268435461,268435489,536872668,536875054,536876694,1073741826],"developers":[1740],"publishers":[1740],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[1756,4142,5782],"themes":[1],"genres":[5,33],"first_release_date":441676800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12}],"alternative_names":[{"name":"Action Force","comment":"Other"},{"name":"G.I. Joe: Attaque Du Cobra","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x4atm5buhgugf5toya02.jpg","cloudinary_id":"x4atm5buhgugf5toya02","width":1000,"height":1363}}