{"id":23897,"name":"River Rescue","slug":"river-rescue","url":"https:\/\/www.igdb.com\/games\/river-rescue","created_at":1473719112416,"updated_at":1517270836950,"summary":"River Rescue is a 1982 game for the Commodore VIC-20, Commodore 64, ZX Spectrum, and Atari 8-bit family. It is one of a number of game titles produced by Thorn EMI Computer Software (later known as Creative Sparks) during 1982 and 1983. A TI-99\/4A version was announced but never released. \n \nRiver Rescue is similar in concept and gameplay to the 1981 Orca arcade game River Patrol. \n \nThe player guides a boat along a river, which scrolls from right to left across the screen in a top-down view. The boat must avoid colliding with various hazards in the river - these include small islands, crocodiles and logs. The aim is to rescue explorers lost in the jungle. \n \nThe boat periodically passes a pair of docks arranged across from each other on either side of the river. If the boat moves to the upper dock, and explorer will run out of the jungle onto the boat. Stopping at the lower dock causes any explorers already on the ship walk back off to safety. Because of the scrolling motion, it is not possible to land at both docks in one go, you must pick up an explorer and then continue along the river until the dock reappears. \n \nDepending on the version and level, between three and five explorers have to be rescued to complete a round. Once the round is complete, the game starts again, faster.","popularity":1.333333333333333,"games":[28029,76246,19341,10039,32902,68287,68142,28751,51485,36794],"tags":[1,268435461,268435466,268435489,1073741826],"developers":[10800],"publishers":[10800],"category":0,"player_perspectives":[2],"game_modes":[1,2],"themes":[1],"genres":[5,10,33],"first_release_date":410140800000,"platforms":[71,65,15,26],"release_dates":[{"category":2,"platform":65,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12},{"category":2,"platform":15,"date":473299200000,"region":2,"human":"1984","y":1984,"m":12},{"category":2,"platform":71,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12},{"category":2,"platform":26,"date":473299200000,"region":1,"human":"1984","y":1984,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bwhsedlnmropnhdfkjwr.jpg","cloudinary_id":"bwhsedlnmropnhdfkjwr","width":1000,"height":1394}}