{"id":33797,"name":"The Legend: A University Story","slug":"the-legend-a-university-story","url":"https:\/\/www.igdb.com\/games\/the-legend-a-university-story","created_at":1495757784703,"updated_at":1523401491488,"summary":"For our first installment of \"The Legend\" series, we've chosen a backdrop that many of our audience can relate to: College. Everyone in the atmosphere, or has a friend immersed in it will understand. For students:\nThe fear of walking back to their dorms late at night alone.\nThe fear of being followed by a dark presence.\nThe fear of being assigned that psychotic, crazy roommate.\nWe've also tackled the fears of this atmosphere from another angle too. From the perspective of the staff, specifically, the Campus Police Department:\nThe fear of finding strange things on the CCTV system.\nThe fear of patrolling the facilities late at night.\nThe fear of being too-late.In this release you will be receiving three chapters, each with a unique perspective, mechanic and atmosphere to immerse you in the story of West University. Specifically:\n\nChapter Zero: The Story\nAn opening chapter, where you will be introduced and playing Sergeant Thompson, the Night-Watch Commander for the University Police Department. In this chapter you will be patrolling the facilities of West University, while in contact with your rookie police dispatch officer on the hooks. \n\nChapter One: The Oracle\nIn this chapter, you will be introduced and play as Officer Morrison. A Rookie (New-Hire) Police Dispatch Officer who is thrust into a campus atmosphere that has found itself immersed in darkness. You main purpose is to watch those CCTV systems, and patrol the dispatch office from time-to-time, to ensure the safety of all students walking late-night on campus.\n(Each Student has a randomly generated phone number, to ensure that gameplay is never the same everytime.)\n\nChapter Two: The Roommate\nIn this chapter, you will be playing as Ashley Tamon, of whom, you will have already been introduced in Chapter One. Chapter Two: TR takes place weeks prior to Chapters Zero and One. You are returning to your dorm to your foreign-exchange student roommate who may have stolen some of your belongings again. As with any college, young adult, preppy girl, your phone is glued to your hand in this life\/death scenario.","popularity":1,"games":[37022,55289,44191,34919,25646,40524,25311,23175,28277,37419],"tags":[1,268435487,268435488],"category":0,"game_modes":[1],"themes":[1],"genres":[31,32],"first_release_date":1469577600000,"status":4,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1469577600000,"region":8,"human":"2016-Jul-27","y":2016,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pqubj1hhiuu7y8veoncj.jpg","cloudinary_id":"pqubj1hhiuu7y8veoncj","width":1666,"height":850},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zkcxjzqhg403wsvat8oo.jpg","cloudinary_id":"zkcxjzqhg403wsvat8oo","width":1666,"height":850},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b5jdvfrphdpcrvdfzcvp.jpg","cloudinary_id":"b5jdvfrphdpcrvdfzcvp","width":1666,"height":850},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gbbbuk6kuephxjhvqdni.jpg","cloudinary_id":"gbbbuk6kuephxjhvqdni","width":1666,"height":850},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uwooufinrwz1wwhg7ehu.jpg","cloudinary_id":"uwooufinrwz1wwhg7ehu","width":1658,"height":864}],"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/431360"}],"external":{"steam":"431360"}}