{"id":39497,"name":"Super Sidekicks 2","slug":"super-sidekicks-2","url":"https:\/\/www.igdb.com\/games\/super-sidekicks-2","created_at":1498129441977,"updated_at":1526567736128,"summary":"Published in 1994 (Japanese title: Tokuten Ou 2 - Real Fight Football), the sequel corrected most of the flaws in the original's design, including the ability to switch players' control during the game, a smaller goal, and no more long shots taken (in Super Sidekicks 1 the simple long shot was sometimes too long, leading into a throw-in situation). It increased the number of teams to 48 and divided them into 6 geographical \"regions\": \n \n Europe A: Italy, England, Spain, Holland, Switzerland, Norway, Turkey, Ireland \n Europe B: Germany, France, Bulgaria, Sweden, Russia, Greece, Belgium, Romania \n Americas\/Oceania: United States, Mexico, Canada, Australia, New Zealand, Costa Rica, El Salvador, Honduras \n Asia: South Korea, Japan, Saudi Arabia, Taiwan (as Republic of China), China, Iran, Hong Kong, United Arab Emirates \n South America: Brazil, Argentina, Paraguay, Colombia, Bolivia, Uruguay, Peru, Ecuador \n Africa: Cameroon, Morocco, Nigeria, Egypt, South Africa, Côte d'Ivoire, Guinea, Zambia \n \nWhen you start the game, you go into a \"Regional Qualifying Round Final\" against another team from your region. After beating it, your team goes into the World (Cup) Tournament, in which you are grouped with three other countries in a round-robin. After winning against all of them, you go into an elimination tournament: the quarterfinals, semifinals, and the final for the World Cup. This type of tournament thus is more reminiscent of the real-life World Cup. If a match ends in a draw, you also have the option of replaying a full game, go to the penalty kick tiebreaker, or play a sudden death (golden goal) game (the golden goal feature was not present in the original Super Sidekicks). \n \nAll subsequent Super Sidekicks games followed the same design and gameplay as Super Sidekicks 2.","collection":4280,"popularity":1.666666666666667,"games":[18681,77576,76999,72888,72833,63514,62335,62325,59802,58577],"tags":[268435470,536870938],"publishers":[1474],"category":0,"keywords":[26],"genres":[14],"first_release_date":758937600000,"pulse_count":3,"platforms":[80,52,136,79],"release_dates":[{"category":0,"platform":136,"date":779068800000,"region":2,"human":"1994-Sep-09","y":1994,"m":9},{"category":0,"platform":79,"date":758937600000,"region":2,"human":"1994-Jan-19","y":1994,"m":1},{"category":0,"platform":80,"date":759628800000,"region":2,"human":"1994-Jan-27","y":1994,"m":1},{"category":0,"platform":136,"date":779068800000,"region":5,"human":"1994-Sep-09","y":1994,"m":9},{"category":0,"platform":79,"date":758937600000,"region":5,"human":"1994-Jan-19","y":1994,"m":1},{"category":0,"platform":80,"date":759628800000,"region":5,"human":"1994-Jan-27","y":1994,"m":1},{"category":0,"platform":52,"date":767750400000,"region":8,"human":"1994-May-01","y":1994,"m":5}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wp2rftshkimpwbdy8ngb.jpg","cloudinary_id":"wp2rftshkimpwbdy8ngb","width":1440,"height":1008}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fzbrtjo9y8wr7ukz4xl4.jpg","cloudinary_id":"fzbrtjo9y8wr7ukz4xl4","width":850,"height":1205}}