{"id":89297,"name":"Fireman Sam - Fire & Rescue","slug":"fireman-sam-fire-and-rescue","url":"https:\/\/www.igdb.com\/games\/fireman-sam-fire-and-rescue","created_at":1519585511801,"updated_at":1522207595741,"summary":"OFFICIAL LICENSED FIREMAN SAM APP\n \nNew FREE Ocean Rescue Themed Update: Includes an 25 Extra Stickers and 4 Exciting New Backgrounds all unlocked and ready to use in your sticker album. No In-App Purchase Required.\n\nJoin Fireman Sam and the rest of the Pontypandy crew in this exciting collection of action-packed emergencies and heroic rescues. Featuring 8 ways to play including interactive single and multi-player games, video player, and a special reward sticker book with *Print Function, this app adventure includes the following Games: \n\nFOREST FIRE – The Forest is on fire! Fill the helicopter’s tank with water from the lake then drop it onto the flames to put out the fires and save the nearby village.\n\nMOUNTAIN ADVENTURE – An emergency has been called in, some of the villagers are stuck on a mountain ledge near The Mountain Activity Centre. Use the helicopter to lift everyone to safety!\n\nNEPTUNE’S MISSION – Part of the jetty has dislodged and some villagers have fallen into the water. Use Neptune to bring the villagers safely back to shore.\n\nFIRE ENGINE RESCUE – A fryer has burst into flames in the Café. Rescue the people of Pontypandy and put out the fires as quickly as you can. \n\nCONNECT THE HOSE – Jupiter’s hose needs to be mended. Help Fireman Sam connect the correct pieces to get the water flowing.  \n\nQUAD BIKE TRAINING – Join Fireman Sam on a training exercise to learn how to use the new Quad Bike.  Avoid obstacles and complete the training course as quickly as you can. \n\nSTICKER ALBUM - Collect 75 virtual stickers along the way and use them to decorate 12 different backgrounds to create your own Fireman Sam scenes.\n\nVIDEO PLAYER – Earn a video reward for every 5 games played then watch them in the Video Player. There are 10 fantastic videos included.\n\nAll games are playable 3 ways:\n- EASY - non-timed free play, great for the little ones to get started\n- HARD - play against the clock for more of a challenge\n- 2 PLAYER - great to compete against friends\n\nFully translated into English, French, German, Italian, Spanish, Dutch, Danish, Norwegian, Swedish and Polish.\n\n*To use the print function access to an AirPrint enabled printer or emulator is required.\n\nPlayable on iPad, iPhone, iPod touch and featuring all the familiar characters, music and sound effects from the TV show, FIRE & RESCUE is a must have app that gives young children a fun and entertaining experience with their favourite ‘hero next door’.\n\n• SUITABLE FOR AGES\n 3 to 6 years\n\n• P2 KID SAFE APP \nThis is a P2 Kid Safe App. P2 Kid Safe apps DO NOT contain in-app purchasing or data gathering systems of any kind, meaning your children can safely play without fear of unwittingly purchasing app content or credits, or disclosing data about their playing habits, location or the device they are using. \n\n• P2 CUSTOMER CARE PLEDGE \nWe are committed to bringing all our customers the highest quality apps and aftercare service and are always looking for ways to improve our games so please get in touch if you have any suggestions or feedback. In the unlikely event that you experience a problem, please email our support team who are waiting to help you. Email us on support@p2games.co.uk you will usually receive a reply within 24 hours.\n\n• LOVE THE APP?\nIf your child likes the game, please leave a review or why not Gift the App to a special friend.\n\n• MORE EXCITING APPS\nFor details of other exciting interactive apps from P2 Games, please visit www.p2games.co.uk\n\n• BECOME A P2 GAMES FAN \nFacebook: \nhttp:\/\/www.facebook.com\/p2games\n\n• ABOUT FIREMAN SAM\nFireman Sam™, the ultimate Hero Next Door, has been racing to the rescue of his friends and colleagues in all sorts of perilous situations since he first made his UK TV debut in 1987. In the UK the CGI series airs on, Cartoonito, and Five Milkshake - consistently rating as a number 1 show. For more information about Fireman Sam, please visit www.firemansamonline.com","rating":20,"popularity":1,"total_rating":20,"total_rating_count":0,"rating_count":0,"games":[95651,95287,90806,90796,89764,89732,89493,89304,89135,89129],"tags":[536872030],"category":0,"keywords":[1118],"first_release_date":1363392000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1363392000000,"region":8,"human":"2013-Mar-16","y":2013,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fsj1fw2yik3etu6cuesi.jpg","cloudinary_id":"fsj1fw2yik3etu6cuesi","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tgb13vuqojooxedf6inx.jpg","cloudinary_id":"tgb13vuqojooxedf6inx","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yrlj2lhnxfxjgdeikguy.jpg","cloudinary_id":"yrlj2lhnxfxjgdeikguy","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qsx60wi1k59cb8xf9mlu.jpg","cloudinary_id":"qsx60wi1k59cb8xf9mlu","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mdbinqm89nksztubjmtv.jpg","cloudinary_id":"mdbinqm89nksztubjmtv","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ywvpsk8pecvwcqaualhk.jpg","cloudinary_id":"ywvpsk8pecvwcqaualhk","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pe5yxwdqchc1nvl3onil.jpg","cloudinary_id":"pe5yxwdqchc1nvl3onil","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uqwesr0zlbei82v7z4ao.jpg","cloudinary_id":"uqwesr0zlbei82v7z4ao","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lqea6hbodx64xcmm9mrs.jpg","cloudinary_id":"lqea6hbodx64xcmm9mrs","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sq9hwewj7cqtp3xhv7il.jpg","cloudinary_id":"sq9hwewj7cqtp3xhv7il","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/regsxodhzyaw0k2tjj3e.jpg","cloudinary_id":"regsxodhzyaw0k2tjj3e","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/fireman-sam-fire-rescue\/id606910110?mt=8&uo=4"}]}