{"id":14424,"name":"Phantasie II","slug":"phantasie-ii","url":"https:\/\/www.igdb.com\/games\/phantasie-ii","created_at":1446760756999,"updated_at":1517270879835,"summary":"In 1986, SSI published the next part of the series, Phantasie II. Again, the Dark Lord Nikademus was the nemesis. This time Nikademus had fashioned an evil orb, and with it he cast a curse on a beautiful island named Ferronrah and enslaved its people. The player's mission was to find and destroy the orb. \n \nPhantasie II used the same graphics and fighting as the original Phantasie game, with one improvement to combat: the ability of any character class to target any enemy rank with a thrown rock. There were improvements in the complexity of quests, but little was done to innovate the series. One option which endeared many veterans was the ability to transfer characters from Phantasie I to this sequel. \n \nThe manual included in Phantasie II was identical to the one included with Phantasie, plus a small card explaining the differences. Computer Gaming World noted this was advantageous in terms of how players of the original would have an easier time getting into the game, but disadvantageous as to some particularly tedious mechanisms of both games, particularly \"the infamous Distribution and Selling rigamarole.\" The review continued to note that characters imported from the original have their equipment removed as well as most of their gold and experience, affording only a slight head start over newly created characters.[","collection":1657,"popularity":1.333333333333333,"games":[26766,18398,36534,47823,12632,36926,36792,19698,26163,55092],"tags":[17,268435468,268435487,536871208,536871938,536871939,536872983,1073741827],"publishers":[528,11582],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[296,1026,1027,2071],"themes":[17],"genres":[12,31],"first_release_date":536371200000,"platforms":[63,65,75,15,27],"release_dates":[{"category":2,"platform":75,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":65,"date":567907200000,"region":2,"human":"1987","y":1987,"m":12},{"category":2,"platform":63,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":27,"date":599529600000,"region":5,"human":"1988","y":1988,"m":12}],"alternative_names":[{"name":"Phantasie 2","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gbnjqbasglrvsarmkpp0.jpg","cloudinary_id":"gbnjqbasglrvsarmkpp0","width":800,"height":1196}}