{"id":24724,"name":"duplicate Unreal Tournament 3: Black","slug":"duplicate-unreal-tournament-3-black","url":"https:\/\/www.igdb.com\/games\/duplicate-unreal-tournament-3-black","created_at":1475693879879,"updated_at":1517270826711,"summary":"Unreal Tournament 3 marks the return of the world's premiere first-person shooter. Unreal Tournament 3 unleashes the full power of Unreal Engine 3, taking graphics, gameplay, and challenge to a whole new level. Players engage in intense battles with other human players online, or against Unreal artificial intelligence that sets the industry standard. With the most powerful futuristic weapons and vehicles available, this is FPS action at its best!\nUnparalleled graphical and physical realism from the award-winning Unreal Engine 3 technology delivers the most compelling first-person shooter experience to date...online and offline! \nVast arsenal of weapons - Unreal Tournament has always been known for brutal weaponry, and now the arsenal is even bigger and badder. Detonate your opponent from a distance with the ever popular Shock Rifle or blast away at close range with the Flak Cannon. Over two dozen weapons and vehicles have been upgraded and enhanced for maximum killing potential. \nNew single player campaign! This is Unreal Tournament like you've never seen it before! The Necris invasion has begun, and your clan was one of the first to be slaughtered. Head to the front lines and join this Epic battle to defend humanity while taking your revenge. \nNew and favorite characters - Fight side-by-side with or compete against new and returning characters from the Unreal universe, all with enhanced abilities, extremely detailed designs, and distinct personalities. \nEnhanced popular game types, including Deathmatch, Team Deathmatch, Capture the Flag, and all-new Warfare mode and more. \nOnline innovations - Unreal Tournament 3 brings back all the award-winning online features of previous Unreal Tournament games, plus seamless loading on servers, improved matchmaking, and co-operative campaign play online. \nPC version bundled with the award-winning Unreal Engine 3 Toolset - Build your own levels, game types, and more, or download the latest mods from the massive Unreal community.","storyline":"Unlike the prior Unreal Tournament games, the single-player campaign does not follow a plot based around the Tournament Grand Championship, and therefore several of the teams within Unreal Tournament 3 are not Tournament competitors. The five playable factions are: Iron Guard, a team of human mercenaries led by former Tournament champion Malcolm; the Ronin, a band of four survivors of a Skaarj attack on a human colony; Liandri, a series of advanced humanoid robots custom-built or retrofitted for combat; the Krall, a warlike race of aliens formerly under the leadership of the Skaarj, returning from their initial appearance in the original Unreal; and the Necris, warriors who have undergone the process of the same name, making them stronger at the expense of replacing their biological processes with \"Nanoblack\", effectively turning them into undead soldiers (hence the name, Necris). In the Campaign, players control members of the Ronin, and the Necris serve as the chief antagonists.\n\nIn the game's story, set in 2307, some years after the events of UT2004, a Necris attack occurs on a colony on unknown planet, releasing armed Kralls on the humans. The colony is defenseless, but a group of Ronins arrives on the scene, defending the survivors. Reaper, the group's leader, advises his second-in-command warrior Othello and his sister Jester to destroy the orbital Necris blockade with a fighter, and orders team's sniper expert, Bishop, to provide cover as he swarms to save the colony. Suddenly, he is caught in the explosion of an incoming rocket missile and passes out, but not before seeing an unknown Necris woman shooting a soldier next to him. Reaper is rescued by Othello and Jester and wakes up in the base of the Izanagi, a guerrilla force that fights against Necris and Axon, and he meets with the leader, revealed to be Malcolm, who also leads the Iron Guard as the Izanagi's army. He explains that the Necris attack was masterminded by Liandri, who also turn some of the Krall, into Necris, controlled undead soldiers. The unknown woman who Reaper saw turns out to be Akasha, the Necris operative who destroyed the colony and also leads the Necris forces. Reaper wants to kill her, but Malcolm tells him that he needs to prove himself first.","popularity":1.333333333333333,"games":[28029,76246,19341,32902,10039,68287,68142,28751,24920,272],"tags":[1,268435461,536872006,1073741825],"game_engines":[351],"category":0,"player_perspectives":[1],"game_modes":[1,2,3],"keywords":[1094],"themes":[1],"genres":[5],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e8h2pza2nmlajdhuzdts.jpg","cloudinary_id":"e8h2pza2nmlajdhuzdts","width":1024,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eeq85bpuc8fge1oz2rki.jpg","cloudinary_id":"eeq85bpuc8fge1oz2rki","width":1024,"height":512}],"videos":[{"name":"Trailer","video_id":"iJv1BOWnBOk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/trufgnzdycnoqxm5v7qq.jpg","cloudinary_id":"trufgnzdycnoqxm5v7qq","width":1200,"height":1920},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Unreal_Tournament_3"}],"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}