{"id":41224,"name":"Videocart-17: Pinball Challenge","slug":"videocart-17-pinball-challenge","url":"https:\/\/www.igdb.com\/games\/videocart-17-pinball-challenge","created_at":1498814175421,"updated_at":1515493956225,"summary":"Although the title of the game may lead players to believe it's a pinball game, this is actually a Breakout variant. The basic gameplay features the player bouncing a ball off of a paddle into a wall of bricks, chipping them off one brick at a time. Each brick destroyed earns the player points with the low green bricks being worth 1 point each, the middle blue bricks being worth 4 points each, and the red bricks on top rewarding 7 points each. Once the ball bounces off the wall of bricks, it's up to the player to maneuver the paddle under the falling ball in order to hit it back up into the wall of bricks. The player loses a life if he happens to miss hitting the ball with his paddle and it falls into the abyss. The game ends when 7 balls are lost. To keep up with the pinball motif, the wall of bricks are referred to as different colored skill lanes, the walls on the side that the ball can bounce off of are labeled side rails, and the paddle is referred to as a flipper. \n \nThe game offers 132 game variations of this basic gameplay idea, some of them for two simultaneous players. Game modes include Pinball Wiz, Crossover, Blok-Shot, Cooperation, Pro Challenge, and Double Blok, with each having variations that can include different sized paddles, ball speeds, invisible bricks, and even a variation where the paddle shrinks each time it hits the ball.","collection":1634,"popularity":1.333333333333333,"version_parent":2754,"games":[28029,68287,25311,71455,36794,36608,51485,34919,36950,76722],"tags":[1,18,268435489,1073741827],"developers":[9372],"publishers":[9372],"category":0,"player_perspectives":[3],"game_modes":[1],"themes":[1,18],"genres":[33],"first_release_date":257558400000,"platforms":[127],"release_dates":[{"category":0,"platform":127,"date":257558400000,"region":8,"human":"1978-Mar-01","y":1978,"m":3}],"alternative_names":[{"name":"Videocart 15 - Barriere"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fe46syjyonzlzd2cmgu9.jpg","cloudinary_id":"fe46syjyonzlzd2cmgu9","width":612,"height":464}],"videos":[{"name":"VR","video_id":"l0r-3YMxYx0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rtfpcr34iu7dhpqpyphf.jpg","cloudinary_id":"rtfpcr34iu7dhpqpyphf","width":344,"height":462}}