{"id":46624,"name":"Unreal Tournament III: Black Edition","slug":"unreal-tournament-iii-black-edition","url":"https:\/\/www.igdb.com\/games\/unreal-tournament-iii-black-edition","created_at":1499641431121,"updated_at":1532963052667,"summary":"The Black Edition is a complete Unreal Tournament III package -- included is the complete UT3 (with patch 2.0) as well as the Titan Pack. The “Titan Pack” gives players a substantial amount of enhanced features and new content, including many original environments, new gametypes, the namesake Titan mutator, powerful deployables and weapons, new characters, and the Stealthbender vehicle.","storyline":"Unlike the prior Unreal Tournament games, the single-player campaign does not follow a plot based around the Tournament Grand Championship, and therefore several of the teams within Unreal Tournament 3 are not Tournament competitors. The five playable factions are: Iron Guard, a team of human mercenaries led by former Tournament champion Malcolm; the Ronin, a band of four survivors of a Skaarj attack on a human colony; Liandri, a series of advanced humanoid robots custom-built or retrofitted for combat; the Krall, a warlike race of aliens formerly under the leadership of the Skaarj, returning from their initial appearance in the original Unreal; and the Necris, warriors who have undergone the process of the same name, making them stronger at the expense of replacing their biological processes with \"Nanoblack\", effectively turning them into undead soldiers (hence the name, Necris). In the Campaign, players control members of the Ronin, and the Necris serve as the chief antagonists. \n \nIn the game's story, set in 2307, some years after the events of UT2004, a Necris attack occurs on a colony on unknown planet, releasing armed Kralls on the humans. The colony is defenseless, but a group of Ronins arrives on the scene, defending the survivors. Reaper, the group's leader, advises his second-in-command warrior Othello and his sister Jester to destroy the orbital Necris blockade with a fighter, and orders team's sniper expert, Bishop, to provide cover as he swarms to save the colony. Suddenly, he is caught in the explosion of an incoming rocket missile and passes out, but not before seeing an unknown Necris woman shooting a soldier next to him. Reaper is rescued by Othello and Jester and wakes up in the base of the Izanagi, a guerrilla force that fights against Necris and Axon, and he meets with the leader, revealed to be Malcolm, who also leads the Iron Guard as the Izanagi's army. He explains that the Necris attack was masterminded by Liandri, who also turn some of the Krall, into Necris, controlled undead soldiers. The unknown woman who Reaper saw turns out to be Akasha, the Necris operative who destroyed the colony and also leads the Necris forces. Reaper wants to kill her, but Malcolm tells him that he needs to prove himself first.","collection":156,"rating":80,"popularity":1.666666666666667,"total_rating":80,"total_rating_count":0,"rating_count":0,"version_parent":928,"version_title":"Black Edition","games":[103020,28029,103298,103281,306,90099,103301,68287,27011,32902],"tags":[1,18,268435461],"developers":[168],"publishers":[168],"category":0,"game_modes":[1,2,3],"themes":[1,18],"genres":[5],"first_release_date":1198022400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1198022400000,"region":8,"human":"2007-Dec-19","y":2007,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sou9vxxwmddacne7j2gg.jpg","cloudinary_id":"sou9vxxwmddacne7j2gg","width":1280,"height":1024}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h4yfhzwf6uhnfxucmoji.jpg","cloudinary_id":"h4yfhzwf6uhnfxucmoji","width":1528,"height":1915},"websites":[{"category":1,"url":"http:\/\/www.unrealtournament3.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/13210"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Unreal_Tournament_3"}],"external":{"steam":"13210"},"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}