{"id":58224,"name":"Out There Chronicles - Ep. 1","slug":"out-there-chronicles-ep-1","url":"https:\/\/www.igdb.com\/games\/out-there-chronicles-ep-1","created_at":1504705693083,"updated_at":1521308775548,"summary":"Out There Chronicles is an interactive graphic novel based on the science fiction universe of Out There, the acclaimed, multi-award-winning space exploration game. \n \nAfter a slumber of a million years, you wake up on America, a planet colonized by humans who fled the Earth. In your quest to find your people, you’ll set off on a galactic adventure where you’ll meet a host of colorful characters and visit unimaginable locations. \n \nOut There Chronicles is a unique adventure set several million years before Out There. Where do the Arks come from? What are the Cubes? Fans of the original game will find answers to some questions, but others will remain a mystery. \nYou’ll also meet various alien races and get the opportunity to learn more about their people… If you can master their language, of course. \n \nIn this universe that is so far from your own in distance and in time, a sharp mind and an instinct for survival are your only weapons. Friendships can be forged and ancient rivalries re-emerge through your encounters with almost-human and less-human races. Will you be able to distinguish friend from foe? \nAs in the original game, a single human is unable to face the forces of the universe alone. Achieve your goals by exercising diplomacy when needed, and seizing opportunities when they present themselves. \n \nWritten by FibreTigre, author of the original game, Out There Chronicles offers an epic story that will delight science fiction fans in search of new experiences. \nBrilliantly illustrated by top French SF artist, Benjamin Carré, and equipped with a simple interface, Out There Chronicles will take you on a journey of adventure, even if you’ve never played a video game before. \n \nFeatures : \n• 80 achievements \n• An interactive sci-fi graphic novel written by FibreTigre (Out There) \n• A complex dialogue system: your choices can have consequences later in the adventure \n• Master the alien language and discover their cultures \n• Stunning, varied environments \n• Develop relationships with an array of complex characters \n• Revelations on the Out There universe \n• A dead simple, accessible interface \n• Magnificent illustrations by Benjamin Carré, the French master of science fiction \n• Captivating music composed by Siddhartha Barnhoorn (Antichamber, Out There…)","collection":3533,"popularity":1,"games":[68287,71455,26766,36950,72641,60188,60142,60139,60135,60134],"tags":[18,536871882,536873308,536875172],"category":0,"keywords":[970,2396,4260],"themes":[18],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pnmvyb8k4udv9m8qep4p.jpg","cloudinary_id":"pnmvyb8k4udv9m8qep4p","width":1024,"height":1024},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.miclos.outtherechronicles"}]}