{"id":47156,"name":"Colby","slug":"colby","url":"https:\/\/www.igdb.com\/games\/colby","created_at":1499777019691,"updated_at":1504283660942,"summary":"•\tIntroduction \nColby is an arcade game featuring an imaginary character who takes on many interesting challenges including various obstacles with the goal of remaining alive for as long as possible, discovering the marvellous programme consisting of several worlds on its way. The aim of game itself is to achieve the highest score possible. \nThe game involves dynamic character controlling, entertaining additional features and enables players to compete against each other. \n \n•\tFeatures \no\tTilt mode character control \no\tDynamic exchange of worlds \no\tInteresting obstacle course \no\tCompetition between players via Facebook and Google \no\tCoin collection combined with a plentiful market \no\tThe game is suitable for all age groups \no\tDynamic animations and accompanying sounds \no\tMobile phone mode (Game adjustment to make it suitable for mobile phone play) \n \n•\tGameplay \nThe aim of the game is to understand just how easy it is to control and play, but, at the same time, how difficult it is to achieve a high score. The mentioned score, which enables constant competition among players, is achieved by maintaining balance and avoiding obstacles.  \n‘’Tilt’’ play method makes character control all the more entertaining and the game’s dynamic edge is achieved through the world-to-world transition feature throughout the entirety of its course. \nThe game features includes coin collection used to shop in a plentiful market, where players are given the opportunity to give their character an interesting upgrade. \nEach world is presented in a 2D technique and includes various obstacles characteristic for the world the player is currently in. Worlds end in 2D technique and feature a dynamic transition onto the next one. \n \n•\tThe course of the game \nThe game begins on a balanced surface. Character movement and balance maintenance are made difficult by obstacles falling onto the course. Aside from the obstacles themselves, the players are encouraged to collect coins, as the game includes negative bonuses which induce the occurrence of new obstacles and difficulties for the character. World-to-world transition is achieved by successful survival in each world – all limited by a certain amount of time to be spent in it and ended with a dynamic transition to the next one. The longer the character remains on the surface, destroying obstacles, the higher the player’s score and chance to compete are. Market visit and purchases enable character upgrades and makeovers. \n \n•\tGraphics \nThe graphic is presented in a 2D technique and the game is made in arcade mode, including various animations to make it more visually entertaining.","storyline":"Welcome to Colby's world! \n \nHelp me fight various obstacles that are preventing me from achieving the best possible score. \n \nRain, snow, bombs, heavy boxes and concrete blocks are among all problems that I'm expecting therefore I need your help.","hypes":1,"popularity":1.333333333333333,"games":[100934,99307,101949,11510,91085,87728,90965,104978,103220,90788],"tags":[21,268435489],"developers":[13110],"publishers":[13110],"game_engines":[404],"category":0,"game_modes":[1],"themes":[21],"genres":[33],"first_release_date":1498608000000,"status":2,"platforms":[34,39],"release_dates":[{"category":0,"platform":39,"date":1498694400000,"region":1,"human":"2017-Jun-29","y":2017,"m":6},{"category":0,"platform":34,"date":1498608000000,"region":1,"human":"2017-Jun-28","y":2017,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iodln6v9d4wewfgf0gos.jpg","cloudinary_id":"iodln6v9d4wewfgf0gos","width":1920,"height":1119},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hdgjumwgcm31hldxkx0u.jpg","cloudinary_id":"hdgjumwgcm31hldxkx0u","width":1920,"height":1125},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bvt6002l6gfsm3un4sci.jpg","cloudinary_id":"bvt6002l6gfsm3un4sci","width":1920,"height":1117},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cvja4bbs25lroxlltx5m.jpg","cloudinary_id":"cvja4bbs25lroxlltx5m","width":1920,"height":1112},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a5nq0wj3xpbmpwzytmj0.jpg","cloudinary_id":"a5nq0wj3xpbmpwzytmj0","width":350,"height":205}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zkmsgjryv9apmtzyqpvu.jpg","cloudinary_id":"zkmsgjryv9apmtzyqpvu","width":1200,"height":1200},"pegi":{"rating":1},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCPT1OMrN6tQxC0crLk2ZdEw"},{"category":5,"url":"https:\/\/twitter.com\/SharkTeam_app"},{"category":4,"url":"https:\/\/www.facebook.com\/Colbysharkteam"},{"category":1,"url":"http:\/\/www.sharkteam.org"}]}