{"id":8656,"name":"Leisure Suit Larry Goes Looking for Love (in Several Wrong Places)","slug":"leisure-suit-larry-goes-looking-for-love-in-several-wrong-places","url":"https:\/\/www.igdb.com\/games\/leisure-suit-larry-goes-looking-for-love-in-several-wrong-places","created_at":1421499995753,"updated_at":1532709456125,"summary":"Leisure Suit Larry Goes Looking for Love (In Several Wrong Places) is the second game in Al Lowe's Leisure Suit Larry series. Continuing the plot of the previous game, the swinging single Larry Laffer has finally found his true love and is happily living with her. Right? Wrong!.. Because Larry is mercilessly thrown out by his great love and is left all alone, penniless, and womanless, in Los Angeles. Accidentally, Larry comes into contact with KGB agents who will pursue him all over the globe from now on. And there is also the evil doctor Noontonyt plotting evil schemes on a remote tropical island... Looks like Larry will have to forget about his women-related problems for now... or is it so? \n \nThe second game in the series introduces an improved engine (allowing for full-screen graphics and mouse control for movement). As opposed to the first game, which relied on exploration of one large area, the sequel has a more linear progression, the player being continuously taken to new locations as dictated by the plot. There are less puzzles in this installment than in the previous game; however, the number of ways to die has increased, danger awaiting Larry in most places he visits.","storyline":"The opening sequence of the game finds Larry mowing the lawn of Eve, his sexual encounter from the ending of the previous game, implying the pair have remained together. However, this is quickly revealed to be an instance of an unreliable narrator, as Eve pulls into the driveway with only the vaguest recollection of who Larry is. Realising that his affair with Eve was merely a one-night stand, a distraught Larry wanders off, winning the Lottery as well as a free vacation after stumbling into a rigged dating game show. During his preparations for the cruise ship, a microfilm falls into Larry's hands by mistake; this attracts the attention of the KGB as well as the mad scientist Dr. Nonookee (a pun on \"no nookie\"), who both want to recover the film. \n \nOn the cruise ship, Larry discovers that the woman who mistakenly chose him in the dating show let her mother go with Larry, so he makes preparations in order to escape her; he stops the ship and escapes on a lifeboat. Days later he is washed off a resort on a Hispanophone Pacific island. As KGB agents block the way to the Airport, Larry desses up as a woman and pass through. \n \nAs the landing of the airplane will bring Larry to the agents, he opens the door and escapes the plane with a parachute. He will fall in the jungle of a virgin tropical island, Nontoonyt, where Dr. Nonookee has his base of operations. Passing through peris in the jungle, Larry meets Kalalau, the daughter of chief Keneewauwau, who explains him that Dr. Nonookee prevents a company to invest on the island and develop it as a resort island. In order to marry Kalalau, Larry infiltrates the volcano and accidentally causes the death of Dr. Nonookee, liberating the native women he had hypnotized as slaves, including \"Polyester Patti\". In the final cutscene, Larry marries the chief's daughter, the witch doctor rejuvenates him, and he makes love to Kalalau as the volcano explodes. \n \nThroughout the adventure there are recurring themes that contribute to the comedic effect, like visitation to identical barber shops in almost each location Larry visits; one of them is tended by Rosella of King's Quest IV: The Perils of Rosella.","collection":539,"rating":70.4215703870878,"popularity":8,"total_rating":70.4215703870878,"total_rating_count":10,"rating_count":10,"games":[2912,59218,22423,2274,22425,22490,13189,25222,22422,22482],"tags":[27,268435458,268435487,536871255,536871262,536871939,536872626,536872666,536872873,536875531,536875632,536875827,536876082,536876274,536876292,536876393,536876610,536876642,536877802,536878396,536878567,536879186,536879191,536879715,536882730,536886243,536886353,1073741828],"developers":[32],"publishers":[32],"game_engines":[143],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[343,350,1027,1714,1754,1961,4619,4720,4915,5170,5362,5380,5481,5698,5730,6890,7484,7655,8274,8279,8803,11818,15331,15441],"themes":[27],"genres":[2,31],"first_release_date":593913600000,"platforms":[63,13,16],"release_dates":[{"category":2,"platform":16,"date":631065600000,"region":2,"human":"1989","y":1989,"m":12},{"category":2,"platform":63,"date":631065600000,"region":2,"human":"1989","y":1989,"m":12},{"category":0,"platform":13,"date":593913600000,"region":2,"human":"1988-Oct-27","y":1988,"m":10}],"alternative_names":[{"name":"Leisure Suit Larry 2","comment":"Other"},{"name":"Leisure Suit Larry II - Goes looking for Love (In Several Wrong Places)"},{"name":"Leisure Suit Larry II"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lrqktxysrlbtkmurivpf.jpg","cloudinary_id":"lrqktxysrlbtkmurivpf","width":320,"height":200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pj0djhoidxceqcmaunry.jpg","cloudinary_id":"pj0djhoidxceqcmaunry","width":320,"height":200}],"videos":[{"name":"Gameplay video","video_id":"a51s1oi44dc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/awlxeiz5ssr8gpjmzlqn.jpg","cloudinary_id":"awlxeiz5ssr8gpjmzlqn","width":800,"height":993},"esrb":{"rating":6},"pegi":{"rating":5},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/765840"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Leisure_Suit_Larry_Goes_Looking_for_Love_(in_Several_Wrong_Places)"}],"external":{"steam":"765840"}}