{"id":86856,"name":"Ultimate Jungle Simulator","slug":"ultimate-jungle-simulator","url":"https:\/\/www.igdb.com\/games\/ultimate-jungle-simulator","created_at":1518609503740,"updated_at":1523427679109,"summary":"Dash into your newest adventure as a powerful Gorilla, crafty Lemur, or a deadly Tiger! Choose from TEN PLAYABLE ANIMALS! Hunt down food in the rainforest, raise your family, and unlock exciting new playable animals as you experience life in a beautiful yet dangerous Jungle!\n\nDownload the Ultimate Jungle Simulator today while it's 50% OFF for a very limited time!\n\nBrand New Features\nREALISTIC SIMULATOR\nYou'll need to maintain your health, hunger, thirst, and energy while ruling over the Jungle!\n\nTEN PLAYABLE ANIMALS\nChoose from your favorite species of forest animals in a single game! Become a Tiger, Lemur, Frog, Gorilla, Macaw Parrot, Leopard, Panda, Sloth, Snake, and a Chimpanzee! Each species has their own families, experience, and levels!\n\nDANGEROUS BOSS BATTLES\nTest your skills against SIX thrilling boss battles! A massive serpent lurks in a hidden cove waiting to strike! The King of the Jungle awaits any challenger in his domain!\n\nBUILD YOUR FAMILY\nDominate other animals or bring them a treat to recruit them to your family! Customize and play as any animal in your pack and create a powerful family!\n\nRAISE YOUR BABIES\nBreed babies that will grow into powerful members of your family! Care for you babies while they are are young, finding food for them and carrying them in your mouth!\n\nCUSTOMIZE YOUR ANIMAL\nChoose your animal’s name, appearance, skills, and attributes to complement your pack members and become a more powerful group!\n\nLEVEL UP YOUR ANIMAL\nGain experience by catching and eating your prey, escaping predators, caring for your family, and completing missions! Level up your animal to increase their health and attack damage, earn points to upgrade your stats, and increase the size of your pack!\n\nEARN STAT POINTS\nStat Points can be used to provide bonus’s to traits like Health, Critical Attack Chance, Run Speed, and much more! \n\nUPGRADEABLE BUFFS\nBuff Points can be used to upgrade your Hiss and Roar Buffs, which create temporary Stat Boosting auras around your animal when active! \n\nRAGDOLL PHYSICS\nYour prey now realistically dangles from your jaws as you carry and drag them!\n\nDYNAMIC WEATHER AND DAY\/NIGHT CYCLE\nProcedural weather system with unique storms, clouds, sun, and stars!\n\nMASSIVE REALISTIC 3D ENVIRONMENT\nExplore a world so big we created TWENTY FOUR unique dens for your animals to live in! Hunt in the dense jungle, build your home high in the trees, and brave piranha filled waters in the swamp!\n\nDOZENS OF ENEMIES\nHunt down animals like tiger, leopard, gorilla, chimpanzee, toucan, snake, fish, turtle, elephant, bat, monkey, wildebeest, crocodile, giraffe, squirrel, flamingo, frog, iguana, lion, panda bear, parrot, lemur, sloth, warthog and many more!\n\nOPTIONAL BLOOD EFFECTS\nIf you are of age or have your parents permission, turn on the BRAND NEW blood effects for added combat ferocity!\n\nGLUTEN-FREE PROMISE\nWith all of our games you will always get the full game with no ads or additional purchases!\n\nDownload the Ultimate Jungle Simulator to transport yourself into a dense rainforest filled with dangerous creatures and live the life of your favorite wild animal!\n\nIf you liked living in the Jungle then you'll love our other animal simulators! Download our Ultimate Cat Simulator and live as a wild feline in the city, or try the Ultimate Wolf Simulator and howl at the moon with your pack of wolves!\n\nGive us a shout and let us know what you want to play next!\nfacebook.com\/glutenfreegames\ntwitter.com\/glutenfreegames","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[75102,49414,25636,74378,25311,26145,44242,75398,36608,28465],"tags":[268435468,268435469],"category":0,"genres":[12,13],"first_release_date":1494892800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1494892800000,"region":8,"human":"2017-May-16","y":2017,"m":5}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ybd1ojnlihcrp2vmusqe.jpg","cloudinary_id":"ybd1ojnlihcrp2vmusqe","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h4uzke32q3ingxte46ml.jpg","cloudinary_id":"h4uzke32q3ingxte46ml","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qbk2jlnaliggo7fvaj7f.jpg","cloudinary_id":"qbk2jlnaliggo7fvaj7f","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/goi5lvitcsfy4vlbflai.jpg","cloudinary_id":"goi5lvitcsfy4vlbflai","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/grmiyjp1v6dg8eg5idto.jpg","cloudinary_id":"grmiyjp1v6dg8eg5idto","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kplj8jskerahn66tvj5i.jpg","cloudinary_id":"kplj8jskerahn66tvj5i","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h0agma5nw6ekauyd8c5b.jpg","cloudinary_id":"h0agma5nw6ekauyd8c5b","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gfsnimrkapgw7h90pzjl.jpg","cloudinary_id":"gfsnimrkapgw7h90pzjl","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pg45w3nd2trsnxdnnshu.jpg","cloudinary_id":"pg45w3nd2trsnxdnnshu","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vostk8lolzbsjtkzishm.jpg","cloudinary_id":"vostk8lolzbsjtkzishm","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kdsgwc3lunuy5lkvamca.jpg","cloudinary_id":"kdsgwc3lunuy5lkvamca","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/ultimate-jungle-simulator\/id1150945722?mt=8&uo=4"}]}