{"id":15539,"name":"Master Ninja","slug":"master-ninja","url":"https:\/\/www.igdb.com\/games\/master-ninja","created_at":1451245137541,"updated_at":1515666867102,"summary":"Shadow Warrior of Death. \n \nWelcome to the adventure of a lifetime. Prepare yourself for the most awesome and dangerous challenge ever. Enter the mystic land of Japan as it was centuries ago. Assume the identify of a proud Ninja warrior and ready yourself to enter the castle of the evil Japanese Warlord. Sanjo Yama Moto. Your quest is to regain a precious magical sword that Sanjo has stolen from your Ninja sect. This sword has power that Sanjo can use to being death and destruction to the land. The danger in Sanjo's castle will be tremendous. Through the castle lurk powerful Ninja warriors, Samurai guards, evil mystic priests, and deadly tigers. You must work your way through the many chambers of Sanjo's castle, flight and kill his Ninjas, battle his black magic curses, overcome his traps and obstacles, recapture the magic sword, and assassinate Sanjo Yama Moto himself. No Ninja has ever survived the destructive forces of Sanjo. Are you the one who can finally battle the dark power and bring truth and goodness back to the land? Are you the one who has no fear? Are you the one that will be called... Master Ninja?","popularity":1.333333333333333,"games":[10039,36794,2907,36608,34919,19658,74155,75089,1235,16468],"tags":[1,268435460,536871076,1073741828],"developers":[1157],"publishers":[1157],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[164],"themes":[1],"genres":[4],"first_release_date":536371200000,"platforms":[13,16,15],"release_dates":[{"category":2,"platform":13,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":16,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12}],"alternative_names":[{"name":"Master Ninja: Shadow Warrior of Death"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bi4wqltsafsksjxnnjgx.jpg","cloudinary_id":"bi4wqltsafsksjxnnjgx","width":669,"height":877}}