{"id":87139,"name":"250+ Solitaires","slug":"250-plus-solitaires","url":"https:\/\/www.igdb.com\/games\/250-plus-solitaires","created_at":1518620889153,"updated_at":1518710645366,"summary":"\"250+ Solitaires\" is a collection of 253 solitaire games.\nThe collection contains favorite solitaire games such as Freecell, Klondike, Canfield, and others, as well as a lot of original games. The list of solitaire games contains about 15 patience types. They are Scorpion, Joker Type, Pyramid patience, Blockade, Carpet Type and so on. You can play popular solitaire games like Algerian patience, Golf patience, Yukon solitaire, solitaire Royal Secrets. Use search to find a patience you love, i.e. Solitaire New York, patience deluxe, Solitaire classic, tri-peaks and others. Then choose your ultimate solitaire, add it to Favorites and get quick access to favorite patience card games free.\nThis free solitaire app has a text description of rules for each patience game. Rules describe the game purpose, foundation and tableau piles, stock regulations and placement. You can also view playing card games demo with the step-by-step solitaire guide. So trying new solitaire games will never be a challenge again.\nIf you are a board games fun, you’ll love application settings agility. It can be customized for any kind of card player. You are able to set common game options, animation, game table background, cards style and their back view. Backup functionality added to make your patience game stable, calm and pleasant on phones and pads\nThere is a possibility to change the rules of most solitaire games.\nFor each game, there is a description of the rules and a demonstration.\nThis collection gives you solitaire no wifi needed.\nRefer to https:\/\/alxanosoft.com for cooperation.","rating":70,"popularity":1,"total_rating":70,"total_rating_count":0,"rating_count":0,"category":0,"keywords":[1361,3171],"first_release_date":1376006400000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1376006400000,"region":8,"human":"2013-Aug-09","y":2013,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/do1wali8lfamvr9ffcvq.jpg","cloudinary_id":"do1wali8lfamvr9ffcvq","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/akxcg8cskisoijsy1nx2.jpg","cloudinary_id":"akxcg8cskisoijsy1nx2","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ajrnq5vgxdmkxnnvlqcc.jpg","cloudinary_id":"ajrnq5vgxdmkxnnvlqcc","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u8qjenyu31oytspasrxf.jpg","cloudinary_id":"u8qjenyu31oytspasrxf","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mzrfnof69rolre7yaysz.jpg","cloudinary_id":"mzrfnof69rolre7yaysz","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/250-solitaires\/id680532369?mt=12&uo=4"}]}