{"id":23930,"name":"Blue Horizon","slug":"blue-horizon","url":"https:\/\/www.igdb.com\/games\/blue-horizon","created_at":1473807351705,"updated_at":1522296342705,"summary":"A brand new open world first person game set in a tropical archipelago filled with islands, sailing ships and pirates!\nA brand new game, from a new Indie Studio, bringing you an action packed adventure on the high seas!\n\nThe year is 1686, and you must make your way through the Caribbean world on the Blue Horizon so find your fortune and seek revenge on the evil Pirate Captain Bloodbeard! A first person desktop game filled with adventure, discovery and combat.\n\nBlue Horizon has been created so the player is in a large open world environment. With each part of the game although separate can be explored without the player noticing.\n\nCaribbean World\nThere is only one level. Always viewable on the horizon. Initially consisting of 8 Islands, the player must discover each location in order to explore it. Locations can be discovered by talking to NPCs (Non-Playable characters), or following maps found. Once a location has been found it can be traveled to and from using a ship.\n\nTropical Islands with towns, villages, forts, dunes, mountains, cave systems, giant caverns, ship wrecks, and forests all lay in wait for the player to find and explore.\n\nInventory and Items\nWeapons, equipment, books, valuable loot are found laying around, in containers or purchased from shops and peddlers, looted from enemies, or given as rewards for completing tasks previously given. Keys are required for some doors too.\nWeapons are currently melee, pistols and cannon emplacements.\n\nEquipment or a pistol can also be equipped in the left hand such as the Lantern for seeing in dark caves. Provisions are needed to restore health, enhancement items can also be found or purchased.\n\nTasks\nTo progress, one must complete tasks given from NPCs or from instructions found. The NPCs will be grateful, whether they are for the main quest or side missions. Tasks may involve collecting, farming, building, hunting, slaying or completing another task. Hidden stashes, and Bounty hunting are available from NPCs.\n\nEnemies\nThere are dangerous islands, and relatively safe islands. Unique foes await, be they Pirates, animals or strange creatures, undead and non-human. Some enemies are weak, some are strong and have various short and long range attacks. Some individuals you encounter will be docile until provoked, in which case they may attack as a group.\n\nEnemy ships can plague the player too. Captain Bloodbeard's ship is the main aggressor. Bosses await to complete the main story line. The seas contain Marauding Pirate ships which you may encounter when sailing from Island to Island.\nThe game is still in development and is being expanded to give the player the most enjoyment and fun as possible, while making it not too easy or too hard.","rating":50,"popularity":1.333333333333333,"total_rating":50,"total_rating_count":0,"rating_count":0,"games":[47823,25300,36926,55289,25311,55092,16468,26766,22747,37088],"tags":[1,22,268435468,268435487,268435488,536871063,536871208,536871938,536871945,536875352],"category":0,"game_modes":[1],"keywords":[151,296,1026,1033,4440],"themes":[1,22],"genres":[12,31,32],"first_release_date":1503014400000,"status":2,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1503014400000,"region":8,"human":"2017-Aug-18","y":2017,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l4jk8bmwrzlob8jxtlr3.jpg","cloudinary_id":"l4jk8bmwrzlob8jxtlr3","width":1604,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j8qgi8jyv8mzeskjqkeb.jpg","cloudinary_id":"j8qgi8jyv8mzeskjqkeb","width":1615,"height":909},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y35ad6tgscohpe279hwo.jpg","cloudinary_id":"y35ad6tgscohpe279hwo","width":1615,"height":905},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jowk4to6abrezgjoop1a.jpg","cloudinary_id":"jowk4to6abrezgjoop1a","width":1403,"height":787},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/weihzwieodwyxxrwe8sq.jpg","cloudinary_id":"weihzwieodwyxxrwe8sq","width":1614,"height":907}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ffdchs2nx6hs0crl9n4l.jpg","cloudinary_id":"ffdchs2nx6hs0crl9n4l","width":1016,"height":908},"external":{"steam":"589740"}}