{"id":26830,"name":"Ethernalis","slug":"ethernalis","url":"https:\/\/www.igdb.com\/games\/ethernalis","created_at":1484741700966,"updated_at":1484766755275,"summary":"Ethernalis - multi-user dungeon crawler supported with roguelike procedurally generated content. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe game describes a dark fantasy world via original cards placed on the game board.  Engine, as it exists in it's current form can already support most of what you would normally expect from a roguelike or an RPG game.  \r\n\r\n\r\n\r\nThe moment the client connects - the game engine generates 3 available characters that a Player can choose to control. Each character is different and comes with a range of specific attributes that make the game play different each time. Once the character is chosen - the player is presented with a choice of quest. From then on it will fight for survival in an unforgiving dungeon where you will collect loot, gain experience and advance your hero reaching deeper and deeper into the dungeons depths.   Every enemy has a chance to become special and gain additional strength, defense or surprise you with extra ordinary amount of health points. Players have a small chance of coming across enchanted equipment and weapons.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWe're talking class specific cards, location specific cards and experience level based encounters combined with MUD like event system that allows you to immerse in challenging storyline designed by our Game Masters. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nIn the game you can come across cards which will have their own interaction rules. This allows us to fill the world with NPCs and events that couldn't otherwise be simply shawn through card interface. Game engine supports capacity for Quests, Rewards, Standings and to provide content tailored to specific classes or characters.   \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe game already has a strong roguelike feel and your character is few die rolls away from death or glory.","storyline":"The story is procedurally generated, depends on character choice and gameplay.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nYour character can discover randomly generated dungeons to support Imperial campaigns or join the forces of Evil to unleash the death lurking in the mountain depths for millennia.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r","popularity":1.333333333333333,"games":[47823,26163,16468,24048,36534,55289,36792,25311,26145,18398],"tags":[17,268435468,268435487,268435488,536871170,536871208,536871328,536871390,536871632,536872420,536874021],"developers":[11947],"game_engines":[429,414],"category":0,"keywords":[258,296,416,478,720,1508,3109],"themes":[17],"genres":[12,31,32],"first_release_date":1484524800000,"status":2,"platforms":[34],"release_dates":[{"category":0,"platform":34,"date":1484524800000,"region":8,"human":"2017-Jan-16","y":2017,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qlp30d45ppcgwjojthue.jpg","cloudinary_id":"qlp30d45ppcgwjojthue","width":1024,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fg8zu5mykyeytjps3g9u.jpg","cloudinary_id":"fg8zu5mykyeytjps3g9u","width":576,"height":1024}],"videos":[{"name":"Gameplay video","video_id":"QMSdw0fqntw"},{"name":"Gameplay video","video_id":"XMHz6DEByRw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tp9myynuwp8dnn6pvsne.jpg","cloudinary_id":"tp9myynuwp8dnn6pvsne","width":617,"height":512},"esrb":{"rating":6},"pegi":{"rating":2},"websites":[{"category":4,"url":"https:\/\/www.facebook.com\/ethernalis\/"},{"category":1,"url":"http:\/\/ethernalis.com\/game\/"}]}