{"id":39530,"name":"Kizuna Encounter: Super Tag Battle","slug":"kizuna-encounter-super-tag-battle","url":"https:\/\/www.igdb.com\/games\/kizuna-encounter-super-tag-battle","created_at":1498129858650,"updated_at":1548380917515,"summary":"One year ago, King Leo had made the Battle of the Beast God tournament in order to see on who had what it took to challenge and fight against him from within their own given time and opportunity. Nine fighters had entered the tournament from within sight and that each of them had battled against one another from within a strong and relentless manner, but in the end, Sho Hayate had proven to be the strongest competitor and that he had won the tournament while defeating King Leo (and his fake impersonator King Lion) from within the finals of the tournament. \n \nTo seek revenge against Hayate and those who caused his humiliating downfall, King Leo has organized a second version of the Battle of the Beast God tournament, but this time, there's a new rule. Teams of 2 people must work together from within this new tournament so that they can either ensure victory or face defeat. The competitors from last year's tournament have learned of King Leo's new tournament and that each of them have decided to join forces with each other on either friendly or temporary terms. With the exception of Carol Stanzack (who decides to skip the tournament to continue her gymnastics training) and Nicola Zaza (who's too busy in having to work on his latest scientific project), Hayate and the fighters from the previous tournament have returned for combat and that they're ready to face the latest challenge that's presented to them by King Leo. \n \nHowever, the previous fighters aren't the only ones from within this tournament, as two new challengers have entered into the fray and that they have their own reasons in battling from within King Leo's new competition. The gathered fighters must be ready and prepared to not only fight against each other and King Leo from within this tournament, but also, they must deal with a possible unknown threat that lies directly from within the shadows of this competition as well.","collection":5036,"popularity":1.333333333333333,"games":[41828,17548,61985,76885,8564,47576,90101,10039,7222,43988],"tags":[268435460,536870973,536871019,536871889,536873064,536875716,536875870,536878192,536881123],"publishers":[17183],"category":0,"keywords":[61,107,977,2152,4804,4958,7280,10211],"genres":[4],"first_release_date":821059200000,"platforms":[80,52,79],"release_dates":[{"category":0,"platform":79,"date":822096000000,"region":5,"human":"1996-Jan-20","y":1996,"m":1},{"category":0,"platform":80,"date":821059200000,"region":5,"human":"1996-Jan-08","y":1996,"m":1},{"category":0,"platform":79,"date":822096000000,"region":2,"human":"1996-Jan-20","y":1996,"m":1},{"category":0,"platform":80,"date":821059200000,"region":1,"human":"1996-Jan-08","y":1996,"m":1},{"category":0,"platform":52,"date":845769600000,"region":8,"human":"1996-Oct-20","y":1996,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tket1xhesiwi6b9dti6o.jpg","cloudinary_id":"tket1xhesiwi6b9dti6o","width":1161,"height":1629}}