{"id":41530,"name":"Blackjack","slug":"blackjack","url":"https:\/\/www.igdb.com\/games\/blackjack","created_at":1498819565817,"updated_at":1513079078250,"summary":"Atari's Blackjack employs a variant of blackjack rules that is so extremely unfavorable to the player, that it would almost certainly never be seen in a real casino because no one would play with them. Splitting pairs is not allowed, and even more substantially, draws are won by the dealer (your bet is not returned to you if you and the dealer get the same card total and neither busts). This represents over a 10% house advantage. The player uses the paddle controller to enter a bet of up to 25 chips from an initial pot of 200. An up card is then presented, and the player decides whether to \"hit\" (accept another card) or stand. The player breaks the bank by obtaining a score of 1,000 chips, or is \"busted\" upon losing everything. \n \nDue to a glitch in the program, while a player is selecting among the options of what to do with the current hand by pressing left or right with the paddle controller, the amount of the player's next bet is modified even though it is defined by a variable that will not be visible until the end of the hand, requiring the player to carefully re-enter it at the start of every hand without pressing the button carelessly or risk wagering an unintended amount.","popularity":1.333333333333333,"games":[44242,18623,22470,29173,26145,22425,55689,55590,23867,22406],"tags":[268435469,268435472,536871641,536872060,536874083,1073741827],"developers":[82],"publishers":[82],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[729,1148,3171],"genres":[13,16],"first_release_date":241920000000,"platforms":[59],"release_dates":[{"category":1,"platform":59,"date":241920000000,"region":2,"human":"1977-Sep","y":1977,"m":9}],"videos":[{"name":"Gameplay video","video_id":"FyhBwWmIr6A"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/deh3jvnkjwh5rxzu4uuo.jpg","cloudinary_id":"deh3jvnkjwh5rxzu4uuo","width":439,"height":600}}