{"id":50830,"name":"Brainpipe: A Plunge to Inhumanity","slug":"brainpipe-a-plunge-to-inhumanity","url":"https:\/\/www.igdb.com\/games\/brainpipe-a-plunge-to-inhumanity","created_at":1500054508066,"updated_at":1513086815307,"summary":"What is BRAINPIPE? \n \nIs it an otherworldly mind control device, masquerading as a seemingly quaint computer game? \n \nIs it a gateway to worlds beyond our own, created by eldritch wizardry and invoked by strange creatures hidden away on uncharted islands in the South Pacific? \n \nPerhaps it's a message from the future, an instruction to mankind to uplift humanity to a higher state of being. \n \nOr maybe it's just an addictive endurance run game from Digital Eel. \n \nBRAINPIPE is a unique gaming experience. The ultimate objective is to transcend humanity. You do this by navigating the tunnels of your mind, exercising your hand-eye coordination while relishing in the funkadelic sights and sounds of your inner self. Collect the illuminated glyphs while avoiding the nasty obstacles. They may look all nice and shiny, even warm and inviting, but each brush with them brings you one step closer to eternal darkness! \n \nBRAINPIPE is also an easy game to play, hearkening back to the classic arcade games of yesteryear. A one click interface keeps you focused on the action, instead of searching for the right key to press, and is a perfect complement to the soothing audio and visuals. \n \nAre you ready for a trip beyond space? \n \nBeyond time? \n \nBeyond MIND? \n \nExperience BRAINPIPE today!","popularity":1.333333333333333,"games":[13189,25222,55803,41895,22425,29730,26766,11296,36950,37374],"tags":[268435487,536871938,536871939,536875243],"category":0,"keywords":[1026,1027,4331],"genres":[31],"first_release_date":1232755200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1232755200000,"region":8,"human":"2009-Jan-24","y":2009,"m":1}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lc1aekztvfgbihyuivf7.jpg","cloudinary_id":"lc1aekztvfgbihyuivf7","width":1152,"height":864}}