{"id":87130,"name":"Blood & Glory 2: Legend","slug":"blood-and-glory-2-legend","url":"https:\/\/www.igdb.com\/games\/blood-and-glory-2-legend","created_at":1518620538001,"updated_at":1518710715858,"summary":"***If you are experiencing an initial loading screen hang and are currently on Mac OS Mountain Lion 10.8.2, please upgrade for free to 10.8.3 released on 14-March.***\n\n***If you would like to customize the controls access the game settings from the main menu.***\n\nWelcome to Blood & Glory Legend – the highly anticipated sequel to the AAA blockbuster smash-hit Blood & Glory! Return to the arena and bask in the blood-hungry cheers of the crowd as you fight to become a LEGEND!\n\nThe top-rated gladiator combat game continues with Blood and Glory: Legend! Equip lethal weapons and epic armor in your quest to achieve blood-soaked victory over the Emperor himself!\n\nMOTION COMIC STORYLINE\nJourney through the Empire, leaving blood-thirsty bosses in your wake as the all new animated comic story unfolds!\n\nSTUNNING & AWARD-WINNING AAA GRAPHICS\nThe bleeding-edge graphics are optimized for the Retina Display of the MacBook Pro.\n\nNEW MOVES & STRATEGY\nPerfect your skills and unleash stunning Special Attacks, Super Combos and the all new Glorious Strike! Enemies can now perform unblockable and undodgeable attacks so choose your defenses wisely!\n\nDAILY BONUS!\nCome back every day to earn free money and equipment! Complete battles ever day to earn even larger Bonus rewards!\n\nPLEASE NOTE:\n- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.\n- This game is not intended for children.\n- Please buy carefully.\n- Advertising appears in this game.\n- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.\n- A network connection is required to play.\n- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com\/privacy\n- If you have a problem with this game, please use the game’s “Help” feature.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[23175,37022,55289,42080,59516,44191,12579,25646,25311,1221],"tags":[1,268435487],"category":0,"themes":[1],"genres":[31],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lddjbnywev9jugn53tu4.jpg","cloudinary_id":"lddjbnywev9jugn53tu4","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d4p2fe4cfogzmzlqthyi.jpg","cloudinary_id":"d4p2fe4cfogzmzlqthyi","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/chl9xmx7xobkh5r50q78.jpg","cloudinary_id":"chl9xmx7xobkh5r50q78","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wuqukffweqfp0aiivgcn.jpg","cloudinary_id":"wuqukffweqfp0aiivgcn","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cfcl4wmp1behg4vnualz.jpg","cloudinary_id":"cfcl4wmp1behg4vnualz","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tg5vxa3mt9ecxk9seilc.jpg","cloudinary_id":"tg5vxa3mt9ecxk9seilc","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/blood-glory-2-legend\/id582468635?mt=12&uo=4"}]}