{"id":101094,"name":"Pocket Rogues: Ultimate","slug":"pocket-rogues-ultimate","url":"https:\/\/www.igdb.com\/games\/pocket-rogues-ultimate","created_at":1525940561080,"updated_at":1542402231171,"summary":"Pocket Rogues is a dynamic old school Action-RPG designed in the Roguelike genre. Here, you have to shoot your way out of hordes of monsters by traveling through unique and randomly generated locations and develop your own fortress and heroes. \n \nReal-time battles will challenge any hardcore player, and research for environment and many unusual techniques will engage you for long hours. \n \nDozens of dungeons filled with unique loot and monsters will be in Pocket Rogues. The game has a lot of heroes for whom you can play, as well as many bosses against whom you will fight, and the battle will be a real test for you. And the traditional components of the RPG genre, such as character upgrade and exploring the world around them, will never let you feel bored! \n \nULTIMATE-VERSION FEATURES: \n \n• The number of all the crystals, obtained by killing monsters, bosses and for completing tasks, is increased by 50% \n• Added the ability to save the game before leaving, being in any normal dungeon, as well as auto-save while minimizing the game \n• Berserk and all future premium classes are available for gold \n• All normal dungeons are completely free \n• Advertising is completely disabled","storyline":"For many centuries, a dark dungeon had been beckoning hapless travelers with its secrets and treasures. One after another, they disappeared after having met the true Evil, but gloomy legends only heat up new and new adventurers’ itches. So why not to become one of them?!”","popularity":1,"version_parent":111249,"version_title":"Ultimate","games":[103303,99118,26163,103282,25877,54775,36929,16468,26879,47823],"tags":[17,268435468,268435488,536872617,1073741827],"developers":[16935],"publishers":[16935],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[1705],"themes":[17],"genres":[12,32],"first_release_date":1514678400000,"platforms":[34,39],"release_dates":[{"category":2,"platform":34,"date":1514678400000,"region":8,"human":"2017","y":2017,"m":12},{"category":2,"platform":39,"date":1514678400000,"region":8,"human":"2017","y":2017,"m":12}],"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.EtherGaming.PocketRoguesUltimate&hl=en_US"},{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/pocket-rogues-ultimate\/id1316150324?mt=8"},{"category":4,"url":"https:\/\/www.facebook.com\/PocketRogues"}]}