{"id":11002,"name":"Earth Defense Force 4.1 - The Shadow of New Despair","slug":"earth-defense-force-4-dot-1-the-shadow-of-new-despair","url":"https:\/\/www.igdb.com\/games\/earth-defense-force-4-dot-1-the-shadow-of-new-despair","created_at":1433631697245,"updated_at":1534368449561,"summary":"This updated version of Earth Defense Force 2025 marks the series first current-gen appearance. It sports improved performance, new content amounting to more than 50 percent of the original, two-player local co-op, and four player online co-op. \n \n \nThe game is also being ported to PC \n \n\"It's a fight for the future of the planet between the Ravagers, a merciless swarm of alien invaders, and the Earth Defense Force (EDF) in this third-person shooter. \n \nAs an EDF soldier you will go head to head in fierce combat against the hordes of giant alien insects and their slaughtering machines. \n \nPlay as four different classes in over 80 missions with a range of 800 weapons at your disposal. \n \nThe most overwhelmingly numerous forces of Ravagers the series has ever seen will take the EDF fighters to the depths of despair and back! \n \nOnline co-op play supported.\"","storyline":"\"2013 was the first year we spotted them. We had no way of knowing what they were back then; just blips and warbles on the scanners, far out in space, slowly heading our way. Some of us hoped they were elder beings, coming to share their wisdom or take us to a better place. We all hoped that, really, but some of us had the foresight to plan for other possibilities, and that's how Earth Defense Force was born. \n \nIt took four years to corral the world's militaries into assembling and equipping a joint task force. By the time all the petty politics were out of the way, we scarcely had time to train the troops. Not knowing what to expect, we ran EDF through every sci-fi scenario we could imagine. \n \nThen, in 2017, they arrived. And they opened fire. Not just from the sky, with their starships and battle machines, but from underneath the ground as well, with swarms and swarms of giant mutant insects. We called the aliens Ravagers, and across the globe, they lived up to that name. Only EDF, with their specialized weapons and training, stood a chance. Finally, after the bloodiest war in history, EDF blasted the last Ravager off the planet. \n \nWe thought that was the end of it. It had to be. But now, eight short years later, humanity's worst nightmare has come true: What we'd faced had only been the first wave. The Ravagers are back, with new enhanced creatures and machines. Fortunately, EDF has stayed vigilant all this time, and they've put those eight years to good use. With new weapons, new units, and even giants of our own, humanity is ready to go another round, and by the time we're done, they'll never want to come back again.\"","collection":818,"rating":90,"popularity":2.666666666666667,"aggregated_rating":65.8,"aggregated_rating_count":10,"total_rating":77.9,"total_rating_count":12,"rating_count":2,"games":[68287,36950,27011,55038,28029,96027,27208,90099,27186,106102],"tags":[1,18,39,268435461,536870915,536870937,536871427,536871529,536871882,536872235,536872360,536873023,536873146,1073741826],"developers":[2481],"publishers":[449,2187,4091],"category":0,"player_perspectives":[2],"game_modes":[1,2,3],"keywords":[3,25,515,617,970,1323,1448,2111,2234],"themes":[1,18,39],"genres":[5],"first_release_date":1427932800000,"pulse_count":1,"platforms":[6,48],"release_dates":[{"category":0,"platform":48,"date":1427932800000,"region":5,"human":"2015-Apr-02","y":2015,"m":4},{"category":0,"platform":48,"date":1449878400000,"region":2,"human":"2015-Dec-12","y":2015,"m":12},{"category":0,"platform":48,"date":1455235200000,"region":1,"human":"2016-Feb-12","y":2016,"m":2},{"category":0,"platform":6,"date":1468800000000,"region":8,"human":"2016-Jul-18","y":2016,"m":7}],"alternative_names":[{"name":"Chikyuu Boueigun 4.1: The Shadow of New Despair","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xjmal1oxzcmk6muxbpnp.jpg","cloudinary_id":"xjmal1oxzcmk6muxbpnp","width":1920,"height":818},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/anoj0wyyjbbltoar4rx4.jpg","cloudinary_id":"anoj0wyyjbbltoar4rx4","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qwdva8fm1reautaserel.jpg","cloudinary_id":"qwdva8fm1reautaserel","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ju13qfhdthx7sp5uqsrh.jpg","cloudinary_id":"ju13qfhdthx7sp5uqsrh","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fzv6yddbxsjwybtfudo5.jpg","cloudinary_id":"fzv6yddbxsjwybtfudo5","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"kH_31cTPdgo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ze78uk3ogxncfeleemww.jpg","cloudinary_id":"ze78uk3ogxncfeleemww","width":614,"height":168},"esrb":{"synopsis":"\tThis is a third-person shooter in which players assume the role of military soldiers defending cities from giant insects and aliens. Players use lasers, machine guns, turrets, and rockets launchers to destroy alien robots, spacecraft and creatures (e.g., ants, spiders, dragons). Players can also use jet packs, tanks, and helicopters to fight enemies in frenetic combat. Battles are accompanied by realistic gunfire and large explosions. Large splashes of red blood frequently appear when creatures are hit and when human characters are attacked. The word “sh*t” appears in the dialogue.","rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Realistic looking violence towards non human looking characters - Non realistic looking violence towards human characters - Mild bad language\r\nThis game allows the player to interact with other players ONLINE","rating":3},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/410320"},{"category":2,"url":"http:\/\/theearthdefenseforce.wikia.com\/wiki\/Earth_Defense_Force_4.1:_The_Shadow_of_New_Despair"},{"category":1,"url":"http:\/\/www.theedfdeploys.com\/edf4.1\/"}],"external":{"steam":"410320"},"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":0,"onlinecoopmax":0,"onlinemax":0,"offlinemax":0}]}