{"id":113358,"name":"Escape from Titan","slug":"escape-from-titan","url":"https:\/\/www.igdb.com\/games\/escape-from-titan","created_at":1544718066115,"updated_at":1544941791604,"summary":"The game is under development. More information and the latest updates you can find on http:\/\/patreon.com\/cutepixel \n \nEscape form Titan is a mixture of survival and RPG. You have to play for the girl Maya, the flight engineer from the cargo ship, who suddenly found herself held captive by unknown creatures in an secret research facility on Titan - Saturn's satellite. Your goal will be to escape from Titan, and if possible, and save some of the prisoners in this place people. \n \nBriefly about the features of the current version: \n \n- At the moment the game is completely without sound. The voice acting is being prepared and in the next versions it will certainly appear. \n- The saving system has not yet been implemented. In the case of the death of a character, all game progress is lost and the game will have to start anew. However, do not despair, because at the moment the gameplay will take 10-15 minutes :) \n- As mentioned above, there may be numerous glitches, errors and other amenities of the alpha version. I will be glad to hear about all such finds in the comments here. \n \nGame Management: \n \nAWSD - movement \nSpace - Jump \nRight mouse button hold - overview \nW + Left Shift - running \nE - use, pick up \nR - hack \nEsc - main menu \nP - character parameters window \nG - settings window \nM - map \nKeys 1-6 - use the item in the appropriate cell inventory \nKeys 1-6 + Left Shift - discard an item from the corresponding inventory cell","storyline":"Escape form Titan is a mixture of survival and rpg. Our main heroine - Maya, a flight engineer on a banal cargo ship, who comes to refuel at Titan, a satellite of Saturn. \n \nMaya suddenly finds herself locked in a certain room, apparently deep beneath the surface of the satellite. At the same time, she does not remember what happened and does not understand how she got here. In addition, the girl is absolutely naked. \n \nYour main task is to get out of here and, having got to the serviceable ship, to fly away from Titan. Explore extensive locations, collect useful items, upgrade your skills and build a team of characters met on the way, any of which you can take control. \n \nThe main obstacle on the way to the freedom are unknown creatures who's inhabited of complex and keep it under their control, and besides, they are abnormally not indifferent to the female sex.","hypes":1,"popularity":1,"games":[25300,55038,68287,76397,36950,19301,18290,103054,16478,103232],"tags":[18,21,23,42,268435468,536871044,536871251,536871255,536871390,536871882,536872441,536873421,1073741826],"developers":[17065],"publishers":[17065],"game_engines":[601],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[132,339,343,478,970,1529,2509],"themes":[18,21,23,42],"genres":[12],"status":0,"platforms":[6],"release_dates":[{"category":7,"platform":6,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5reo.jpg","cloudinary_id":"sc5reo","width":1366,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5ren.jpg","cloudinary_id":"sc5ren","width":1366,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rem.jpg","cloudinary_id":"sc5rem","width":1060,"height":597},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rel.jpg","cloudinary_id":"sc5rel","width":1366,"height":768}],"videos":[{"name":"Teaser","video_id":"yL6EzbhDgd8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1i5c.jpg","cloudinary_id":"co1i5c","width":328,"height":400},"websites":[{"category":15,"url":"https:\/\/cutepixel.itch.io\/"},{"category":8,"url":"https:\/\/instagram.com\/@cutepixelgames"},{"category":1,"url":"http:\/\/patreon.com\/cutepixel"}]}