{"id":113464,"name":"Sindome","slug":"sindome","url":"https:\/\/www.igdb.com\/games\/sindome","created_at":1545762889141,"updated_at":1545798634404,"summary":"Sindome is a cyberpunk MOO (a text-based online virtual reality system to which multiple users are connected at the same time). Roleplaying in Sindome is unique in that most of its coding is custom, employing XML, File-IO, custom web based websocket powered game client (optional), and a graphical web interface. Sindome has been online since 1997. \nThe Sindome world is based on the cyberpunk genre of science fiction. Sindome draws its inspiration from books, movies, and traditional role-playing games like: William Gibson's Neuromancer, Count Zero, Virtual Light, Idoru, \"Burning Chrome\"; Neal Stephenson's Snow Crash; Bruce Sterling's Mirrorshades, Richard K Morgan's Altered Carbon and Islands in the Net; R. Talsorian Games' Cyberpunk 2020; the movies Blade Runner, Judge Dredd, and The Matrix series.","storyline":"Set in a dark gritty world in the year 2103, Sindome takes place in Withmore City, a geodesic dome city built in the wastelands of lower California. The face of the earth has been scarred by climate change and many great cities have been submerged due to the rising oceans. Sindome is all about playing a role in the struggle of the haves versus the have-nots. Characters fight for survival, carving out a niche in the underworld for themselves. \n \nFrom the Sindome website: \n \nThe corporations have grown larger than the countries they were once entities of, their wealth and power allowing them to build a refuge away from the chaos that has befallen the globe. Once invested in their failed salvation, a city was born out of their necessity to turn a profit. The blood, sweat and very lives of the first citizens a testament to the inequality that has existed since its birth, the city teems with the overflowing masses of corporate drones and ramshackle destitute. With the law empowering its patrolmen to be judge, jury and executioner, the haves have a distinct advantage over the population that is forbidden from owning fire-arms themselves.","popularity":1,"games":[55038,36950,1877,25300,18290,36929,25311,107169,17130,90099],"tags":[18,268435468,536871015,536871882,536871938,536872758,536873308,1073741829],"developers":[17145],"publishers":[17145],"category":0,"player_perspectives":[5],"game_modes":[2],"keywords":[103,970,1026,1846,2396],"themes":[18],"genres":[12],"first_release_date":883526400000,"platforms":[82],"release_dates":[{"category":2,"platform":82,"date":883526400000,"human":"1997","y":1997,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rvj.jpg","cloudinary_id":"sc5rvj","width":1263,"height":664},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rvi.jpg","cloudinary_id":"sc5rvi","width":1280,"height":662},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rvh.jpg","cloudinary_id":"sc5rvh","width":1280,"height":609}],"videos":[{"name":"Gameplay video","video_id":"OYdr7ZQd96c"},{"name":"Gameplay video","video_id":"PsAqbvRDP1E"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1iar.jpg","cloudinary_id":"co1iar","width":546,"height":198},"websites":[{"category":4,"url":"https:\/\/www.facebook.com\/sindome.org"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Sindome"},{"category":1,"url":"https:\/\/www.sindome.org\/"}]}