{"id":11412,"name":"Baseball","slug":"baseball--3","url":"https:\/\/www.igdb.com\/games\/baseball--3","created_at":1438090064711,"updated_at":1515839876546,"summary":"Baseball is a baseball sports game that was created on a PDP-10 mainframe computer at Pomona College in 1971 by student Don Daglow. The game (actually spelled BASBAL due to the 6-character file name length restrictions) continued to be enhanced periodically through 1976. The program is documented at the Baseball Hall of Fame in Cooperstown, New York. It was the first interactive Baseball simulation game, allowing players to manage the game as it unfolded.\n\nAt the start of each inning the batter's and pitcher's names were listed, and the player in the field could enter a number to choose whether to pitch to the batter, walk him intentionally, warm up a reliever or change the pitcher. In a later version the options for a pitchout and for a visit to the mound were added. The player controlling the batter could choose to put in a pinch hitter. If runners were on base the player could direct them to try to steal. Once the players had entered the desired orders, the game would print out the result of the at-bat, update the number of outs, the score and the location of the runners, and print the name of the next batter. If a game was still a tie after nine innings, extra innings would be played in accordance with baseball rules.","collection":5247,"popularity":1.333333333333333,"games":[22690,15851,36608,11253,34919,55715,78789,73330,62323,43992],"tags":[1,268435470,536870932,536872078,536875570],"category":0,"keywords":[20,1166,4658],"themes":[1],"genres":[14],"first_release_date":62985600000,"platforms":[96],"release_dates":[{"category":2,"platform":96,"date":62985600000,"region":2,"human":"1971","y":1971,"m":12}],"alternative_names":[{"name":"BASBAL","comment":"Acronym"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/exmhfr9tms7ihnm3ufsl.jpg","cloudinary_id":"exmhfr9tms7ihnm3ufsl","width":185,"height":267}}