{"id":11508,"name":"Lemonade Stand","slug":"lemonade-stand","url":"https:\/\/www.igdb.com\/games\/lemonade-stand","created_at":1438527048601,"updated_at":1517270917100,"summary":"Lemonade Stand is a business simulation game created in 1973 by Bob Jamison of the Minnesota Educational Computing Consortium. Charlie Kellner ported the game to the Apple II platform in February 1979. Throughout the 1980s Apple Computer included Lemonade Stand (along with other software) with the purchase of their systems. \n \nThe game simulates a child's lemonade stand, where choices made by the player regarding prices, advertising, etc. will determine the success or failure of the enterprise. The game owed its success to offering just enough variables to make a complex challenge for users, but still providing a simply-grasped addictive introduction to the offsetting priorities facing a business. The choice of the right prices and quantities on the day of a heat-wave could instill the satisfaction unique to a greatly profitable private enterprise. \n \nThe player is first given a weather report for the day (sunny, cloudy or hot and dry, each accompanied by a color drawing) and is prompted for three values: the number of glasses of lemonade to make, the number of advertising signs, and the cost of lemonade per glass. The program then gives a report of the earnings for that day. A thunderstorm, sometimes occurring on cloudy days and accompanied by a color animation, will void any profits and cause the player to lose any investment for the day. The game can be played either single-player or with up to 30 players (each player is independent and the sales of one do not affect another). The Apple II version included music, with bars from \"Morning Mood,\" \"Singin' in the Rain,\" \"Raindrops Keep Fallin' on My Head,\" and \"Summertime\" played at appropriate moments.","popularity":1.666666666666667,"games":[29173,11679,55590,55689,44242,18623,40470,22470,19847,44076],"tags":[28,34,35,268435469,536871291,536871446,536871906,536872060,536872761,536872770,536872772,536876673,536880383,1073741829],"developers":[1087],"publishers":[1087],"category":0,"player_perspectives":[5],"game_modes":[1,2],"keywords":[379,534,994,1148,1849,1858,1860,5761,9471],"themes":[28,34,35],"genres":[13],"first_release_date":126144000000,"platforms":[112,75],"release_dates":[{"category":1,"platform":75,"date":286675200000,"region":2,"human":"1979-Feb","y":1979,"m":2},{"category":2,"platform":112,"date":126144000000,"region":2,"human":"1973","y":1973,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tnlde1y4vkxt1gllokkm.jpg","cloudinary_id":"tnlde1y4vkxt1gllokkm","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d4zqr5tst8cxqj3ish0m.jpg","cloudinary_id":"d4zqr5tst8cxqj3ish0m","width":640,"height":400}],"videos":[{"name":"Gameplay video","video_id":"ME5fHbMl23M"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s7bwhzujiyegpbpmkut5.jpg","cloudinary_id":"s7bwhzujiyegpbpmkut5","width":280,"height":192},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Lemonade_Stand"}]}