{"id":11786,"name":"The Devil Inside","slug":"the-devil-inside","url":"https:\/\/www.igdb.com\/games\/the-devil-inside","created_at":1440522784846,"updated_at":1547537000998,"summary":"The Devil Inside is a horror-themed third-person shooter video game developed by Gamesquad and published by Cryo Interactive for the PC Windows in 2000.\n\n\nGAMEPLAY:\nThe Devil Inside is presented as a reality television game show documenting the supernatural exploits of the protagonist Dave and his titular alter ego, a succubus named Deva. The player can transform between Dave and Deva by activating pentagrams located at certain places throughout the game's levels. During gameplay, Dave\/Deva is followed by a small flying camera as well as a cameraman, and the player can switch between the two camera views as desired. Occasionally, a news helicopter will also be present and scripted cutscenes will be viewed from an aerial perspective.\n\nThe pacing, exploration, and puzzle factor of the game is similar to that of other survival horror titles. As Dave, the player has access to a variety of guns, which are equipped with laser sights to assist the player in aiming. As Deva, the player uses spells to attack enemies. Spells do not require ammunition, but do deplete mana that regenerates slowly. Some enemies generate souls when killed, and Deva can inhale souls to replenish her mana. Deva also has the ability to fly and regenerate health when standing in fire. The game uses a checkpoint save system represented by television sets found in-game.\n\n\nDEVELOPMENT:\nThe game's script was written by Hubert Chardot, better known for his work in the Alone in the Dark series. Its theme is similar to The Running Man, written by Stephen King, whose name is mentioned early in the game.\n\n\nRECEPTION:\nGameSpot's Greg Kasavin awarded the game a 6.8 out of 10, citing difficulties with the control scheme. In regards to the game's action sequences, Kasavin opined that \"some of the battles are scripted very well. But other times, the combat is poor.\" The environments of the game were praised for their realism and atmosphere, while character models and sound effects were rated as plain. Overall, the game was described as competent but lacking polish. PC Gamer US gave the game a score of 79% in their January 2001 issue. The review praised the animations, camera angles, the use of a dual character, and the game's low learning curve. However, the review cited \"poor polygonal figures and texturing\", and some environmental bugs as the low points of the game.\n\nIn Poland, it was one of the first of the series of cheap premiere releases in the ExtraGra magazine. Shortly after the game's release, one of Poland's most popular TV stations, TVN aired a report on the game, accusing the distributor, CD Projekt of selling satanic games in commonly accessible kiosks. The epilepsy warning, which by the time was already common among video games released in Poland and almost omnipresent in Europe, was used as an example of the game's exceptionally negative impact on young people.","rating":79.7297578840581,"popularity":1.333333333333333,"aggregated_rating":70,"aggregated_rating_count":1,"total_rating":74.86487894202905,"total_rating_count":5,"rating_count":4,"games":[26658,19686,26192,7291,51524,37016,7631,13210,103020,37777],"tags":[1,19,21,268435461,536870984,536870991,536871085,536871684,536872017,536872032,536872745,536872746,536872747,536872748,536872749,536872750,536875057,536875437,536876332,536877282,1073741826],"developers":[6315],"publishers":[267,139,234],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[72,79,173,772,1105,1120,1833,1834,1835,1836,1837,1838,4145,4525,5420,6370],"themes":[1,19,21],"genres":[5],"first_release_date":951868800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":974937600000,"region":5,"human":"2000-Nov-23","y":2000,"m":11},{"category":1,"platform":6,"date":951868800000,"region":1,"human":"2000-Mar","y":2000,"m":3},{"category":0,"platform":6,"date":972950400000,"region":2,"human":"2000-Oct-31","y":2000,"m":10}],"alternative_names":[{"name":"Дьявол Шоу","comment":"Russian spelling"},{"name":"心魔","comment":"Chinese spelling (Simplified)"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jj16vdq3isuokceciier.jpg","cloudinary_id":"jj16vdq3isuokceciier","width":1280,"height":960},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wk1ohivnyl8ywq1tusmv.jpg","cloudinary_id":"wk1ohivnyl8ywq1tusmv","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uwsn5w4m2cpmbgcbxq98.jpg","cloudinary_id":"uwsn5w4m2cpmbgcbxq98","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/phk7i0ngbzhiyt5aoqsk.jpg","cloudinary_id":"phk7i0ngbzhiyt5aoqsk","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bnyv7xovl9ma88ohy43o.jpg","cloudinary_id":"bnyv7xovl9ma88ohy43o","width":1024,"height":594}],"videos":[{"name":"Gameplay video","video_id":"7mvDyQvtyl0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fxqzxu74dynhtx3ijuec.jpg","cloudinary_id":"fxqzxu74dynhtx3ijuec","width":449,"height":500},"esrb":{"rating":6},"pegi":{"rating":4}}