{"id":14630,"name":"Cribbage King & Gin King","slug":"cribbage-king-and-gin-king","url":"https:\/\/www.igdb.com\/games\/cribbage-king-and-gin-king","created_at":1448101509288,"updated_at":1540325870890,"summary":"Play Cribbage like a King! First played by Kings and Queens in the 1600's, Cribbage is one of the world's oldest and most popular card games. Now, the creators of the award-winning Chessmaster 2100 and Mavis Beacon Teaches Typing bring you the challenge and mastery of Cribbage in... Cribbage King.\n\nWhether you're already a Cribbage master or just beginning, Cribbage King is the game for you. With Cribbage King, you'll play against the strongest computerized Cribbage engine in the world. Seven Artificial Intelligence computer personalities- each with his or her own unique playing style- await you. You can even ask them for hints! (Receive answers in easy, conversational English.) Cribbage King has gorgeous, full-color, high-resolution graphics. Special Bicycle card designs are also included! Easy-to-use, menu-driven features and context-sensitive help create a game fit for a King.\n\nPlay Gin like a Master! Gin King will astound you. Gin King brings you the fascination of playing one of the world's most popular card games: challenging play, great graphics and a real sense of fun.\n\nGin King's brilliance comes from the Artificial Intelligence labs that created the best-selling Chessmaster 2100 and Mavis Beacon Teaches Typing. Powered by the most advanced algorithms available, Gin King employs modern play techniques and sophisticated probability analysis. Adding to the sense of realism are stunning full-color, high-resolution graphics incorporating traditional Bicycle card designs. Gin King even lets you choose your opponents from seven computer personalities. They can play against you or give you hints (based on their different strengths and weaknesses!). Context-sensitive help and easy-to-use, menu-driven features satisfy the most demanding Gin enthusiast. With Gin King, you get the royal treatment!","popularity":1.333333333333333,"games":[55036,77597,32510,17613,33552,29173,9472,36553,30457,55590],"tags":[268435471,536871158,536874694,1073741825],"publishers":[2393],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[246,3782],"genres":[15],"first_release_date":631065600000,"platforms":[13,16],"release_dates":[{"category":2,"platform":13,"date":631065600000,"human":"1989","y":1989,"m":12},{"category":2,"platform":16,"date":662601600000,"human":"1990","y":1990,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uj9uscqaxwt1r1t8d94b.jpg","cloudinary_id":"uj9uscqaxwt1r1t8d94b","width":640,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zbq4abtouxjhq8yr8czi.jpg","cloudinary_id":"zbq4abtouxjhq8yr8czi","width":640,"height":512}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oeznly0u0ci00uyn8rlq.jpg","cloudinary_id":"oeznly0u0ci00uyn8rlq","width":630,"height":892}}