{"id":20622,"name":"Resident Evil: Code Veronica X HD","slug":"resident-evil-code-veronica-x-hd","url":"https:\/\/www.igdb.com\/games\/resident-evil-code-veronica-x-hd","created_at":1468847419833,"updated_at":1534376332870,"summary":"Resident Evil CODE: Veronica (BIOHAZARD CODE: Veronica in Japan) is the fourth game in Capcom's Resident Evil survival horror series originally released for the Sega Dreamcast in 2000. The game takes place on December 27, 1998, three months after the events of Resident Evil 2 and Resident Evil 3: Nemesis. It is the first Resident Evil game made for a sixth generation console and the first game to use full polygonal environments instead of the static, pre-rendered backgrounds that characterized the previous installments. \n \nSource: http:\/\/residentevil.wikia.com\/wiki\/Resident_Evil_CODE:Veronica","storyline":"It has been three months since the total destruction of Raccoon City, and Claire Redfield is still searching for her missing brother, Chris. Claire's search takes her to an Umbrella owned facility in Paris where she is discovered and met with fierce resistance. Claire attempts an impressive escape from the clutches of the hired soldiers, but it proves to be just not enough. \n \nShe is captured by Rodrigo Juan Raval, an Umbrella military commander and is shipped to the remote Rockfort Island facility. Claire finds herself interrogated and then imprisoned. She is knocked unconscious by a guard and hours later she awakens to the sound of explosions. \n \nFacing imminent death, Claire receives opportunity once more when an inexplicable air raid on the island wipes out most of the island inhabitants and damages the majority of its structures. Unfortunately, the air raid also causes the accidental release of t-virus samples and B.O.W.s, which spread quickly and wipe out the remaining survivors. \n \nClaire has thrust back into the world of survival horror once again, with the odds seemingly stacked against her. Claire finds support in fellow inmate Steve Burnside but encounters untold hardships when the insane island commander, Alfred Ashford, and his equally evil twin sister, Alexia Ashford, set their sights on causing the end of the duo in their own sick, twisted, and demented games. \n \nClaire and Steve managed to escape the island, only to have been forcibly directed to Antarctica. When attempting to escape the Antarctic Umbrella base, Steve manages to mortally wound Alfred while Claire successfully dispatches a mutated Alexander Ashford. As Claire and Steve attempt to leave for an Australian research outpost in a snowmobile, Claire and Steve get attacked by tentacles deployed by a revived Alexia. \n \nMeanwhile, Chris Redfield has been in hiding with the surviving S.T.A.R.S. members following their harrowing survival story at the Spencer Mansion in Raccoon City. When the word from Leon S. Kennedy reaches him that his sister Claire has been captured by Umbrella, he races against time to reach Rockford and rescue her from danger. However, what Chris discovers on the island is something he never expected - a man from his past who should, by all rights, be dead - his former Captain, Albert Wesker. \n \nWesker has his own agenda that he is relentlessly executing - he is working for a new enemy, pursuing an unknown interest. As Chris soon finds out, this is not the Wesker he remembers, as Wesker possessed super-human speed and strength. Chris learns from Wesker that Claire was already in Antarctica and attempts to rescue her. \n \nChris gets reunited with Claire, with the pair attempting to rescue Steve, only to get separated again. Claire manages to reach Steve, only for him to die a heroic death after saving her from a tentacle. Chris, on the other hand, gets into a skirmish with Alexia and arms the self-destruct system to regroup with Claire. Chris successfully kills Alexia with a prototype weapon and successfully evacuates the base with Claire. \n \nSource: http:\/\/residentevil.wikia.com\/wiki\/Resident_Evil_CODE:Veronica\/plot","collection":83,"franchise":29,"franchises":[29],"rating":85,"popularity":1.333333333333333,"aggregated_rating":69.6,"aggregated_rating_count":7,"total_rating":77.3,"total_rating_count":7,"rating_count":0,"version_parent":968,"version_title":"X HD","games":[29525,25646,68287,37777,37016,51524,36950,26192,105269,25300],"tags":[1,18,19,20,21,43,268435461,268435465,268435487,536872571,536887610,536887611,536892461,536892462,1073741826],"developers":[11900],"publishers":[11900],"game_engines":[537],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[1659,16698,16699,21549,21550],"themes":[1,18,19,20,21,43],"genres":[5,9,31],"first_release_date":1317081600000,"platforms":[9,12],"release_dates":[{"category":0,"platform":9,"date":1317081600000,"region":8,"human":"2011-Sep-27","y":2011,"m":9},{"category":0,"platform":12,"date":1317081600000,"region":8,"human":"2011-Sep-27","y":2011,"m":9}],"alternative_names":[{"name":"BIOHAZARD CODE: Veronica","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d4ounqabegfubaz2nivf.jpg","cloudinary_id":"d4ounqabegfubaz2nivf","width":655,"height":385}],"videos":[{"name":"Cutscenes","video_id":"Qk6q0FXhe2s"},{"name":"Game intro","video_id":"6ofRM_v6X94"},{"name":"Trailer","video_id":"YRz9rpVR1hU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xulslhjw6yyovhlkigtg.jpg","cloudinary_id":"xulslhjw6yyovhlkigtg","width":557,"height":800},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Resident_Evil_%E2%80%93_Code:_Veronica"},{"category":2,"url":"http:\/\/residentevil.wikia.com\/wiki\/Resident_Evil_CODE:Veronica"}]}