{"id":23888,"name":"It's TIME","slug":"its-time","url":"https:\/\/www.igdb.com\/games\/its-time","created_at":1473702759733,"updated_at":1473710388598,"summary":"Just so there’s no temporal confusion, “It’s Time” is a classic point and click adventure game, that focuses on Time Travel. As the lead operative in a shadowy government organization, you’ll be travelling back in time completing different missions and objectives. Every mission is unique, and you could be doing anything from analyzing an event, to actually messing around with them and changing the past!","storyline":"Just so there’s no temporal confusion, “It’s TIME” is a classic point and click adventure game, that focuses on Time Travel. As you are the lead operative in a shadowy government organization, you’ll be travelling back in time completing different missions and objectives. Every mission is unique, and you could be doing anything from analyzing an event, to actually messing around with them and changing the past! (WOO HOO, Lottery number here I come!) \n\nAs any time travel game worth its flux capacitor, the things you change in the past, will undoubtedly mess with the present, and you can never really be sure how it’s going to work out for you. Nothing is ever that simple, and it is in that which we build our story! \n\nSo who are you? \nLead operative - has specifically been chosen for this job, you might even say you were ‘born for it’. From the moment the kind hearted genius Mr. Greenvill adopted you, you’ve been groomed for this position. You are completely untraceable, you’re basically a ghost, who better to send back and forth in time after all, than someone who could be over looked. \n\nWhat do we have for you? \nWe’ve used a low poly art style for the game along with appropriately captivating colors. The UI will also be built around the same low poly style. It’s time travel after all, let’s have some nostalgia! Please note the videos and images are current, a work in progress and not representative of the final product. Entirely isometric view for the game play but we switch it up with dynamic camera angles to keep things interesting during our cinematic sequences before every mission. \n\nAs mentioned before, that the game play is mission based and the story runs in a linear frame, there is however lots to explore in and out of missions. During the missions, you will be exploring the given scenario; you’ll be interacting with people in the past, as well as occasionally using stealth to avoid situations, all to achieve your objectives. We figure it will run around 2-4 hours of game play, in addition to three extra ‘present’ missions which draw you further into the It’s TIME story, as you feel and experience your work in the past, reflected. \n\nThe “It’s TIME” Team \nWe’re a bunch of passionate geeks; coders, designers, artists, musicians and overly talkative voice actors. Our studio setup is based out of India, but many of us come from around the globe, all to make our first big hit! We’ve been working on the story, game play prototype and mission concepts for what seem like ages now, and we’re ready to hit the ground running as soon as our crowd funding campaign comes to a close, we just want to bring you along for the ride too!. \n\nRelease \nInitial plans are for PC, Mac, Linux and Steam (if we are lucky enough to get your support for greenlight). We also have plans for Android and IOS in the future. Release date will be around 1 year from the campaign. \n\nBefore we go… \nAs one last note we’d like to leave for you; if there is anything you think you’d like to suggest or even change in our vision for “It’s TIME”, please feel free to leave us a comment here, or visit our website to do the same. This is why we’re asking you, we want you to be happy with what we create together. If you like what you see above kindly support us on steam and also back us on the campaign to get this game professionally done. Now is the time to make this idea a reality, and we can only do it with your help, so don’t hesitate to contact us; because It’s TIME!","popularity":1.333333333333333,"tags":[1073741826],"game_engines":[13,385],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[117,481,503,1027,1141,1158,1416,2579,2580,2751,2752],"themes":[18,20,22,23,31,43],"genres":[2,9,31],"first_release_date":1517356800000,"status":4,"pulse_count":2,"platforms":[6,92,14,3],"release_dates":[{"category":0,"platform":6,"date":1517356800000,"region":8,"human":"2018-Jan-31","y":2018,"m":1},{"category":0,"platform":14,"date":1517356800000,"region":8,"human":"2018-Jan-31","y":2018,"m":1},{"category":0,"platform":3,"date":1517356800000,"region":8,"human":"2018-Jan-31","y":2018,"m":1},{"category":0,"platform":92,"date":1517356800000,"region":8,"human":"2018-Jan-31","y":2018,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eayuwaddnn7anww2lwze.jpg","cloudinary_id":"eayuwaddnn7anww2lwze","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/grka7l0laa3cmfseni7t.jpg","cloudinary_id":"grka7l0laa3cmfseni7t","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/onyzpzjkphbcuwxrqowr.jpg","cloudinary_id":"onyzpzjkphbcuwxrqowr","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/banc8gtqeog0rr7meopo.jpg","cloudinary_id":"banc8gtqeog0rr7meopo","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zpil2byirnd3dcx4zwck.jpg","cloudinary_id":"zpil2byirnd3dcx4zwck","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"qeC1ndJYdMw"},{"name":"Game intro","video_id":"feA2wObD5io"},{"name":"Gameplay video","video_id":"PftxcfnHAFE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uzd2c6jtk5klggto6d9g.jpg","cloudinary_id":"uzd2c6jtk5klggto6d9g","width":1024,"height":1024},"esrb":{"rating":3},"pegi":{"rating":2},"websites":[{"category":1,"url":"http:\/\/www.yellowstargames.com\/"}]}