{"id":27030,"name":"The Elder Scrolls Online: Morrowind","slug":"the-elder-scrolls-online-morrowind","url":"https:\/\/www.igdb.com\/games\/the-elder-scrolls-online-morrowind","created_at":1485963270873,"updated_at":1547449354673,"summary":"The Elder Scrolls Online: Morrowind is the next Chapter of ZeniMax Online Studios’ award-winning online RPG, The Elder Scrolls Online (ESO). This new adventure will return Elder Scrolls fans to the legendary island of Vvardenfell, the same iconic environment featured in Bethesda Game Studios’ genre-defining open world RPG, The Elder Scrolls III: Morrowind. \n \nIntroducing an enormous new zone, a new player class, more than 30 hours of main story content, a new Trial, and a new three-team, 4v4v4 PvP mode, The Elder Scrolls Online: Morrowind will be the biggest addition to The Elder Scrolls Online yet, offering a new adventure for ESO veterans as well as a fresh Elder Scrolls saga for players new to the game. \n \nReturn to Morrowind: Vvardenfell is the largest zone added to The Elder Scrolls Online since launch and utilizes the same geographic footprint as The Elder Scrolls III, including all key points of interest from the classic game. Players will embark on a dangerous journey through legendary locales in Vvardenfell, 700 years before the events of The Elder Scrolls III, from the docks of Seyda Neen, to the volcanic Ashlands, to dense, mushroom-filled forests, and through the glory of Vivec City, still under construction in this time period. \n \nNew Class – The Warden: Players will harness nature-based magic to master the powerful new character class - The Warden. The Warden is the first new class since launch of ESO, and true to ESO and the Elder Scrolls franchise, the player will have the freedom to select from a number of abilities that enable a variety of play styles. The Warden also introduces a devastating new combat ally – the War Bear – a ferocious fighter will stay by the Warden’s side through the most intense battles. \n \nNew PvP Mode -- Battlegrounds: The Elder Scrolls Online is renowned for open world PvP battles, pitting hundreds of players in a massive battle for supremacy in Cyrodiil. The Elder Scrolls Online: Morrowind will introduce a new PvP mode – Battlegrounds – intense 4v4v4 battles in arena-like environments. Players take the battle to the Ashlands to claim their place among the fiercest and most accomplished combat veterans in Tamriel.","storyline":"An Incredible Elder Scrolls Story: Set roughly 700 years prior to the events of The Elder Scrolls III, The Elder Scrolls Online: Morrowind will take gamers on a sweeping adventure through the legendary Vvardenfell, featuring iconic locations, characters, and storylines that will instill nostalgia with longtime Elder Scrolls fans and extend ESO’s narrative into a new chapter. Morrowind is in dire peril and it’s up to player heroes to help Vivec, the legendary warrior-poet and Guardian of Vvardenfell, solve the mystery of his mysterious illness, regain his strength – and save the world from ultimate destruction.","collection":6,"franchise":456,"franchises":[456],"rating":80,"popularity":2.666666666666667,"aggregated_rating":77.375,"aggregated_rating_count":11,"total_rating":78.6875,"total_rating_count":15,"rating_count":4,"game":1081,"games":[81249,26163,19698,103303,47823,54842,17001,54775,90099,28168],"tags":[17,38,268435468,536871812,536875269,536887738,536887740,536887806,536888166,536888471,536888912,536888913,536888914,536888915,1073741826,1073741825],"developers":[851],"publishers":[28],"category":2,"player_perspectives":[1,2],"game_modes":[2,3,5],"keywords":[900,4357,16826,16828,16894,17254,17559,18000,18001,18002,18003],"themes":[17,38],"genres":[12],"first_release_date":1496707200000,"pulse_count":40,"platforms":[6,14,48,49],"release_dates":[{"category":0,"platform":49,"date":1496707200000,"region":2,"human":"2017-Jun-06","y":2017,"m":6},{"category":0,"platform":48,"date":1496707200000,"region":1,"human":"2017-Jun-06","y":2017,"m":6},{"category":0,"platform":48,"date":1496707200000,"region":2,"human":"2017-Jun-06","y":2017,"m":6},{"category":0,"platform":48,"date":1496707200000,"region":8,"human":"2017-Jun-06","y":2017,"m":6},{"category":0,"platform":49,"date":1496707200000,"region":8,"human":"2017-Jun-06","y":2017,"m":6},{"category":0,"platform":14,"date":1496707200000,"region":8,"human":"2017-Jun-06","y":2017,"m":6},{"category":0,"platform":6,"date":1496707200000,"region":8,"human":"2017-Jun-06","y":2017,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gadln2pzpiarmwzg2vgj.jpg","cloudinary_id":"gadln2pzpiarmwzg2vgj","width":2880,"height":1620},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ytlvr1viv3cbm1mycomn.jpg","cloudinary_id":"ytlvr1viv3cbm1mycomn","width":1920,"height":1090},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zhg6clrphbnjxgeyyrfk.jpg","cloudinary_id":"zhg6clrphbnjxgeyyrfk","width":1920,"height":1090},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ptvdltri2e99vkijm38x.jpg","cloudinary_id":"ptvdltri2e99vkijm38x","width":2880,"height":1620},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ymx6uljzzsh3qqjzf0x7.jpg","cloudinary_id":"ymx6uljzzsh3qqjzf0x7","width":1800,"height":1012}],"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kgg3c5aflzkv55oncsnt.jpg","cloudinary_id":"kgg3c5aflzkv55oncsnt","width":1280,"height":543},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ylumkl8jmr7y87tysgh6.jpg","cloudinary_id":"ylumkl8jmr7y87tysgh6","width":5414,"height":2579},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t6os6gth6jrr8klhasgj.jpg","cloudinary_id":"t6os6gth6jrr8klhasgj","width":1280,"height":619},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bsjogu4faa4j6ixf7geu.jpg","cloudinary_id":"bsjogu4faa4j6ixf7geu","width":1280,"height":656},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u1fgjc4kiwxxyonsddrb.jpg","cloudinary_id":"u1fgjc4kiwxxyonsddrb","width":5218,"height":2427}],"videos":[{"name":"Trailer","video_id":"HVdzUBwA4-k"},{"name":"A New Chapter in Vvardenfell Trailer","video_id":"9TQmDkSuYvc"},{"name":"Warden Gameplay Trailer","video_id":"7Rsqrj36y9k"},{"name":"Announcement Trailer","video_id":"oIzMxktF27Q"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/szmc0iucjhwegyy45nu2.jpg","cloudinary_id":"szmc0iucjhwegyy45nu2","width":1513,"height":2147},"esrb":{"synopsis":"This is a multiplayer online role-playing game in which players assume the role of a warrior in the fantastical world of Morrowind. As players explore open-world environments, they can perform quests and complete various tasks. Characters use swords, axes, maces, and magic attacks (e.g., lightning, fire attacks) to kill human-like and fantastical enemies (e.g., orcs, demons, giant insects, robots). Players engage in melee-style combat, hacking and slashing at enemies; battles are highlighted by cries of pain, impact sounds, and large splashes of blood. Some quests prompt players to assassinate specific characters or creatures; one quest requires players to mount severed creatures' heads onto pikes. Some game environments depict piles of corpses or skeletons hanging from torture devices. Text descriptions or dialogue sometimes contain references to sexual material (e.g., “She...raped the men as cruelly as Bal had ravished her”; “Sex with attractive Nedes was considered casual recreation...”; “[T]here have been instances of intercourse between these 'races,' generally in the nature of rape or magical seduction...”). During the course of the game, alcohol (i.e., wine, mead, ale) can be purchased and consumed by the player's character; one sequence\/mission prompts players to engage in a drinking contest that results in the character's blurred vision and slurred speech.","rating":6},"external":{"steam":"582880"},"multiplayer_modes":[{"platform":49,"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":0,"onlinecoopmax":0,"onlinemax":200,"offlinemax":0}]}