{"id":2896,"name":"Crackdown","slug":"crackdown","url":"https:\/\/www.igdb.com\/games\/crackdown","created_at":1375473590343,"updated_at":1547448195995,"summary":"Crackdown is an open world, third-person shooter video game for the Xbox 360. Set in the fictional Pacific City, the player controls a biologically enhanced Agent, tasked with defeating three crime lords and their organized crime syndicates. The Agent's abilities improve by defeating both crime lords and their supporters, as well as by completing optional activities, such as street races and scavenger hunts. The gameplay is nonlinear: instead of following a rigid mission sequence, players are free to select the approach to completing their missions and activities. The game features a two-player cooperative play mode via Xbox Live. \nCrackdown, initially planned for release on the original Xbox console, was envisioned as a vast world in which players could experiment and explore freely. Microsoft Game Studios bundled specifically marked copies of Crackdown with an access code to the multiplayer test version of the much-anticipated Halo 3 Beta. The game sold 1.5 million copies in its first six months of release because everybody wanted to play Halo 3. It received positive reviews and has garnered several awards for its innovative gameplay. Crackdown was a free download (for Xbox Live Gold members only) from August 1st, 2013 to August 16th, 2013 as part of the Xbox 360 \"Games With Gold\" (Xbox Live) program.","storyline":"Crackdown takes place in the fictional metropolis of Pacific City, whose several districts and areas are divided among four islands. The city is controlled by three crime organizations: Los Muertos (which means \"the dead\" in Spanish), of Central American origin; an Eastern European gang, the Volk (Russian for Wolf) ; and the formerly above-board Shai-Gen Corporation, from East Asia. Normally, a police-like organization called the Peacekeepers kept the city under control; their forces, however, were overwhelmed by the sudden rise in crime. The city, therefore, sought additional help from \"the Agency\", an organization that, in addition to outfitting and supporting Peacekeepers, has used advanced surgical and cybernetic technology to create supersoldiers known as \"Agents\". The Agency is based out of a former hotel in the very centre of the city. The player takes on the role of one of their Agents, and is tasked with systematically bringing down all three organized gangs, while keeping both the populace and Peacekeepers safe. The Agent's actions are continuously monitored by the Agency, and its Director (voiced by Michael McConnohie) provides continuous reports to him of his progress. \nThroughout the game, the player roams Pacific City, systematically eliminating the leaders and subordinates of the three gangs. Upon defeating the gangs' Kingpins and generals, the Agent must put down a final riot by the remaining gang members in the area which after completion will cause that city to be almost crime free.","collection":995,"rating":70.1717406083718,"popularity":2.333333333333333,"aggregated_rating":85,"aggregated_rating_count":4,"total_rating":77.5858703041859,"total_rating_count":34,"rating_count":30,"games":[55038,36950,18290,25300,80916,47823,25311,16611,103020,90099],"tags":[1,18,33,268435461,268435468,268435487,536871882,536871945,536872315,536875610,536875819,536875910,536875937,536876563,536877032,536887323,1073741826],"developers":[733],"publishers":[53],"game_engines":[41,17,42],"category":0,"time_to_beat":{"completely":108000},"player_perspectives":[2],"game_modes":[1,3],"keywords":[970,1033,1403,4698,4907,4998,5025,5651,6120,16411],"themes":[1,18,33],"genres":[5,12,31],"first_release_date":1171929600000,"pulse_count":13,"platforms":[12],"release_dates":[{"category":0,"platform":12,"date":1172188800000,"region":1,"human":"2007-Feb-23","y":2007,"m":2},{"category":0,"platform":12,"date":1172102400000,"region":3,"human":"2007-Feb-22","y":2007,"m":2},{"category":0,"platform":12,"date":1171929600000,"region":2,"human":"2007-Feb-20","y":2007,"m":2}],"alternative_names":[{"name":"Riot Act","comment":"Other"},{"name":"Crackdown"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hoyehdb2fnk8tz7vpies.jpg","cloudinary_id":"hoyehdb2fnk8tz7vpies","width":480,"height":270}],"videos":[{"name":"Trailer","video_id":"YBg0lOlSQpQ"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o0duhjrpusvaes3nvxl1.jpg","cloudinary_id":"o0duhjrpusvaes3nvxl1","width":256,"height":362},"esrb":{"synopsis":"","rating":6},"pegi":{"rating":5},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Crackdown"}],"multiplayer_modes":[{"platform":12,"offlinecoop":false,"onlinecoop":true,"lancoop":true,"campaigncoop":true,"splitscreenonline":false,"splitscreen":false,"dropin":true,"offlinecoopmax":0,"onlinecoopmax":2,"onlinemax":0,"offlinemax":0}]}