{"id":40036,"name":"Galactic Warriors","slug":"galactic-warriors","url":"https:\/\/www.igdb.com\/games\/galactic-warriors","created_at":1498469104340,"updated_at":1515822582854,"summary":"The game is controlled with an 8-way joystick and three buttons: the attack button, the guard button, and the weapon selection button. There are six stages, each with different themes and environmental effects based on gravity. Some other features introduced in Galactic Warriors that were used in later fighting games include block damage, air-blocking, the ability to shoot\/throw projectiles, the ability to execute multiple attacks while airborne, a modern health bar (as opposed to a health meter with notches like in Capcom's Mega Man series that made their debut two years later), the ability to switch between armed and unarmed and attacks of varying levels of strength. \n \nAnother feature introduced at the time allows the player to choose one of three Mechas, each with their own movesets: Samson, Gaea and Poseidon. When one is selected, the player must use it to destroy other robots in each planet. Other than the playable characters, there are several non-playable characters and bosses with original designs and unique movesets. In the final battle, the player will face the same character he or she chose. After defeating the final opponent, the game goes back to the beginning and the player's chosen character and the opponents will have an extra weapon. \n \nUnlike in the single player modes of other fighting games, Galactic Warriors lacks continues and gives the player a number of lives similar to ones in some other genres from platform games to beat 'em ups. When the player loses all of his or her lives, the game is over and it returns to attract mode. In each battle, the timer starts at one minute and thirty seconds, and when it drops to zero before any player is knocked out, the player with the least amount of damage wins. Players can monitor this by looking at their life bars. At the start of the fight, both players life bars are blue, but as the fight progresses, the life bar changes to a pink color for the player with the least amount of health remaining or most damage taken. Therefore, if a player's life bar is pink when\/if time runs out, that player will lose.","popularity":1.333333333333333,"games":[68287,25300,36950,11253,71455,21063,27314,2558,19448,19099],"tags":[1,18,268435460,536870979,536870990,536871019,536871079,536871213,536871487,536871882,536871889,536874398,536875075,536875358,536876028,536876352,536876857,536877014],"category":0,"keywords":[67,78,107,167,301,575,970,977,3486,4163,4446,5116,5440,5945,6102],"themes":[1,18],"genres":[4],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j6etkqnsr5xolxr06ctj.jpg","cloudinary_id":"j6etkqnsr5xolxr06ctj","width":992,"height":703}}