{"id":56997,"name":"One Hour One Life","slug":"one-hour-one-life","url":"https:\/\/www.igdb.com\/games\/one-hour-one-life","created_at":1504541246527,"updated_at":1541933470598,"summary":"A multiplayer game which tackles parenting and civilization building. It is by Jason Rohrer and Tom Bailey.","storyline":"This game is about playing one small part in a much larger story. You only live an hour, but time and space in this game is infinite. You can only do so much in one lifetime, but the tech tree in this game will take hundreds of generations to fully explore. This game is also about family trees. Having a mother who takes care of you as a baby, and hopefully taking care of a baby yourself later in life. And your mother is another player. And your baby is another player. Building something to use in your lifetime, but inevitably realizing that, in the end, what you build is not for YOU, but for your children and all the countless others that will come after you. Proudly using your grandfather's ax, and then passing it on to your own grandchild as the end of your life nears. And looking at each life as a unique story. I was this kid born in this situation, but I eventually grew up. I built a bakery near the wheat fields. Over time, I watched my grandparents and parents grow old and die. I had some kids of my own along the way, but they are grown now... and look at my character now! She's an old woman. What a life passed by in this little hour of mine. After I die, this life will be over and gone forever. I can be born again, but I can never live this unique story again. Everything's changing. I'll be born as a different person in a different place and different time, with another unique story to experience in the next hour...","hypes":2,"rating":70,"popularity":2,"total_rating":70,"total_rating_count":0,"rating_count":0,"games":[26145,76397,103232,29348,43165,35994,25311,51991,22425,17548],"tags":[268435468,268435469,268435487,268435488,536870981,536871812,536872060,536872282,1073741828,1073741826],"developers":[7549],"publishers":[7549],"category":0,"player_perspectives":[2,4],"game_modes":[5],"keywords":[69,900,1148,1370],"genres":[12,13,31,32],"first_release_date":1519689600000,"pulse_count":7,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1519689600000,"region":8,"human":"2018-Feb-27","y":2018,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zzztzf6vwp5aunnzelka.jpg","cloudinary_id":"zzztzf6vwp5aunnzelka","width":712,"height":222}],"videos":[{"name":"Trailer","video_id":"mT4JktcVQuE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nufcmxgj0bxzpxpguers.jpg","cloudinary_id":"nufcmxgj0bxzpxpguers","width":448,"height":360},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/595690"},{"category":2,"url":"https:\/\/onehouronelife.gamepedia.com\/One_Hour_One_Life_Wiki"},{"category":1,"url":"http:\/\/onehouronelife.com\/"}],"external":{"steam":"595690"}}