{"id":64242,"name":"Big Air Wakeboarding","slug":"big-air-wakeboarding","url":"https:\/\/www.igdb.com\/games\/big-air-wakeboarding","created_at":1505161375855,"updated_at":1545396592433,"summary":"Big Air Wakeboarding is probably the first wakeboarding game for PC :) But WTF is wakeboarding? :) Well, wakeboarding is the watersport of the 1990's, and the fastest-growing board sport world-wide. Akin to snowboarding, the sports popularity is spreading like wildfire around the globe. Evolving from a combination of waterskiing, snowboarding, skating and surfing, wakeboarding is not only the world's fastest-growing water board sport but also the most accessible. It can be done on waterski lakes or on the sea. Riders are able to perform amazing BIG AIR tricks (Backwash, Bindings, Edge, Fakie etc), whilst being towed behind a boat, with the use of big boards and big wakes. The rider stands sideways on a shorter, wider board similar in concept to a snowboard. If you have no imagination, look at these shots from real wakeboarding (shot1, shot2, shot3). So now I think you have an idea kind of sport wakeboarding is, so back to the game. \nBig Air Wakeboarding features over eight distinct characters, hundreds of different mind-bending trick combos, multiple jumps and obstacles, real wakeboards from O'Brien, and Darin Shapiro - the 2000 X Games and Pro Wakeboard Tour Champion. In the game you can choose from Career, Competition and Quick Start. In Career mode you have to collect Gas cans, to improve your character over time.These Gas cans unlock new board graphics and improve on the quality of all boards. Gas can also unlock better boats with bigger wakes and more advanced tie-ins. In Competition you got three runs out in the open water to try and rack up the most points - any medal in a competition will unlock the next course. If you like skateboarding and snowboarding games, maybe this game could be quite interesting for you.","popularity":1.333333333333333,"games":[102805,15851,30830,81145,100359,81281,80865,80456,80412,79667],"tags":[268435470,536872078],"publishers":[1488],"category":0,"keywords":[1166],"genres":[14],"first_release_date":1007164800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1007164800000,"human":"2001-Dec-01","y":2001,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rrv.jpg","cloudinary_id":"sc5rrv","width":500,"height":375},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5rru.jpg","cloudinary_id":"sc5rru","width":500,"height":375}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ihttzw6jfynibmss6lcz.jpg","cloudinary_id":"ihttzw6jfynibmss6lcz","width":414,"height":500}}