{"id":66321,"name":"Suzumiya Haruhi no Tsuiso","slug":"suzumiya-haruhi-no-tsuiso","url":"https:\/\/www.igdb.com\/games\/suzumiya-haruhi-no-tsuiso","created_at":1505326104825,"updated_at":1515824383644,"summary":"The Reminiscences of Haruhi Suzumiya (涼宮ハルヒの追想, Suzumiya Haruhi no Tsuisō) is a “wandering adventure” game for the PlayStation 3 and PSP gaming consoles, published by Namco Bandai Games. The game shipped on May 12, 2011 as a tie-in to The Disappearance of Haruhi Suzumiya film, taking place shortly afterward in the parallel universe. \n \nThere were two limited-edition Nagato Yuki no Otoshimono (Nagato Yuki's Lost Property) Boxes — one for the PlayStation 3 version and another for the PSP version.","storyline":"After Kyon activated the emergency escape protocol, the Disappearance version of Nagato waited for Kyon's answer. A large error in the time plane prompted Asahina to summon Kyon to repair it. Kyon ended up in The Disappearance alternate world. None of the SOS Brigade, not even Nagato, knew who he was. He made friends with Haruhi by getting her to perform in a band, helped Koizumi and Asahina win \"beauty\" contests, and helped Nagato's book sale. \n \nAfterward, Kyon was able to return to the normal world, but decided to go back for a bit. He helped the alternate SOS Brigade make a movie. Then Kyon returned Nagato's Literature Club form with his name on it. The SOS Brigade (without him) would exist in the alternate world, preventing Nagato from being lonely. \n \nBack in his original world at the nabe party, Kyon asked Nagato to go to the library during the weekend. She said she would think about it. However, the visit became a Brigade event instead. There Kyon told Nagato about her alternate self, referring to the alternate as another girl. Nagato said she was sure the other person was happy, because \"she lives right there, in your memory\".","collection":4464,"franchise":1147,"franchises":[1147],"popularity":1.333333333333333,"games":[55803,29730,13189,25222,22482,41895,22425,11423,22490,11296],"tags":[268435487,536870990,536871939,536875054,536875157,536875243,536877236],"developers":[6330],"publishers":[6330],"category":0,"keywords":[78,1027,4142,4245,4331,6324],"genres":[31],"first_release_date":1305158400000,"platforms":[9,38],"release_dates":[{"category":0,"platform":38,"date":1305158400000,"region":5,"human":"2011-May-12","y":2011,"m":5},{"category":0,"platform":9,"date":1305158400000,"region":5,"human":"2011-May-12","y":2011,"m":5}],"alternative_names":[{"name":"The Reminiscence of Haruhi Suzumiya","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/z8pfomtpvymbtkuq7pjk.jpg","cloudinary_id":"z8pfomtpvymbtkuq7pjk","width":1500,"height":846},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cfoest3oxhp89yrklytv.jpg","cloudinary_id":"cfoest3oxhp89yrklytv","width":1500,"height":846}],"videos":[{"name":"Trailer","video_id":"4zobNHUlT6M"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mhvqexa0a9w1czfhyfc9.jpg","cloudinary_id":"mhvqexa0a9w1czfhyfc9","width":1291,"height":1500}}