{"id":7324,"name":"NHL 15","slug":"nhl-15","url":"https:\/\/www.igdb.com\/games\/nhl-15","created_at":1402348404840,"updated_at":1534371882840,"summary":"12 PLAYER NHL COLLISION PHYSICS \nFor the first time in any sports game, real-world physics affects every player through every on-ice collision with the new 12 Player NHL ® Collision Physics. Utilizing the power of the next generation consoles, and building off the critically-acclaimed NHL Collision Physics system, every player on the ice is governed by physics at all times. Feel the hard-hitting chaos of NHL hockey through true-to-life secondary collisions, net scrambles and player pileups, capturing the desperation of every shift. \n \nREAL PUCK PHYSICS \nThe puck is one of the most complex items in the game to authentically replicate and it finally gets its due in NHL 15. Completely rebuilt puck physics result in a more realistic feel to every puck interaction. Everything on the ice, including the ice surface itself, is live which leads to the unpredictable and authentic puck spins, rolls and bounces seen in a real NHL game. \n \nAUTHENTIC PLAYER & EQUIPMENT MODELS \nThe Next Generation Hockey Player has been rebuilt from the ice up. Now player models have three distinct layers - the body, equipment, and jersey. Each layer interacts independently, making every contact with the puck or other players even more realistic. Dynamic Cloth technology adds an extra layer of realism as it reacts to the player’s movement as they explode up the ice, helping bring the speed of the game to life. \n \nUNPRECEDENTED PLAYER LIKENESS \nPowered by the same technology that brought the most realistic representation of the athlete to EA SPORTS UFC, NHL 15 delivers groundbreaking player likeness, emotion and animation. From the strides a player takes to get up the ice to the emotion on their face after scoring a game winning goal, the players are as real as they’ve ever been. \n \nSUPERSTAR SKILL STICK \nNow all the tools of an NHL superstar are in your hands. The revolutionary Skill Stick has evolved to give even more control to the player. Protect the puck, receive passes without breaking stride, and discover an arsenal of sweet new dekes, all with an intuitive right stick control scheme that is easy to use but packed with depth. \n \nAUTHENTIC ARENAS \nThere is no feeling like being there, and we are giving you the best seats in the house. The power of the next-gen consoles finally allows the NHL franchise to capture every detail of an NHL arena. Unique arena elements from 19,000+ seat capacities to lighting and player entrance tunnels are captured with a level of detail not possible on the previous generation. Now those home games will truly feel like home. \n \nNEW COMMENTARY TEAM \nNew voices for a new generation. NHL 15 welcomes the NBC Sports commentary team of Mike 'Doc' Emrick and Eddie Olczyk to the broadcast booth. TSN analyst Ray Ferraro will provide game insights at ice level. Combined with Real Life Broadcast Integration that will feature real-world pre-game video commentary with Doc and Eddie set against in-game visuals, NHL 15 takes a revolutionary step forward in sports videogames; where the lines between the real world of sport broadcast and the game are blurred. \n \nNBC SPORTS GAME DAY PRESENTATION \nThe most realistic broadcast package in a video game to-date is possible because of a new partnership with NBC Sports. Set the scene with the NHL on NBC crew welcoming you to the city during the game intros and immerse yourself in an experience that matches what you see on television with NHL on NBC graphics and branding. \n \nLIVING CROWDS \nNHL 15 sets a new standard in videogames with over 9,000 individual crowd models with 4x the animations of previous generations. Take a look through the glass and you’ll see fans hold up signs with your name on them, costume wearing superfans, or even sections full of team rivals rooting against you. Feel their behavior change after dropping the gloves, landing a big hit, or scoring a clutch goal. The crowd is alive. \n \nVISION AI \nAn elevated level of player intelligence, Vision AI features evolved awareness with players reading and reacting to potential plays. Scoring area recognition, pass anticipation, and enhanced team breakouts all improve the flow of the game.","collection":200,"franchise":220,"franchises":[220],"hypes":1,"rating":75.1197275505005,"popularity":1.333333333333333,"aggregated_rating":62.2222222222222,"aggregated_rating_count":9,"total_rating":68.67097488636135,"total_rating_count":18,"rating_count":9,"games":[30830,44242,102122,27744,38967,101439,35099,18623,29173,103218],"tags":[32,268435469,268435470,536870956,536872060,536872078,536872219,536877488,536878163,536878167,536878169,536889503,536890153,536890764,536890765,536890766,1073741827],"developers":[277],"publishers":[454],"category":0,"player_perspectives":[3],"game_modes":[1,2,3],"keywords":[44,1148,1166,1307,6576,7251,7255,7257,18591,19241,19852,19853,19854],"themes":[32],"genres":[13,14],"first_release_date":1410220800000,"platforms":[45,9,48,12,49],"release_dates":[{"category":0,"platform":45,"date":1410220800000,"region":2,"human":"2014-Sep-09","y":2014,"m":9},{"category":0,"platform":9,"date":1410480000000,"region":1,"human":"2014-Sep-12","y":2014,"m":9},{"category":0,"platform":9,"date":1410220800000,"region":2,"human":"2014-Sep-09","y":2014,"m":9},{"category":0,"platform":48,"date":1410480000000,"region":1,"human":"2014-Sep-12","y":2014,"m":9},{"category":0,"platform":49,"date":1410480000000,"region":1,"human":"2014-Sep-12","y":2014,"m":9},{"category":0,"platform":12,"date":1410480000000,"region":1,"human":"2014-Sep-12","y":2014,"m":9},{"category":0,"platform":48,"date":1410393600000,"region":3,"human":"2014-Sep-11","y":2014,"m":9},{"category":0,"platform":9,"date":1410393600000,"region":3,"human":"2014-Sep-11","y":2014,"m":9},{"category":0,"platform":49,"date":1410393600000,"region":3,"human":"2014-Sep-11","y":2014,"m":9},{"category":0,"platform":12,"date":1410393600000,"region":3,"human":"2014-Sep-11","y":2014,"m":9},{"category":0,"platform":48,"date":1410220800000,"region":2,"human":"2014-Sep-09","y":2014,"m":9},{"category":0,"platform":12,"date":1410220800000,"region":2,"human":"2014-Sep-09","y":2014,"m":9},{"category":0,"platform":49,"date":1410220800000,"region":2,"human":"2014-Sep-09","y":2014,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oucjquwnogmevnielssm.jpg","cloudinary_id":"oucjquwnogmevnielssm","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c7qrp9alpqnj2usbr8aq.jpg","cloudinary_id":"c7qrp9alpqnj2usbr8aq","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/q6napiov1jlvqvklpceu.jpg","cloudinary_id":"q6napiov1jlvqvklpceu","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qwd9okk6ovfxoeakcmth.jpg","cloudinary_id":"qwd9okk6ovfxoeakcmth","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vmdllt9gnobpsabna1mc.jpg","cloudinary_id":"vmdllt9gnobpsabna1mc","width":1500,"height":844}],"videos":[{"name":"Trailer","video_id":"0jEgFzpsPMA"},{"name":"Gamescom Trailer","video_id":"SPds2-s7DTA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jpbevdkvcs505grtzdp3.jpg","cloudinary_id":"jpbevdkvcs505grtzdp3","width":930,"height":1318},"esrb":{"synopsis":"In this hockey simulation game, players can select teams from NHL rosters and play realistically depicted games of hockey. During the course of each match, players may initiate brief fistfights: the perspective shifts to isolate two players throwing punches and grabbing at one another until the fight is broken up.","rating":4},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Violence in a sporting context\r\nThis game allows the player to interact with other players ONLINE","rating":3},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/NHL_15"},{"category":1,"url":"http:\/\/www.easports.com\/de\/nhl"}],"multiplayer_modes":[{"platform":12,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":0,"onlinecoopmax":0,"onlinemax":0,"offlinemax":0}]}