{"id":7686,"name":"Raven's Cry","slug":"ravens-cry","url":"https:\/\/www.igdb.com\/games\/ravens-cry","created_at":1408834895484,"updated_at":1475424865325,"summary":"If you think you know something about pirates, think again.\n\nRaven's Cry plunges you into the dark world of the Golden Age of Piracy, as you follow the story of Christopher Raven and his quest for vengeance against the men who murdered his family. Reality Pump Studios has recreated the world of the 18th century Caribbean in painstaking detail, leaving behind the family-friendly tropes common to portrayals of this era and instead bringing you a gritty, realistic pirate experience like you’ve never seen before.\n \nPlayers can immerse themselves in a living, breathing environment just begging to be explored, complete with realistic period architecture and geography. Slash, sail, and shoot your way through a main storyline of 25 hours, along with several side quests, and discover new islands, hidden treasures, and action-packed adventures. Starting out in the filthy, rum-soaked ports of the Caribbean, players will travel to wealthy towns rife with political intrigue, beautiful plantations belonging to ruthless slave-owners, savage South American jungles filled with restless natives, and uncharted mercenary island hideouts. With its robust combat system and captivating storyline, Raven's Cry is a unique gaming experience you don’t want to miss.","storyline":"Caught between the rival powers of the Old World, mysterious native tribes, cutthroats, and buccaneers, players assume the role of Christopher Raven, as he explores both land and sea, travels to unexplored corners of the Caribbean, and to the dark corners of the human heart.\n\nHaunted by his inner demons, plagued by dreams of his bloody past, Christopher is a man adrift, having lost his moral compass and any sense of direction. The death of his family has pushed him to the brink of madness, awakening evil forces within him, which Christopher barely keeps in check as he struggles to find his life’s purpose. A routine sea voyage soon leads Christopher down a dark path that will send shockwaves throughout the whole Caribbean world.","collection":1954,"hypes":1,"popularity":1.333333333333333,"aggregated_rating":35,"aggregated_rating_count":3,"total_rating":35,"total_rating_count":3,"games":[37088,59516,55289,25311,36608,16468,1221,47823,23175,25300],"tags":[1,22,268435468,268435487,536870916,1073741826],"developers":[2973],"publishers":[1189],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[4],"themes":[1,22],"genres":[12,31],"first_release_date":1421193600000,"platforms":[6,9,48,12],"release_dates":[{"category":0,"platform":48,"date":1422403200000,"region":8,"human":"2015-Jan-28","y":2015,"m":1},{"category":0,"platform":9,"date":1422403200000,"region":8,"human":"2015-Jan-28","y":2015,"m":1},{"category":0,"platform":12,"date":1421193600000,"region":8,"human":"2015-Jan-14","y":2015,"m":1},{"category":0,"platform":6,"date":1422230400000,"region":8,"human":"2015-Jan-26","y":2015,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/thalcmzcrhhkyb1fzifq.jpg","cloudinary_id":"thalcmzcrhhkyb1fzifq","width":1919,"height":1062},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fkefrq0swb509ldyw06m.jpg","cloudinary_id":"fkefrq0swb509ldyw06m","width":1920,"height":1183},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v2zpv3somxhzxpyvwsge.jpg","cloudinary_id":"v2zpv3somxhzxpyvwsge","width":1919,"height":1062}],"videos":[{"name":"Trailer","video_id":"zoTy_8SWlhA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qk0ig5nlpt8pdrzd5y9e.jpg","cloudinary_id":"qk0ig5nlpt8pdrzd5y9e","width":1512,"height":2161},"websites":[{"category":1,"url":"http:\/\/www.ravenscry-game.com"}]}