{"id":82432,"name":"Life is Strange: Before the Storm - Limited Edition","slug":"life-is-strange-before-the-storm-limited-edition","url":"https:\/\/www.igdb.com\/games\/life-is-strange-before-the-storm-limited-edition","created_at":1516352432970,"updated_at":1533641742150,"summary":"Life is Strange: Before the Storm is a new three-part, standalone adventure set three years before the first game in the BAFTA award-winning franchise. You play as sixteen-year-old Chloe Price who forms an unlikely friendship with Rachel Amber, a beautiful and popular girl destined for success. When Rachel learns a secret about her family that threatens to destroy her world, it is her newfound friendship with Chloe that gives her the strength to carry on. No longer alone the girls must confront each other's demons and together, find a way to overcome them. \n \nThe Limited Edition includes Standard Edition content [Life is Strange: Before the Storm - The Complete Season (Episodes 1 to 3); Bonus Episode: 'Farewell' - play one last time as a young Max Caulfield in a special bonus episode; Mixtape Mode - Design your own playlist from the Life is Strange licensed soundtrack and listen to it alongside a cinematic scene from the game; Outfit Pack - Change up Chloe's look with three new complete outfits. Includes Punk Doe, Hawt Dawg Man & Illuminati outfits. Episode 1 from the first Life is Strange season. (digital content)] as well as an exclusive art book featuring art from Life is Strange: Before the Storm as well as a soundtrack CD with the original music soundtrack.","collection":2724,"popularity":5,"version_parent":29004,"version_title":"Limited Edition","tags":[1073741826],"developers":[12931],"publishers":[14089],"game_engines":[13],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[17379,17693,22846],"themes":[20],"genres":[31],"first_release_date":1520294400000,"platforms":[6,48,49],"release_dates":[{"category":0,"platform":49,"date":1520294400000,"region":2,"human":"2018-Mar-06","y":2018,"m":3},{"category":0,"platform":48,"date":1520294400000,"region":2,"human":"2018-Mar-06","y":2018,"m":3},{"category":0,"platform":49,"date":1520553600000,"region":1,"human":"2018-Mar-09","y":2018,"m":3},{"category":0,"platform":48,"date":1520553600000,"region":1,"human":"2018-Mar-09","y":2018,"m":3},{"category":0,"platform":6,"date":1520553600000,"region":1,"human":"2018-Mar-09","y":2018,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jrj6cg8bc4oltc3yzykx.jpg","cloudinary_id":"jrj6cg8bc4oltc3yzykx","width":1024,"height":576},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hzyq9pgb9ldondxomus0.jpg","cloudinary_id":"hzyq9pgb9ldondxomus0","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"7Ve5_vbwT78"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mww1drbuixjnkgyrupy2.jpg","cloudinary_id":"mww1drbuixjnkgyrupy2","width":1172,"height":1341},"esrb":{"synopsis":"This is an adventure game in which players assume the role of a girl (Chloe Price) investigating a family secret. From a third-person perspective, players observe character interactions, and can make dialogue choices that affect the outcome of the story. Characters are sometimes depicted shooting or stabbing each other, and Chloe is struck across the face in handful of scenes. In one sequence, a character is seen getting struck and killed by a car; in another scene, a bound character is injected with heroin against her will. Injured characters are sometimes depicted with blood on their hands and clothing; a handful of scenes contain large streaks of blood. Dialogue and game text occasionally reference sexual material (e.g., “will bang 4 Jesus”; “Wait, you're a prostitute? But I'm a prostitute! Now who gets paid?”; “You just looked at my t*ts”). During the course of the game, a character is shown smoking marijuana; a couple of sequences depict high-school students drinking alcohol. The words “f**k,” “sh*t,” and “a*shole” appear in dialogue","rating":6},"pegi":{"synopsis":"This game has been rated PEGI 16 depictions of realistic looking violence towards human-like characters, use of sexual expletives and depictions of the use of illegal drugs. Not suitable for persons under 16 years of age.","rating":4},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/554620\/Life_is_Strange_Before_The_Storm"},{"category":9,"url":"https:\/\/www.youtube.com\/user\/lifeisstrange"},{"category":8,"url":"https:\/\/www.instagram.com\/lifeisstrangegame"},{"category":5,"url":"https:\/\/twitter.com\/LifeIsStrange"},{"category":4,"url":"https:\/\/www.facebook.com\/LifeIsStrangeGame"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Life_Is_Strange:_Before_the_Storm"},{"category":2,"url":"http:\/\/life-is-strange.wikia.com\/wiki\/Before_the_Storm"},{"category":1,"url":"https:\/\/www.lifeisstrange.com\/en-us\/games\/before-the-storm"}]}