{"id":87484,"name":"3d Voxel Art: Color by Number","slug":"3d-voxel-art-color-by-number","url":"https:\/\/www.igdb.com\/games\/3d-voxel-art-color-by-number","created_at":1518796461862,"updated_at":1519364183733,"summary":"3d Voxel Art: Color By Number takes painting apps to the entirely new level. Craft your colorful 3d Voxel models now!\n \nMain App Features:\n \n- Easy to use. Rotate, Scale, Zoom and Drag your model. It is very convenient for our users to paint blocks because with simple hand gestures you can place model exactly how you want it to be. Coloring has never been more natural and fun! \n \n- Anti-stress gaming. The best stress-relief after the hard week. Paint highlighted boxes with the chosen color. \n \n- 3d Sharing. Share the time-lapse video of how you paint your 3d pixel art model.\n \n- Augmented Reality. Place your model in AR on your table, floor, street or anywhere else! Share this beautiful real-life experience with your friends. (ARkit available only for: iPhone X, iPhone 8, iPhone 8 Plus, iPhone 7, iPhone 7 Plus, iPhone SE, iPad Pro, iPad 5th Gen)\n \n- Fun drawing game for all ages. With a wide variety of figures and daily updates, this game is excellent for both adults and kids. We have unicorns, stars, cats, dogs, foxes, ponies and much more!\n \nThe 3d coloring is going to be a new trend of 2018. Join now and make your life a bit more colorful!\n\n3d Color By Number Premium subscription\n\n- You can subscribe to remove all ads;\n- Subscription is $2.99 USD per week;\n- All prices are subject to change without notification. We occasionally run promotion prices as incentives or limited time opportunities for qualifying purchases made during the promotional time period. Due to the time sensitive and promotional nature of these events, we are unable to offer price protection or retroactive discounts or refunds for previous purchases in the event of a price reduction or promotional offering.\n- Payment will be charged to iTunes Account at confirmation of purchase.\n- You will be able to color all available images for the duration of the subscription;\n- Subscription automatically renews for the same price and duration period as the original \"one week\" package unless auto-renew is turned off at least 24-hours before the end of the current period\n- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package).\n- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase.\n- No cancellation of the current subscription is allowed during the active subscription period.\n- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http:\/\/support.apple.com\/kb\/ht4098 for more information.\n- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period.\n- Any unused portion of a free-trial period will be forfeited when the user purchases a 3d Color By Number Premium subscription.\n\nLinks to our Terms of Service and Privacy Policy can be found below\nPrivacy Policy: https:\/\/www.dropbox.com\/s\/yv1saro5ol103xv\/Privacy%20Policy.pdf?dl=0\nTerms of Use: https:\/\/www.dropbox.com\/s\/obavfsvnwfq5w7u\/Terms%20of%20Use.pdf?dl=0\n\n* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD","popularity":1,"games":[19222,41348,10225,27266,91177,90837,90671,90051,89132,88889],"tags":[268435465,536872030],"category":0,"keywords":[1118],"genres":[9],"first_release_date":1518566400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1518566400000,"region":8,"human":"2018-Feb-14","y":2018,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/krnjyqtjz3eljoku7gn7.jpg","cloudinary_id":"krnjyqtjz3eljoku7gn7","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qbgwsym11qg0xv5fmxwa.jpg","cloudinary_id":"qbgwsym11qg0xv5fmxwa","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hcmlztjo9tm4t0wvd8ri.jpg","cloudinary_id":"hcmlztjo9tm4t0wvd8ri","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xdyyy7ap6ahtplcuhmf4.jpg","cloudinary_id":"xdyyy7ap6ahtplcuhmf4","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tbvxjgqss5dhqxk6uexr.jpg","cloudinary_id":"tbvxjgqss5dhqxk6uexr","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/smhl7olu38wc323wr2tq.jpg","cloudinary_id":"smhl7olu38wc323wr2tq","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gzogehrynrtfheizckma.jpg","cloudinary_id":"gzogehrynrtfheizckma","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xonz8itto27kub3dyto5.jpg","cloudinary_id":"xonz8itto27kub3dyto5","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bknmuot026xtpyrn5s4s.jpg","cloudinary_id":"bknmuot026xtpyrn5s4s","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/z30zggbmdijkou7jpu4v.jpg","cloudinary_id":"z30zggbmdijkou7jpu4v","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tr8i1wwaouzjevzssafv.jpg","cloudinary_id":"tr8i1wwaouzjevzssafv","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/3d-voxel-art-color-by-number\/id1339713432?mt=8&uo=4"}]}