{"id":89824,"name":"Dance School Stories","slug":"dance-school-stories","url":"https:\/\/www.igdb.com\/games\/dance-school-stories","created_at":1519995900707,"updated_at":1525782245317,"summary":"Have you ever dreamed of dancing on stage, the spotlight on you, the crowd going wild? This is your moment! You've been accepted into the exclusive Fame Dance Academy - and now your hard work REALLY begins. \n\nYour new school is cutthroat - you have to impress your teachers AND the tough headmistress who had doubts about you since the beginning. Choose your dance classes and master new moves in ballet, hip hop, jazz and Latin dance. But there’s drama off-stage too…Sam, only the hottest guy you’ve ever met, has eyes on you. This could be perfect, right?! But guess what: He has a girlfriend, and no other than the cold-hearted (but great dancer) Victoria. This girl is not playing around and will make your life a living hell, so watch out! And when the end-of-year duet gets closer - the tension rises! Who will get the lead part of the show? Will it be you, or...?\n\nFeatures:\n>> Make your own choices every step of the way - build your path to success!\n>> Which dance styles do you love? Pick a class and set your own schedule\n>> Advance to the next level by completing tasks\n>> Rock your audition! Repeat the dance moves in the exact order your teacher showed you\n>> Being a ballerina is hard work - practice your plies and pirouettes in the ballet studio!\n>> Pick out a killer dance outfit for your big performance!\n>> It’s battle time – show off your hip hop skills in the ultimate dance-off!\n>> Professional dancers need to stay fit. Lift weights, hula hoop, and bike at the gym\n>> You’ve mastered your jazz technique - show off that fancy footwork!\n>> Show everyone that you're a versatile dancer - amaze them with your Latin dance moves.\n>> Uh oh, you're caught in a love triangle. Go for the one that steals your heart\n>> It’s time to perfect your look! Give yourself a makeover with new clothes, makeup, a hairstyle and accessories.\n\n\nABOUT US\nCrazy Labs is a casual games brand, under which TabTale develops and publishes fun and addictive games. Crazy Labs partners with independent development studios across the globe to create engaging mobile content for audiences of all ages. \nLike us: https:\/\/www.facebook.com\/crazylabsgames\nWatch us: http:\/\/www.youtube.com\/Tabtale\nVisit us: http:\/\/tabtale.com\/\nFollow us:@CrazyLabsGames\n\n\nCONTACT US \nLet us know what you think! Questions? Suggestions? Technical Support? Contact us 24\/7 at Talk2Us@Crazy-Labs.com\n\nPRIVACY:\nThe app is free to play but certain in-game items may require payment. The app includes:\n- advertising for TabTale and some third parties that redirect users to our sites, apps or third-party sites\n- social networks links to connect with others while playing\n- the option to accept push notifications to inform of exciting news (e.g. updates) \n- an age-gate to prevent access to some features to protect children (e.g. restrict behavioral advertising or information sharing).\nPrivacy is important to us. The app may enable data collection for legal purposes (e.g. respond to support queries; enable, analyze and improve the app’s features and services; personalize content including targeted advertising). For more information refer to our Privacy Policy: http:\/\/tabtale.com\/privacy-policy\/. Note that referred third parties are subject to their own policies. Use of the app is subject to our Terms of Use: http:\/\/tabtale.com\/terms-of-use\/.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[75102,49414,25636,74378,25311,26145,44242,75398,36608,28465],"tags":[268435468,268435469],"category":0,"genres":[12,13],"first_release_date":1519776000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1519776000000,"region":8,"human":"2018-Feb-28","y":2018,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/laisycbbt5svliezf0qh.jpg","cloudinary_id":"laisycbbt5svliezf0qh","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qdjr3sobt9gprqktpotp.jpg","cloudinary_id":"qdjr3sobt9gprqktpotp","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wzxuyvelex44iszryiof.jpg","cloudinary_id":"wzxuyvelex44iszryiof","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hio0pxlltobo6qqqaseh.jpg","cloudinary_id":"hio0pxlltobo6qqqaseh","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ixrlghasahbo1sqrkp56.jpg","cloudinary_id":"ixrlghasahbo1sqrkp56","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/w0rqgog3ximwycdn4sxo.jpg","cloudinary_id":"w0rqgog3ximwycdn4sxo","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwfl4te9gyfx1vdihlug.jpg","cloudinary_id":"vwfl4te9gyfx1vdihlug","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dbzwqndhmqkdykepuspc.jpg","cloudinary_id":"dbzwqndhmqkdykepuspc","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e1qbxsynmvnnkhjuzos2.jpg","cloudinary_id":"e1qbxsynmvnnkhjuzos2","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/omvr2zvchnndgtbn9qia.jpg","cloudinary_id":"omvr2zvchnndgtbn9qia","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wgln7pbdrk54ald6jrfw.jpg","cloudinary_id":"wgln7pbdrk54ald6jrfw","width":512,"height":512},"esrb":{"rating":3},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.crazylabs.dance.school&hl=en&gl=us"},{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/dance-school-stories\/id1300091337?mt=8&uo=4"}]}