{"id":95639,"name":"Scary Granny Horror Game","slug":"scary-granny-horror-game","url":"https:\/\/www.igdb.com\/games\/scary-granny-horror-game","created_at":1521999121041,"updated_at":1523426817086,"summary":"Oh no seems like you’re trapped and there is no escape... everything is creepy and spooky and you’re probably getting the goosebumps. How did you get here in the first place? The only possible reason could be... you have been kidnapped!!! \n\nBut kidnapped by whom? The evil creepy neighbor or someone else. Oh no... it must be... the scary granny!!! Legend has it that there lives an angry scary granny in neighbourhood who will kidnap anyone who seems like a grandchild to her. When she will kidnap you, she will trap you inside her horror house and not let you go.\n\nBut obviously you can’t stay there forever and have to escape the haunted house at all costs before she does something bad to you. Now that you have been kidnapped by the angry scary granny it is time for you to escape her haunted house where she keeps all the people she will kidnap. \nNow this game becomes a survival game house escape. You have 5 days to escape or else the game will be over for you. You’re probably scared but there is a way to get out and you must find it!! \n\nInside the creepy angry scary granny house there are five rooms and out of the five rooms one room has the key to the main door which is the route to the house escape into the safe neighborhood away from the scary granny and all other creepy neighbors living in that neighborhood. \n\nThe game will start in the room where you are trapped in, you have to leave that spooky room very quietly without the granny finding out. She is probably lurking around in the horror house or in the neighborhood, but she knows you’re in the haunted house.\nWhen you leave the room go to another room out of the five to find they key to escape. With the help of the on screen control you can open drawers and cupboards to find the key. If by chance the granny is near and you spot her you have to hide before she catches you. You can hide in the cupboard or dunk under the bed.\n\nBut if she catches you, you’re up for a huge punishment which may cost you your life (in the game obviously.) Be careful of mindless knocking and dropping things because the moment she hears the sound she’s going to immediately pop up and finish you!!!\nSo to escape from the horror house and the creepy scary granny quietly sneak into all the rooms, find the key and ESCAPE!!!!!!! \n\nFeatures of Scary Granny Horror House Neighbour Survival Game:\n- horror house simulation\n- creepy scary granny simulator\n- single player game \n- on screen controls \n- haunted house realistic graphics\n- scary music for extra spooky horror effect \n\nEscape now or never. It's up to you to play Scary Granny Horror House Neighbour Survival Game","rating":40,"popularity":1,"total_rating":40,"total_rating_count":0,"rating_count":0,"games":[49414,25636,36608,21842,28080,75102,18862,16468,19567,72412],"tags":[268435468,268435489],"category":0,"genres":[12,33],"first_release_date":1517529600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1517529600000,"region":8,"human":"2018-Feb-02","y":2018,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lara4si1ocqwp6y8mwcz.jpg","cloudinary_id":"lara4si1ocqwp6y8mwcz","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/njemuqeraxiyuzxahwyv.jpg","cloudinary_id":"njemuqeraxiyuzxahwyv","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ove6mblrquomgxypb6m9.jpg","cloudinary_id":"ove6mblrquomgxypb6m9","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eb26lxbc7szfsligso3x.jpg","cloudinary_id":"eb26lxbc7szfsligso3x","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uolqoj1lxuotajiggo4g.jpg","cloudinary_id":"uolqoj1lxuotajiggo4g","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a44n7cbpoarjbrvgkm2y.jpg","cloudinary_id":"a44n7cbpoarjbrvgkm2y","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g9mblztq2tt10stt2d3h.jpg","cloudinary_id":"g9mblztq2tt10stt2d3h","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gaoixw3uapffule1qtfc.jpg","cloudinary_id":"gaoixw3uapffule1qtfc","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rb38qbmhgsyxgl2xvciy.jpg","cloudinary_id":"rb38qbmhgsyxgl2xvciy","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xwdbgdfopdiy0iiqe4bt.jpg","cloudinary_id":"xwdbgdfopdiy0iiqe4bt","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/scary-granny-horror-game\/id1341565681?mt=8&uo=4"}]}