{"id":11335,"name":"Bad Blood","slug":"bad-blood","url":"https:\/\/www.igdb.com\/games\/bad-blood","created_at":1436737847249,"updated_at":1515686480028,"summary":"A nuclear war has turned the world into a wasteland. The pure-blooded humans have retreated in large cities while mutants live in small villages on the plains where they make a living by hunting the many monsters. Now one of the human leaders, Lord Dominix, wants to start a war to wipe out all the \"bad-blooded\" mutants. Your village chief has assigned you with the task of preventing this war. \n \nBad Blood is a top-down action game with light role-playing elements. You can not create your own character but have to pick one of the three predefined ones: Varrigg (a strong green mutant who fights with his bare hands), Dekker (a human male armed with a knife) or Jakka (she looks human but can shoot laser beams from her eyes like Cyclops of X-Men fame). The choice you make has only a limited impact on gameplay and storyline. \n \nGameplay consists of exploring the world map, visiting several cities and villages, talking with NPCs, picking up items and new weapons (like shotguns, grenades, Uzis etc.) and lots of real-time combat. Bad Blood lacks character stats and character development. The game has a day-night cycle which influences the amount of monsters on the plains and whether or not you can talk with some NPCs.","popularity":1.333333333333333,"games":[25300,11567,26766,36926,36950,54842,25311,19448,68287,47823],"tags":[1,18,268435468,536870981,536870984,536871086,536871390,536871835,536871882,536871938,536871945,536872234,536875830,536876712,536879693,1073741827],"developers":[295],"publishers":[295],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[69,72,174,478,923,970,1026,1033,1322,4918,5800,8781],"themes":[1,18],"genres":[12],"first_release_date":662601600000,"platforms":[13,15],"release_dates":[{"category":2,"platform":13,"date":662601600000,"region":2,"human":"1990","y":1990,"m":12},{"category":2,"platform":15,"date":694137600000,"region":2,"human":"1991","y":1991,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y9wzdpw5zgrkriy5hibi.jpg","cloudinary_id":"y9wzdpw5zgrkriy5hibi","width":640,"height":917},"websites":[{"category":2,"url":"https:\/\/en.wikipedia.org\/wiki\/Bad_Blood_%28video_game%29"}]}