{"id":1135,"name":"Castlevania: Lament of Innocence","slug":"castlevania-lament-of-innocence","url":"https:\/\/www.igdb.com\/games\/castlevania-lament-of-innocence","created_at":1340744153463,"updated_at":1545685891788,"summary":"Lament of Innocence is one of several Castlevania games that attempts to give the series an \"origin story.\" This retconned Legends, and was later retconned by Lords of Shadow. This one makes Leon the patriarch of the Belmont clan, explains the origin of Dracula, and also defines the conflict between the two.","storyline":"Lament of Innocence is set in the fictional universe of the Castlevania series. Set in 1094, it focuses on the origins of the series' premise—the conflict between the vampire-hunting Belmont clan and the vampire Dracula. The protagonist and primary player character of Lament of Innocence is Leon Belmont, a former baron and member of the Belmont clan. His close friend, Mathias Cronqvist, tells him that Leon's betrothed, Sara, is being held captive by the vampire Walter Bernhard. During the game, he encounters Rinaldo Gandolfi, an alchemist and resident of the forest outside Walter’s castle. \n \nArriving on the castle grounds, Leon meets Rinaldo, who gives him a whip crafted by alchemy to assist in killing the monsters and enchants his gauntlet so he is able to use magic relics within the castle. Leon also learns that he must defeat five monsters to gain access to Walter's throne room. Arriving at the castle, Leon proceeds to defeat the five monsters, including Joachim, a vampire kept prisoner in the castle by Walter. Before dying, Joachim mentions the Ebony and Crimson Stones, both of which are created from alchemy, and explains to Leon that the Ebony Stone can produce darkness. From Rinaldo, Leon learns that the Crimson Stone converts the souls of vampires into power for its holder. \n \nAfter Leon reaches Walter’s quarters, he rescues Sara and attempts to slay him with the whip, to no effect. At Rinaldo's cottage, it is revealed that Sara is slowly becoming a vampire. Rinaldo reveals that Leon must sacrifice Sara to make the whip effective against Walter. Overhearing their conversation, Sara begs him to kill her and use her soul to save others from suffering her fate. Leon reluctantly completes the ritual, creating the Vampire Killer whip. \n \nDevastated by the loss of Sara, Leon returns to the castle to confront Walter and defeats him. Death takes Walter's soul and offers it up to Mathias; Mathias appears and reveals he had orchestrated everything to obtain his soul and convert it into power for himself using the Crimson Stone. Mathias explains that he chose immortality as a vampire so he could curse God for taking away his beloved wife. He offers Leon the same, but a disgusted Leon refuses. Mathias orders Death to kill Leon, but Leon defeats Death, vowing that the Belmont clan will hunt down Mathias and destroy him one day. The game's epilogue reveals that Mathias became Dracula, the series' main antagonist.","collection":65,"franchise":895,"franchises":[895],"rating":79.4923560964143,"popularity":1.333333333333333,"aggregated_rating":78,"aggregated_rating_count":3,"total_rating":78.74617804820716,"total_rating_count":14,"rating_count":11,"games":[76253,103312,76747,75412,37419,78632,80916,106987,81249,107926],"tags":[1,268435481,268435487,536891373,536891374,1073741826],"developers":[129],"publishers":[129],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[20461,20462],"themes":[1],"genres":[25,31],"first_release_date":1066694400000,"platforms":[8],"release_dates":[{"category":0,"platform":8,"date":1066694400000,"human":"2003-Oct-21","y":2003,"m":10}],"alternative_names":[{"name":"Castlevania","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/svnj7xzhyc0f7u3faouk.jpg","cloudinary_id":"svnj7xzhyc0f7u3faouk","width":987,"height":757},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/umgyuryknyo0wpgatvbn.jpg","cloudinary_id":"umgyuryknyo0wpgatvbn","width":986,"height":754},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v1sjqr7sqvuhurxzgpzx.jpg","cloudinary_id":"v1sjqr7sqvuhurxzgpzx","width":985,"height":665},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xvweieicrafr7u6kt4a9.jpg","cloudinary_id":"xvweieicrafr7u6kt4a9","width":983,"height":755},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uhqaojmuobnimlepk4zt.jpg","cloudinary_id":"uhqaojmuobnimlepk4zt","width":1107,"height":809}],"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kbom5abfkdkhqodvamot.jpg","cloudinary_id":"kbom5abfkdkhqodvamot","width":630,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qjq0ejowlcm3ptr4sija.jpg","cloudinary_id":"qjq0ejowlcm3ptr4sija","width":635,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/asevlwrqcho9vwujefqk.jpg","cloudinary_id":"asevlwrqcho9vwujefqk","width":475,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gh02rcxi5htvxx1zilg8.jpg","cloudinary_id":"gh02rcxi5htvxx1zilg8","width":635,"height":900}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bzp9cpxamw3u2yhhyxs2.jpg","cloudinary_id":"bzp9cpxamw3u2yhhyxs2","width":359,"height":510},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Castlevania:_Lament_of_Innocence"}]}