{"id":11835,"name":"Yetisports","slug":"yetisports","url":"https:\/\/www.igdb.com\/games\/yetisports","created_at":1440871050807,"updated_at":1441386991668,"summary":"Yetisports (also known as Pingu Throw) is a web-based Flash game that originally appeared on the Internet in January 2004. The goal of the original game is to have a yeti smack a penguin with a club and try to get it to fly as far as possible. The original Yetisports game features no name other than the words \"1978 Reinhold + Yeti\", a reference to Reinhold Messner's claim to have found Yetis.\n\nThe game is very popular and soon after release, there was a quick succession of many variants created by multiple people on the internet. None of these are officially sponsored by Chris Hilgert, even though many copy the original almost exactly save certain small changes. One of the more violent variants was made by someone known as 'Pawel', featuring decapitation, spikes, a big spiky club and mines. Since the original was released at the Yetisports homepage, the website has released nine further adventures of the Yeti as well as a re-release of the original that allows movement of the penguin in flight.\n\n\nGame 1 (Deluxe version of original)\nLocation: Antarctic\nLaunched: 19.01.2004\nTag Line: \"It all started with a club\"\n\nIn this game, the players hit the penguin with good timing and he goes flying. Using the arrow keys, the player controls the angle of the penguin as he flies, and catches air currents (the closer to an ideal angle, the better the currents) to stay in the air. The videos of records all show the flight starting on a low trajectory, with little manipulation of arrow keys to get better angle, meaning an ideal angle is kept throughout the flight.\n----------------------------------\nGame 2 (Orca slap)\nLocation: Antarctic\nLaunched: 12.02.2004\nTag Line: \"Hit the bulls eye\"\n\nIn this game, the goal is to hit penguins into a dartboard with a snowball. An orca hits the penguins into the air, which the yeti then hits with a snowball. The point on the dartboard the penguin hits is determined by the angle it faces in the air (the penguin rotates) and the height it is in its fall. The theoretical maximum score is 1000 (each of 10 shots scores a bull's eye for 100 points). In the more violent variant, the yeti throws icicles instead of snowballs, impaling the penguins if they hit one.\n----------------------------------\nGame 3 (Seal bounce)\nLocation: Antarctic\nLaunched: 18.03.2004\nTag Line: \"Up the iceberg\"\n\nIn this game, you play with 2 clicks of the mouse. The first click starts the yeti windmilling his arms (which hold a penguin), the second makes him release the penguin, between two glaciers with seals sticking out at regular intervals. The seals hit the penguin higher, which is useful as the penguin will not go higher than 300 if thrown straight up, whereas with bounces it is possible to go substantially past 400.\n\nThere is a more violent variant, featuring a sea of blood, dead penguins and the throwable penguin is thrown with the bottom half of his torso ripped off, bleeding. The game physics have also been adjusted to allow for much higher scoring, even with no bounces.\n----------------------------------\nGame 4 (Albatross overload)\nLocation: Australia\nLaunched: 29.04.2004\nTag Line: \"Gone with the wind\"\n\nThis game is set in Australia. The penguin stands on one side of a see-saw while the yeti stomps on the other end. If the stomp is executed with good timing, the penguin lands on an albatross flying overhead. The player then has control over when the albatross flaps its wings. The closer to the ground the bird flaps, the more efficient it is. When the albatross' energy bar (which slowly recharges when the bird is not flapping) reaches 0, the bird will soon crash.\n----------------------------------\nGame 5 (Flamingo drive)\nLocation: Africa\nLaunched: 17.06.2004\nTag Line: \"May the vulture get him?\"\n\nThis game, set in Africa, involves using a flamingo as a golf club to hit a penguin. The angle is set by clicking while an arrow points at various angles, and power is set by clicking while a bar moves up and down. You have five shots per game. There are many game elements that will affect the final score, such as giraffes, which will catch the penguin in their mouths and throw it further if the penguin flies near their heads; Elephants and acacias that block low shots; Vultures that catch the penguin, bring it lower and drop it, if it flies too high; and pythons that bounce the penguin higher if it hits them. There is always the same pattern of animals and trees: A giraffe at 0, an acacia at 1000, and a giraffe at 2000, for example. The pattern can be used to help determine the best angle of the first shot. It is definitely a lower angle, but the exact best angle is hard to achieve. A tiny difference can mean a score on the first shot of 350 or 1000.\n----------------------------------\nGame 6 (Big wave)\nLocation: Hawaii\nLaunched: 02.09.2004\nTag Line: \"The perfect wave\"\n\nThis game, controlled by the arrow keys, is the first of a series of games focusing more on the yeti, instead of the penguin and his attempts at flight. The yeti surfs up and down a big wave, trying to pull off tricks and hit penguins out of the air. The wave gradually shrinks until the end of the game. If you press the Y (\"motivation\") key, when playing the game, an unseen penguin loudly yodels, which then echoes in the background.\n----------------------------------\nGame 7 (Snowboard free ride)\nLocation: Austria\nLaunched: 14.10.2004\nTag Line: \"Back to the Snow\"\n\nIn this game, the yeti snowboards down a long slope, racing 10 penguins. The slope has many jumps and ibexes that send the yeti into the air, where he can do tricks for points. The point is not to win the race, but to get the most points, though you get bonus points for doing well in the race. Hitting a penguin slows it down for a few seconds, but then the penguin gets angry and moves faster. The top score is 12141.\n----------------------------------\nGame 8 (Jungle Swing)\nLocation: South America\nLaunched: 4.4.2005\nTag Line: \"Cry of the rain forest\"\n\nThis game involves swinging up a series of branches in a tree, jumping with a mouseclick. It requires precise timing, as the angle of the jump changes based on when the click is. When the yeti jumps off a green branch, the branch turns gold. When the yeti jumps off a gold branch, the branch turns red. When the yeti jumps off a red branch, the branch falls off and 3 green branches grow on the 3 next branchless spaces. There are only 25 branches at the start, all of which are green, so to get to the top yeti must swing off of 9 different branches 3 times each to get to the top, as well as the 50 branches that must be climbed to get to the top at all.\n----------------------------------\nGame 9 (Final spit)\nLocation: Himalaya\nLaunched: 07.07.2005\nTag Line: \"Game Over\"\n\nIn this game, the yeti has kidnapped a llama and makes it spit at penguins. The other animals don't like being spat at and spitting them costs points. Missing 10 penguins or running out of time (Hitting the ox gives a time bonus) ends the game. The secondary title of the violent variant is altered to \"The End\" and is the final violent Yetisports game. In it, the llama gives the yeti a machine gun. Unlike the penguins, the other animals (with the exception of eagles and tortoises) don't get decapitated, but they do bleed. This also has in-game music, something that its official counterpart doesn't. Also, penguins die if they get caught in the wheel the ox is pulling, whilst moving.\n----------------------------------\nGame 10 (Icicle climb)\nIn this game, the yeti has 12 icicles to throw into the side of a cliff. There is a penguin next to this cliff, and he jumps up the icicles. The only limitation is the fact that the penguin only jumps 1.2 meters up.\n----------------------------------\nSpecial Stage (Stage Dive)\nLocation: Concert Halls\nLaunched: 15.09.2004\nTag Line: \"Let it Rock\"\n\nInfluenced by the new media on his travels the Yeti gets into rock, and to prove his \"popstar\" credentials, dives headfirst into the mosh-pit where the penguins are headbanging. They struggle to the task of getting the Yeti around the room. The Yetis movements are controlled with the left mouse button: you have ten clicks to get the Yeti as far as possible.\n\n\nGLITCHES:\nIn the deluxe version of the first game, the penguin throws up on impact when the player hits him high in the air and holds down the left or right arrow key. The animation lasts longer than the time it takes for the sign saying the score, \"replay\", \"highscores\" and \"OK\" to pop up. If you click the OK button before the vomiting animation is complete, the penguin will vomit on impact next time no matter what. Then if you play the replay, the penguin will not vomit on impact with the ground and keep flying unguided.\n\nIn Game 4, Albatross Overload, your score is the average of three flights. If you have a bad flight you can press 'q' to quit and start over, but your score will not be submitted to the High Score chart on the Yetisports web site.\n\nIn Yeti Sports 5: Flamingo Drive, if you hit the penguin hard enough and it hits a snake just before getting to a giraffe, then sometimes on certain giraffes it will go straight through the neck and continue, sometimes at an increased speed.\n\n\nPARODIES:\nThe original Pingu Throw inspired the popular flash game Penguin Extreme, where a yeti uses a spiked mace as the baseball bat, decapitating the penguin and leaving a bleeding head flying into the distance, to land for distance. On the ground are added landmines that can cause further distance to accrue. The game is a hack of the original Yetisports.","popularity":2.333333333333333,"games":[109581,103303,11367,9655,99118,54775,21641,103282,81249,72812],"tags":[17,27,268435470,536871636,536872576,536872627,536872774,536872775,536872776,536872777],"developers":[6349],"category":0,"keywords":[724,1664,1715,1862,1863,1864,1865],"themes":[17,27],"genres":[14],"first_release_date":1074470400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1074470400000,"human":"2004-Jan-19","y":2004,"m":1}],"alternative_names":[{"name":"1978 Reinhold + Yeti"},{"name":"Pingu Throw"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rnkrcpvot3tdtt7d785g.jpg","cloudinary_id":"rnkrcpvot3tdtt7d785g","width":400,"height":300},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c3u08gkq1xcevipsujrj.jpg","cloudinary_id":"c3u08gkq1xcevipsujrj","width":480,"height":320},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cnkdifam38visah7fa1j.jpg","cloudinary_id":"cnkdifam38visah7fa1j","width":650,"height":399},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dfiohuzjvvmrq2opksyn.jpg","cloudinary_id":"dfiohuzjvvmrq2opksyn","width":498,"height":399},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l8ruddq08drtikqo3dih.jpg","cloudinary_id":"l8ruddq08drtikqo3dih","width":300,"height":200}],"videos":[{"name":"Gameplay video","video_id":"K6tVvcWjBUg"},{"name":"Gameplay video","video_id":"COTSJAgXqmY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uhlhr3mdexei5c8xfpwu.jpg","cloudinary_id":"uhlhr3mdexei5c8xfpwu","width":337,"height":480}}