{"id":35,"name":"Dungeon Keeper","slug":"dungeon-keeper","url":"https:\/\/www.igdb.com\/games\/dungeon-keeper","created_at":1297689932000,"updated_at":1547323608831,"summary":"Dungeon Keeper is a strategy video game in which the player attempts to build and manage a dungeon or lair while protecting it from invading 'hero' characters intent on stealing the player's accumulated treasures and killing various monsters. This was Peter Molyneux's final project with Bullfrog before he left the company in August 1997 to form Lionhead Studios. \n \nThe player uses a mouse, represented in-game as a hand, to interact with a bar on the left-hand side of the screen, allowing them to select which rooms to build and which spells to cast. The player can also use the hand to pick up creatures and objects in the dungeon and carry them around, allowing for tactics such as gathering an assault force and dropping off the creatures en masse once a foothold has been established. The hand also allows the player to \"slap\" objects and thereby interact with them: creatures will hurry up when slapped, some traps will be triggered and prisoners in the Torture Chamber can be tortured. \n \nThe main game view is in isometric perspective; this view can be zoomed and rotated. The player also has the option of possessing one of their creatures, and seeing the dungeon from that creature's first-person perspective, as well as using their attacks and abilities. The map is divided into a grid of rectangles, most of which are invisible. A smaller part of the map is shown as a minimap in the top left corner of the screen. \n \nA world map is also available, and at the beginning of the game the player is allocated one of the 20 regions of a fictional, idyllic country to destroy. As the player progresses through these regions, each of which represents a level of the game, the areas previously conquered will appear ransacked, twisted, and evil. Before starting a new level, the Mentor will tell the player about the current region and its attributes. After completing a level, the Mentor will talk about the \"improvement\" of the destroyed region: \"The streets run with the blood of the slain. Screams of pain and howls of anguish rip the night air like a vengeful siren's song. This really is somewhere you can take the kids for the weekend.\" \n \nThe Dungeon Heart represents the Dungeon Keeper's own link to the world. If it is destroyed, the player loses the level, and must restart. Along with the heart, the player begins with a small number of imps, the generic work force for all dungeon activities: they can dig tunnels into the surrounding soil, capture enemy rooms and Portals, mine gold and gems, set traps, and even attack when desperate or threatened. Slapping creatures forces them to work faster for a while, but removes some of their health and happiness. \n \nOnce the Imps are busily working, the player must then set up a basic infrastructure: Lairs for monsters, a Hatchery (where chickens, which serve as food for the minions, are bred), and a Treasury for storing gold. After connecting the dungeon to a \"Portal\", monsters will arrive. As the game progresses, the player moves along a technology tree, unlocking further rooms. \n \nThe dungeon has a fleshed-out ecology: some creatures are natural enemies. Flies and Spiders are often found at odds with one another, while a Horned Reaper, if it has gone berserk, will attack all creatures in its path. The goals for each level are fairly straightforward: they generally fall along the lines of eliminating the heroic force or destroying all other Dungeon Keepers on the level.","collection":13,"rating":87.1644041058365,"popularity":5.666666666666667,"aggregated_rating":10,"aggregated_rating_count":0,"total_rating":48.58220205291825,"total_rating_count":60,"rating_count":60,"games":[9226,36,2040,1593,3155,9256,9834,44,14394,5652],"tags":[1,17,19,22,27,268435467,268435471,536870928,536871008,536871027,536871059,536871063,536871123,536871138,536871139,536871165,536871170,536871172,536871208,536871213,536871244,536871262,536871438,536871506,536871561,536871570,536871682,536871717,536871905,536871906,536871931,536871938,536872032,536872092,536872257,536872304,536872383,536872440,536872817,536872978,536873017,536873066,536873089,536873297,536873400,536873822,536874094,536874134,536874445,536874694,536875042,536875131,536875147,536875275,536875304,536875312,536875327,536875330,536875331,536875344,536875361,536875432,536875531,536875606,536875775,536875778,536875781,536875782,536876007,536876010,536876033,536876036,536876062,536876286,536876390,536876501,536876591,536876607,536876967,536876996,536877368,536877422,536877423,536877565,536877581,536877583,536877604,536877754,536877762,536878045,536878072,536878073,536878323,536878354,536878360,536878513,536878531,536879105,536880160,536880467,536880648,536881106,536881386,536881793,536882547,536886167,536886280,1073741827],"developers":[14],"publishers":[1],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[16,96,115,147,151,211,226,227,253,258,260,296,301,332,350,526,594,649,658,770,805,993,994,1019,1026,1120,1180,1345,1392,1471,1528,1905,2066,2105,2154,2177,2385,2488,2910,3182,3222,3533,3782,4130,4219,4235,4363,4392,4400,4415,4418,4419,4432,4449,4520,4619,4694,4863,4866,4869,4870,5095,5098,5121,5124,5150,5374,5478,5589,5679,5695,6055,6084,6456,6510,6511,6653,6669,6671,6692,6842,6850,7133,7160,7161,7411,7442,7448,7601,7619,8193,9248,9555,9736,10194,10474,10881,11635,15255,15368],"themes":[1,17,19,22,27],"genres":[11,15],"first_release_date":867283200000,"pulse_count":4,"platforms":[34,6,14,13],"release_dates":[{"category":0,"platform":34,"date":1381363200000,"region":2,"human":"2013-Oct-10","y":2013,"m":10},{"category":0,"platform":13,"date":867283200000,"human":"1997-Jun-26","y":1997,"m":6},{"category":0,"platform":6,"date":867283200000,"human":"1997-Jun-26","y":1997,"m":6},{"category":2,"platform":14,"date":1356912000000,"human":"2012","y":2012,"m":12}],"alternative_names":[{"name":"Dungeon Keeper Gold","comment":"Other"},{"name":"地城守護者","comment":"Chinese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jlfdpye07c8hclbpstcx.jpg","cloudinary_id":"jlfdpye07c8hclbpstcx","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/niwhz7gebexxi3tus8cv.jpg","cloudinary_id":"niwhz7gebexxi3tus8cv","width":766,"height":463}],"videos":[{"name":"Game intro","video_id":"8N5ODEGR1KQ"},{"name":"Trailer","video_id":"WlnRUE14ozA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yzqgmjedmto4ov9btgjq.jpg","cloudinary_id":"yzqgmjedmto4ov9btgjq","width":498,"height":600},"esrb":{"rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\r\nIt contains: Realistic looking violence.","rating":4},"websites":[{"category":2,"url":"http:\/\/dungeon-keeper.wikia.com\/"}]}