{"id":41135,"name":"Remote Control","slug":"remote-control","url":"https:\/\/www.igdb.com\/games\/remote-control","created_at":1498812626970,"updated_at":1515669987179,"summary":"Remote Control is based on the MTV quiz show of the same name. During the game three contestants (computer or human controlled) compete by answering questions about various TV shows, movies, characters, or actors\/actresses. There are two rounds of gameplay followed by a third \"think real fast\" round. \n \nIn the first two rounds of gameplay the gameboard consists of a giant TV with nine channels; one of the players chooses a channel (representing a particular category) revealing a question; the first player to buzz in and provide the correct answer earns points. The are a variety of categories available (some of these are \"video high\", \"cop shows\", \"saturday night live\", \"soap operas\", and many more) which will vary from game to game. Sometimes a surprise channel may appear which doesn't have a question, but awards or removes points from a player. These rounds end when all of the supplied questions have been exhausted. Near the end of the second round, the lowest scoring player is eliminated from the game leaving two players for the final round. \n \nThe final \"think real fast\" round lasts for thirty seconds; during this time the players need to answer as many short answer questions as possible to earn points. At the end of this round the player with the most points wins the game","popularity":1.333333333333333,"games":[11588,19083,25217,28213,19082,7782,69474,11529,51464,65832],"tags":[27,268435471,268435482,536871262,536871684,536873513,536875051,536875054,536875140,536875291],"category":0,"keywords":[350,772,2601,4139,4142,4228,4379],"themes":[27],"genres":[15,26],"first_release_date":619488000000,"platforms":[15],"release_dates":[{"category":0,"platform":15,"date":619488000000,"region":8,"human":"1989-Aug-19","y":1989,"m":8}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/twh6ik7upug6ps8wnwxn.jpg","cloudinary_id":"twh6ik7upug6ps8wnwxn","width":290,"height":413}}