{"id":635,"name":"Sid Meier's Civilization III: Conquests","slug":"sid-meier-s-civilization-iii-conquests","url":"https:\/\/www.igdb.com\/games\/sid-meier-s-civilization-iii-conquests","created_at":1317748693000,"updated_at":1515165038395,"summary":"Civilization III: Conquests is the second and final expansion for the award-winning and best-selling computer game Civilization III. It was published in 2003. This expansion added eight new civilizations to the game, and including the eight civilizations from Play the World this brings the total number of playable civilizations up to thirty-one (the maximum supported by the game). The new civilizations are the Byzantines, the Dutch, the Hittites, the Incans, the Mayans, the Portuguese and the Sumerians. In addition to these playable civilizations, graphics for the Austrians are present in the editor so one can replace an existing civilization. \n \nTwo new special traits are added in this pack: seafaring and agricultural. Many of the new civilizations take advantage of these new traits (e.g. the Sumerians are Scientific and Agricultural), and some old civilizations are changed to more appropriate ones (e.g. the English have been changed from Expansionist and Commercial to Seafaring and Commercial). \n \nNew governments have also been added to the game, Feudalism and Fascism, and new Wonders of the World such as the Statue of Zeus and the Mausoleum of Mausollos. Four new bonus resources have been included, two of which provide food bonuses to previously unprofitable terrain. Oases can now be found in deserts, tropical fruit in jungles, sugar on plains and hills, and tobacco on grasslands and hills. In addition, two new types of terrain have been added. These are marshes and volcanoes. Players cannot construct cities on marshes, and cannot improve volcanoes in any way. Like jungles and flood plains, cities that have at least 1 citizen working a marsh may succumb to disease. Volcanoes may periodically erupt, destroying all improvements and cities and killing any units in some or all adjacent squares. \n \nThe centerpiece of this expansion pack, however, was the inclusion of scenarios, intended for multiplayer gaming. Unlike the main (\"epic\") game, these scenarios took much less time to play, and focused on a specific period in history. \n \nGenerally the reception of this expansion pack was much better than that of Play the World. \n \nOne year after Conquests was launched, the latest Civilization III stand-alone version, Civilization III: Complete was also released. This version included Civilization III, Play the World and Conquests. This version also includes several patches. \n \nTwo years later, in 2005 Civilization IV was released.","collection":89,"franchise":10,"franchises":[10],"rating":75.1969393411517,"popularity":1.333333333333333,"aggregated_rating":90,"aggregated_rating_count":1,"total_rating":82.59846967057585,"total_rating_count":7,"rating_count":6,"game":310,"games":[310,8787,293,19130,4228,848,29173,2918,302,23345],"tags":[17,22,34,41,268435469,268435471,268435472,536871271,536871304,536871416,536871446,536871475,536871561,536871859,536871906,536872060,536872151,536873652,536873780,536873822,536874445,536874694,536875067,536875257,536875262,536875358,536875361,536875407,536875525,536875679,536875870,536876263,536876315,536876335,536876390,536876393,536876412,536876578,536876687,536876931,536876932,536877557,536877611,536879765,536879827,536880383,536881651,536882134,536883035,536883773,1073741827],"developers":[377,635],"publishers":[82],"category":2,"player_perspectives":[3],"game_modes":[1,2],"keywords":[359,392,504,534,563,649,947,994,1148,1239,2740,2868,2910,3533,3782,4155,4345,4350,4446,4449,4495,4613,4767,4958,5351,5403,5423,5478,5481,5500,5666,5775,6019,6020,6645,6699,8853,8915,9471,10739,11222,12123,12861],"themes":[17,22,34,41],"genres":[13,15,16],"first_release_date":1067904000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1067904000000,"human":"2003-Nov-04","y":2003,"m":11}],"alternative_names":[{"name":"Civilization 3: Conquests","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/q7ol8yuved2dcmq1fluw.jpg","cloudinary_id":"q7ol8yuved2dcmq1fluw","width":639,"height":907}}