{"id":6735,"name":"64th Street - A Detective Story","slug":"64th-street-a-detective-story","url":"https:\/\/www.igdb.com\/games\/64th-street-a-detective-story","created_at":1399549449533,"updated_at":1517270896754,"summary":"Players One and Two start with the two selectable protagonists, Rick and Allen. Each private detective uses different fighting styles, attempt to solve cases by beating up each criminal they encounter. Lots of special items can be found by throwing enemies into the background and breaking things, typical of this popular genre in the 1990s arcades. Along the way they are harangued by all manner of thugs and toughs, whose costumes range from 1980s hip-hop wear to stereotypical pirates. The bosses are tough by way of strange special attacks.","storyline":"The story starts out in a typical Double Dragon\/Final Fight style setting at 64th Street with two protagonists: Rick (Anderson), a calm and intelligent, 35-year old professional private detective and manager of the detective agency; and Allen (Tombs), a 19-year old, reformed delinquent trained by Rick, who is \"short-tempered and violent when angry\". At the start of the plot, an evil corporation known as the Legacy organization, kidnapped the daughter of a mid-aged rich man and left him a letter explaining why they kidnapped her.\n\nLate one night, before Rick and Allen was about to close their office, the mid-aged rich man, rushed inside the office while being exhausted. He asked for support on saving his daughter and gave the letter to Rick and Allen. The next day, Allen notices an advertisement in the classifieds with similar sentence structure to the letter left by the kidnappers. Rick couldn't understand it so easily, until Allen told him to look cautiously at both, the letter and the ad. They soon realised that the writing was actually a secret code, only understood by certain crime lords, so Rick and Allen struggled toward the main base of the Legacy organisation to find the truth and save the kidnapped daughter. The setting later takes on a steampunk feel as it goes along, coming to a head in a battle inside a blimp.","popularity":1.333333333333333,"games":[71455,10039,19934,14593,44076,7603,5370,28380,29147,1269],"tags":[1,268435460,268435481,536871213,536871889,536871894,536872581,536873064,536873208,536874398,536874745,536875095,536875125,536875198,536875199,536875523,536875731,536875758,536876273,536876334,536876490,536876665,536876910,536876989,536877063,536877293,536877440,536877943,1073741828],"developers":[2897],"publishers":[303],"category":0,"player_perspectives":[4],"game_modes":[1,3],"keywords":[301,977,982,1669,2152,2296,3486,3833,4183,4213,4286,4287,4611,4819,4846,5361,5422,5578,5753,5998,6077,6151,6381,6528,7031],"themes":[1],"genres":[4,25],"first_release_date":694137600000,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":694137600000,"human":"1991","y":1991,"m":12}],"videos":[{"name":"Gameplay video","video_id":"tDqkPLO7nXo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nzdewftadlykstitibuc.jpg","cloudinary_id":"nzdewftadlykstitibuc","width":640,"height":480},"websites":[{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/64th_Street:_A_Detective_Story"}]}