{"id":8435,"name":"Heroes Chronicles: Clash of the Dragons","slug":"heroes-chronicles-clash-of-the-dragons","url":"https:\/\/www.igdb.com\/games\/heroes-chronicles-clash-of-the-dragons","created_at":1420272726264,"updated_at":1513072637693,"summary":"Clash of the Dragons is the fourth part of Heroes Chronicles, following Masters of the Elements and preceding The World Tree.\r\nTarnum takes up the bow and defends the Elves and Dwarves of AvLee as a Ranger while opposing the tyrannical Queen of Nighon, Mutare, and her legions of murderous Dragons.","storyline":"In Clash of the Dragons, the good dragons leave AvLee. Having lived with these green and gold dragons for twenty years, Tarnum sets out on a quest to find them. He leaves Adrienne, the fire witch, to look after the orphan boy Waerjak while he is gone. Tarnum appoints the dwarf Kurbon as his master of supplies, and the elves appoint the druid Aspen as Tarnum's advisor. Tarnum and Aspen frequently play chess together, but Tarnum's aggressive tactics cause him to lose each time.\r\n\r\nTarnum speaks to the Dragontalker about the disappearance of the good dragons. The Dragontalker tells Tarnum about Mutare, an overlord who used the Vial of Dragon's Blood to turn herself into the Dragon Queen of Nighon, thus enslaving all dragons, good and evil, to her will. Tarnum steals this vial and uses it on the ten kidnapped Gold Dragon Mothers in order to restore the good dragons to their normal selves. While he does so, he rescues the ranger Valita from a demonic prison. Aspen, once a great spy, suspects Captain Valita of spying for Nighon, but Tarnum refuses to believe this.\r\n\r\nTarnum continues to battle against Mutare, even after she gains power over the mighty Rust, Crystal and Azure Dragons. To gain an advantage over Mutare, Tarnum seeks the aid of the Faerie Dragons. Aspen captures the harpy messenger who carries the spy reports to and from Nighon. The harpy claims that the notes are stuck to a tree with an arrow of green and black fletchings (the colors of Valita's arrows). Tarnum realizes that Kurbon is the spy because he knows all the troop movements and supplies the arrows for Valita whom he trained while in the Forest Guard. Kurbon shoots Aspen (who dies a few weeks later) before fleeing into Nighon.\r\n\r\nTarnum's lightning assault pushes Mutare back into Nighon territory, but now she focuses all of her forces against him. Valita is captured by the traitor, Kurbon. Tarnum eventually frees her by reminding Kurbon of who he really is, which leads to dwarf's second betrayal, this time of Mutare. Kurbon sacrifices his troops and his own life to liberate Valita. After Tarnum's victory on the border, Mutare is forced to retreat further into Nighon to plot Tarnum's death. Tarnum progresses further into Nighon and battles Mutare herself, crushing her armies and forcing her to flee. While weakened Mutare plans her revenge in Nighon, she is killed by unknown person in a coup for power, just like she herself once came to rule the Dungeons. Tarnum is called away again by the Ancestors, but he will always remember the time he spent in AvLee as the happiest time of his life.","collection":194,"franchise":458,"franchises":[458],"rating":40.561441895563,"popularity":1.333333333333333,"total_rating":40.561441895563,"total_rating_count":6,"rating_count":6,"games":[7615,23183,26940,28182,32510,932,77597,9472,40477,32851],"tags":[17,268435471,268435472,536871138,536871208,536871244,536873311,536874094,536874694,536875257,536875390,1073741827],"developers":[97],"publishers":[99],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[226,296,332,2399,3182,3782,4345,4478],"themes":[17],"genres":[15,16],"first_release_date":961027200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":961027200000,"region":2,"human":"2000-Jun-15","y":2000,"m":6}],"alternative_names":[{"name":"Хроники Героев: Схватки драконов"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tttyx6xtm6bfnpi2chjw.jpg","cloudinary_id":"tttyx6xtm6bfnpi2chjw","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dbxlbe9sk99bgssgypon.jpg","cloudinary_id":"dbxlbe9sk99bgssgypon","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rkgx2hy5vdpvtri8fbok.jpg","cloudinary_id":"rkgx2hy5vdpvtri8fbok","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qus90e5ox8jcjkv3u7jl.jpg","cloudinary_id":"qus90e5ox8jcjkv3u7jl","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vpumvjh01i79jrgvinjb.jpg","cloudinary_id":"vpumvjh01i79jrgvinjb","width":800,"height":600}],"videos":[{"name":"Game intro","video_id":"MF0acS1hJns"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rp36zl66apicfch39vsv.jpg","cloudinary_id":"rp36zl66apicfch39vsv","width":399,"height":500},"esrb":{"rating":3},"websites":[{"category":2,"url":"http:\/\/mightandmagic.wikia.com\/wiki\/Heroes_Chronicles:_Clash_of_the_Dragons"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Heroes_Chronicles#Clash_of_the_Dragons"}]}