{"id":87335,"name":"SpongeBob: Sponge on the Run","slug":"spongebob-sponge-on-the-run","url":"https:\/\/www.igdb.com\/games\/spongebob-sponge-on-the-run","created_at":1518700662013,"updated_at":1523427468996,"summary":"SpongeBob and Plankton are in a race to find the lost Krabby Patty formula somewhere in Bikini Bottom, Apocalyptic Bikini Bottom and a real-world beach. When he’s not running, SpongeBob is flying, floating in a bubble, or has Plankton jumping around his surreal imagination. And when the running gets tough, the tough get heroic! SpongeBob becomes Super SpongeBob to knock through any obstacle in his way!\n\nEXPERIENCE BIKINI BOTTOM\n• Laugh at hilarious dialog between SpongeBob and his arch-rival Plankton\n• Run through iconic locations including Bikini Bottom, Apocalyptic Bikini Bottom and out of water on a beach\n• Plankton helps SpongeBob with power-ups like shields and magnets\n\nUNEXPECTED TWISTS\n• Drive the Patty Wagon!!!\n• Adventure off the beaten path:\n- Float SpongeBob in a bubble through a coral forest\n- Plankton’s jetpack speeds past obstacles\n• Custom animation and voice-overs with SpongeBob and Plankton created just for this game!\n\nSpongeBob: Sponge on the Run was developed by Playside Studios in Australia, creators of the Worldwide Editor’s Choice 'Catch the Ark’ and the recently released Boulder Jack.\n\n***Minimum requirements are: iPhone 4S and above, iPad 3 and above, iPod touch (5G). This game is NOT supported on earlier generations.***\n____________________________________________\nSpongeBob: Sponge on the Run collects personal user data as well as non-personal user data (including aggregated data). User data collection is in accordance with applicable law, such as COPPA. User data may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content and advertising; and manage and improve Nickelodeon's services. For more information regarding Nickelodeon’s use of personal user data, please visit the Nickelodeon Group Privacy Policy below. Our Privacy Policy is in addition to any terms, conditions or policies agreed to between you and Apple, Inc., and Nickelodeon and its affiliated entities are not responsible for Apple's collection or use of your personal user data and information.  Additionally, this App may use “local notifications.” Local notifications are sent directly from the App to your device (you don’t need to be connected to the Internet) and may be used to notify you of new content or events within your App, among other reasons. Use of this app is subject to the Nickelodeon End User License Agreement.\n\nSpongeBob: Sponge on the Run offers in-app purchases and charges real money for additional in-app content. You may lock out the ability to purchase in-app content by adjusting your device’s settings.\n\nYou may have set up your Apple ID password to keep you logged on for 15 minutes after an initial in-app purchase. If so, additional purchases won’t require a re-entry of the password during this 15 minute interval. This is a function of how you set up your account and not within our control.\n\nFor users residing in the EU, SpongeBob: Sponge on the Run may include the use of persistent identifiers for game management purposes and installation of this app constitutes your permission to such usage of persistent identifiers for all users on your device.\n\nEnd User License Agreement: http:\/\/www.nick.com\/nick-eula\/\nPrivacy Policy: http:\/\/www.nick.com\/privacy-policy\/\nThe End User License Agreement for this app includes arbitration for disputes – see FAQs: http:\/\/www.nick.com\/faqs\/\n____________________________________________\nVisit the SpongeBob Movie site at http:\/\/www.spongebobmovie.com\nVisit our official site at http:\/\/www.spongebob.com\nFollow us on Instagram @spongebobmovie, Twitter at @spongebob or like us on Facebook at https:\/\/www.facebook.com\/spongebob\n\n© 2017 Paramount Pictures Corporation. All Rights Reserved. © 2017 Viacom International Inc. All Rights Reserved. Nickelodeon, SpongeBob, and all related titles, logos, and characters are trademarks of Viacom International Inc. Created by Stephen Hillenburg.","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[91053,90809,89110,88904,88873,88813,87621,87332,86863,39188],"tags":[268435489,536872030],"category":0,"keywords":[1118],"genres":[33],"first_release_date":1421884800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1421884800000,"region":8,"human":"2015-Jan-22","y":2015,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gfhmuuhgfr5fsiujaf9q.jpg","cloudinary_id":"gfhmuuhgfr5fsiujaf9q","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o2he9pnbbosdub54eo4k.jpg","cloudinary_id":"o2he9pnbbosdub54eo4k","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l6szsnstizol3uc84k0o.jpg","cloudinary_id":"l6szsnstizol3uc84k0o","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/btttnrbbp7uobnmub4zu.jpg","cloudinary_id":"btttnrbbp7uobnmub4zu","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/shbnvie9bjebgdzv8s6r.jpg","cloudinary_id":"shbnvie9bjebgdzv8s6r","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mtlwtqmjwdgnsi2whcin.jpg","cloudinary_id":"mtlwtqmjwdgnsi2whcin","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qxpadlz3w4rguecxacqm.jpg","cloudinary_id":"qxpadlz3w4rguecxacqm","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c5qpfzqffahw8aw7bvbv.jpg","cloudinary_id":"c5qpfzqffahw8aw7bvbv","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k6dg87ug4x4mimsfeq7k.jpg","cloudinary_id":"k6dg87ug4x4mimsfeq7k","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rzs4m8osoudxfjaqyzhh.jpg","cloudinary_id":"rzs4m8osoudxfjaqyzhh","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hnl0qdtoonctjurjuzu0.jpg","cloudinary_id":"hnl0qdtoonctjurjuzu0","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/spongebob-sponge-on-the-run\/id948805709?mt=8&uo=4"}]}