{"id":89135,"name":"Timmy's Kindergarten Adventure","slug":"timmys-kindergarten-adventure","url":"https:\/\/www.igdb.com\/games\/timmys-kindergarten-adventure","created_at":1519426584009,"updated_at":1523052225629,"summary":"On Sale For a Limited Time: 50% off!\nThere's never been an educational game like this before. Kids of all ages will enjoy learning basic skills by guiding their player on a kindergarten adventure!\n\nCreated in partnership with a teacher, Timmy's Kindergarten Adventure focuses on the basic skills learned in Kindergarten: \nBasic Math, Sight Words, Spelling, Telling Time, Counting Money, Color Mixing and more. \n(http:\/\/www.scholastic.com\/resources\/article\/preparing-for-kindergarten\/)\n\nWhat People Are Saying\n~~~~~~~~~~~~~~~~~~\n\"Since buying this App a few days ago, it's all my 5 year old has asked for. He has played it every day, and hasn't asked for any of his favorite non-educational games at all\"\n\n\n5 different challenges with varying difficulty to practice skills \n~~~~~~~~~~~~~~~~~~ \n\n• Math Birds - Pesky birds keep taking your fruit. Learn subtraction by figuring out how many fruits are left.\n• Clock Waterfall - There's a waterfall in your path. Find the log with the correct time to block the water get across the pond.\n• Word Mountain - How do you get over the gaps in the mountain? Touch the correct Dolch sight word to jump! \n• Math Bridge - Crossing a bridge can be tough when there's rocks weighing down one side. Figure out how many rocks are needed to balance it out with basic addition skills. \n• Word Maze - This corn maze is tricky but if you can identify the object that starts with the letter spoken, you'll make it through. \n\nWe automatically adjust the difficulty of each challenge as your child improves and reward them with a special 10c coin for \"leveling up\". \n\n\n7 school activities to help enrich your child's creativity \n(unlock new activities each time you reach the school) \n~~~~~~~~~~~~~~~~~~ \n\n• Monday: Painting and color mixing - four sized brushes can be used to paint pictures. Mix the 5 basic colors (red, blue, yellow, black, white) to create new colors to paint with.\n• Tuesday: Piano - there's a baby piano you can play. As you touch the keys, the notes are displayed on the sheet music above. \n• Wednesday: Learn to draw - trace the outlines step by step to learn how to draw. When you're done tracing, you can paint your creations.\n• Thursday: Remix - touch any of the buttons to turn on the music. Mix and match different buttons to create your own songs \n• Friday: Collage - create beautiful collages with different papers, shapes and stickers\n• Saturday: Bubbles - take a trip to the bubble geysers and have fun popping them. Look out for coins hidden in the bubbles!\n• Sunday: Bike race - jump on a bike and ride down the trail. Tilt your device to control the player as they go through puddles and markers \n\n\n What is the game like? What can I expect? \n~~~~~~~~~~~~~~~~~~~ \n\n- The game starts outside Timmy's house. Tap on the School sign when you're ready to start. \n- Timmy will need to complete 3 challenges on his way to school. Each time you start the game it will pick up from the level you last completed\n- At the end of each challenge, you'll win a coin. If you make no mistakes, you get two coins. These coins can be used to purchase mini games back at home.\n- Once Timmy reaches the school, tap on the calendar day to select the activity you'd like to play. If you've already unlocked today's activity, you'll win a key to unlock another activity. Reach the school 7 times to unlock them all! \n \n\nSpecial Features\n~~~~~~~~~~~~~~~~~~~ \n• Multi user support for classrooms and families with multiple kids\n\n\nDo you have feedback? \n~~~~~~~~~~~~~~~~~~~~~ \nWe love seeing your reviews, but if you have a complaint or feature request, please let us know directly. There's no way for us to write you back if you leave a review. We want to make our games better, what you think is really important to us. \n\nFacebook - http:\/\/facebook.com\/TantrumApps \nTwitter - http:\/\/twitter.com\/TantrumApps \nDirect - http:\/\/TantrumApps.com\/contact","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[95651,95287,90806,90796,89764,89732,89493,89304,89297,89129],"tags":[536872030],"category":0,"keywords":[1118],"first_release_date":1324425600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1324425600000,"region":8,"human":"2011-Dec-21","y":2011,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zaepextup90ju4xcfvl4.jpg","cloudinary_id":"zaepextup90ju4xcfvl4","width":360,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ah5qyld4ctfwwcefjtgu.jpg","cloudinary_id":"ah5qyld4ctfwwcefjtgu","width":360,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iubhgkcmazhj7gqvsgvv.jpg","cloudinary_id":"iubhgkcmazhj7gqvsgvv","width":360,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dmyf5n8vyak1fpqxq5pe.jpg","cloudinary_id":"dmyf5n8vyak1fpqxq5pe","width":360,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nzfqyu3u6z7fhnv95mmn.jpg","cloudinary_id":"nzfqyu3u6z7fhnv95mmn","width":360,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gswnuswktytnlrmh3i7x.jpg","cloudinary_id":"gswnuswktytnlrmh3i7x","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ykbaebvhhkmfmmrijb3p.jpg","cloudinary_id":"ykbaebvhhkmfmmrijb3p","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/syuu3lrgmqxhpiwxbthd.jpg","cloudinary_id":"syuu3lrgmqxhpiwxbthd","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/shoc65nhwb4bnszys0en.jpg","cloudinary_id":"shoc65nhwb4bnszys0en","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wt3ybrbx0bahk9eek7wp.jpg","cloudinary_id":"wt3ybrbx0bahk9eek7wp","width":640,"height":1136}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s1k511ica1nsfnumtoic.jpg","cloudinary_id":"s1k511ica1nsfnumtoic","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/timmys-kindergarten-adventure-fun-math-sight-words\/id489718169?mt=8&uo=4"}]}