{"id":103386,"name":"Heavy Rain - Special Edition","slug":"heavy-rain-special-edition","url":"https:\/\/www.igdb.com\/games\/heavy-rain-special-edition","created_at":1529286301213,"updated_at":1542816076460,"summary":"Heavy Rain is a cinematic psychological thriller from game developer Quantic Dream exclusively for the PlayStation 3. Dealing with a range of adult themes, the game revolves around a sophisticated plot and strong narrative threads that explore a complex moral proposition. You assume the role of multiple characters with very different backgrounds, motivations, and skills in a world where each player decision affects what will follow.","storyline":"The game focuses on four different characters; Ethan Mars, a father and main protagonist; Scott Shelby, a private eye; Norman Jayden, an FBI agent and finally Madison Paige, a photojournalist. They are very different characters and do not know each other at the game's point, but are all connected in the sense that they all have interest in the game's main antagonist, the Origami Killer.","popularity":1.333333333333333,"version_parent":493,"version_title":"Special Edition","tags":[1073741826,1073741825],"developers":[261],"publishers":[13634],"game_engines":[52],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[8296,17137],"themes":[1,20,31,43],"genres":[31],"first_release_date":1267142400000,"platforms":[9],"release_dates":[{"category":0,"platform":9,"date":1267142400000,"region":1,"human":"2010-Feb-26","y":2010,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kfay0l44b8ugaj3fmmao.jpg","cloudinary_id":"kfay0l44b8ugaj3fmmao","width":1169,"height":777}],"videos":[{"name":"Trailer","video_id":"YVYiJ3VSp60"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zkpwlet03bodloaphyz0.jpg","cloudinary_id":"zkpwlet03bodloaphyz0","width":800,"height":983},"esrb":{"synopsis":"In this cinema-style action game, players control one of four main characters whose lives are altered by events surrounding the investigation of the Origami Killer, a serial killer who kidnaps children in public places. Gameplay consists of controlling a character in a fully interactive environment; choosing a variety of action-, dialogue-, and decision-paths based on on-screen prompts; and watching as cinematic cutscenes progress the somewhat dark (film noir-style) storyline.\r\n\r\nPlayers may encounter victims at various crime scenes: a woman (fully clothed) in a bathtub tainted with blood; a child under forensic examination (though the scene is largely narrative and clinical, with no depiction of victim's face or signs of trauma). More direct depictions of violence include the following: a woman squirming and screaming as she catches on fire; a man impaled in the chest with a power drill; a female attacked in her own home by masked male assailants (the scene is prolonged); and a man shot (shown in slow-motion) by police officers. Blood sometimes accompanies the acts of violence—whether triggered or viewed passively.\r\n\r\nThe most intense instance of violence occurs during a \"lizard trial\" sequence in which players' character, Ethan, is forced to cut off a segment of his own finger to save his son's life: Several instruments (saw, scissors, knife, etc.) can be used to remove the finger; and though the camera pans away from the actual dismemberment—instead the blade, the blood, the scream—the scene's poring focus on Ethan's psychological tenor\/terror (the dread deliberation before the cut) may be unnerving for some.\r\n\r\nThe game contains sexual content and nudity. Shower cutscenes may depict a male character's bare butt; if players control the female character, her breasts and buttocks are also briefly visible. A more prolonged instance of nudity occurs during a female character's investigation of a seedy club owner: After getting him alone in a room, the player-character is asked to strip; at gunpoint, she dances topless in front of the man. The game also contains a prompt-based love scene (kissing and rubbing) in which players match on-screen cues to angle characters' mouths, remove shirts and blouses, unhook bras, and lower to the floor; a woman briefly appears topless amidst the dark shadows and heavy breathing—actual sex is never depicted as the camera fades to black.\r\n\r\nThe camera does not fade on characters addicted to the fictional drug Triptocaine, referred to as \"dope\" in the game: Players may see a character trembling next to open vials; lines of cut white powder on a table; and a man staggering from the drug's ill-effects, as the screen turns blurry. Consumers may also wish to know that the game contains strong profanity (e.g., \"f**k,\" \"motherf**ker,\" \"sh*t,\" and \"a*shole\"). Overall, the game's highly evolved motion-capture graphics (advanced renderings by 2010 standards) sharpen the sense of realism, increasing the impact of some aspects of pertinent content (the nudity, blood, violence, etc.).","rating":6},"pegi":{"synopsis":"This game is rated PEGI 18 which restricts availability to ADULTS ONLY and is not suitable for anyone below this age. This rating has been given due to violence towards defenceless persons, occasional threat of sexual violence and the use of sexual expletives.","rating":5},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Heavy_Rain"},{"category":2,"url":"http:\/\/heavyrain.wikia.com\/wiki\/Heavy_Rain_Wiki"},{"category":1,"url":"http:\/\/www.quanticdream.com\/en\/#!\/en\/category\/heavy-rain"}]}