{"id":1786,"name":"Mega Man Star Force 3: Black Ace","slug":"mega-man-star-force-3-black-ace","url":"https:\/\/www.igdb.com\/games\/mega-man-star-force-3-black-ace","created_at":1352061436023,"updated_at":1542165373089,"summary":"Mega Man Star Force returns in the most thrilling series adventure yet, delivering totally upgraded and cutting-edge online communication and device customization technologies through a portable RPG adventure that is brought to life in the iconic, action-driven Mega Man way! New to the series are \"Noise Changes,\" random enhancements that change Mega Man's form and unlock new abilities. There are more than 100 transformations possible. Mega Man Star Force 3 will be available in two versions, Red Joker and Black Ace, each with their own unique Noise Types. Mega Man Star Force 3 blends a unique formula of RPG exploration elements with fast-paced action, as players travel and battle between coexisting worlds, the physical world and the virtual Wave World. Players will encounter enemies in the virtual Wave World and battle them on three-by-five battle grids with their Battle Card deck. Mega Man Star Force 3 also adds a new feature called \"Rezon,\" which allow players to fill in profiles about battles and their team name\/symbol.","collection":343,"franchise":38,"franchises":[38],"popularity":2,"games":[55038,25311,36950,25300,22387,76397,35994,55092,27092,27405],"tags":[1,18,268435468,268435471,268435480,268435487,536871159,536871274,536871390,536871427,536871433,536871717,536871835,536871882,536871938,1073741827,1073741826],"developers":[37],"publishers":[37],"category":0,"player_perspectives":[2,3],"game_modes":[1,2],"keywords":[247,362,478,515,521,805,923,970,1026],"themes":[1,18],"genres":[12,15,24,31],"first_release_date":1226534400000,"platforms":[20],"release_dates":[{"category":0,"platform":20,"date":1226534400000,"region":5,"human":"2008-Nov-13","y":2008,"m":11},{"category":0,"platform":20,"date":1246320000000,"region":2,"human":"2009-Jun-30","y":2009,"m":6}],"alternative_names":[{"name":"Shooting Star Rockman 3: Black Ace","comment":"Japanese title"},{"name":"Ryuusei no RockMan 3: Black Ace","comment":"Japanese title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zi7rj4so5ijts7r8qdru.jpg","cloudinary_id":"zi7rj4so5ijts7r8qdru","width":640,"height":575},"esrb":{"synopsis":"This is a role-playing action game featuring characters and elements from the Mega Man franchise. Characters use 'battle cards' to defeat robots\/aliens on 3D fields in turn-based combat. When characters are hit, a quick burst of light signifies damage. During one cutscene, a boy and a girl are held prisoner, restrained by a blue laser-like force field. In another scene, a character uses the derogatory word scumbags to describe the enemies.","rating":3},"websites":[{"category":1,"url":"http:\/\/www.capcom.co.jp\/ryusei3\/"}]}