{"id":18786,"name":"Bomberman: Party Edition","slug":"bomberman-party-edition","url":"https:\/\/www.igdb.com\/games\/bomberman-party-edition","created_at":1460807865991,"updated_at":1513003496524,"summary":"Bomberman Party Edition, known in Japan and Europe as Bomberman, is a PlayStation version of the 1983 game Bomberman. In addition to vintage graphics for single player mode, an option for enhanced graphics is added.\n\nBattle mode is added to this release, which features 8 courses with 3 levels per course.\n\nThe single player mode is very similar to the 1983 release of Bomberman. The player controls the titular Bomberman in a wide area, full of destructible and non-destructible blocks. The blocks can be destroyed with bombs, and may contain a power up that increases Bomberman's walking speed, the size of Bomb explosions, the number of bombs able to be placed, or the ability to explode your bombs with the push of a button or to walk through walls or bombs. Some power ups are temporary, allowing Bomberman to be immune to bombs or monsters.\n\nThe point of each level is to destroy each monster, and then locate the door, which is located underneath a random block.\n\nAfter every few levels, the player can play a bonus level. The player is invincible, and an endless stream of monsters is to be destroyed by the player. The point is to try to build up score until a bonus life is awarded.\n\nSimilar in design to Super Bomberman, there are a number of level themes in the single player mode.","collection":549,"franchise":799,"franchises":[799],"popularity":1.333333333333333,"games":[11362,73075,9760,33603,36962,55888,65827,2015,32283,33383],"tags":[268435471,1073741827],"developers":[864],"publishers":[864,141,218],"game_engines":[336],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[3782,4164,4350,4372,5436],"themes":[1],"genres":[15],"first_release_date":913248000000,"platforms":[7],"release_dates":[{"category":0,"platform":7,"date":913248000000,"region":5,"human":"1998-Dec-10","y":1998,"m":12},{"category":0,"platform":7,"date":969321600000,"region":2,"human":"2000-Sep-19","y":2000,"m":9}],"alternative_names":[{"name":"Bomberman","comment":"Japanese title"},{"name":"Bomberman"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/izzlikeccnnhwh16jfmi.jpg","cloudinary_id":"izzlikeccnnhwh16jfmi","width":329,"height":321},"esrb":{"rating":3}}