{"id":39386,"name":"Martial Masters","slug":"martial-masters","url":"https:\/\/www.igdb.com\/games\/martial-masters","created_at":1498126922753,"updated_at":1515755911860,"summary":"At the end of the Qin's Dynasty, the government weakened by corruption was attacked by foreign influences. The people were flung into misery and became quite unsatisfied with the situation. They did not believe in the government anymore and turned their faith back to religion. \n \n \nThe White Lotus sect saw this as an opportunity and took over. They claimed to help the government to defeat foreigners and bring peace to the world. Their Ideology was quickly adopted. Everything related with the Western world was killed or destroyed. Anyone against this principal was considered an enemy and accused of being bound with the devil. Dragon of Martial Master and Master Huang of Po Chi Lam could not accept these outrageous actions so they band together in order to prevent much bloodshed. \nOne day the leader of White Lotus Sect sent an invitation to Dragon and Master Huang but Dragon's disciples saw this as a trap and recommended that they wait for Master Huang, who was out of town collecting medicine. The Master did not want to miss this opportunity to make peace and went alone. Unfortunately, he was captured and put in prison. Both parties started confrontations and have struggled since then. \n \n \nNow dangers are hidden all over the place. Who is capable of resolving the situation? Let's find out!","popularity":1.333333333333333,"games":[41828,56987,61162,44868,1235,74699,64350,58905,56039,46808],"tags":[268435460,536870973,536871019,536876114],"category":0,"keywords":[61,107,5202],"genres":[4],"first_release_date":917827200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":917827200000,"region":8,"human":"1999-Feb-01","y":1999,"m":2}],"alternative_names":[{"name":"Xing Yi Quan","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ndolbzrshwilo9atnm5z.jpg","cloudinary_id":"ndolbzrshwilo9atnm5z","width":850,"height":1204}}