{"id":76086,"name":"The Hidden Continent: Column of the Maya","slug":"the-hidden-continent-column-of-the-maya","url":"https:\/\/www.igdb.com\/games\/the-hidden-continent-column-of-the-maya","created_at":1511130146208,"updated_at":1511157331491,"summary":"The Hidden Continent: Column of the Maya is a hidden object adventure game. Apart for looking for the various hidden items, the player often has to interact with the scenery to open drawers, use items from the inventory and also solve logical puzzles. The built-in hint system recharges regularly and usually is very helpful. Sometimes it even allows to skip the whole puzzle entirely, though it doesn't apply for the hidden object locations nor for the final puzzle. Most of the hidden object screens are followed by mini-games, usually based on spotting differences. The story is presented in static cut-scenes and also with subtitles that describe the protagonist's thoughts. \n \nThe game is also marketed as the sequel to Journey to the Center of the Earth and with similar cover art design, even though the gameplay is entirely different and there are no story connections between the two games.","storyline":"Sarah Oldman is an art restorer, who spends her time closed in the basement office of her uncle's house. Sarah isn't happy with her current occupation and envies her uncle's career of a professor of archaeology. When she discovers he is missing and that he was searching for a mysterious Mayan artifact, she decides to follow his trail... but she isn't the only one who is looking for the mysterious column. She'll have to fight for the treasure with an adventurer named Miguel Alvarez.","popularity":1.333333333333333,"tags":[1073741825],"developers":[13916],"publishers":[2248],"category":0,"player_perspectives":[1],"genres":[9,31],"first_release_date":1279497600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1279497600000,"human":"2010-Jul-19","y":2010,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nxhu7ccygarm2fmdycrm.jpg","cloudinary_id":"nxhu7ccygarm2fmdycrm","width":1024,"height":768}],"videos":[{"name":"Trailer","video_id":"oCVncGxSybk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g0psseijwlemapzgua8v.jpg","cloudinary_id":"g0psseijwlemapzgua8v","width":496,"height":700},"pegi":{"rating":1}}