{"id":9686,"name":"Warm Gun","slug":"warm-gun","url":"https:\/\/www.igdb.com\/games\/warm-gun","created_at":1428860643660,"updated_at":1517270836556,"summary":"This single player adventure takes players on a post-apocalyptic ride through a decayed amusement park. Jammed packed with shooting ranges, mini games and a few surprises, players are invited to hone their skills in the many wonders of… The Carnival of Bullets!","storyline":"World War III has been fought to the tipping point and ecologists long unheeded cries have been silenced by the grim truth of their predictions. To the last drop of oil have the worlds resources been depleted, and only sporadic traces of modern structure can be sifted in the dust. Time ticks forward, but humans must retrace their advancement back; through a history that has already been lived and to the Wild West for the second time. We have trampled ahead to the past in muddy boots, to the United States of late 19th century.\n\nThis spun western lets you take control of 4 original characters; choose from weapons new and strange and a wider range of modern contraptions with primitive power. Classic and innovative, undoubtedly original, every FPS player will find satisfaction with Warm Gun.","popularity":1.666666666666667,"games":[10039,32902,34919,27314,28751,16468,17446,29525,40524,54639],"tags":[1,268435461,268435488,536871162,536871365,1073741825],"developers":[5170],"game_engines":[6],"category":0,"player_perspectives":[1],"game_modes":[2],"keywords":[250,453],"themes":[1],"genres":[5,32],"first_release_date":1356912000000,"platforms":[39],"release_dates":[{"category":2,"platform":39,"date":1356912000000,"region":8,"human":"2012","y":2012,"m":12}],"videos":[{"name":"Trailer","video_id":"98mxGb91Y8o"},{"name":"Trailer","video_id":"nop6pHXJxHA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rmcjhqnosnblsnfbhcfw.jpg","cloudinary_id":"rmcjhqnosnblsnfbhcfw","width":500,"height":500},"websites":[{"category":1,"url":"https:\/\/itunes.apple.com\/us\/app\/warm-gun\/id422088284?mt=8"}]}