{"id":53692,"name":"Survive on Mars","slug":"survive-on-mars","url":"https:\/\/www.igdb.com\/games\/survive-on-mars","created_at":1501612073177,"updated_at":1523385850818,"summary":"Survive on Mars is a first person survival game for Microsoft Windows. \n \nSurviving under the harsh conditions of Mars will be hard, but if you are strong enough, you will succeed. \n \nFind the best way to survive, but be careful, each wrong step will lead you to death. \nThe environment is your main enemy. The radiations, low temperatures and the atmosphere without oxygen will kill you. \nThe meteorites can also kill you and\/or destroy your base. \n \nThe modular system will let you create something as you like. \nCreate 3D parts by using a 3D printer and start building your base. \n \nThe abandoned rovers from Mars soil will give you parts to build a good rover. You also can create it with 3D printed parts. Or you can combine them and use the remaining parts to other projects. \n \nYour temporary home will be a spacecraft. You also will have few items to survive until you will make a farm, a base and other things that will help you to survive. \nYou can create water in 2 ways: \nBy 'boiling' the soil, and by burning hydrogen and oxygen. \nYou can grow different plants in your base: arabidopsis, mizuna lettuce, super dwarf wheat, apogey wheat, brassica rapa, rice, tulips, kalanchoe, flax, onions, peas, radishes, lettuce, wheat, garlic, cucumbers, parsley, dill, lettuce and cinnamon basil. \n \nYou can mine in different ways, but the simple one is to create a drilling machine and to place it where you want to drill. After it will finish drilling, you can get the 'drilled ore' and melt it to extract the metals. \n \nYou can use portable power banks to store energy from solar panels. If you want to use a PPB (Portable Power Bank) in a rover\/vehicle, you can do that to charge it and use it on a vehicle\/rover. \nBut, if you want to connect solar panels directly to the base, you can also do that. \n \nYou can sell goods (metals and other things) from Mars to Earth by using a small spacecraft. You will receive some coins and you can use them to buy something from Earth.","popularity":1.333333333333333,"games":[23175,37022,55289,42080,59516,44191,12579,25646,25311,1221],"tags":[1,268435487],"category":0,"game_modes":[1],"themes":[1],"genres":[31],"first_release_date":1504137600000,"status":4,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1504137600000,"region":8,"human":"2017-Aug-31","y":2017,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ffyjtscywmoyinp3mdw1.jpg","cloudinary_id":"ffyjtscywmoyinp3mdw1","width":1917,"height":906},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bgbqs9mtdkd9uqbfsjgc.jpg","cloudinary_id":"bgbqs9mtdkd9uqbfsjgc","width":1919,"height":907},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nfx8mxbohfvfqygwsm09.jpg","cloudinary_id":"nfx8mxbohfvfqygwsm09","width":1919,"height":907},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bocryrdtkffr3gtgedzf.jpg","cloudinary_id":"bocryrdtkffr3gtgedzf","width":1919,"height":906},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zsfeiq1mq2i5gqverpxn.jpg","cloudinary_id":"zsfeiq1mq2i5gqverpxn","width":1919,"height":908}],"websites":[{"category":1,"url":"http:\/\/somthegame.com\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/498630"}],"external":{"steam":"498630"}}