{"id":6792,"name":"Dungeons and Dragons: Tower of Doom","slug":"dungeons-and-dragons-tower-of-doom--1","url":"https:\/\/www.igdb.com\/games\/dungeons-and-dragons-tower-of-doom--1","created_at":1400062366544,"updated_at":1542510589164,"summary":"Tower of Doom is a side-scrolling arcade game featuring four different characters (cleric, dwarf, elf, fighter) fighting iconic Dungeons & Dragons monsters. Notable bosses include a troll that regenerates unless burned, a large black dragon, the dreaded Shadow Elf (Mystara's equivalent of the drow), a beholder, the optional superboss Flamewing (a great wyrm red dragon) and the final boss Deimos (an archlich). The gameplay is more technical than the average on beat'em up games. In addition to the usual basic attacks and jumping it includes blocking, strong attacks, turning attacks, dashing attacks, crouching and evading. It also requires the use of careful tactics, as most enemies have the same abilities as the heroes and can out-range them, too. As important as melee combat is ranged combat and the use of spells. Daggers, hammers, arrows and burning oils can be used as throwing weapons, and many enemies have similar weapons. Spells can be used by means of magical rings or by the two playable spellcasters (a cleric and an elf).","storyline":"The Republic of Darokin is under a terrible siege as the number of monsters and their attacks rise. A group of four adventurers step forth to rescue various areas, then are sent by the Corwyn Linton to investigate the attacks, revealed to be masterminded by the Archlich Deimos. Eventually the adventurers make their way to the Deimos' Tower of Doom and ultimately destroy him.","collection":830,"franchise":43,"franchises":[43],"rating":70.1401815203315,"popularity":1.333333333333333,"total_rating":70.1401815203315,"total_rating_count":4,"rating_count":4,"games":[100934,76253,99307,38280,101949,11510,91085,87728,90965,101257],"tags":[268435481,268435489,1073741828,1073741826],"developers":[37],"publishers":[37],"category":0,"player_perspectives":[2,4],"game_modes":[1,2,3],"genres":[25,33],"first_release_date":757296000000,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":757296000000,"human":"1993","y":1993,"m":12}],"videos":[{"name":"Gameplay video","video_id":"Rh2g34F0As4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jsgxamiyp9fiegajtfka.jpg","cloudinary_id":"jsgxamiyp9fiegajtfka","width":850,"height":1210},"esrb":{"rating":1},"websites":[{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/Dungeons_%26_Dragons:_Tower_of_Doom"}]}