{"id":51066,"name":"My Fitness Coach 2: Exercise and Nutrition","slug":"my-fitness-coach-2-exercise-and-nutrition","url":"https:\/\/www.igdb.com\/games\/my-fitness-coach-2-exercise-and-nutrition","created_at":1500059846023,"updated_at":1516632177006,"summary":"Customized fitness and nutrition game in one \n \nCustomized fitness and nutrition game in one: personalized workout with over 80 exercises per trainer and 130 healthy recipes based on your goals and needs. Pick from different trainers, environments, challenges and goals, and your personal trainer will coach you to get in shape and lose weight. \n \nFeatures \n \n• Motivational workout partners: Choose between 4 personal trainers (2 men and 2 women) who are based on real fitness coaches vs. in-game characters. \n• Customized workout regimen: Over 80 exercises per trainer with primary and secondary goals for both men and women: 25 for each, such as weight loss, get fit for holidays, lower cholesterol, new year\/new start, six packs for summer. \n• Personalized healthy meals: Over 130 recipes built around your specific needs (ingredient likes and dislikes) that will fit within your workout plan. Weekly menu and shopping list included. \n• Charting progress: See your success tracked and displayed graphically over time. \n• Variety of settings: Choose between four different workout environments (beach, gym, forest and mountain) & variety of challenges (dance, army, boxing, cardio, football).","collection":3562,"popularity":1,"games":[26766,6685,56961,50957,76888,6464,70703,61358,45709,39789],"tags":[268435470,536871689,536872983,536875140,536875151],"category":0,"keywords":[777,2071,4228,4239],"genres":[14],"first_release_date":1262649600000,"platforms":[5],"release_dates":[{"category":0,"platform":5,"date":1262649600000,"region":2,"human":"2010-Jan-05","y":2010,"m":1},{"category":0,"platform":5,"date":1265328000000,"region":8,"human":"2010-Feb-05","y":2010,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pog7kzlrhjgivxnpo6xy.jpg","cloudinary_id":"pog7kzlrhjgivxnpo6xy","width":640,"height":901},"esrb":{"rating":3}}