{"id":7566,"name":"Conquests of Camelot: The Search for the Grail","slug":"conquests-of-camelot-the-search-for-the-grail","url":"https:\/\/www.igdb.com\/games\/conquests-of-camelot-the-search-for-the-grail","created_at":1407183954460,"updated_at":1516158799242,"summary":"It is the most famous and sought after object in the world. It is the stuff that dreams and legends are made of. It is the one thing that will heal the heart of a king and breathe life into a dying land. More than all these things, it is a symbol of the trials of body, mind and spirit that all people face in their search for meaning and truth. Come with us to Camelot as the legendary King Arthur sets out on his ultimate quest.\n\nAs King Arthur, the weight of the world rests on your shoulders as you contemplate the task that lies ahead.\n\nIn pagan times, the legends of Camelot were told as epic tales full of fearsome battles and tests of faith. Bold, colorful, and often brutal, these tales survived the ages. They were a tribute to the legendary High King of Britain who managed to bring the warring tribes of Saxons, Celts, Angles and Jutes under one rule and bring about a rebirth of Western civilization.\n\nSadly, in the last half century, the Arthur legend has been recast as a cartoon and children's story. The mystic rituals and dark passions that colored the original Arthurian legends have been watered down to the soft and toothless fairy tales most commonly seen today.\n\nWith Conquest of Camelot, designer Christy Marx has dug deep into the most ancient roots of legend to restore the power and passion of King Arthur and his court: his queen's forbidden love for Sir Lancelot; the struggle for supremacy between Christianity and the ancient Roman warrior-god, Mithra. The blending of myth, history and religion behind the Grail legend is dealt with honestly and directly.\n\nThis combination of pre-Medieval history and ancient legend makes for a more sophisticated, complex and powerful view of Arthur than any you may have seen before.\n\nConquests of Camelot designer Christy Marx is best known for writing the \"Jem\" animated TV series, and the \"Sisterhood of Steel\" comics and graphic novel. With her husband and professional partner, illustrator Peter Ledger, she has researched Arthurian myths and legends extensively for many years in preparation for writing this game.","collection":1020,"franchise":754,"franchises":[754],"popularity":1.666666666666667,"games":[47823,19289,36534,11214,18398,13189,22425,36792,25222,7621],"tags":[17,268435487,536871139,536871179,536871208,536871470,536871939,536873066,536876007,536877148,536879186,536879216,536879693,536880674,1073741826],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[227,267,296,558,1027,2154,5095,6236,8274,8304,8781,9762],"themes":[17],"genres":[31],"first_release_date":662601600000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":662601600000,"human":"1990","y":1990,"m":12},{"category":7,"platform":13,"human":"TBD"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/inh918ukwellcv3z1myi.jpg","cloudinary_id":"inh918ukwellcv3z1myi","width":1413,"height":1757}}