{"id":24942,"name":"First Strike","slug":"first-strike","url":"https:\/\/www.igdb.com\/games\/first-strike","created_at":1476358780134,"updated_at":1476358990386,"summary":"Escalation is a downward spiral. A nuclear armageddon is no one’s dream scenario. So choose your steps carefully, it’s a small path between war and peace. FIRST STRIKE is a great strategy simulation featuring snappy gameplay and an intuitive interface that makes dropping the big one as easy as ABC. But be sure to take the right measures to guarantee your people’s safety. Pick one of the big nuclear players – from known Superpowers to an upstart hellraiser like North Korea – and plan your strategy wisely: What size of bombs to build, what kind of research to conduct, whether you’re a bloodthirsty warmonger or a tree-hugging hippie – it’s time to put your cards on the table.\n\nA quick and fun game with beautiful graphics, FIRST STRIKE shows you how little it takes to heat things up. With the tip of your finger you can control the destiny of the precious and vulnerable rock floating through space, the rock we call mothership Earth.","storyline":"Why does humanity still maintain so many nuclear bombs to destroy mothership earth more than 10'000 times? We have to solve this - Welcome to First Strike","popularity":1.333333333333333,"games":[34919,19341,25311,44242,36608,28465,37419,54999,55715,33603],"tags":[1,268435469,1073741827],"developers":[11274],"publishers":[11276],"category":0,"player_perspectives":[3],"game_modes":[1],"themes":[1],"genres":[13],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sag4rt2vjhyadnes1x8o.jpg","cloudinary_id":"sag4rt2vjhyadnes1x8o","width":1750,"height":656}],"videos":[{"name":"Trailer","video_id":"QjZ0sYeWSDI"}],"esrb":{"rating":5},"pegi":{"rating":3},"websites":[{"category":1,"url":"http:\/\/www.firststrike.mobi\/"},{"category":5,"url":"https:\/\/twitter.com\/firststrikegame"},{"category":4,"url":"https:\/\/www.facebook.com\/firststrikegame"}]}