{"id":27942,"name":"Chuusotsu – 1st Graduation","slug":"chuusotsu-1st-graduation","url":"https:\/\/www.igdb.com\/games\/chuusotsu-1st-graduation","created_at":1490388254383,"updated_at":1490388291632,"storyline":"\"Under the P3 law enacted under the Global People's Federation, citizens are ranked according to the Authorization Seals issued by the world government. \n \nAs spring arrives, the manga lover Marisugawa Arue, set back by a long-lasting illness, finds herself having to live her life as a \"chuusotsu\" - a person with no education beyond middle school. \n \nThe chuusotsu are not in possession of any Seals, and are considered to be failures at life. As such, their Authorized Power level is only 5 - young Arue's future is already looking mighty bleak. \n \n\"How will I be able to accomplish my goals now...\" \n \nIn order to break free of her grim situation, and reach her true goal in life, Arue applies for a government relief program where she will... \n \nShare a room with other chuusotsu!? \n \nHer two roommates are overwhelmingly unique: a taciturn girl in a souvenir jacket and a crazy otaku girl. \n \nAnd then the three girls are given group challenges to clear. \n \nWhat makes a wonderful life? \n \nSynchronize your minds and philosophize on this proposition. \n \n\"There's no way incompetents like us can do philosophy...\" \n \nTheir time is limited, and failure means that they will immediately get kicked out of the apartment! \n \nWill Arue manage to successfully complete the philosophical challenges and achieve a happy, steady-going life...!? \n \nThis is a philosophical story of how the three girls considered lame ducks by the society spend their unusual youth in a world where Authorization Seals decide the lives of all people.\"","popularity":1.333333333333333,"tags":[1073741829],"developers":[12378],"publishers":[6083,12378],"category":0,"player_perspectives":[5],"game_modes":[1],"keywords":[78,94,2425],"themes":[18,27],"genres":[32],"first_release_date":1471564800000,"pulse_count":1,"platforms":[6],"release_dates":[{"category":6,"platform":6,"date":1514678400000,"region":8,"human":"2017-Q4","y":2017,"m":12},{"category":0,"platform":6,"date":1471564800000,"region":5,"human":"2016-Aug-19","y":2016,"m":8}],"alternative_names":[{"name":"ちゅーそつ！1st graduation ～ちゅーそつのTime After Time～","comment":"Japanese title"},{"name":"ちゅーそつ！1st graduation","comment":"Japanese title"}],"videos":[{"name":"Game intro","video_id":"81JsUNnPMzw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bvx0t5xmc29gmt4uf9be.jpg","cloudinary_id":"bvx0t5xmc29gmt4uf9be","width":307,"height":437},"websites":[{"category":1,"url":"http:\/\/fruitbatfactory.com\/chuusotsu\/"}]}