{"id":41342,"name":"19: Neunzehn","slug":"19-neunzehn","url":"https:\/\/www.igdb.com\/games\/19-neunzehn","created_at":1498815471993,"updated_at":1516758751832,"summary":"A strategy war game for the Famicom Disk System, released by Soft Pro International. It was never released outside of Japan. \n \nThe title of 19 is based on the Greek pantheon of Gods, of which there are nineteen. \"Neunzehn\" is simply the number 19 in German. The player controls one of four heirs with an equal claim to the throne of the Greek hero Achilles. The latter sends the four to procure a magical stone that confers omnipotence to the user, originally left behind by the Greek gods. Through warfare, the player-chosen hero must defeat the armies of their three rivals and claim it for themselves. \n \nGameplay: \nThe game is a war strategy sim, where each player has an army to command and move into battle against other armies. The player starts off at a corner of the world map, depending on which side they chose to lead. Armies can be moved one at a time and once positioned the turn is over, the CPU sides move their units and the next begins. \n \nEncountering an enemy army switches the game to a hexagon-grid field where the goal is to plan out the movement and attacks of the four units under the player's command. However, each turn plays out simultaneously - the enemy moves when the player does, leading to several circumstances where an enemy is no longer standing in a spot that the player has targeted. Rather, the player has to guess based on their best judgement where the computer will move and then intercept them. \n \nThe game ends once every other side has been wiped out: Though the war is predicated on a search for a mystical stone, there is no stone to be found in-game.","popularity":1.333333333333333,"games":[55036,32510,77597,17613,29173,36553,9472,55590,33552,30457],"tags":[268435471,536873863,536874694,536875472],"category":0,"keywords":[2951,3782,4560],"genres":[15],"first_release_date":573436800000,"platforms":[51,58],"release_dates":[{"category":0,"platform":51,"date":573436800000,"region":5,"human":"1988-Mar-04","y":1988,"m":3},{"category":0,"platform":58,"date":576115200000,"region":8,"human":"1988-Apr-04","y":1988,"m":4}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jilfrcmyfuoajrwwfzpi.jpg","cloudinary_id":"jilfrcmyfuoajrwwfzpi","width":275,"height":304}}