{"id":74742,"name":"BURSTLY","slug":"burstly","url":"https:\/\/www.igdb.com\/games\/burstly","created_at":1508427140247,"updated_at":1508490892813,"summary":"Burstly is an action arcade game which is simple, but with endless fun. Touch your finger \nanywhere on the screen and slide on to avoid the traps and collect luminours. The only work you need to do is to pass the barriers and \nkeep away from the enemy traps (triangles) as you collect the points. \n \nYou will never get annoyed as far as you have the talent and skill to play the game. \nAs the level progresses the game becomes much more challenging. \n \nThe game features challenging physics based game-play and hours of replay value. Each level requires logic, skill and force to solve. \n \nI don't know if this is the best game for sure, but \nYou probably already know that ONLY TALENTED persons could PLAY this game... \nIts born for you and You are born for it. \n \nTRUST ME, YOU NEED THIS ....HURRY UP.... DOWNLOAD AND PLAY NOW.","storyline":"Burstly is cursed with an angry face and its not able to get back its cool happy face, until he collects the luminours. But he need to find the \npure white luminour to remove its curse. \nBut these luminours are guarded by powerful enemy traps that can destroy anyone who touches it. \nBurstly need to overcome all the enemy traps in order from bursting to ashes. \n \nThink wisely how to overcome all traps by either scooting them or by striking them with the other obstacles provided, to remove the enemies from your way or by controlling the movement of the character in right time and collect the luminours in the trap. \n \nIn short.. Escape the enemy traps and collect maximum points.","popularity":1.333333333333333,"tags":[1073741826],"developers":[13663],"category":0,"player_perspectives":[2],"themes":[1,21,43],"genres":[33],"first_release_date":1508284800000,"status":3,"platforms":[34],"release_dates":[{"category":0,"platform":34,"date":1508284800000,"region":8,"human":"2017-Oct-18","y":2017,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cn0qx6ahcpxnzi8jjcdx.jpg","cloudinary_id":"cn0qx6ahcpxnzi8jjcdx","width":720,"height":1280},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hjqr5klngi6wo0nbalc1.jpg","cloudinary_id":"hjqr5klngi6wo0nbalc1","width":720,"height":1280}],"videos":[{"name":"Trailer","video_id":"G7-9sXeFxCc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x3sov4i8ayxror7udepf.jpg","cloudinary_id":"x3sov4i8ayxror7udepf","width":1024,"height":500},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.nerampoke.burstly"},{"category":9,"url":"https:\/\/youtu.be\/G7-9sXeFxCc"}]}