{"id":87142,"name":"Bible Quizzer","slug":"bible-quizzer","url":"https:\/\/www.igdb.com\/games\/bible-quizzer","created_at":1518620902000,"updated_at":1518710714326,"summary":"Learn all about the Bible in this fun quick-fire quiz game! Answer correctly before time runs out, or it's game over! Gradually improve your knowledge of the world's most read book, and prove to your friends that you're the ultimate biblical expert! \n\n\"Great app! - Fun & interesting way to keep up on your bible knowledge.\" - 5\/5 stars \n\n\" This is such a wonderful app. I love to play it, it shows me where I need to read more.\" - 5\/5 stars\n\n\"Great Bible Study aide!!! - This app is really great and lots of fun! It's a wonderful way to memorize verses, challenge you memory of Bible facts and learn new information. It's an awesome way to engage your kids with literally hours of Bible fact fun! Good job on this one!\" - 5\/5 stars\n\n\"Love this app - it helps you learn a lot of the bible! My husband and I sit and play the quiz game together :)\" - 5\/5 stars\n\n\"Love it! - Keeps me occupied and on my toes. Best Bible trivia app I know!\" - 5\/5 stars\n\n\"Great Reminder, Good alternative to other Apps - Very enjoyable app. Great learning tool and reminder to think on God throughout the day. Thanks for making! Be blessed.\" - 5\/5 stars\n\n\"Love the game - quick and easy to get into and not too complicated for us older players!! Much better than candy crusher!\" - 5\/5 stars\n\n• How well do you know the world's most read book? Become a professional! \n• Learn all about the important people and characters from Biblical times. \n• Improve your knowledge of the various books of the Bible. \n• Discover more about the miracles which Jesus (and others) performed. \n• Answer quizzes about the most important events which took place in the Bible. \n• Become the ultimate theologian and test your knowledge against two timed modes. Experts only! \n• Power-ups! Use \"Freeze\" to stop the timer, \"Skip\" to jump to the next question, and \"Remove\" to blast away a wrong answer! \n• An addictive audio track accompanies detailed graphics and animations. \n• 6 free game modes, with 12 more available as an upgrade.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[88542,87662,86844,11588,91145,91127,90839,90182,89176,88863],"tags":[536873513],"category":0,"keywords":[2601],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uww4h2palj3tlvlhkvpl.jpg","cloudinary_id":"uww4h2palj3tlvlhkvpl","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vjrirdibz40s76bruink.jpg","cloudinary_id":"vjrirdibz40s76bruink","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gapdm3ibbir7xch3weqb.jpg","cloudinary_id":"gapdm3ibbir7xch3weqb","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/boqycnls5pe7u7ldipgk.jpg","cloudinary_id":"boqycnls5pe7u7ldipgk","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ohncsavjirmieczewn9f.jpg","cloudinary_id":"ohncsavjirmieczewn9f","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cs48bhaquadj5a7nbbwk.jpg","cloudinary_id":"cs48bhaquadj5a7nbbwk","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/bible-quizzer\/id609512191?mt=12&uo=4"}]}