{"id":111277,"name":"Chronicle of Innsmouth: Mountains of Madness","slug":"chronicle-of-innsmouth-mountains-of-madness","url":"https:\/\/www.igdb.com\/games\/chronicle-of-innsmouth-mountains-of-madness","created_at":1540191039627,"updated_at":1542348478689,"summary":"The second chapter in the \"Chronicle of Innsmouth\" saga. A team of scientists are attempting to be the first to reach a previously unknown chain of mountains higher than the Himalayas. Within a huge cavern they discover the alien bodies of hithertofore unknown creatures frozen in the ice walls.","storyline":"Mountains of Madness is the second chapter in the \"Chronicle of Innsmouth\" saga. \n \nPrivate Investigator Lone Carter regains conciousness to find himself lying, washed up, on a beach near Innsmouth. His body has been ripped apart. His life is coming to an end. He tries to pull his last cigarette from the pack. His arm fails to obey. As he fades away into death, terror growing in his eyes, he remembers: The encounter with the Shoggoth had, for him, been a fatal one. \n \nAn endless period of darkness ensues. \n \nThen, some burning fire within awakens him, and he returns, completely recovered and unharmed. Ever since this rebirth, Carter has been haunted by horrible nightmares. Extensive investigations lead him to discover a proposed expedition to the South Polar regions. A team of scientists are attempting to be the first to reach there a previously unknown chain of mountains higher than the Himalayas. Within a huge cavern they discover the alien bodies of hithertofore unknown creatures frozen in the ice walls. The mountains prove to hide the ruins of an alien civilization that, having come to the earth eons before, made it their home with the aid of their shapeshifting slaves: the Shoggoths. \n \nThese events concerning Carter occur ten years before those of Chronicle of Innsmouth, the first chapter in the saga, and will influence the stories of different characters in different eras, all entwined and linked by a common thread. We will travel to ancient Yemen, playing in the role of Abdul Alhazred - \"The Mad Arab\", the creator of the Necronomicon - and even step into the shoes of H.P. Lovecraft himself, guiding him along the path to unveil the mysteries of his bloodline. Mountains of Madness is a graphic adventure, oozing with twisty dread, which will drag all who play it to the very limits of their sanity... and perhaps beyond. \n \nFeatures: \n \n- Play as Lone Carter, Abdul Alhazred - \"The Mad Arab\", and H.P. Lovecraft himself! \n- Dozens of puzzles and characters to interact with, in a chilling South Polar region \n- A professional atmospheric art style rendered in 640 x 480 resolution \n- Everything in the hands of a massive Lovecraft geek as inspired by the master \n- Original soundtrack showcasing the underlying disturbing events","franchise":1339,"franchises":[1339],"hypes":1,"popularity":1,"games":[27266,13189,26658,25646,26298,36334,37419,28277,36759,18011],"tags":[19,268435487,268435488,536872206,536872328,536894226,1073741826],"developers":[15011],"publishers":[15011],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[1294,1416,23314],"themes":[19],"genres":[31,32],"first_release_date":1540857600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1540857600000,"human":"2018-Oct-30","y":2018,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jfl.jpg","cloudinary_id":"sc5jfl","width":600,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jfk.jpg","cloudinary_id":"sc5jfk","width":600,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jfj.jpg","cloudinary_id":"sc5jfj","width":600,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jfi.jpg","cloudinary_id":"sc5jfi","width":600,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jfh.jpg","cloudinary_id":"sc5jfh","width":600,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jfg.jpg","cloudinary_id":"sc5jfg","width":600,"height":337}],"videos":[{"name":"Teaser","video_id":"blJCJi4j-bA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1hbv.jpg","cloudinary_id":"co1hbv","width":460,"height":215},"websites":[{"category":1,"url":"https:\/\/www.mountainsofmadness.it\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/962700\/Chronicle_of_Innsmouth_Mountains_of_Madness"}],"external":{"steam":"962700"}}