{"id":24977,"name":"Until I Have You","slug":"until-i-have-you","url":"https:\/\/www.igdb.com\/games\/until-i-have-you","created_at":1476550514671,"updated_at":1540241525052,"summary":"Until I Have You is a 2D side-scrolling action platform video game which has 12 chapters with 4 stages and a unique boss each, taking place within a different setting. The goal for each stage is to get to the end of the stage as fast as possible without falling, getting killed or depleting your sanity gauge.\n\nCentral to Until I Have You is the exoskeleton suit. The suit gives the player special abilities at the cost of the player's sanity. The exoskeleton comes with the abilities to slow down time, ala Max Payne and to rewind time. However, overuse of these abilities will cause the sanity bar to deplete making your character lose touch with reality. When the sanity bar depletes your character starts to hallucinate, altering gameplay mechanics and level design.\n\nIn each stage, the player navigates his way from left to right through platforming sections, death traps, and enemies. The goal is to do this as fast as possible with the least amount of deaths. The fast pace of the game can make it difficult to plan a perfect approach. To make up for this, the game allows the player to restart each stage the moment they die, allowing them to quickly fine-tune their approach over several attempts. At the end of each chapter the player must also defeat a unique boss. Along the way the player acquires a number of weapons and upgrades that you can cycle through, all of which have a specific use.\n\nThe game grades the player's performance at the end of each stage based on a number of factors and given a percentage raring out of 100. Things you get judged on include method of death, whether you kill any of the enemies and what you killed them with.","storyline":"Until I Have You, is a story-driven, fast-paced, retro-aesthetic platformer, engulfed in a Cyberpunk setting.\n\nDriving you to the edge of your seat as you run n' gun through enemies, the game recounts a thrilling story of regret, love and corruption, in a city that’s gone haywire and just doesn't give a damn.\n\nThis is the story of the ARTIST, a talented assassin, who has worked many dirty jobs in a long and successful career. Finally heeding the pleadings of his wife, he has decided it's time to quit this ugly business and live a simple and peaceful life. However the ARTIST’s clients know he is irreplaceable, and are unwilling to allow the craftsman to hangup his tool belt. They send him this message by kidnapping his wife, Emily, and make it clear, retirement is not an option! The ARTIST is determined to get his wife back, and prepares himself for one last assignment. He understands to be successful he needs to go all out, and he procures a rare exoskeleton suit. Although this provides him with additional powers, it also can cause hallucinations and affect his judgment.\n\nIf you could save someone, how much of yourself would you be willing to sacrifice?","hypes":2,"rating":60,"popularity":1.666666666666667,"total_rating":60,"total_rating_count":1,"rating_count":1,"games":[19150,80916,33269,10039,25311,20342,24426,29032,18285,55173],"tags":[1,268435464,268435468,268435488,536871015,536871127,536871156,536872048,536872961,1073741828],"developers":[3188],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[103,215,244,1136,2049],"themes":[1],"genres":[8,12,32],"first_release_date":1459728000000,"pulse_count":1,"platforms":[6,14,3],"release_dates":[{"category":0,"platform":6,"date":1459728000000,"region":8,"human":"2016-Apr-04","y":2016,"m":4},{"category":0,"platform":3,"date":1459728000000,"region":8,"human":"2016-Apr-04","y":2016,"m":4},{"category":0,"platform":14,"date":1459728000000,"region":8,"human":"2016-Apr-04","y":2016,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tsx9zslpurv8nw1yf5qk.jpg","cloudinary_id":"tsx9zslpurv8nw1yf5qk","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sz4eghphra6hwp6zo6dq.jpg","cloudinary_id":"sz4eghphra6hwp6zo6dq","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xw2v81uwcerbkbsgwxo5.jpg","cloudinary_id":"xw2v81uwcerbkbsgwxo5","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gv5ibckg9qlytpixk2xg.jpg","cloudinary_id":"gv5ibckg9qlytpixk2xg","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/riuiwphka6pnm7zdrgsb.jpg","cloudinary_id":"riuiwphka6pnm7zdrgsb","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"k_TWJgDL5mU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nvhzpqgzmvstl5noubus.jpg","cloudinary_id":"nvhzpqgzmvstl5noubus","width":616,"height":353},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/439310"},{"category":1,"url":"http:\/\/untilihaveyou.com\/"}],"external":{"steam":"439310"}}