{"id":37277,"name":"duplicate Leisure Suit Larry II - Goes looking for Love (In Several Wrong Places)","slug":"duplicate-leisure-suit-larry-ii-goes-looking-for-love-in-several-wrong-places","url":"https:\/\/www.igdb.com\/games\/duplicate-leisure-suit-larry-ii-goes-looking-for-love-in-several-wrong-places","created_at":1497614727917,"updated_at":1500461764145,"summary":"Unlike the original Leisure Suit Larry in the Land of the Lounge Lizards, the game follows a linear story progression similar to Sierra's other adventure games, particularly later entries in the King's Quest series. The player character's movements are controlled via the cursor keys, the mouse or even the joystick, although a text parser is still used for all other actions. Rather than navigating through a single city, the player character is guided through a variety of puzzles and mazes. Players must take care in acquiring certain items over the course of the journey, lest they be stymied by an inescapable trap. Though there is no visible time limit, a number of pre-scripted events require players to act quickly in order to reach the next sequence. \n \nAs is standard in most Leisure Suit Larry games, the protagonist Larry Laffer's interactions with female non-player characters are accompanied by an on-screen portrait, though the images are much smaller than seen previously. The game actively punishes Larry for flirting with any woman he meets, a marked departure from the rest of the series; such acts invariably leads to Larry's violent death and a game over. Also included is a \"Trite Phrase\" option, which allows players to input a catchphrase which is repeated over the course of the game; the default is the notorious \"Have a nice day\".","popularity":1.333333333333333,"games":[14605,17469,75586,25130,43130,23175,28277,63734,29646,27266],"tags":[268435487],"category":0,"keywords":[1094],"genres":[31],"first_release_date":594518400000,"pulse_count":1,"platforms":[16],"release_dates":[{"category":0,"platform":16,"date":594518400000,"region":8,"human":"1988-Nov-03","y":1988,"m":11}]}