{"id":40577,"name":"Solaris","slug":"solaris","url":"https:\/\/www.igdb.com\/games\/solaris","created_at":1498481432350,"updated_at":1513006337806,"summary":"The Zylons are back, and are attempting another takeover of the galaxy! Your goal is to destroy all of the Zylon fighters you encounter, rescue cadets that are trapped on Zylon planets, and to find the planet Solaris to protect it from the Zylons. Your spaceship is equipped with a galactic map which can be used to warp to different sectors of the galaxy. The map shows the location of Zylon squadrons, Zylon planets, federation starbases, wormholes, clusters of stars, and Solaris when you find it. By warping to the correct sector, you can battle the numerous types of Zylon fighters to keep them from attacking federation bases and planets. Your spaceship has a limited amount of fuel; when you see the fuel gage get too low, you will need to warp to a federation starbase to refuel (make sure you leave enough fuel to warp). When flying over a Zylon controlled planet, you will see your cadets on the surface. If you rescue all of the cadets as you fly past, you will receive bonus points and an extra spaceship. The Zylon's have many different types of fighters which you will encounter, as well as some narrow corridors with blockades which you will need to clear in order to reach new locations in the galaxy.","popularity":1.333333333333333,"games":[68287,28029,36950,19341,25311,64204,142,27314,71455,34919],"tags":[1,18,268435461,268435469,536871859,536871882,536871937,1073741826],"developers":[190],"publishers":[190],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[947,970,1025],"themes":[1,18],"genres":[5,13],"first_release_date":536371200000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gozunvnrbylfbxcocjgp.jpg","cloudinary_id":"gozunvnrbylfbxcocjgp","width":1000,"height":1371}}