{"id":45277,"name":"Borderlands 2 Deluxe Vault Hunter's Edition","slug":"borderlands-2-deluxe-vault-hunters-edition","url":"https:\/\/www.igdb.com\/games\/borderlands-2-deluxe-vault-hunters-edition","created_at":1499503497966,"updated_at":1521886104002,"summary":"Gearbox sends gamers back to the Borderlands for a shooter-adventure sequel of high-velocity combat and custom character development. The first-person action plays out in dystopian outpost environments on the original game's planet of Pandora, five years later, as a greedy industrialist called Handsome Jack seeks to weed out the local populace through a series of gladiator matches. Players choose from four new character types, each with three branches of specialized development in the game's RPG-like experience system. Experience comes with kills and quest completions. \n \nExpanding on the original game, Borderlands 2's gun system can create millions of different computer-generated weapons, as well as shields and equipment enhancements. Non-player characters are more expressive, and quest outcomes have more influence on the game world. In addition to the dusty, desert settings of the first adventure, the sequel visits a number of new Pandora environments, including the merciless frozen tundra where the revenge-driven plotline begins. Online, over a local network, or in split screen, the game's co-op mode allows a second player to freely join and drop out of a game in session. \n \nThe \"Deluxe Vault Hunter's Collectors Edition\" offers players the full game, an authentic Marcus Kincaid bobblehead doll, a hardbound art book, a set of four collectible stickers, a map of Pandora, and DLC including a digital comic.","popularity":1.333333333333333,"games":[46892,41258,76246,19341,28029,32902,97018,96550,93794,88910],"tags":[268435461],"publishers":[294],"category":0,"genres":[5],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bvxwntxdxunzkv70jqag.jpg","cloudinary_id":"bvxwntxdxunzkv70jqag","width":1500,"height":1057}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xfca8qted2tjmqszco3c.jpg","cloudinary_id":"xfca8qted2tjmqszco3c","width":640,"height":325},"websites":[{"category":1,"url":"https:\/\/www.telltalegames.com\/talesfromtheborderlands\/"}]}