{"id":54677,"name":"Lona - Realm of Colors","slug":"lona-realm-of-colors","url":"https:\/\/www.igdb.com\/games\/lona-realm-of-colors","created_at":1502870719218,"updated_at":1517353618454,"summary":"\"Take the brush as Lona, a young girl on a journey to the deepest depths of herself. Beware though! For in the realm of colors the craving to explore can turn to a yearning to return in a blink of an eye. \n \nLona - Realm of Colors is an independent puzzle-adventure dwelling in the highly stylized and abstract past memories of Lona. \n \nWho is Lona? How did she come to be here? Push fear aside and command the paintings as the original artist, shifting the world to reveal the answers. Discover Lona’s past. Escape the Realm of Colors. Return to reality.\"","storyline":"\"Lona is a teenage girl, an artist, struggling with life's difficulties and hardships. Her only escape is her sketchbook and paintings in which she draws and paints to deal with life challenges. She is struggling to find inner peace with what has happened through her life. Her paintings of life changing incidents are both drawn from logical perspective of Mr. Ruppel or the chaotic view of Ms. Schmidt and you have to help her find the balance between these ever-conflicting feelings. Each scene and level tells a part of Lona's life story and the way she tries to deal with real life difficulties. You have to solve puzzles and use items important to her to try and bring her peace of mind. \n \nLona's story will be narrated in a non linear fashion with no dialogues and conventional narration methods. Instead you have to piece together all the clues given through levels, puzzles and an insane symphony of visual arts. This is our way of narrating a story of extreme emotions, one's inner conflicts and fighting to win against hardships of real life via a unique story telling medium called video game!\"","hypes":3,"popularity":1.333333333333333,"games":[27725,25222,26239,27266,26223,13189,236,25646,26163,29525],"tags":[43,268435458,268435465,268435488,1073741828],"developers":[13309],"publishers":[13309],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[43],"genres":[2,9,32],"pulse_count":3,"videos":[{"name":"Trailer","video_id":"yf5BgWuu-tQ"},{"name":"Teaser","video_id":"2rqwbbK8iA8"},{"name":"Trailer","video_id":"Rhw05svz7jU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zfi4elob6fg2nzjzq6qm.jpg","cloudinary_id":"zfi4elob6fg2nzjzq6qm","width":680,"height":962},"websites":[{"category":8,"url":"https:\/\/instagram.com\/lona_game"},{"category":5,"url":"https:\/\/twitter.com\/LonaGame"},{"category":4,"url":"https:\/\/facebook.com\/Lonagame"},{"category":1,"url":"http:\/\/lonagame.com\/"}]}