{"id":80877,"name":"Final Fantasy XV: Royal Edition","slug":"final-fantasy-xv-royal-edition","url":"https:\/\/www.igdb.com\/games\/final-fantasy-xv-royal-edition","created_at":1515444549838,"updated_at":1541497619862,"summary":"This special edition of the game includes all previously released downloadable content, as well as new areas to explore and quests to conquer.","collection":39,"franchise":4,"franchises":[4],"popularity":2,"aggregated_rating":73,"aggregated_rating_count":1,"total_rating":73,"total_rating_count":1,"version_parent":359,"version_title":"Royal Edition","games":[55038,81249,106987,47823,25311,101608,109463,25300,54775,113360],"tags":[1,17,18,21,33,268435460,268435468,268435487,1073741826],"category":0,"player_perspectives":[2],"game_modes":[1],"themes":[1,17,18,21,33],"genres":[4,12,31],"pulse_count":16,"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ar4d7.jpg","cloudinary_id":"ar4d7","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1hfl.jpg","cloudinary_id":"co1hfl","width":720,"height":1080},"esrb":{"synopsis":"This is an action role-playing game (RPG) in which players control a prince and his friends as they attempt to save their kingdom from evil forces. From a third-person perspective, players move around battlefields and city environments, perform various quests, and battle an assortment of human and fantastical enemies (e.g., demons, titans). Characters use swords, guns (e.g., pistols, machine guns, rocket launchers, sniper rifles), and magic attacks (e.g., exploding fireballs, blasts of ice) to defeat soldiers, monsters, and oversized animals in frenetic combat. Fights are highlighted by cries of pain, dramatic light effects, explosions, and realistic gunfire. A handful of cutscenes depict characters impaled on swords; one cutscene involves a woman being stabbed off-screen; another scene depicts a character with a bloodstained wound. During the course of the game, some female characters are depicted topless, with breasts that lack discernible details (i.e., no nipples). The word “sh*t” appears in the dialogue.","rating":5}}