{"id":87877,"name":"Craft The World - Pocket Edition","slug":"craft-the-world-pocket-edition","url":"https:\/\/www.igdb.com\/games\/craft-the-world-pocket-edition","created_at":1519226220504,"updated_at":1523454995097,"summary":"50% off for a limited time!\n\nCraft The World is a unique sandbox strategy game, the mix of Dungeon Keeper, Terraria and Dwarf Fortress. Explore a random generated world populated by dangerous creatures, build a dwarf fortress, gather resources, and craft all the items, weapons, and armor you need. \n\nPocket Edition contains all 4 worlds of the Steam version:\nhttp:\/\/store.steampowered.com\/app\/248390\n\nGOD-SIMULATION\nYou control a tribe of dwarves by giving them commands to dig in certain places, attack enemy creatures, and build houses and other structures. You'll need to provide your dwarves food and clothing, as well as help them with magic when fighting against other inhabitants of the world. You start the game with one dwarf and gain additional dwarves as your experience level increases.\n\nSANDBOX GAME\nEach game level has many layers of earth to explore, from the sky down to boiling subterranean lava. The level is randomly generated as an island, restricted by natural boundaries: oceans on the edges, lava beneath it, and the sky above. Other features include day and night and changing weather conditions. The worlds differ in size, humidity, temperature, terrain, and flora and fauna. Abandoned halls and rooms with treasure are hidden somewhere deep within the islands.\n\nCRAFTING\nOne feature of the game is a user-friendly system of recipes for crafting. The recipes are organized and easily accessible. You can craft dozens of different items: building blocks for houses, furniture, decorations, weapons, armor, ammunition, and food for your dwarves.\n\nRTS\nAt the outset you find the recipes for basic tools and items, and build a small house with places to sleep and eat. Then, the size of the tribe increases and catches the attention of other inhabitants of the world. Most of them are night creatures and dwell underground. The worlds are full of fantasy creatures like zombies, skeletons, goblins, beholders, ghosts, giant spiders, and others. Some of them pay little attention to the dwarves, as long as the dwarves do not come into their field of vision. Others gather into quite large groups and try to break into the dwarves’ residence.\n\nTOWER DEFENSE\nEspecially dangerous are the waves of monsters that appear from time to time from portals. So, do not neglect to build a safe haven with strong walls and numerous trapdoors, cells, firing towers, and secret passageways.\n\nMAGIC\nAs a divine being, you possess various spells. You can speed up the movement of the dwarves, open small portals, illuminate dark caves to scare away monsters, evoke natural magic in the form of rain or tree growth, hurl fireballs at the monsters’ heads, and find useful resources and hidden rooms underground, thereby helping to speed up resource extraction, exploration of the world, and the population growth of your assistants.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"category":0,"genres":[12,13],"first_release_date":1418342400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1418342400000,"region":8,"human":"2014-Dec-12","y":2014,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kqzwdxiyazwwpsisguvn.jpg","cloudinary_id":"kqzwdxiyazwwpsisguvn","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nhfpwihqa7indazxpkph.jpg","cloudinary_id":"nhfpwihqa7indazxpkph","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/afxspkdwzk9honfgdihe.jpg","cloudinary_id":"afxspkdwzk9honfgdihe","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tnjmhc7mxszwofdcg9fr.jpg","cloudinary_id":"tnjmhc7mxszwofdcg9fr","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ouijxluc4exui6cuytku.jpg","cloudinary_id":"ouijxluc4exui6cuytku","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lykwffglxr17iialcoqp.jpg","cloudinary_id":"lykwffglxr17iialcoqp","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rrxxphb4dldhgzmwtwvr.jpg","cloudinary_id":"rrxxphb4dldhgzmwtwvr","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ougflavmqaoo4d3xsq0w.jpg","cloudinary_id":"ougflavmqaoo4d3xsq0w","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/exkklne2qagnuaczsfst.jpg","cloudinary_id":"exkklne2qagnuaczsfst","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r3pqykrdfwv8paqxdcy8.jpg","cloudinary_id":"r3pqykrdfwv8paqxdcy8","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sowzlvo0znvpjpo9vrce.jpg","cloudinary_id":"sowzlvo0znvpjpo9vrce","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/craft-the-world-pocket-edition\/id921954809?mt=8&uo=4"}]}