{"id":9177,"name":"P·O·L·L·E·N","slug":"p-star-o-star-l-star-l-star-e-star-n","url":"https:\/\/www.igdb.com\/games\/p-star-o-star-l-star-l-star-e-star-n","created_at":1425172972435,"updated_at":1523412214013,"summary":"Pollen (Stylised P·O·L·L·E·N) is a first-person exploration game optimized for the upcoming Oculus Rift virtual reality headset.\n\nPollen is a first-person exploration game set on Titan, the sixth and largest moon of Saturn and the only moon in the solar system with an atmosphere and vast liquid seas, where life may exist. Inspired by science-fiction classics Solaris, 2001: A Space Odyssey and Moon, as well as adventure games Gone Home and The Dig, Pollen begins as the player docks and enters Research Station M. Inside the research station, the player moves from room to room and explores a fully interactable environment. Each step forward leads to new discoveries about the fate of the crew and the secrets that they have uncovered.\n\nPollen will be optimized for the upcoming Virtual Reality headsets and motion controllers on launch. If you own a VR headset you can enter Research Station “M” just like you were actually on Titan. \n\nThe gameplay will not take camera control away from you, use jump scares, have frame drops or any other clear discomforts of VR...except where its intentional like the drunk mode. The best movement type in VR for you can be chosen from the different movement modes (regular, comfort, 25 degree jumping etc.) and multiple tweaks are available from head bob to gamepad acceleration.","storyline":"After the failed assassination of President Kennedy, NASA combined forces with the Soviet space program. A permanent moonbase was established in the 70s and space technology kept booming throughout the decade as inventions such as anti-gravity allowed objects to be lifted cheaply into orbit. The famous moonbase became a tourist attraction in the 90s as commercial space flights continued to expand the frontier towards the outer solar system \n\nRama Industries is one of the many organizations expanding the human frontier. Though encountering a disaster from time to time they push forward and search for new possibilities in space. One of the most interesting being the latest findings on the saturnian moon Titan, where the research of Station “M” has taken a spotlight. \n\nThe five person research team has now been working on “M” for one year, expanding the base and making wonderous discoveries until two months ago when one of their technicians went missing in a work related accident and a replacement is needed.","hypes":3,"rating":50,"popularity":7,"aggregated_rating":60.5,"aggregated_rating_count":2,"total_rating":55.25,"total_rating_count":3,"rating_count":1,"games":[21564,13205,25311,19150,36198,22747,19301,17130,26870,20329],"tags":[18,268435487,268435488,536870984,536871029,536874098,536875046,536875783,536876291,1073741825,1073741831],"developers":[4933],"publishers":[4933],"category":0,"time_to_beat":{"normally":8640},"player_perspectives":[1,7],"game_modes":[1],"keywords":[72,117,3186,4134,4871,5379],"themes":[18],"genres":[31,32],"first_release_date":1461110400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1461110400000,"region":8,"human":"2016-Apr-20","y":2016,"m":4}],"alternative_names":[{"name":"Pollen","comment":"Stylised"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fvboup49q4pmjxs8rgnt.jpg","cloudinary_id":"fvboup49q4pmjxs8rgnt","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sychvhx0kuv4pnjmeobs.jpg","cloudinary_id":"sychvhx0kuv4pnjmeobs","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mtjth6ljur3k7bc9xucd.jpg","cloudinary_id":"mtjth6ljur3k7bc9xucd","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kkpq71hib7gyuropcryt.jpg","cloudinary_id":"kkpq71hib7gyuropcryt","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/esq2rcfx0ntcuwz5owbc.jpg","cloudinary_id":"esq2rcfx0ntcuwz5owbc","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"09FPsRLZl-Q"},{"name":"Gameplay video","video_id":"B1nNf2EcQW8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pahpm1707dnnwm3yshff.jpg","cloudinary_id":"pahpm1707dnnwm3yshff","width":267,"height":301},"external":{"steam":"393750"}}