{"id":107015,"name":"Wonder Blade","slug":"wonder-blade","url":"https:\/\/www.igdb.com\/games\/wonder-blade","created_at":1533952475240,"updated_at":1533985431417,"summary":"\"OMG! My dear princesses is kidnapped by the evil power! What are you waiting for, huh? Grab your weapon and get on the journey to save your princess and free the world! You’ll be surprised what’s waiting for you :) \n \nUtilizing all the combos and killer moves plus magic tricks you will defeat all the bad guys who got in your way! All the powerful weapons and coolest packages will make you an one of kind adventurer, you can disguise as a ninja hitting your enemies with frozen fish or a lightsaber holding galaxy trooper who likes to kick-ass! It’ll be all you! \n \nTons of fun-filled levels in game with various challenging bosses waiting for you, from high speed car chase in the thick forest to zombie army marching on the deserted land, mysterious haunted house to fishing competition in the deep ocean, riding dragon that spits fire and fighting side by side with intelligent robot, trust me :) This adventurous setting will give you the thrills and surprises that you’d never had before! \n \nFunny story paired with humorous characters plus awesome combat experiences, you will enjoy an awesome and fun adventure you’d remember for Long Long time! \n \nQuestion is........ \nAre you ready for this?!?!\"","popularity":1,"games":[76253,81147,26820,87728,103282,134,96414,81249,26879,16468],"tags":[1,17,268435481,268435489,1073741828],"developers":[16161],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[1,17],"genres":[25,33],"first_release_date":1533686400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1533686400000,"region":8,"human":"2018-Aug-08","y":2018,"m":8}],"videos":[{"name":"Trailer","video_id":"xZ_EoYThqAI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lmh5dkmnstor9pw1rhyo.jpg","cloudinary_id":"lmh5dkmnstor9pw1rhyo","width":246,"height":246},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/true\/id1410642865?platform=ipad"},{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/true\/id1410642865?platform=iphone"}]}