{"id":14315,"name":"Song of the Firefly","slug":"song-of-the-firefly","url":"https:\/\/www.igdb.com\/games\/song-of-the-firefly","created_at":1445877138544,"updated_at":1445887916489,"summary":"Song of the Firefly is a 3D exploration platformer. Explore the streets of post-apocalypse England as Sam, making use of gadgets left by Sarah and her firefly lantern to find your way around the world. With the lantern, you can make use of both light and dark to explore the world and use your gadgets in different ways. But be warned, total darkness will press in around you, and you may find yourself assaulted by shadows, which shun the light. \n\nThe game mixes traditional platforming with a free-roam, open world experience, creating an exciting and immersive world for you to explore, solve puzzles, and uncover the mystery behind the ruined world.","storyline":"The apocalypse has left the world barren and broken. Most of humanity has succumbed to the toxic fumes throughout the atmosphere, and the sky is shrouded in dark mist. Samuel and Sarah are two survivors, struggling to stay alive in an unforgiving world. Their survival relies on Sarah's ingenious gadgets, but when she goes missing, Sam begins a journey in order to rescue her and discover the truth about the past, armed only with a lantern that Sarah left behind, and the advice of the scientist Doctor Williams.","popularity":1,"games":[25646,27266,51485,55289,26848,37022,19289,25222,10039,25311],"tags":[1,268435464,268435487,268435465,268435488,536871338,1073741828],"developers":[7180],"publishers":[7180],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[426],"themes":[1],"genres":[8,9,31,32],"status":2,"platforms":[6],"release_dates":[{"category":7,"platform":6,"human":"TBD"}],"videos":[{"name":"Trailer","video_id":"1J1Jaf9yLZY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cz999ofylrg6pmeccku7.jpg","cloudinary_id":"cz999ofylrg6pmeccku7","width":1920,"height":1080},"websites":[{"category":1,"url":"http:\/\/www.arpeggiogames.com\/songofthefirefly\/"}]}