{"id":17015,"name":"Swordquest: Fireworld","slug":"swordquest-fireworld","url":"https:\/\/www.igdb.com\/games\/swordquest-fireworld","created_at":1454228873151,"updated_at":1513068368052,"summary":"Swordquest is an unfinished series of video games produced by Atari, Inc. in the 1980s as part of a contest, consisting of three finished games and a planned but never released fourth game. All of the games came with a comic book that explained the plot, as well as containing part of the solution to a major puzzle that had to be solved to win the contest. Fireworld was the second of the four games. Its room structure was based on the tree of life.","storyline":"After defeating many beasts of the Zodiac and another thief (Herminus) in Earthworld, the twins are transported to the \"central chamber\" where the \"Sword of Ultimate Sorcery\" and the \"Talisman of Penultimate Truth\" are kept. Upon reaching them, the sword burns a hole through its altar all the way to Fireworld.\n\nIn Fireworld, the twins split up to look for water, and Torr, with the aid of the talisman, summons Mentorr who shows Torr the \"Chalice of Light,\" which will quench his thirst. The twins reunite eventually and find the chalice. However, Torr drops it after he is startled, and it is revealed that the one they found was not the true chalice. Herminus then gives them the chalice, and it grows until it becomes large enough to swallow the twins and transports them to Waterworld.","collection":2026,"popularity":1.333333333333333,"games":[23175,37022,55289,42080,59516,44191,12579,25646,25311,1221],"tags":[1,268435487,1073741827],"developers":[2406],"publishers":[2406],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[274,296,687,966,1027,2875,5935,6062,9407,11027],"themes":[1],"genres":[9,31],"first_release_date":412905600000,"platforms":[59],"release_dates":[{"category":1,"platform":59,"date":412905600000,"region":2,"human":"1983-Feb","y":1983,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r5u6fyd6miowjtqiek0m.jpg","cloudinary_id":"r5u6fyd6miowjtqiek0m","width":600,"height":835}}