{"id":24015,"name":"Quick Step","slug":"quick-step","url":"https:\/\/www.igdb.com\/games\/quick-step","created_at":1474249117553,"updated_at":1517270839769,"summary":"Quick Step! is a unique take on the Q*Bert formula by adding two player action and a more frantic pace. You are a kangaroo who loves to paint trampolines green. However, a squirrel likes to paint them blue. Naturally, this can result in some hectic competition between the two. Jumping on one of the trampolines will turn it the color of your character and earn you points. During the game the trampolines scroll down to the bottom of the screen before they disappear. Naturally, you must avoid being on a trampoline when it disappears, otherwise you will lose a life. \n \nOccasionally, you may find a special square that will cause your character to flash. If you jump onto a trampoline where the other character is, they will be stunned briefly, giving you an opportunity to make them lose a life. What is truly unique is how the computer player also has a limited number of lives just like the human player does. After one player loses all of their lives, the other player is awarded extra points for his or her remaining lives. If you want to get big points, you have to adopt a different strategy to avoid having your opponent lose all their lives. Truly a unique and fun experience, although the game can be frustrating to play against the computer as you'll find it easy to stay alive longer than the computer.","popularity":1.333333333333333,"games":[36794,36608,34919,51485,22819,40524,51683,24199,23175,16468],"tags":[1,268435489,1073741826],"developers":[2522],"publishers":[2522],"category":0,"player_perspectives":[2],"game_modes":[1,2],"themes":[1],"genres":[33],"first_release_date":441676800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hpv2ffrvpi9tpj94mfsi.jpg","cloudinary_id":"hpv2ffrvpi9tpj94mfsi","width":1000,"height":1386}}