{"id":46615,"name":"The Plutonia Experiment","slug":"the-plutonia-experiment","url":"https:\/\/www.igdb.com\/games\/the-plutonia-experiment","created_at":1499641196018,"updated_at":1500470571426,"summary":"After Hell's catastrophic invasion of Earth, the global governments decide to take measures against any possible future invasion, knowing that the powers of Hell still remain strong. The UAC corporation is refounded under completely new management (the old trustees and stockholders are all dead in any case) and aims to develop tools that would prevent demonic invasions. It is said that the new UAC base is on one of Jupiter's moons, Io. UAC's scientists thought that this distance from Earth might prevent another catastrophic invasion, but as the events of TNT: Evilution showed, this was not the case. Something else would be needed. \n \nUAC's scientists start working on quantum accelerator devices intended to close interdimensional gates and stop possible invasions. The experiments are carried out in a secret research complex, with a stationed detachment of marines. The work seems to be going well, but... \n \nThe creatures from Outside have their dire attention drawn towards the new research. A gate opens in the heart of the complex and unnatural horrors pour out. The quantum accelerator performs superbly — the gate is quickly closed and the invasion stopped. Research continues more boldly. \n \nOn the next day, a ring of seven gates opens and an even greater invasion commences. For a single hour the quantum accelerators manage to close six of the seven gates... but the hellish army has become too numerous and too strong. The complex is overrun. Everyone present is slain, or zombified. The last gate of Hell remains open, manned and guarded by a demon Gatekeeper. \n \nThe government, frantic that the quantum accelerator will be destroyed or used in some evil alien fashion against humanity, orders all marines to the site at once. Doomguy is the closest one to the site and gets there first. There he concludes that by the time reinforcements arrive that the demons will be too numerous and powerful. \n \nThe marine decides to enter the complex and stop the Gatekeeper alone.","popularity":1.333333333333333,"games":[76246,19341,28029,32902,24920,272,68287,10039,68142,36608],"tags":[1,268435461],"category":0,"themes":[1],"genres":[5],"first_release_date":837561600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":837561600000,"region":8,"human":"1996-Jul-17","y":1996,"m":7}]}