{"id":715,"name":"Flight Unlimited III","slug":"flight-unlimited-iii","url":"https:\/\/www.igdb.com\/games\/flight-unlimited-iii","created_at":1317748916000,"updated_at":1513005277183,"summary":"Flight Unlimited III is a 1999 flight simulator video game developed by Looking Glass Studios and published by Electronic Arts. It allows players to pilot reproductions of real-world commercial and civilian aircraft in and around Seattle, Washington. Players may fly freely or engage in \"Challenge\" missions, such as thwarting a theft or locating Bigfoot. The development team built on the general aviation gameplay of Flight Unlimited II, with more detailed physics and terrain, more planes and a real-time weather system. Roughly half of Flight Unlimited II '​s team returned to work on the sequel, supported by new hires. \n \nLead designer Peter James described Flight Unlimited III '​s development as a struggle, thanks to a lack of interest from Electronic Arts and from Looking Glass's management. Placed in direct competition with Microsoft Flight Simulator 2000 and Fly!, the game failed to capture sufficient market share. It became one of Looking Glass's biggest commercial flops, with roughly 20,000 units sold in the United States during 1999. This contributed to the company's closure in 2000. The game was well received by critics, who praised its terrain rendering and dynamic weather. Its simulated physics were lauded by several reviewers, but others felt that the physics were imprecise, and that the game's system requirements were extremely high.","collection":166,"popularity":1.333333333333333,"games":[44242,18623,3353,22470,29173,26145,22425,55689,55590,23867],"tags":[268435469,536870968,536871904,536872060,536873364,536873753,536876701,1073741825,1073741826],"developers":[3],"publishers":[1],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[56,992,1148,2452,2841,5789],"genres":[13],"first_release_date":938649600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":938649600000,"human":"1999-Sep-30","y":1999,"m":9}],"alternative_names":[{"name":"Flight Unlimited 3","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vmvkpxju3ves3q3cuhco.jpg","cloudinary_id":"vmvkpxju3ves3q3cuhco","width":410,"height":500}}