{"id":89115,"name":"Call of Duty: Zombies HD","slug":"call-of-duty-zombies-hd","url":"https:\/\/www.igdb.com\/games\/call-of-duty-zombies-hd","created_at":1519425779381,"updated_at":1522676930911,"summary":"Featuring 2 incredible Zombie maps and a host of iPad-specific improvements, Call of Duty®: World at War: Zombies for iPad brings one of the most successful iPhone games to the iPad and is a remarkable example of what can be done on the platform.\n\n“Call of Duty: World at War: Zombies takes portable gaming to a whole new level.” - TotalApps.com\n\nCall of Duty®: World at War: Zombies for iPad features:\n• Two terrifying Zombie maps, “Nacht der Untoten” (Night of the Undead) and “Verrückt” (Zombie Asylum)\n• Stunning HD visuals and graphics improvements specifically for the iPad\n• Sensational audio enhancements will provide an even more startling experience\n• Streamlined controls and interface customized for the iPad\n• 4-Player Co-op Zombie-slaying via WiFi\n• Multiple control options for ease of play\n• Unlimited Zombies! Unlimited gameplay!\n\nABOUT CALL OF DUTY®: WORLD AT WAR: ZOMBIES FOR IPAD\nCall of Duty®: World at War: Zombies for iPad brings the classic Call of Duty®: World at War zombie-slaying game mode to the iPad. Featuring the original zombie map “Nacht der Untoten” (Night of the Undead) and “Verrückt” (Zombie Asylum), fight to survive in two adrenaline-pumping levels – and you can bring along up to 3 of your friends (4-player co-op via WiFi) to help push back the endless waves of attacking zombies!\nHighlights include:\n• Call of Duty®: World at War: Zombies for iPad supports up to four players via Wi-Fi\/Internet. Play with your friends in the same room, on the other side of town, and even across the globe. With the option of either private or open matchmaking, where there’s a Wi-Fi connection, there’s a friend to go Zombie-hunting with.*\n• This is the Zombie experience from Call of Duty: World at War. “Nacht der Untoten” has been fully realized on the iPhone™ in a silky smooth 3D environment, along with the return of your favorite guns and killer power ups. \n• “Verrückt” is an expansive insane asylum on the outskirts of Berlin that features an array of new weapons, life-saving Perks-a-Cola machines, and zombie-crisping Electroshock defenses.\n• Three different control schemes are available to suit your style. Take advantage of the iPad’s tilt capabilities or, for Zombie vets, use the virtual analog sticks to fend off the undead.\n• Call of Duty: World at War: Zombies for iPad features a full list of Achievements.\n• Leaderboard support awards the best of the best, accessed directly through your iPad. Become the top zombie slayer and prove your standings to the world!\n\n*Wi-Fi support only at this time, play unavailable on cellular networks.\nNote: In-game language is English\n\n***** CHECK OUT MORE GAMES FROM ACTIVISION! *****\nCall of Duty: Zombies, Guitar Hero, Crash Bandicoot Nitro Kart 3D, Crash Bandicoot Nitro Kart 2, Tony Hawk’s Pro Skater 2, Cabela’s Dangerous Hunts, Rapala Pro Bass Fishing, Geometry Wars: Touch, and Pix Maze","rating":80,"popularity":1.333333333333333,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[103312,78632,76747,37419,107926,86477,106987,87622,81249,76253],"tags":[1,268435487],"category":0,"themes":[1],"genres":[31],"first_release_date":1270080000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1270080000000,"region":8,"human":"2010-Apr-01","y":2010,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/brmipmeoxokeavphxclz.jpg","cloudinary_id":"brmipmeoxokeavphxclz","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pgkjzgess4haykbkfnuq.jpg","cloudinary_id":"pgkjzgess4haykbkfnuq","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ebuhl7vsy274flvqs1bq.jpg","cloudinary_id":"ebuhl7vsy274flvqs1bq","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dhfzcmdwf6vklbsrc3fb.jpg","cloudinary_id":"dhfzcmdwf6vklbsrc3fb","width":480,"height":360}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vthzge3mm5jpxetgtbeo.jpg","cloudinary_id":"vthzge3mm5jpxetgtbeo","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/call-of-duty-zombies-hd\/id364159440?mt=8&uo=4"}]}