{"id":105558,"name":"Cellyon - Boss Confrontation","slug":"cellyon-boss-confrontation","url":"https:\/\/www.igdb.com\/games\/cellyon-boss-confrontation","created_at":1532103621574,"updated_at":1536594938069,"summary":"Each battle lasts 20 minutes during which you are part of a team of 4 to 8 players and fight against one of the corrupted Children of Cellyon: a boss. Once the battle is over, you can play against the same boss, against another boss, or even change teams. During the battle you have control of your avatar inside a 3D environment.","storyline":"In the beginning, there was Cellyon, a friendly and benevolent celestial being. With his help, Hildra, a small planet of the Kodri system, prospered for thousands of years. \n \nCellyon had become used to spending time with the inhabitants of Hildra, advising them, guiding them along what he believed was the right path. Whenever he was incarnated on Hildra, he took the appearance of a man and always found a way to be close to the influential people on the planet. Every now and then, he became infatuated with a woman, and their love would bring into the world a child with outstanding abilities. Thus, the history of Hildra was punctuated with messiahs, intellectuals, and athletes with exceptional proficiency who left their mark with their inventions, feats, and works. \n \nUnfortunately, every rose has its thorns, and in time, Cellyon’s lineage changed, and just like an overripe fruit, began to spoil. Children would be born deformed and be abandoned, or when they had no deformity, would be violent and unpredictable. \n \nNow, 10,000 years after Cellyon vanished, mankind is caught up in a war between the Children of Cellyon, who have turned into powerful and evil demons. The governments on Hildra have worked together in order to create an organization for the protection of Hildran citizens: The Agency. Most of its recruits are uncorrupted Children of Cellyon. In their veins flows a tiny amount of the blood of this ancient celestial ancestor, often granting them superhuman strength or speed, or even some uncanny powers. \n \nThe members of The Agency are aided by every possible technological advance. Thus, the strongest ones can be equipped with impressive machinery worn directly on their back and allowing to fending them off the corrupted Children of Cellyon. Those with natural powers are entrusted with equipment enabling them to amplify this power. \n \nYou are one of these Children!","popularity":6,"games":[2283,30563,36607,75671,39181,20096,77412,55044,79392,67874],"tags":[536871060,1073741826],"developers":[10455],"game_engines":[13],"category":0,"player_perspectives":[2],"game_modes":[1,2,3,4,5],"keywords":[148,478],"themes":[17],"genres":[32],"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gq7u1bvrq7vf9nuvwkey.jpg","cloudinary_id":"gq7u1bvrq7vf9nuvwkey","width":1920,"height":834},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/z8zbddw1fggfuseu0try.jpg","cloudinary_id":"z8zbddw1fggfuseu0try","width":1920,"height":1335},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dn2pzjyyxib0ruvp6wbz.jpg","cloudinary_id":"dn2pzjyyxib0ruvp6wbz","width":1920,"height":897}],"videos":[{"name":"Trailer","video_id":"yyvX7Ib_el4"},{"name":"Gameplay video","video_id":"zVF7MtntTHI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xeyk8bnqeomgqgoweipe.jpg","cloudinary_id":"xeyk8bnqeomgqgoweipe","width":2480,"height":3132},"websites":[{"category":8,"url":"https:\/\/www.instagram.com\/sentrygames"},{"category":5,"url":"https:\/\/twitter.com\/sentryGamesTM"},{"category":4,"url":"https:\/\/www.facebook.com\/SentryGames"},{"category":1,"url":"https:\/\/www.playcellyon.com\/"}],"multiplayer_modes":[{"platform":6,"offlinecoop":true,"onlinecoop":true,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":true,"dropin":false,"offlinecoopmax":4,"onlinecoopmax":4}]}