{"id":12558,"name":"Cyberblast","slug":"cyberblast","url":"https:\/\/www.igdb.com\/games\/cyberblast","created_at":1442350309886,"updated_at":1465748953687,"summary":"More to shoot, dodge, and grab than in any arcade hit! The Trans-universal Portal experiment in our solar system is out of control. Unless you complete your mission, our world will be engulfed by an expanding rip in space. As the coalition's top trouble shooter, you have been elected to save the trans-universe. They fit you with powerful cybernetics and launch you on your way. Now the Cyberblast is up to you! Your mission...to survive Fastrax Laboratories and to find the missing computer chip that controls our future. By accomplishing this mission, you will seal the portal between the trans-universe before it's too late! The fate of our future rides on your reflexes, skill and total courage! Action packed arcade! Excellent sound effects as you wind your way through 64 action-packed levels- the clock is ticking and each level is more difficult to solve than the last. \n\nDiscover ID cards, magnets, maps, zappers, bombs, and grenades to help you destroy the enemies and walls that block your path. Dodge or destroy over 20 different size enemies- drones, seekers, bubblers, guardians, launchers, and gyros that dance, bounce, spin, and shoot. Watch for poisons, or make a quick search for a chemical cure- your enemies aren't just creatures who inhabit the lab. Compete with a friend- two player simultaneous mode.","popularity":1.333333333333333,"games":[28029,10209,68287,10213,76722,306,14250,17522,10210,17469],"tags":[18,268435461,1073741827],"developers":[7166],"publishers":[7166],"category":0,"player_perspectives":[3],"game_modes":[1,2],"themes":[18],"genres":[5],"first_release_date":725760000000,"platforms":[14,16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":2,"platform":14,"date":725760000000,"region":8,"human":"1992","y":1992,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b1yubscwwtprquargyv0.jpg","cloudinary_id":"b1yubscwwtprquargyv0","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bkgkmqocivc8mkiybrcf.jpg","cloudinary_id":"bkgkmqocivc8mkiybrcf","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jhrf2uqblulchxav5wo9.jpg","cloudinary_id":"jhrf2uqblulchxav5wo9","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kqfacruiisrazdqu5eur.jpg","cloudinary_id":"kqfacruiisrazdqu5eur","width":630,"height":805}}