{"id":1858,"name":"Tom Clancy's ruthless.com","slug":"tom-clancy-s-ruthless-com","url":"https:\/\/www.igdb.com\/games\/tom-clancy-s-ruthless-com","created_at":1356752322822,"updated_at":1515676710668,"summary":"This isn't business. This is war.\n\nHow far will you go?\n\nThe simultaneous turn-based strategy game that lets you build a corporation atop the bodies of your competition. Use thugs, hackers or the occasional lawyer to get what you want, the way you want. You don't need ethics, just greed, ego and a few wicked instincts.\n\nEver thrown a lawyer off a pier? Hacked into a mainframe to swipe classified information? If not, then it's time you went into business with Tom Clancy's ruthless.com.\n\nFind out if you have what it takes not only to survive but to dominate in an industry of cutthroats and corporate raiders. You can forget about ethics- succeeding here means putting all your strategy skills into beefing up your bottom line. But don't worry. You'll have help. A vicious gallery of hackers, thugs and lawyers are waiting to carry out your every greedy whim. And if they fail you, fire them. Or fire at them.\n\nJust don't expect this to be some sissy business sim. You and up to five other competitors do whatever it takes to build a software empire. In the end, the only thing anyone will remember is who comes out on top.","collection":3691,"popularity":2.333333333333333,"games":[29173,55036,55590,19934,76731,9199,932,21417,55689,23345],"tags":[268435471,268435472,536871906,536872131,536872581,536874694,1073741827],"developers":[717],"publishers":[717],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[994,1219,1669,3782],"genres":[15,16],"first_release_date":912384000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":912384000000,"human":"1998-Nov-30","y":1998,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lnsnq2r25dhoe1ffx3tu.jpg","cloudinary_id":"lnsnq2r25dhoe1ffx3tu","width":1600,"height":1819},"esrb":{"rating":3}}