{"id":19658,"name":"Naruto Shippuden: Legends: Akatsuki Rising","slug":"naruto-shippuden-legends-akatsuki-rising","url":"https:\/\/www.igdb.com\/games\/naruto-shippuden-legends-akatsuki-rising","created_at":1466172680167,"updated_at":1546447813416,"summary":"Based on the popular NARUTO Shippuden animated series from VIZ Media, players assume control of over 10 of their favorite ninja, including the dreaded Akatsuki. NARUTO Shippuden: Legends: Akatsuki Rising promises to deliver fierce ninja action as players re-live the NARUTO Shippuden storyline and experience a brand new adventure. Naruto and his friends are in for the fight of their lives as they search for Gaara, the fifth Kazekage, who has been kidnapped by the dreaded Akatsuki organization. It's a race against time as the Akatsuki attempts to release Shukaku, the demon sealed inside Gaara. NARUTO Shippuden: Legends: Akatsuki Rising boasts streamlined controls for the PSP, ensuring exciting, fast-paced tactical battles making best use of each character’s Jutsus. Aim and time the powerful Jutsu attacks with a simple button commands and devastate the enemies by entering Hypermode. As characters defeat the enemies or take damage, the Hyper Gauge will start to fill which enhance the Jutu or unlocks new Jutus. Players will be able to gain advantage in the heat of a battle by selecting two support characters to form a three-man team for each mission. Utilize the different skills each character brings and combine their attacks with yours to discover ultimate combos in defeating enemies. NARUTO Shippuden: Legends: Akatsuki Rising incorporates multiple modes of play including two-player cooperative or versus play via ad-hoc local wireless network. Original Mode lets players experience the Gaara Retrieval Arc as they battle enemies through lush, 3D anime inspired environments. Scenario Mode introduces all-new side-missions to pick up Skill Scrolls which increase your character's abilities including attack, defense, health and other numerous indicators reflected through all modes. Akatsuki Mode lets players gain control of members of the Akatsuki organization for the first time in a brand-new storyline, discovering the Akatsuki's true intentions while Naruto was searching for Gaara. Finally, find out who the best ninja is with Versus Mode by battling against a friend or the computer in one-on-one fights.","collection":2453,"franchise":221,"franchises":[221],"popularity":1.333333333333333,"aggregated_rating":72,"aggregated_rating_count":2,"total_rating":72,"total_rating_count":2,"games":[103288,43465,57372,62890,103269,59937,10039,76428,28010,4052],"tags":[1,268435460,536870990,536873174,1073741828],"developers":[1922],"publishers":[6330],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[78,2262],"themes":[1],"genres":[4],"first_release_date":1254787200000,"platforms":[38],"release_dates":[{"category":0,"platform":38,"date":1254787200000,"region":2,"human":"2009-Oct-06","y":2009,"m":10}],"alternative_names":[{"name":"Naruto Shippuden: Legends: Akatsuki Rising"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m1p4xlftuhkfkjmixoud.jpg","cloudinary_id":"m1p4xlftuhkfkjmixoud","width":480,"height":272},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ki0ymvl3zemazleqhsx9.jpg","cloudinary_id":"ki0ymvl3zemazleqhsx9","width":480,"height":272},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kwpnyml61vli9gikpuso.jpg","cloudinary_id":"kwpnyml61vli9gikpuso","width":480,"height":272},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gyl79p1pottba1hrp0b6.jpg","cloudinary_id":"gyl79p1pottba1hrp0b6","width":480,"height":272},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m5ffsbrikkasqs4pvcyf.jpg","cloudinary_id":"m5ffsbrikkasqs4pvcyf","width":480,"height":272}],"videos":[{"name":"Trailer","video_id":"-n8pHCCyeJc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b97gcdmcop9fr4tfcbkb.jpg","cloudinary_id":"b97gcdmcop9fr4tfcbkb","width":500,"height":864},"esrb":{"rating":5}}