{"id":20458,"name":"City of Heroes: Going Rogue","slug":"city-of-heroes-going-rogue","url":"https:\/\/www.igdb.com\/games\/city-of-heroes-going-rogue","created_at":1468689542004,"updated_at":1544912850264,"summary":"City of Heroes: Going Rogue was released in 2010. Unlike City of Villains, Going Rogue was an expansion rather than a Stand Alone and required the original game(s) to play. Going Rogue added an Alignment system, which allowed players to switch from Hero to Villain and added two intermediate Alignments: Vigilante, as a player progresses from Hero to Villain, and Rogue, as a player progresses from Villain to Hero. Players with Vigilante or Rogue characters had access to both City of Heroes's Paragon City and City of Villains's Rogue Isles until they change to Hero or Villain. The expansion also added the Praetorian Earth dimension where players could start out as neutrally-aligned Praetorians (choosing any of the ten basic Archetypes available to Heroes or Villains), either deciding to side with Emperor Cole's ruling faction and become a Loyalist or side with the Resistance; the allegiance could change as the player chose and completed missions. Praetorian players could also attack new Neutral mobs and would eventually be able to play a mission that allowed them to choose to be a Hero or Villain and complete gameplay in the original games. Going Rogue also granted access to four new power sets, new costume sets and auras, and introduced missions that started after defeating mobs that affected the player's Alignment.","collection":2263,"popularity":1.333333333333333,"game":7830,"games":[57372,62890,103020,47823,59937,34155,103054,80916,54775,56353],"tags":[1,268435468,536870926,536871382,536871812,536873299,536875281,536875778,536875798,536875848,536876027,536876174,536878245,536879742,536879774,536880294,536880643,536880812,1073741826],"developers":[916,3726],"publishers":[256],"category":2,"player_perspectives":[2],"game_modes":[5],"keywords":[14,470,900,2387,4369,4866,4886,4936,5115,5262,7333,8830,8862,9382,9731,9900],"themes":[1],"genres":[12],"first_release_date":1280620800000,"platforms":[6,14],"release_dates":[{"category":1,"platform":6,"date":1280620800000,"human":"2010-Aug","y":2010,"m":8},{"category":1,"platform":14,"date":1280620800000,"human":"2010-Aug","y":2010,"m":8}],"videos":[{"name":"Trailer","video_id":"shrT_sXrXKY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k4ufeing3fwoi99jhv83.jpg","cloudinary_id":"k4ufeing3fwoi99jhv83","width":640,"height":894},"esrb":{"rating":5}}