{"id":80858,"name":"Unleashed","slug":"unleashed","url":"https:\/\/www.igdb.com\/games\/unleashed","created_at":1515413406859,"updated_at":1539860642128,"summary":"A dark RPG based on sins and virtues. \n \nUnleashed brings modern graphics and popular game features to the traditionnal RPG. \n \nPlayers that grew with games such as the Pokemon series will love to see the game style they know applied to a darker and original story. \nTraditional RPG features such as turn based battles, exploration, inventory management and such were kept to have a strong base, and popular features were added such as farming, crafting, and even housing. Battles are team oriented, which allows building complex strategies to defeat strong ennemies. \n \nAn accent has been put on the world's richness. Never explore an empty world again: Mystria is filled with resources to harvest, random encounters to make, and secrets that are waiting to be discovered. Every time you explore a map, random elements will either spawn or not, which may open unknown paths. There is no level scaling in the game, and each of the 300 maps can be explored right from the beginning. Explore the world at your own risks! \n \nDuring fights, while one's soul can hold up to 10 Achivaras, but only 3 can be summoned at a time; strategies should be prepared thoroughly in order to win against strong opponents. Actions, which can be either of a sin or a virtue type, have different properties and can combo with other actions. If you don't have any Achivara alive anymore, the fight isn't over! In Unleashed, you have to fight yourself for your survival. \n \nFeedback from indie development forums: \n\"I am glad I took the time to click, because it looks great!\" - Typogre \n\"Certainly sounds like an interesting concept!\" - bfarnsey \n\"I love the art style.\" - ThylacineStudios \n\"This is potentially really cool-looking. I like the fact that you're taking the sort of modern action\/RPG aesthetic of weird monsters and demons and applying that to the old turn-based style that we mostly associate with elves, dwarves and goblins\" - infinitywaltz1 \n \nUnleashed has been made by a group of volunteers, which goal is to build a company after the release of the game, in late summer 2018. The first step to reach this goal is to successfully fund a KickStarter campaign, which will be launched the 13th of February.","storyline":"A powerful curse has been cast across Mystria. It changed people, who became the expressions of their primordial sin. Hiding their darkest impulses was impossible anymore and their burning desire was the only thing guiding them. The curse affected their soul deeply, breaking it into ten parts. Each of those parts could represent either a sin or a virtue, able to manifest itself into the physical world via entities called Achivaras.","hypes":1,"popularity":4,"games":[81249,26163,103303,26951,25877,54775,99118,19319,103282,17836],"tags":[17,38,268435468,268435488,536870984,536871327,536871338,536871422,536871455,536872015,536872371,536873337,536873913,536887624,536887625,1073741827],"game_engines":[221],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[72,415,426,510,543,1103,1459,2425,3001,16712,16713],"themes":[17,38],"genres":[12,32],"first_release_date":1538265600000,"status":2,"pulse_count":1,"platforms":[6],"release_dates":[{"category":7,"platform":6,"region":8,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fesvnthzwe3bs3tcfyzp.jpg","cloudinary_id":"fesvnthzwe3bs3tcfyzp","width":1200,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pa4uibyqhntf77vzvgk6.jpg","cloudinary_id":"pa4uibyqhntf77vzvgk6","width":960,"height":960},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aeqdxpmdebefgckosbmn.jpg","cloudinary_id":"aeqdxpmdebefgckosbmn","width":1200,"height":676},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bh5urb3gqhamqblb2zdt.jpg","cloudinary_id":"bh5urb3gqhamqblb2zdt","width":1200,"height":691},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/is4c4iixhfznuyfrah44.jpg","cloudinary_id":"is4c4iixhfznuyfrah44","width":1200,"height":675}],"videos":[{"name":"Trailer","video_id":"-6zAHkCpyiE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iit0dzzgtrkivwjdvzpx.jpg","cloudinary_id":"iit0dzzgtrkivwjdvzpx","width":200,"height":200},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/838690"},{"category":4,"url":"https:\/\/www.facebook.com\/UnleashedRPG"},{"category":5,"url":"https:\/\/twitter.com\/UnleashedRPG"},{"category":1,"url":"http:\/\/unleashed-rpg.com\/"}],"external":{"steam":"838690"},"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinemax":1}]}