{"id":111,"name":"Amnesia: The Dark Descent","slug":"amnesia-the-dark-descent","url":"https:\/\/www.igdb.com\/games\/amnesia-the-dark-descent","created_at":1300095550000,"updated_at":1548254138687,"summary":"The game, set in 1839, casts the player in the role of Daniel, a young man from London, who awakens in the dark halls of Prussian Brennenburg Castle with little to no memory about himself or his past. All he can remember is his name, that he lives in Mayfair and that something is hunting him. Shortly after waking, Daniel finds a note written by himself that explains how he purposely made himself forget his past, because he couldn't handle losing his innocence, so he wanted to forget it all. The note urges Daniel to descend into the castle's Inner Sanctum and murder a man named Alexander , the baron of the castle. The note gives a final warning that a \"living nightmare\" is chasing him, and Daniel must escape it for as long as he can because there is no way to fight back.","storyline":"Daniel explores the castle of Brennenburg. As he does, he occasionally finds a fleshy substance growing on the walls and doors, a sign of the \"nightmare\" getting closer and closer. Through the diary entries from Daniel's journal, scattered around the rooms, the backstory of the castle and the events that transpired there begin to become clear. Before his arrival at the castle, Daniel had gone on an archaeological expedition to Africa with his friend and colleague, Professor Herbert in order to research an ancient burial chamber. Whilst there, Daniel had encountered a large underground chamber during a dig, much older than the one they had expected to find based on their research. A sudden collapse of stone had trapped Daniel inside the chamber where he began to suffocate, but also experienced a strange vision of a glowing blue sphere of light. Attempting to grab it, he suddenly blacked out and soon woke up being rescued by Arab diggers with the pieces to an ancient Orb in his hands.   \n   \nDaniel returned to England at the request of Herbert and attempted to fit the pieces together but was puzzled to find out that they did not fit together. Stranger still, the pieces appeared to be changing shape and texture. To find out more, Daniel visited famed geologist Sir William Smith. The geologist was unsure of what was causing the changes, but explained to Daniel that over long periods of time, glass changes shape. Later, Daniel received a letter about the fate of the expedition he left behind and it was revealed that only the empty campsite was found. Herbert and his men had vanished and the lone survivor, who was grievously injured, kept rambling about something hunting down the expedition. Some of Herbert's journals were sent back to England and Daniel picked them up. The majority of the notes were only quick scribblings at most, but Daniel was confused to see that Herbert wrote he was trapped for over an hour, despite beginning to choke almost immediately. Stranger still, Herbert claimed to have descended into the ancient chamber and retrieved the Orb himself, making it impossible for Daniel to have the fragments.   \n   \nDaniel continues to explore Brennenburg Castle and is soon hunted by disturbing, nightmarishly mutilated creatures as well as the \"Shadow \". He also begins to experience visions of the events in the castle's past, including what Alexander, his target, had done in many of the chambers. Daniel is shocked to realize Alexander had been performing inhumane experiments on animals in order to find vitae , a substance he saw as essential for some sort of mystical ritual. He is also shown to be ruthless, even going as far as to poison and kill his own men to prevent them from telling the outside world what he had been doing inside the castle. Daniel also experiences flashback visions of him and Alexander talking to one another, presumably on their way to the Inner Sanctum. Daniel continues his journey down into the depths of the castle through the use of Alexander's elevator, which takes him down into the underground prison area of the castle.   \n   \nFurther diary entries show that despite being haunted by nightmares every night, Daniel was able to reassemble the Orb after waking from a nightmare. The object fitted together without any adhesive and sat in Daniel's drawing room in a complete form. Daniel went to Herbert's university to get some answers about the relic, and saw Professor Taylor to find out more. He learned that the Orbs appeared to have left a mark on English culture, even inspiring royal symbology. The Orbs had, supposedly, originally been wielded by priests. On his way out, he overheard a conversation from which he learned that William Smith had been killed only a fortnight after Daniel spoke to him. Through more flashbacks, Daniel learns he went to see Dr. Tate about his nightmares, but was not able to get a diagnosis. Days later, both Professor Taylor and Dr. Tate were killed in horrific ways, and this convinced Daniel that he was somehow to blame for their deaths. Thinking he would be next, Daniel tried contacting many names in Herbert's address book and received a cryptic response from a baron in Prussia who claimed he could protect him from some unknown force. The letter was signed 'Alexander' and urged Daniel to come to Brennenburg Castle immediately.   \n   \n   \nOnce at the castle, Daniel began to assist Alexander in various tasks designed to keep the living nightmare away from him. Revealed to be a Guardian of the Orb, the \"Shadow\" would not take long to arrive, despite being described as sluggish. During this time, Daniel also allowed Alexander to use his Orb in their attempted rituals to banish the Shadow later on. On a tour of the castle, Alexander revealed not only Brennenburg's function as a prison, but also that the inmates would be used in arcane rituals needed to save Daniel. The Shadow began to draw even closer, until finally the partial failure of a ritual allowed it into the castle. Panicking, Daniel told Alexander he would do whatever it took to survive and unwittingly played right into the baron's hands.   \n   \nBack in the current timeline, close to the Inner Sanctum, Daniel meets an old frail man chained to the wall near the castle's laboratory. The man is Agrippa , a friend of Alexander's, who helped him gain knowledge of the Orb's powers many years ago. His consciousness is now trapped in a dead husk so that Alexander may use him as a source of information. Agrippa asks Daniel to create a concoction to set him free from his body and stop Alexander from using the Orbs. Through finding the ingredients and the things needed to carry on, Daniel finds himself in a part of the castle littered with torture rooms and bodily remains. Through flashbacks and more diary entries, it becomes clear why Daniel chose to lose his memories at the beginning of the game.   \n   \nAlexander began telling Daniel about different methods of extracting vitae from the prisoners down in the castle depths, claiming the process would keep the Shadow away from him. Daniel followed him without question through his increasing desperation and helped to perform gruesome rituals of killing the prisoners through various methods of torture, thinking that he would save himself through the process. Using such items as an Iron Maiden and a brass bull, Daniel ended up becoming the very thing he was killing and even went as far as to kidnap local villagers and children from outside the castle to use for the rituals. Consumed by grief, regret and disgust at his actions, Daniel drank a memory-destroying Amnesia tonic to have a fresh start and fix what he had done. He realised that Alexander had manipulated him in order to obtain the Orb to achieve his goal and swore that the baron would die for his actions, leading to the events at the start of the game.   \n   \nAs he progresses, Daniel is attacked by a horde of creatures and locked up in one of the castle prison cells. He hears Alexander speaking to him telepathically, thanking him for his role in everything and for keeping the Shadow away from the baron. At this point, it is possible to end the game- Alexander asks Daniel to wait in the cell and let the shadow consume him, and it is possible to do just that. The cell will fill with the fleshy substance, Daniel will hear the voices of the people he's tortured, and then the shadow will kill him. If Daniel manages to escape, he will be able to return to the laboratory and find that the Shadow's influence has grown over absolutely everything. Agrippa asks Daniel for the potion. If the player has found the ingredients, then the potion can be made in the lab and fed to Agrippa. The old man then asks that his head be cut off and taken with Daniel to stop Alexander and get into a \"portal\" before he does. If the player did not find the ingredients, then Daniel enters the Inner Sanctum alone. He uses the power of his own Orb to open the way and goes to complete his objective.   \n   \nInside the massive chamber, Alexander awaits on a raised platform in front of one of the Orbs, engulfed in a blue glow. Surrounding the Orb are three fragile pillars that are feeding blue-hued energy to it in order to complete the ritual. Alexander thanks Daniel once again and rants about how he can finally return \"home\" once again. Three possible endings to the game can happen at this point.","collection":353,"rating":81.9050131102899,"popularity":8,"aggregated_rating":89,"aggregated_rating_count":3,"total_rating":85.45250655514495,"total_rating_count":164,"rating_count":161,"games":[2939,11270,9727,5601,19562,11233,7342,5647,11118,1334],"tags":[1,19,21,268435465,268435487,268435488,536871010,536871041,536871135,536871208,536871506,536871931,536871939,536872010,536872032,536872184,536872207,536872220,536872349,536872352,536872647,536872748,536872793,536872922,536873081,536873362,536873787,536874115,536874706,536874834,536875057,536875081,536875085,536875095,536875096,536875199,536875229,536875242,536875271,536875275,536875286,536875306,536875340,536875342,536875344,536875372,536875485,536875491,536875502,536875503,536875511,536875529,536875537,536875540,536875547,536875549,536875665,536875675,536875737,536875741,536875745,536875792,536875808,536875809,536875905,536875910,536876016,536876023,536876031,536876098,536876184,536876185,536876188,536876277,536876287,536876302,536876317,536876334,536876339,536876356,536876358,536876377,536876474,536876476,536876540,536876563,536876594,536876619,536876625,536876684,536877236,536877238,536877306,536877587,536877604,536878226,536878270,536879092,536879093,536879138,536879769,536879944,536879957,536880252,536880362,536880449,536881002,536881249,536883770,536883771,1073741825],"developers":[36],"publishers":[36],"game_engines":[279],"category":0,"time_to_beat":{"normally":27600,"completely":38400},"player_perspectives":[1],"game_modes":[1],"keywords":[98,129,223,296,594,1019,1027,1098,1120,1272,1295,1308,1437,1440,1735,1836,1881,2010,2169,2450,2875,3203,3794,3922,4145,4169,4173,4183,4184,4287,4317,4330,4359,4363,4374,4394,4428,4430,4432,4460,4573,4579,4590,4591,4599,4617,4625,4628,4635,4637,4753,4763,4825,4829,4833,4880,4896,4897,4993,4998,5104,5111,5119,5186,5272,5273,5276,5365,5375,5390,5405,5422,5427,5444,5446,5465,5562,5564,5628,5651,5682,5707,5713,5772,6324,6326,6394,6675,6692,7314,7358,8180,8181,8226,8857,9032,9045,9340,9450,9537,10090,10337,12858,12859],"themes":[1,19,21],"genres":[9,31,32],"dlcs":[15534],"first_release_date":1283904000000,"pulse_count":8,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1283904000000,"human":"2010-Sep-08","y":2010,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wad51g1rxhpwmkmbzyoi.jpg","cloudinary_id":"wad51g1rxhpwmkmbzyoi","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gyyicpkwuffdypssnuc2.jpg","cloudinary_id":"gyyicpkwuffdypssnuc2","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xvuh525qyxihrn8bnru0.jpg","cloudinary_id":"xvuh525qyxihrn8bnru0","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cwjli17pk0x9qk4af1dc.jpg","cloudinary_id":"cwjli17pk0x9qk4af1dc","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l2d3w5bt2mfpwxp84xs0.jpg","cloudinary_id":"l2d3w5bt2mfpwxp84xs0","width":1920,"height":1200}],"videos":[{"name":"Trailer","video_id":"u1nY_5-UrY4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/srebvpovqlpfkreynta4.jpg","cloudinary_id":"srebvpovqlpfkreynta4","width":794,"height":1000},"esrb":{"synopsis":"This is a horror-adventure game in which players assume the role of a man attempting to recover from self-induced amnesia. From a first-person perspective, players navigate castle environments, solve puzzles, and avoid zombie-like creatures. When players are attacked, splashes of blood appear on-screen; large bloodstains and pools of blood are also visible in some areas. Players can encounter human corpses lying on the ground: some are nude with visible male genitalia, while others are decapitated or dismembered (e.g., bloody torsos, severed arms). The word \"sh*t\" appears in the dialogue.","rating":6},"pegi":{"rating":4},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/57300"},{"category":1,"url":"http:\/\/www.amnesiagame.com"}],"external":{"steam":"57300"}}