{"id":11911,"name":"Archipelagos","slug":"archipelagos","url":"https:\/\/www.igdb.com\/games\/archipelagos","created_at":1441027199488,"updated_at":1508155647475,"summary":"Restore the Planet. Plastics. Poisons. Nuclear waste. Ozone-destroying gases. Genetic mutations. There was no end to what man did to make earth uninhabitable. And now man wants to reclaim it. \n \nSpecially trained ecological engineers, called Environmental Purifiers (EPs), are being sent to earth to undo centuries of damage. Is it too late? You're about to find out. Because you are one of our best EPs. \n \nYou'll enter the earth's hazardous atmosphere in a plasmic hoversphere. Then begin by destroying radioactive nodes and obelisks. You'll build land and fly across oceans. Avoiding mutant strains of experimental species, like poisonous Viral Trees and deadly Eco-Eggs. Or watch out for wandering Necromancers and sweeping air purifiers. \n \nThere have been others before you and we may as well tell you the truth: no one has returned alive. But you can do it. Because you have one thing the others didn't: a love for the Earth. \n \nExplore all 360 degrees of this living landscape. See the sky evolve from day to night. Watch plants grow and move, painting the landscape with their poison. Even when you're not moving, everything else in this animated 3-D world is. \n \nNode: The collector nodes funnel radioactive energy to the obelisk; so they must all be destroyed first. You may even need to create land bridges linking the nodes and obelisk, in order to \"short circuit\" the nodes. \n \nEco-Egg: The Eco-Egg was genetically cultivated to trap poisons in a bulbous flower. Which it does, until disturbed. Then its deadly poison pod explodes. \n \nViral Tree: This strain of Viral Trees protects itself by poisoning the land around it. It's constantly growing and forever inching its way towards anything with body heat. Leaving a wake of poison in its path. \n \nNecromancer: This was once an environmental Purifier. Now mutated into an aimless Necromancer, a lost soul who hovers around beaches, destroying coastlines. \n \nAircleaner: This whirling dervish is actually a highly sophisticated and extremely effective Air Cleaner called the 900-B. Problem is, it'll clean up everything. Including innocent EPs. \n \nObelisk: Each archipelago is home to a single obelisk that send out ultra-high doses of UV and GAMMA radiation. These are the heart of the problem- and must be destroyed before the island can be purged.","popularity":1.333333333333333,"games":[51978,19222,41348,17469,10225,27266,28029,23906,23297,236],"tags":[18,268435465,1073741825],"developers":[13279],"publishers":[7143],"category":0,"player_perspectives":[1],"game_modes":[1],"themes":[18],"genres":[9],"first_release_date":631065600000,"platforms":[63,13,16],"release_dates":[{"category":2,"platform":63,"date":631065600000,"region":1,"human":"1989","y":1989,"m":12},{"category":2,"platform":13,"date":631065600000,"region":1,"human":"1989","y":1989,"m":12},{"category":2,"platform":16,"date":631065600000,"region":1,"human":"1989","y":1989,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fewg1tc1jimd2kwfxpmh.jpg","cloudinary_id":"fewg1tc1jimd2kwfxpmh","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yo0donqaekk3xxdu8hq6.jpg","cloudinary_id":"yo0donqaekk3xxdu8hq6","width":320,"height":200}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pxnscxv4iovlxm5990si.jpg","cloudinary_id":"pxnscxv4iovlxm5990si","width":630,"height":767}}