{"id":42511,"name":"The Jetsons: Invasion of the Planet Pirates","slug":"the-jetsons-invasion-of-the-planet-pirates","url":"https:\/\/www.igdb.com\/games\/the-jetsons-invasion-of-the-planet-pirates","created_at":1499074250502,"updated_at":1515606609507,"summary":"George Jetson was about to run out to work when his pal Captain Zoom appears out of thin air. Zoom tells him that Zora, the leader of SPREE (\"Space Pirates Revelling in Evil Enterprises\"), is planning on looting this solar system of all its resource! Unfortunately, in his last encounter with Zora, Zoom has used up all his strength and now he is powerless so he asks George to take over. He gives George his Pneumo Osmatic Precipitator (or P.O.P.) and bids him good luck. Can George save his family and this galaxy? \n \nGuide George through 9 stages of intergalactic action armed with only his wits and the P.O.P....which is like a super vacuum. The P.O.P. can be used as a traveling tool by sucking onto walls and ceilings, it will enable George to climb up and across platforms. As a weapon, the P.O.P. can be used to suck up blocks or enemies and spit out at other enemies. George can also use the P.O.P. to breathe under water! Talk about multi-functional! \n \nGeorge's conditions are indicated by the number of hearts he has at the top of the screen. By collecting more hearts, it will refill George's health. Food items will increase your score and by getting a high enough score in each stage, you may get to play a bonus game.","collection":4932,"popularity":1,"games":[55752,25646,19174,68287,26766,25300,29525,76229,28154,36950],"tags":[1,18,19,268435464,536870990,536871882,536872032,536872552,536872961,536875054,536875151,536875291,536876208,536880135],"category":0,"keywords":[78,970,1120,1640,2049,4142,4239,4379,5296,9223],"themes":[1,18,19],"genres":[8],"first_release_date":760060800000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":760060800000,"region":8,"human":"1994-Feb-01","y":1994,"m":2}],"alternative_names":[{"name":"Yokai Buster: Ruka no Daibouken","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/haveys0fuebwe7uf8mck.jpg","cloudinary_id":"haveys0fuebwe7uf8mck","width":475,"height":347}}