{"id":51211,"name":"Astro Avenger 2","slug":"astro-avenger-2","url":"https:\/\/www.igdb.com\/games\/astro-avenger-2","created_at":1500062115471,"updated_at":1500456360904,"summary":"In the decade since the Global Political Crisis, mankind has entered its second golden age planning to expand the man’s presence further in the Galaxy. But all the plans for the prosperous future crashed with the abrupt appearance of the hostile alien fleet destroying everything on its way. Humans found themselves on the verge of extinction and endeavored to resist the enemy. But all the attempts would have been vain had it never occurred to them to find and assemble the secret weapon which might reverse the flow of war to their favor. Astro Avenger 2 is a stunning comeback of the classic space scroller that lifts up the level of action, dynamics and drive in modern arcades. The detailed setting along with spectacular graphics abundant with modern visual effects and atmospheric futuristic soundtrack in the Hollywood style will not leave you indifferent and challenge your reaction and stamina by rash action operations in five immense worlds. \n \nThere are 50 levels in 5 different worlds, 35 kinds of units and 15 types of weapons available in Astro Avenger 2. The gameplay, as the genre implies, represents a series of action operations the goal of which is to find all the pieces of the secret weapon which will reverse the flow of the war. Destroying alien ships the player collects plazma (the substance that the assembled secret weapon operates on) which can be further exchanged for new types of weapons or details for the ship comprehensive modernization in the nearest space-shop.","popularity":1.666666666666667,"games":[46892,41258,76246,19341,28029,32902,97018,96550,93794,88910],"tags":[268435461],"category":0,"genres":[5],"first_release_date":1183680000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1183680000000,"region":8,"human":"2007-Jul-06","y":2007,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vmfzrustjjclfqbeoy0x.jpg","cloudinary_id":"vmfzrustjjclfqbeoy0x","width":1500,"height":1308}}