{"id":42046,"name":"Formation Soccer: Human Cup '90","slug":"formation-soccer-human-cup-90","url":"https:\/\/www.igdb.com\/games\/formation-soccer-human-cup-90","created_at":1499067703380,"updated_at":1516647022199,"summary":"A Japan-only soccer game developed by Human for the 1990 World Cup in Italy. It was the first in the Formation Soccer series. \n \nFormation Soccer: Human Cup '90 is a soccer game for the PC Engine that was released in Japan exclusively. It is the first of the Formation Soccer games from Human Entertainment: many of which would end up on the Super Famicom\/Nintendo as \"Super Formation Soccer\", in a similar pattern as Human's Fire Pro Wrestling series which also became Super Fire Pro Wrestling once they started coming out on the Super Famicom. Formation Soccer uses a vertical-scrolling view of the pitch. \n \nThe game was designed and released to coincide with the 1990 World Cup event set in Italy. It features sixteen teams, though only eleven of those actually qualified for the World Cup. The player can choose between a single game Exhibition mode and a tournament \"Human Cup\" mode to choose between. \n \nTeams \nThe following sixteen teams could be selected for use in either mode: \n \nItaly (the hosts) \nBrazil \nThe Netherlands \nU.S.S.R. \nArgentina \nWest Germany \nDenmark (Denmark did not actually qualify for the 1990 World Cup) \nEngland \nSpain \nFrance (France did not actually qualify for the 1990 World Cup) \nUruguay \nPoland (Poland did not actually qualify for the 1990 World Cup) \nYugoslavia \nUSA \nMexico (Mexico was disqualified during the qualification process) \nJapan (Japan did not actually qualify for the 1990 World Cup)","collection":3214,"popularity":1.333333333333333,"games":[18681,77576,76999,72888,72833,63514,62335,62325,59802,58577],"tags":[268435470,536870938],"category":0,"keywords":[26],"genres":[14],"first_release_date":641174400000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":641174400000,"region":5,"human":"1990-Apr-27","y":1990,"m":4},{"category":0,"platform":86,"date":643766400000,"region":8,"human":"1990-May-27","y":1990,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lyx1osehjnmkskq61j33.jpg","cloudinary_id":"lyx1osehjnmkskq61j33","width":466,"height":466}}