{"id":7146,"name":"The Dark Eye: Chains of Satinav","slug":"the-dark-eye-chains-of-satinav","url":"https:\/\/www.igdb.com\/games\/the-dark-eye-chains-of-satinav","created_at":1401404900340,"updated_at":1541533050808,"summary":"With a history of more than 25 years, The Dark Eye is one of Europe's best-known role-playing brands. In addition to the popular pen & paper adventures, TDE has also inspired a series of successful computer games. The Dark Eye: Chains of Satinav immerses players deep in the world of Aventuria, where they experience an amazing story and explore lands never before featured in a TDE computer game. \n \n  \nIn Andergast, whose inhabitants are considered to be notoriously superstitious, King Efferdan awaits a state visit from high-ranking dignitaries. For centuries the kingdom has been at odds with neighboring Nostria, but now first steps are being undertaken toward a lasting peace. But a plague of crows troubles the king, for the birds are acting with unusual aggressiveness, even attacking humans. Moreover, there are those among the citizens of Andergast who swear that the crows are bringing them dark nightmares. As the belligerent creatures infiltrate even the castle itself, the king seeks a skilled bird catcher - an opportunity for young Geron to prove that the reputation for ill luck that has followed him since childhood is undeserved. Following an audience with the king, the prestigious task is assigned to him. However, not only does his task prove unexpectedly difficult, but it also turns out to be the first step of the greatest adventure of his life, which will lead him to the borders of the charted lands of Aventuria and beyond.","storyline":"Thirteen years ago... \nin the town of Andergast a dark prophet was burned at the stake at the place of execution. \n \nNobody knew his true name. He had come from the woods and spoke his dark prophecies only to disappear again. The people revered him as the \"the Seer\". It was said that he might have been a druid, a sorcerer, a being from the fairy folk or even an all-knowing demigod. Time and time again the Seer predicted disaster would come to Andergast and, indeed, disaster did come. Nobody knew the real reason why the King of Andergast had the Seer executed. Some say the Seer himself had cursed the whole kingdom of Andergast. \n \n \nA poor raven-haired child was watching the execution. As the procession with the disgraced convict passed by, the boy met the eyes of the Seer and with his last words the doomed prophet predicted a dark future for the boy. The stake was lit for the flames to consume the body of the Seer. \n \nThe black haired child Geron grew up to be a gifted trapper. But since that fateful day of the execution he couldn't escape the words of the Seer as the people of Andergast where eying him with suspicion ever since. Feeding their suspicions everything in Geron's presence seemed to break or disappear mysteriously. Thus Geron was called a bringer of bad luck and a witches' brat. \n \nAs our story begins, young Geron works as a trapper and has a lot of trouble on his hands. Flocks of crows act strangely. Aggressive and fearless they even attack humans. Some people even believe that the crows bring nightmares to the citizens of Andergast. When some of the once celebrated heroes, who had executed the Seer, are found dead and with eyes picked out rumors spread throughout the city. Many believe that the ghost of the Seer has finally returned to take revenge. And of course many believe Geron to be the reason for these dark signs. After all he was said to bring bad luck and disaster to Andergast. \n \n \nAs the king searches for a trapper for an important quest, Geron takes his chance to clear his name once and for all. And so Geron gets entangled into a story that will prove to be of greater importance than he could ever have expected.","collection":1215,"franchise":438,"franchises":[438],"rating":70.4861239142367,"popularity":2,"total_rating":70.4861239142367,"total_rating_count":12,"rating_count":12,"games":[22387,14176,3230,9655,18263,47823,15409,20395,28309,80916],"tags":[17,268435458,268435468,268435487,268435488,536871041,536871115,536871138,536871208,536871506,536871939,536872010,536872070,536872093,536872205,536872328,536872406,536872647,536873249,536874706,536874916,536875046,536875081,536875131,536875229,536875275,536875330,536875367,536875420,536875503,536875525,536875531,536875593,536875650,536875673,536875792,536875918,536876062,536876301,536876377,536876473,536876569,536877997,536878064,536882428,1073741826],"developers":[2248],"publishers":[423,4726],"game_engines":[347],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[129,203,226,296,594,1027,1098,1158,1181,1293,1416,1494,1735,2337,3794,4004,4134,4169,4219,4317,4363,4418,4455,4508,4591,4613,4619,4681,4738,4761,4880,5006,5150,5389,5465,5561,5657,7085,7152,11516],"themes":[17],"genres":[2,12,31,32],"first_release_date":1340323200000,"platforms":[6,14],"release_dates":[{"category":0,"platform":14,"date":1365552000000,"region":8,"human":"2013-Apr-10","y":2013,"m":4},{"category":0,"platform":6,"date":1340323200000,"region":8,"human":"2012-Jun-22","y":2012,"m":6}],"alternative_names":[{"name":"The Dark Eye: Klątwa Wron","comment":"Polish title"},{"name":"Das Schwarze Auge: Satinavs Ketten","comment":"German title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/seaqlbtflzi6gmzjrbiu.jpg","cloudinary_id":"seaqlbtflzi6gmzjrbiu","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xdbkdwisib3spzmwnm0f.jpg","cloudinary_id":"xdbkdwisib3spzmwnm0f","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vowndgsbb2yicwf5mhqz.jpg","cloudinary_id":"vowndgsbb2yicwf5mhqz","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/opzyaf9qrfdg4onmxbjp.jpg","cloudinary_id":"opzyaf9qrfdg4onmxbjp","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uuaxdpe509anhn9rhvtw.jpg","cloudinary_id":"uuaxdpe509anhn9rhvtw","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"hCllRxVZavM"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/se1cesjulmhexbi2fwdf.jpg","cloudinary_id":"se1cesjulmhexbi2fwdf","width":1191,"height":1450},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\r\nIt contains: Realistic looking violence.","rating":4},"websites":[{"category":1,"url":"http:\/\/www.satinavs-ketten.de\/?lang_new=de"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/203830"}],"external":{"steam":"203830"}}