{"id":8746,"name":"Aura Kingdom","slug":"aura-kingdom","url":"https:\/\/www.igdb.com\/games\/aura-kingdom","created_at":1422074536764,"updated_at":1543011600886,"summary":"Aura Kingdom takes place in an anime-styled vast world rendered with detailed graphics. The game consists of primarily open world with instances that can either be partaken as solo or in a party. Players can choose between a variety of classes, with ten classes released and an upcoming one, as of May 2014. The players can freely customize their character or avatar with many choices of hair styles and faces and much more. It is then proceeded with the choice of four Eidolons, who will accompany the player throughout the game, while also giving the ability to earn other Eidolons.\nWithin the game, the player can interact with many non-player characters and enter combat mode with monsters outside of the hub world. The combat system is primarily the player using a wide variety of skills corresponding with the class against the monsters, who also have their own set of skills. The majority of the game is to simply attack and defeat the monsters along the way while partaking quests. The combat system is unique in a way that, although the player has to click on a monster to engage in combat, the player also has the ability to move to dodge and use their skills in a variety of ways. With an accompanying Eidolon, the player's Eidolon can also fight alongside their character, and also use a combination attack. The combat system is not merely a \"click-and-watch\" combat. Outside of the combat system, the player can also engage in several different tasks, such as fishing, crafting, and many more.\n\nWhile the game is situated in a free-to-play environment, the game also allows the players to purchase Aeria Points, or for short AP, that allows the players to use that monetary value for special in-game items found in the Item Mall. Otherwise, the game uses the gold and silver tactic, which can be acquired a number of ways. The game also allows the use of trade, a self-installed stall in Navea, and the Auction House. Players can also use the mailing system to mail other players using the cash-on-delivery system.","storyline":"The plot of Aura Kingdom revolves around an Envoy of Gaia, residing in Port Skandia, and later is accompanied by an Eidolon.Afraid to become a monster after witnessing the demonic transformation of another Envoy of Gaia, the Envoy ventures outside of Port Skandia to rid his Eidolon by his side, only to be unsuccessful. Having had a dream of a raging war between the Church of Navea and the demon army, the Envoy finds himself in a situation that became real as he now fights alongside the Church to defeat Reinhardt and his demon army.","rating":60,"popularity":6.333333333333333,"total_rating":60,"total_rating_count":3,"rating_count":3,"games":[47823,22387,68441,55092,34155,80916,54775,27209,17112,81249],"tags":[1,17,22,268435468,268435487,536870990,536871004,536871208,536871390,536871784,536871812,536872070,536872245,536872296,536873297,536875046,536875281,536875735,536875799,1073741826],"developers":[4677],"publishers":[3727],"category":0,"player_perspectives":[2],"game_modes":[5],"keywords":[78,92,296,478,872,900,1158,1333,1384,2385,4134,4369,4823,4887],"themes":[1,17,22],"genres":[12,31],"first_release_date":1387756800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1387756800000,"region":8,"human":"2013-Dec-23","y":2013,"m":12}],"alternative_names":[{"name":"Fantasy Frontier Online","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lxrbwdddyup4stmtxqsu.jpg","cloudinary_id":"lxrbwdddyup4stmtxqsu","width":1580,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bg3gaaqn98oxytajbtxu.jpg","cloudinary_id":"bg3gaaqn98oxytajbtxu","width":1280,"height":729},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kzz5xqd0kwma5uxqhrjt.jpg","cloudinary_id":"kzz5xqd0kwma5uxqhrjt","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yz5iefg7snsvkqdlwzzs.jpg","cloudinary_id":"yz5iefg7snsvkqdlwzzs","width":1276,"height":879},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ovtgfshwsjtuxahzoyvt.jpg","cloudinary_id":"ovtgfshwsjtuxahzoyvt","width":1680,"height":1050}],"videos":[{"name":"Trailer","video_id":"jIjxUscjW1w"},{"name":"Trailer","video_id":"-1Rr2g_Zgpk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ihtfjcynr1kynnesxizi.jpg","cloudinary_id":"ihtfjcynr1kynnesxizi","width":1024,"height":579},"esrb":{"rating":3},"pegi":{"rating":3},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.xlegend.aurakingdom&hl=en&gl=us"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/268420"},{"category":1,"url":"http:\/\/aurakingdom.aeriagames.com\/"}],"external":{"steam":"268420"}}