{"id":22321,"name":"Floating Cloud God Saves the Pilgrims","slug":"floating-cloud-god-saves-the-pilgrims","url":"https:\/\/www.igdb.com\/games\/floating-cloud-god-saves-the-pilgrims","created_at":1470257146461,"updated_at":1520957008958,"summary":"Floating Cloud God Saves the Pilgrims is a Playstation Mini game for PSP and Vita. \n \nFloating Cloud God Saves the Pilgrims is exactly that, a 2D shooter built around the eponymous deity (controlled by the player) and his quest to protect eight pilgrims in their journey across perilous territories. \n \nYour own shots just knock their hats off, but getting hit by anything else will kill a pilgrim and send their spirit floating off with a sad little wail. This is bad not only because the pilgrims are a de facto health bar (losing them all ends the game) but powering up Cloud God depends on harvesting their love - juicy little hearts that pop up whenever you kill an enemy and increase in size as you blast more. \n \nYou must get all of the love (given form as hearts) that they release, which then makes you much more powerful than you already are. You increase in size, look more menacing, and your attacks are more powerful. The pilgrims get the most excited when they witness ambushing ghosts and ghouls get annihilated by you. When they are excited, they produce more love, meaning more power to you. \n \nHowever, you have to be very careful when shooting. You grow weaker with every shot, so try not to channel your inner war-freak and have a little restraint, for the good of both yourself and the pilgrims. You also lose some of your steam if you get hit by enemy forces. And sometimes, the situation calls to for you to sacrifice your mightiness and provide cover to the pilgrims from the enemy assault with your own self. \n \nThere are two types of attack: the normal shot (by pressing X), and the bomb shot (by pressing Circle). The direction of the normal shot depends on what direction you are pressing, so there is some strategy to what part of the screen you should be shooting from. Being too far from your pilgrims is very dangerous but allows you to cover more ground, while launching a full frontal assault can protect your pilgrims by absorbing all the incoming fire. You have to think through, in real time, what tactics you would like to employ. You can always get in the middle, then rush forward, then get to a safe distance; mix and match, and you got yourself going. \n \nThe bomb shot is used if you are above the enemy. But that’s not all, as some enemies can’t be killed with the bomb shot, only with the normal shot, and vice versa. There are also enemies where you have to inflict bomb shot damage first before switching to the normal shot to take them out. \n \nEnemies are varied, and they look good, even if they are vile and evil. There are boss fights, too, to keep you on your toes. The Cloud God's powers and the heart system mesh so well that any enemy can be destroyed in a blink - so they've got to be deceptive, sneaky, and sometimes numerous. Paper lanterns send out an arcing flame on death, red-eyed foxes hide in the scenery, imps swoop to carry off unlucky pilgrims and bobbing doll heads send out swarms of kisses. Hands start clawing up from the ground, crows dive-bomb your crew, and demons with phallic noses launch them as languorous, looping rockets. The cheeky oriental stylings are gorgeous, transforming symbols into everything from freaky momiji to dick-nosed devils. \n \nAs this suggests, one of the reasons Floating Cloud God is such a pleasure to play is its visual inventiveness, which has room enough for everything from Wario tributes to what looks like a crying poo. This big lump of a thing, which is introduced in a level called The Saddest Enemy, explodes into gobbets of mini-poo that are very useful for building up a heart multiplier. Perhaps they're babies? That would explain the sadness. \n \nFloating Cloud God has bags more where that came from, and despite the Minis tag has plenty of room to breathe (there are seven worlds with 27 stages, including boss fights). And it keeps on surprising. The controls are simplicity itself: left stick to move, one button to shoot and one to bomb. But you soon realise the subtlety of how shooting affects movement and vice-versa, which fairly soon you're depending on against every enemy pattern. The pilgrims, too, are loosely tied to Cloud God during some sections, and learning how to manage their momentum is another little learning curve. \n \nThe final touch is a minor detail that ties up everything. The pilgrims' hats can be improved. There's no in-game benefit to this, beyond looking much more awesome, and it's done by completing stages without losing a single pilgrim. Obviously, if you start this process on the first level and never lose a pilgrim, the hats just keep getting better. \n \nSeems like such a small thing, doesn't it? Soon nothing but a perfect run will do. The restart option is accessible, knowing, and tempting. Every time a pilgrim fell, it was too much to take - I didn't see their tiny spirit float off to heaven so much as all my future headwear ambitions. And to be fair, by that point I had four dudes with top hats, two with octopus heads and two with space hero helmets. You can't be replacing any of them with Norman and his brown cap just because some demon gets a lucky shot in. \n \nThat's the best thing about Floating Cloud God Saves the Pilgrims. You do want to save them, and not just because they represent 'health'. The hats are a big part of it, but just as much is the sense of pride in being a badass god - harvesting power at the right moment to smash through oncoming waves, battling desperate rear-guard actions against hails of deadly kisses and throwing yourself in bodily as a last resort (which sometimes works!). The little yelp as a pilgrim goes down is a sharp reprimand, a blow to the daydreams of an all-conquering deity. \n \nThis description was compiled from the following reviews: \n \nhttp:\/\/www.eurogamer.net\/articles\/2012-04-19-floating-cloud-god-saves-the-pilgrims-review \n \nhttp:\/\/www.pspminis.com\/8859\/floating-cloud-god-saves-the-pilgrims-review-if-the-indication-of-a-good-game-is-a-lengthy-title-then-that-rule-applies-here\/","popularity":1.333333333333333,"aggregated_rating":90,"aggregated_rating_count":1,"total_rating":90,"total_rating_count":1,"games":[68287,17130,78770,95340,58095,36607,19686,6060,17111,19376],"tags":[268435461,268435471,536871937,536875046,536875347,536875638,536875939,536876240,536876292],"publishers":[14840],"category":0,"keywords":[1025,4134,4435,4726,5027,5328,5380],"genres":[5,15],"first_release_date":1334707200000,"platforms":[45],"release_dates":[{"category":0,"platform":45,"date":1334707200000,"region":1,"human":"2012-Apr-18","y":2012,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/me2fthoxcasdo6urhbpr.jpg","cloudinary_id":"me2fthoxcasdo6urhbpr","width":1280,"height":722},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ce3lcgipt6jnofvfrtxa.jpg","cloudinary_id":"ce3lcgipt6jnofvfrtxa","width":1280,"height":722},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wpsxnzkhjdpzmvnt1jla.jpg","cloudinary_id":"wpsxnzkhjdpzmvnt1jla","width":1280,"height":722},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/foyvxdoonwuimrxd5xzc.jpg","cloudinary_id":"foyvxdoonwuimrxd5xzc","width":1280,"height":722},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wcumlly0vzsle69ybtic.jpg","cloudinary_id":"wcumlly0vzsle69ybtic","width":1280,"height":722}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/q1itvoenzs67qvbhjjy4.jpg","cloudinary_id":"q1itvoenzs67qvbhjjy4","width":512,"height":512}}