{"id":25321,"name":"The Sims 4: City Living","slug":"the-sims-4-city-living","url":"https:\/\/www.igdb.com\/games\/the-sims-4-city-living","created_at":1477781280886,"updated_at":1517270863329,"summary":"Do your Sims long to leave the suburbs behind? Fulfill their dreams in the diverse city of San Myshuno, where they can discover exciting neighborhoods, move into a new apartment, check out fun festivals and more. In The Sims 4 City Living your Sims can experience the joys and challenges of sharing close quarters with other Sims. Work your way up from a starter unit to a penthouse as your Sims launch new metropolitan careers!\n\nKEY FEATURES\n\nExplore the bustling city of San Myshuno. This densely populated city has enough unique neighborhoods to give your Sims plenty to explore. Get creative in the Arts Quarter or sing your heart out at the Karaoke Bar in the Fashion District. Head over to the Spice Market to shoot some hoops, or invite a few friends over to play video games after a long day at the office in Uptown.\n\nDiscover lively cultural festivals. Festivals are great opportunities to enrich your Sims. Let them watch street performers, enter competitions and meet a wide variety of folks from every walk of life. Check out the Curry Challenge at the Spice Festival or light fireworks with a hot date at the Romance Festival.\n\nLive in apartments and get closer with your neighbors. Lots of new neighbors mean all kinds of opportunities for relationships, both good and bad. Your Sims might make a new best friend or fall in love, then debate giving them a key to their place. And what about those noisy neighbors and their late night dance parties? You'll need to decide how to handle them - if you can't beat them, maybe you should join them.\n\nWork your way up from starter apartment to penthouse. Choosing the right apartment for your Sims can be a challenge. You'll need to balance the charm of your first starter unit with possible setbacks, like cockroaches, leaky pipes or electrical problems. Help your Sims work their way up to living in a Skyscraper Penthouse, with panoramic views and even a Talking Toilet!\n\nEmbark on new, metropolitan careers. There are all kinds of new opportunities in the city so make sure your Sims take advantage of them. As a Politician, your Sims can make dramatic speeches while fighting for a good cause. Maybe they'd prefer a more refined career as a Food or Art Critic. Or they could inspire the masses working in Social Media.","collection":61,"hypes":1,"rating":80.59679124794981,"popularity":2,"aggregated_rating":86,"aggregated_rating_count":3,"total_rating":83.2983956239749,"total_rating_count":6,"rating_count":3,"game":3212,"games":[28558,44242,26563,18623,22470,29173,26145,22425,55689,55590],"tags":[33,268435469,536870955,536871441,536872060,536872662,1073741827],"developers":[283,1505],"publishers":[1],"game_engines":[280],"category":2,"player_perspectives":[3],"game_modes":[1],"keywords":[43,529,1148,1750],"themes":[33],"genres":[13],"first_release_date":1477958400000,"pulse_count":6,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1477958400000,"region":8,"human":"2016-Nov-01","y":2016,"m":11},{"category":0,"platform":14,"date":1477958400000,"region":8,"human":"2016-Nov-01","y":2016,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ylc9nwyzoryavrxxcies.jpg","cloudinary_id":"ylc9nwyzoryavrxxcies","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/z3r0jton49rvisp3kz6z.jpg","cloudinary_id":"z3r0jton49rvisp3kz6z","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sn9q95a8jfnq3tgr7gaa.jpg","cloudinary_id":"sn9q95a8jfnq3tgr7gaa","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xblzpdhmjaysr7ndlid6.jpg","cloudinary_id":"xblzpdhmjaysr7ndlid6","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mmfopsjkziwbdrngxy34.jpg","cloudinary_id":"mmfopsjkziwbdrngxy34","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"W458QnCVQik"},{"name":"Trailer","video_id":"_IjxDbRiAdk"},{"name":"Trailer","video_id":"fCvTzTFNy58"},{"name":"Trailer","video_id":"WCV5xDzvvN8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tzgrllcszevvh0f4ryur.jpg","cloudinary_id":"tzgrllcszevvh0f4ryur","width":2160,"height":3048},"esrb":{"rating":5},"pegi":{"rating":3}}