{"id":40021,"name":"Cosmic Alien","slug":"cosmic-alien","url":"https:\/\/www.igdb.com\/games\/cosmic-alien","created_at":1498466924168,"updated_at":1500234158341,"summary":"Cosmic Alien is an arcade game that is a clone of Galaxian. Players control a gun at the bottom of the screen that shoots at aliens (which are known as \"chiefs\", \"guards\", \"commanders\", or \"soldiers\") that are in a formation overhead. Aliens begin peeling off the formation and fly towards the bottom of the screen while dropping bombs. There are two flagship-type aliens (chiefs) at the top of the screen that can fly accompanied with one or more escort (guard) aliens; shooting one or more of the guards before shooting a chief will increase the amount of the chief’s score. If a player does not shoot an alien (or if it doesn’t ram the player’s gun) during its attack run it will return to the formation. \n \nThere are a few differences with Galaxian, as sometimes aliens will return to the formation without dropping below the bottom of the screen (and then reappearing at the top). They also can shoot off a wide horizontal string of bombs, rather than individual shots like on Galaxian. If the last alien on a level (known as \"screens\") is left alone long enough, it will turn into a big winged creature. Also, aliens start changing form: by the third screen, they start resembling winged demons once they leave the formation, plus the player’s gun is bumped up a notch, giving them less time to react to the aliens’ attacks. \n \nPlayers start off with three guns, which can be lost by being hit by an alien or bomb and the game will end if there are no more guns in reserve. An extra gun is awarded at 5,000 points.","popularity":1.333333333333333,"games":[46892,41258,76246,19341,28029,32902,97018,96550,93794,88910],"tags":[268435461],"category":0,"genres":[5],"first_release_date":318211200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":318211200000,"region":8,"human":"1980-Feb-01","y":1980,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/q06h8ac4fjnkwqjk1mvx.jpg","cloudinary_id":"q06h8ac4fjnkwqjk1mvx","width":850,"height":1108}}