{"id":4721,"name":"Merchant Kingdom","slug":"merchant-kingdom","url":"https:\/\/www.igdb.com\/games\/merchant-kingdom","created_at":1391179457321,"updated_at":1517270787135,"summary":"Merchant Kingdom is a real world location based strategy game. So go out and fire up Merchant Kingdom when you move around in real life. Try and put a settlement on all the places that you visit regularly such as your home, your work place, train stations, the supermarket or your favorite bar!\nThis app works best on an iPhone with 3G access allowing you to roam and settle different locations. An iPod connected to WiFi will restrict the growth of your Kingdom.\n\nEXPAND YOUR EMPIRE\nMerchant Kingdom starts you off as a simple merchant. Found your first settlements to produce basic goods in places you visit often, and then begin your rise to power. Your iPhone is the caravan you can use to buy commodities from traders, take them with you when you move around in real life, and sell at a profit.\n\nDIPLOMACY OR TYRANNY\nAs your trading empire expands, you desire more than just wealth – it’s power you are longing for. When the king awards you a knighthood, you can build a castle, recruit an army and demand allegiance from other players! Alternatively, you can build your kingdom on the cultural influence of your castle and expand it by organising events.\"\n\nVARIETY IS THE SPICE OF LIFE\nClaim locations you visit often and build settlements that produce the commodities you want to trade in. Upgrade your settlements whenever you can and choose from over 50 different buildings each with their own special abilities. Expand your caravan, as you get richer. Buy donkeys, settlers, horses, covered wagons, spies, thieves or one of the other units.\n\nSO MUCH TO DO, SO MUCH TO SEE\nExplore the world and discover over 40 different kinds of land types, from thick jungles, to deserts, to extinct volcanoes. On your travels, find rare commodities on your trips, then bring them home and sell them for a profit. Earn achievements in one of the four guilds: the Traders Guild, the Explorers Guild, the Manufacturers Guild or the Thieves Guild and cement your reputation in the virtual land.","popularity":1.333333333333333,"games":[103303,81249,26163,99118,54775,103282,113114,111651,36929,90099],"tags":[17,38,268435468,536871063,536871363],"developers":[2105],"publishers":[2105],"category":0,"game_modes":[5],"keywords":[151,451],"themes":[17,38],"genres":[12],"first_release_date":1287446400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1287446400000,"human":"2010-Oct-19","y":2010,"m":10}],"alternative_names":[{"name":"Merchant"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o4xbzxhkb57oyyxlss6z.jpg","cloudinary_id":"o4xbzxhkb57oyyxlss6z","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qtdhd2aleshkn17zlmp6.jpg","cloudinary_id":"qtdhd2aleshkn17zlmp6","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lcyfggfuvqiibcfi5mo9.jpg","cloudinary_id":"lcyfggfuvqiibcfi5mo9","width":640,"height":1136},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jrmgg3fiqvqj26iqtmjh.jpg","cloudinary_id":"jrmgg3fiqvqj26iqtmjh","width":640,"height":1136}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/reb08ot0yxsnfus6mlk1.jpg","cloudinary_id":"reb08ot0yxsnfus6mlk1","width":320,"height":480},"websites":[{"category":1,"url":"http:\/\/www.merchantkingdomgame.com\/"}]}