{"id":86721,"name":"Bergen Bridge Beginner 1","slug":"bergen-bridge-beginner-1","url":"https:\/\/www.igdb.com\/games\/bergen-bridge-beginner-1","created_at":1518601434172,"updated_at":1518705519938,"summary":"This app is designed for less-experienced players. It provides 103 deals to declare and 12 to defend. All principles of playing a hand are explained. These include finessing, when not to draw trump first, counting winners and losers, communication etc.\n\nThe app provides an interactive approach to improve your game. When playing the deals, you will feel as if Marty Bergen is looking over your shoulder and giving you advice and tips to help you figure out the best line of play or the best defense. It is very instructive, and a must for everyone who is eager to learn more and play better.\n\nThis app is perfect for the bridge player who wants to improve his\/her playing skills. When you are playing the deal but don’t play or defend perfectly, you will get a message explanation what you should have done. You also have the option to let the program ask you questions about the play. Every bridge player should ask these questions themselves before playing a card. By answering the questions you will learn the best approach. Once you are used to asking yourself these type of questions, you will have made a big step in improving your play and becoming a better opponent.\nThe bidding system is based on Standard American. However, the auction is always provided for you so this program is appropriate for all players.\n\nTo use the app, no internet connection is needed.\n\nAbout Marty Bergen\nMarty is a U.S. bridge teacher\/player\/author. He is a ten-time national champion and ACBL Grand Life Master and World Bridge Federation World International Master. He retired from active competition in 1993 to concentrate on teaching and writing. He was recently voted to be the 22 most influential person in the history of bridge. \nMarty has been a columnist in the monthly ACBL Bridge Bulletin since 1976. He has also written 69 bridge books; two of which won the ABTA Bridge Book of the Year award. Points Schmoints!: Bergen's Winning Bridge Secrets in 1996 and Declarer Play the Bergen Way in 2005.","rating":60,"popularity":1,"total_rating":60,"total_rating_count":0,"rating_count":0,"games":[60693,101648,100968,100795,100755,89096,88982,87471,87215,87121],"tags":[536874083],"category":0,"keywords":[3171],"first_release_date":1496275200000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1496275200000,"region":8,"human":"2017-Jun-01","y":2017,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zkut6ldadtreqhk7jmgo.jpg","cloudinary_id":"zkut6ldadtreqhk7jmgo","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rldn0vujiqrhen733xm4.jpg","cloudinary_id":"rldn0vujiqrhen733xm4","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o535pmtr8gf8rlwsf2tl.jpg","cloudinary_id":"o535pmtr8gf8rlwsf2tl","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h1oefbijkv6hxqzy9agk.jpg","cloudinary_id":"h1oefbijkv6hxqzy9agk","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pboo0y9cm3sn5ogdngeq.jpg","cloudinary_id":"pboo0y9cm3sn5ogdngeq","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/od1xg5e6qto3l3vdvtz5.jpg","cloudinary_id":"od1xg5e6qto3l3vdvtz5","width":512,"height":512}}