{"id":8721,"name":"Mechs and Mercs: Black Talons","slug":"mechs-and-mercs-black-talons","url":"https:\/\/www.igdb.com\/games\/mechs-and-mercs-black-talons","created_at":1421814666283,"updated_at":1517271100096,"summary":"- Persistent and customizable squads\n- Upgradeable and unique (per class) skill tree for all units\n- Customizable mechs\n- Different Worlds with unique environments.\n- Customizable Battlecruiser. The Battlecruiser serves as the base of operations, and can be customized with weapons or infrastructures that will boost the squad numbers, teleport soldiers or even bombard the battlefield.\n- Faction relations. \n- Different unit classes with specialized roles\n- Campaign. The actions of the player directly affect the balance of power on the system. There is one main objective to achieve, but there’s much more to do.","storyline":"Not long ago, there was peace in the inner systems.\nUnited under the flag of the United Space Federation, hostilities between planets laid dormant, but not forgotten.\n\nBut after a bloody war against the Gark - an alien race that anounced itself to humanity with a powerful and brutal offensive - the Federation lost most of its military and political power.\nWarlords rose to power and old tensions came back. Private armies were mobilized and new alliances were forged.\n\nThe Tzanar Union - a regional power and once a strong provider of troops and equipment for the USF - massed its army.\nTheir homeland wasted and dried out by excessive refining and manufacturing, it was time to expand its borders.\n\nFirst by claiming disputed backwater colonies near their home world.\nAnd then targeting smaller governments of weaker political power.\n\nTzanar's next target is the planet Genai, a small but rich agriworld in the Oberon system.\nThe Noctae Republic - ruling faction of Genai - never invested in a large military force, instead keeping a small elite force strong enough to protect their borders with the support of militia units.\nWhen the Noctari planetary governor learned that the Tzanari fleet was moving to Oberon, he decided to ask for the help of all nearby mercenary units to assist in the defense of the planet.\nNever had the Noctae Republic used the services of mercenaries, but these were desperate times.\n\nOne of the units to answer the call were the Black Talons.\nStationed aboard the battlecruiser \"Paladin\", the Black Talons roamed the system looking for contracts. And this was a very big contract. It was impossible to refuse.\n\nBut when the \"Paladin\" arrived in the Oberon system, it was too late.\nGenai was already occupied, Noctae's army scattered throughout the planet.\n\nIn a matter of hours, the Tzanari fleet occupied the system Stargate, leaving everyone stranded inside. Supporters and allies of the Noctae Republic were being hunted and destroyed.\n\nThe only chance to get out alive now is to defeat the Tzanari forces. \nAnd the only way to do it is to help Noctae retake their planet.","popularity":1.333333333333333,"games":[34919,25311,26145,21642,28465,25300,54999,33603,16468,36962],"tags":[1,21,39,268435467,268435469,268435488,536871475,536871717,536872291,1073741826],"developers":[4642],"publishers":[4643],"category":0,"player_perspectives":[2],"keywords":[563,805,1379],"themes":[1,21,39],"genres":[11,13,32],"first_release_date":1420761600000,"platforms":[6,14,3],"release_dates":[{"category":0,"platform":6,"date":1420761600000,"region":8,"human":"2015-Jan-09","y":2015,"m":1},{"category":0,"platform":3,"date":1420761600000,"region":8,"human":"2015-Jan-09","y":2015,"m":1},{"category":0,"platform":14,"date":1420761600000,"region":8,"human":"2015-Jan-09","y":2015,"m":1}],"videos":[{"name":"Gameplay video","video_id":"CCyh4bNUeXE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zxoeoz0r0jyscgbexnjs.jpg","cloudinary_id":"zxoeoz0r0jyscgbexnjs","width":640,"height":903},"pegi":{"rating":4},"websites":[{"category":1,"url":"http:\/\/blacktalons.camel101.com\/"}]}