{"id":14168,"name":"Aquanaut","slug":"aquanaut","url":"https:\/\/www.igdb.com\/games\/aquanaut","created_at":1445535021008,"updated_at":1516677617038,"summary":"The Aquanaut team has been called in to investigate strange happenings around the Yendor Isles. And as the investigation continues, even stranger events come to light.\n\nJoin Commander T.S. Williams and his team of top-notch Aquanauts in an assault on an underwater alien force who must be stopped! Too much is at stake to hesitate.\n\nIn the Encounter at Shark Reef, you must fight through deadly jellyfish, swordfish, and sharks. Swimming through these waters is as dangerous as it can get, with every breath depleting your oxymix supply and every turn unveiling additional enemies. Then when you reach a fantastic alien craft, you've only got moments to plant the plasma bomb and get far enough away to escape injury when you detonate the explosive.\n\nIn the Labyrinth, you will meet many blood-sucking waterbased aliens- each ready to send you to your maker! With careful blasting and clever strategic moves you just might get through it with some air in your lungs and your skin on your bones.\n\nBut watch yourself in the underground city. One touch of a merman will fry your hide. Find the right devices and you might read into the story better. Tuck and roll around the merangels and splatter the hatchlings, grabbing weapons and information vital to your health- and the health of the captive population you realize you are there to set free. But not before the final battle with the master of the alien of the race.\n\nAnd he isn't very nice.","popularity":1,"games":[68287,28029,36950,64204,71455,27314,10209,25300,142,10213],"tags":[1,18,268435461,268435489,536871078,536871882,1073741828],"publishers":[7141],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[166,970],"themes":[1,18],"genres":[5,33],"first_release_date":473299200000,"platforms":[63,16,15],"release_dates":[{"category":0,"platform":15,"date":473299200000,"region":1,"human":"1984-Dec-31","y":1984,"m":12},{"category":2,"platform":63,"date":631065600000,"human":"1989","y":1989,"m":12},{"category":2,"platform":16,"date":631065600000,"human":"1989","y":1989,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wfozj4l8qoimmafayhtx.jpg","cloudinary_id":"wfozj4l8qoimmafayhtx","width":640,"height":781}}