{"id":1768,"name":"Rockman EXE WS","slug":"rockman-exe-ws","url":"https:\/\/www.igdb.com\/games\/rockman-exe-ws","created_at":1352060937759,"updated_at":1515744123079,"summary":"RockMan EXE WS is an Action game, developed by Capcom and published by Bandai, which was released in Japan in 2003. \n \n \n \nLike Mega Man Network Transmission, Rockman EXE WS is a side-scrolling, platform-based video game. The gameplay mainly consisted of shooting enemies and jumping through obstacles and platforms. \n \nAs the game begin, players are given mission briefing through cutscenes. In the cutscenes there will be conversations between MegaMan and other character, which will explain players about the background of the mission. \n \nAfter the briefing, players are brought to a screen that shows a list of chips[jargon] the players have gained while playing and four boxes. By selecting a chip from the list, players choose which of the four boxes the chip will go into. \n \nOnce chips are selected and the stage begins, players may use the chips by pressing the Y buttons on the console. Unlike the Mega Man Battle Network games, some chips can be used multiple times, or replace the Mega Buster attack (such as Wide Sword. Chips can be found lying in stage or by defeating enemies. \n \nAs players battle through the level, the stage splits into two paths. Both paths lead to a different boss, which will be fought depending on player's completion percentage.","collection":340,"franchise":38,"franchises":[38],"popularity":1.666666666666667,"games":[68287,19174,71455,25300,36950,142,28029,55752,64204,27314],"tags":[1,18,268435464,536871298,536871835,536871882,536872961,536875472,1073741828],"developers":[892],"publishers":[617],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[386,923,970,2049,4560],"themes":[1,18],"genres":[8],"first_release_date":1044662400000,"platforms":[57],"release_dates":[{"category":0,"platform":57,"date":1044662400000,"region":5,"human":"2003-Feb-08","y":2003,"m":2}],"alternative_names":[{"name":"ロックマンエグゼ WS"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g8vvpnt70bqtxccfdj83.jpg","cloudinary_id":"g8vvpnt70bqtxccfdj83","width":283,"height":400}}