{"id":42068,"name":"Hanii on the Road","slug":"hanii-on-the-road","url":"https:\/\/www.igdb.com\/games\/hanii-on-the-road","created_at":1499067760084,"updated_at":1515853495335,"summary":"Hanii on the Road (aka Hany on the Road or Honey on the Road) is a side scrolling action game by Face. After Hanii's exploits in Hanii in the Sky, the little Haniwa clay doll is back on a new mission. This time around, our cute friend must free the world from all the demons and other evil creatures that escaped from the Gods' realm. But this time around he's not flying or shooting balls of energy - instead, he must run along a roadway divided into four lanes, each moving at different speeds. And things are just not as easy as it may sound - Hanii has to jump over various enemies and try not to fall into deep holes dug into the ground, without forgetting the occasional change in scrolling direction and the myriad of other exciting, and often lethal, effects. A time limit also urges him to hurry and to quickly reach the end of each stage. Every little helps, and tiny wood signs scattered around every road tell Hany how far the next exit is. Additionally, special items can be collected along the way, such as Blue jars giving Hanii extra lives (twenty five of them need to be collected though), Mystery Jars giving from 100 to 1000 points, Extra Lives, Time Clocks, Rockets, Trampolines and other unique and often bizarre super powers (he can turn into a race-car or an almighty warrior in some stages!). Hanii on the Road consists of many levels and features a non-linear structure with interconnected paths to follow, as well as bosses. The game also offers a two simultaneous player mode where Lemon, a yellow version of Hanii, comes to the rescue.","popularity":1.333333333333333,"games":[55752,68324,10039,1070,47823,36926,12632,51485,26848,1073],"tags":[1,268435464,536871208,536871244,536877330,536877778,536877779,536881098],"category":0,"keywords":[296,332,6418,6866,6867,10186],"themes":[1],"genres":[8],"first_release_date":655257600000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":655257600000,"region":8,"human":"1990-Oct-07","y":1990,"m":10}],"alternative_names":[{"name":"Hani on the Road","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwtvbsfekqj8bz6q89ej.jpg","cloudinary_id":"vwtvbsfekqj8bz6q89ej","width":640,"height":652}}