{"id":50168,"name":"Wing Commander Privateer: Righteous Fire","slug":"wing-commander-privateer-righteous-fire","url":"https:\/\/www.igdb.com\/games\/wing-commander-privateer-righteous-fire","created_at":1500037623899,"updated_at":1515654207662,"summary":"Welcome Back to the Edge of the Unknown. \nSo you think you’re a hotshot pilot. A clever entrepreneur. A notorious pirate. You’ve destroyed the Steltek Drone, secured the alien artifact and outfought and outsmarted everyone in your way. Now, You’re taking a well-deserved break on one of Gemini’s pleasure worlds. But relaxation will soon be the last thing on your mind… \n \nIn Righteous Fire, you’re once again transported to the seamy side of the universe, where you discover a fiendish plot that threatens the order and prosperity of Gemini Sector. Whether you’re a merchant, pirate or mercenary, plenty of action awaits if you’re willing to risk all you earned in Privateer. \n \n-\tExtend the career of your original Privateer character and ship as you undertake new money-making journeys through Gemini Sector! \n-\tEngage in higher-profit trade ventures as you barter and scrimp to equip your ship with new hardware. \n-\tDecide your own course of action and choose among multiple fixers. If you find a better offer elsewhere, take it! \n-\tUnveil a startling discovery in Gemini Sector as you find out why law and order are dissolving into chaos. \n \nNOT A COMPLETE GAME. You must own Privateer to play Righteous Fire.","collection":184,"popularity":2,"game":794,"games":[44242,18623,22470,29173,26145,22425,55689,55590,23867,22406],"tags":[268435469,536872060,536872552,536874140,536877142],"category":1,"keywords":[1148,1640,3228,6230],"genres":[13],"first_release_date":764467200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":764467200000,"region":8,"human":"1994-Mar-24","y":1994,"m":3}],"alternative_names":[{"name":"Privateer: Righteous Fire"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sm3ysnei0hrfuoj8p671.jpg","cloudinary_id":"sm3ysnei0hrfuoj8p671","width":800,"height":1060}}