{"id":51268,"name":"BoneCraft","slug":"bonecraft","url":"https:\/\/www.igdb.com\/games\/bonecraft","created_at":1500063138563,"updated_at":1500457903932,"summary":"BoneCraft: Somewhere in Some Galaxy is the second game created by D-Dub Software. It is a follow-up to 2008’s Action Adventure Porno Video Game, BoneTown. \n \nA parody of everything science fiction and fantasy, BoneCraft brings together many popular stories into one hilarious sexy romp. “BoneCraft is a world where anything can happen–and does,” says Hod, D-Dub’s Lead Developer. \n \nBoneCraft is a third-person action-adventure game with a unique sex dynamic merged seamlessly into the gameplay. The game follows the exploits of Captain Fort Worth, the leader of the Space Wranglers, and his sidekick, Lubbock.","storyline":"The story begins with Captain Fort Worth (Neil Kaplan) and Lubbock (Anson Rotola) cruising through space in their ship the USS Longstreet. After drinking too much Jet Fuel, Lubbock brings up a subject he knows sends Fort into a rage: Elven women. Earlier in Fort’s galactial campaigns he had the chance to bone the crown jewel of the galaxy, the Elf Queen, but was foiled by the Elven Army. Since then, Fort has lived with the pain of the only one he ever let get away. \n \nFort flies into a rage and crash-lands the ship on a nearby planet inhabited by an Orc tribe. When the Wranglers try to enforce their interstellar extinction policy on the Orc, Fort discovers that the Orc tribe is not only led by an old friend of his, Warboss Swampass (Gabriel Brooks), but that the planet is also harboring an Elven Brothel…and the Elf Queen herself. \n \nFort and his Wranglers must fight their way through Orc and Elf men, bone their way through the women, and take on everything from the metrosexual ranks of the Elven Army to the galaxy’s most dreaded creatures, the fearsome Dick Monsters, to make sure Fort finally gets the Holy Grail.","popularity":1.333333333333333,"category":0,"themes":[1],"genres":[31],"first_release_date":1327017600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1327017600000,"region":8,"human":"2012-Jan-20","y":2012,"m":1}]}