{"id":87368,"name":"Gymnastics Superstar","slug":"gymnastics-superstar","url":"https:\/\/www.igdb.com\/games\/gymnastics-superstar","created_at":1518701208732,"updated_at":1523426996799,"summary":"~~> All your hard work has finally paid off - you’ve made it to the Olympics! Now’s your chance to represent your country with pride!\n~~> Work on your amazing gymnast moves until they're ready for the Olympics. Practice makes perfect!\n~~> Compete your way to that shiny GOLD medal! Keep your eye on the prize!\n\nWOW. Your dream has come true. You’ve finally reached the Olympics, and you get to compete against world-class gymnasts to win gold for your country. Train with a famous coach who has helped other Olympic gold medalists reach the top. Perfect your moves and win this year's major competition! Get ready for a lot of practice and dedication, and even come up with your very own gymnastics routine, choreographed by YOU!\n\nFeatures:\n> Compete for your country & climb the world gymnastics ranks! Make that gold medal yours!\n> Perfect your uneven bar routine and floor exercises! \n> Get ready for the biggest gymnastics competition of the year, with an Olympic \"coach to the stars!\"\n> Dress up in a glittery gymnastics leotard that will make you stand out!\n> Get creative and come up with your very own gymnastics routine!\n> Look like a real star gymnast! Get a makeover, a manicure, and a new hairstyle!\n> Hit the gym & get in shape before the competition!\n> OMG! Golden Gymnast magazine asked you to be on their cover! Photo shoot, here you come!\n> Impress the judges with side aerials, triple full layouts, triple pikes, backward rolls & more! \n> Ugh - gymnastics injury. No worries - the doctor will treat you in time for the big competition!\n> Relax at the spa before the big day. You deserve it after all that hard work!\n\nABOUT Coco Play\nCoco Play Limited is China-based developer of creative and unique apps for kids. Founded in 2013, Coco Play provides rich 3D simulation-based games for the whole family. Coco Play is a subsidiary of TabTale, a leading, global creator of innovative games, interactive books and educational apps.\nVisit us: http:\/\/www.tabtale.com\/ \nLike us: http:\/\/www.facebook.com\/TabTale\nFollow us:@TabTale\nWatch us: http:\/\/www.youtube.com\/Tabtale\n\n\nCONTACT US \nLet us know what you think! Questions? Suggestions? Technical Support? Contact us 24\/7 at WeCare@TabTale.com\n\nFOR PARENTS \nThe app is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on this device. The app may include advertising for TabTale and certain third parties which will redirect users to our sites, apps or third-party sites.\nPrivacy is important to us. The app may enable collection of limited user data by TabTale or its carefully selected providers (e.g. ad networks and analytics) for limited legal purposes described in our Privacy Policy (e.g. respond to support queries; enable, analyze and improve the app’s features and services; serve contextual ads). The app includes certain features only accessible behind an age-gate to protect children (e.g. restrict behavioral ads; social networks links to connect with others while playing; option to accept push notifications to inform of exciting news e.g. updates). By downloading or using the app you accept our Privacy Policy: http:\/\/tabtale.com\/privacy-policy\/ and Terms of Use: http:\/\/tabtale.com\/terms-of-use\/ and permit such uses for users of your device.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[49414,25636,36608,21842,28080,75102,18862,16468,19567,72412],"tags":[268435468,536872030],"category":0,"keywords":[1118],"genres":[12],"first_release_date":1500422400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1500422400000,"region":8,"human":"2017-Jul-19","y":2017,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mk7txzeklmarjjlaglfl.jpg","cloudinary_id":"mk7txzeklmarjjlaglfl","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dyubl43z6vvojjkroq9d.jpg","cloudinary_id":"dyubl43z6vvojjkroq9d","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xf2lbyonnxygbtxyby8i.jpg","cloudinary_id":"xf2lbyonnxygbtxyby8i","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cxhifo6596ha8xfyow6s.jpg","cloudinary_id":"cxhifo6596ha8xfyow6s","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vdm6j3xnsthhnehfmnjd.jpg","cloudinary_id":"vdm6j3xnsthhnehfmnjd","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zybtoc1lx9vepwygcuux.jpg","cloudinary_id":"zybtoc1lx9vepwygcuux","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ucltzi5ebcnoux54ohde.jpg","cloudinary_id":"ucltzi5ebcnoux54ohde","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/egxm54hpwhtzjmui9p9v.jpg","cloudinary_id":"egxm54hpwhtzjmui9p9v","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/blh4ykkf2x3t1v5inr2e.jpg","cloudinary_id":"blh4ykkf2x3t1v5inr2e","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t7ulkwqx9qwegapsaoiy.jpg","cloudinary_id":"t7ulkwqx9qwegapsaoiy","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hmdevzpd73amftixt9do.jpg","cloudinary_id":"hmdevzpd73amftixt9do","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/gymnastics-superstar\/id1239325152?mt=8&uo=4"}]}