{"id":12145,"name":"Horror Zombies from the Crypt","slug":"horror-zombies-from-the-crypt","url":"https:\/\/www.igdb.com\/games\/horror-zombies-from-the-crypt","created_at":1441197757906,"updated_at":1512998387266,"summary":"As you take your first tentative steps beyond the decaying entrance gates of the Valdemar estate, your senses are alerted to an unknown fearful presence. You make haste to the apparent safety of the mansion house. The aged oak door slams shut behind you... Still trembling from your first encounter with the undead, and uneasy due to the enormity of your task, you decide to alert the local villagers by raising the flag over the West tower. The alarm raised - it's only a matter of time before help arrives, or is it? As the moments pass you begin to feel a faint vibration in the earth beneath your feet. A mysterious force draws you towards a hidden cave entrance. You enter warily...With no hope of assistance it becomes clear that you alone must end the terror that torments the ancestral home. \n\nLeave no stone unturned in your quest for knowledge, be brave, be strong but most of all be lucky. As your knowledge of the fearful HORROR ZOMBIES increases, you realise that the means to their exorcism lies in gaining access to their stronghold ... the crypt. To find it's entrance you must first challenge the sanctity of the family chapel. The point of no return, ahead lies the final conflict. Remember, here death is no release, you must be victorious or suffer an eternal fate.","popularity":1.333333333333333,"games":[55752,25646,7329,28154,7709,12597,14760,21062,9174,117],"tags":[1,19,268435464,268435489,536871123,536872032,536872617,536872961,536873192,536874813,536875073,536875075,536875081,536875091,536875229,536875330,536875396,536875485,536875511,536875524,536875639,536875690,536875745,536875777,536875822,536876010,536876029,536876031,536876188,536876862,536878349,536878439,1073741828],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[211,1120,1705,2049,2280,3901,4161,4163,4169,4179,4317,4418,4484,4573,4599,4612,4727,4778,4833,4865,4910,5098,5117,5119,5276,5950,7437,7527],"themes":[1,19],"genres":[8,33],"first_release_date":694137600000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":694137600000,"human":"1991","y":1991,"m":12},{"category":7,"platform":13,"human":"TBD"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d6wie7ch25dgcoqrvy21.jpg","cloudinary_id":"d6wie7ch25dgcoqrvy21","width":640,"height":810}}