{"id":38745,"name":"Phozon","slug":"phozon","url":"https:\/\/www.igdb.com\/games\/phozon","created_at":1497997046890,"updated_at":1515805681848,"summary":"The player must take control of the Chemic, a small black atom with red spikes which must adhere itself to passing Moleks (which come in four different colours: cyan, green, pink and yellow) in order to duplicate the patterns shown in the centre of the screen; if a Molek adheres itself to the Chemic incorrectly, the player must press the reject button to throw it away. The singular enemy in the game is the Atomic, a malevolent clump of balls which moves randomly around the screen, and will kill the Chemic if it merely touches it - however, the Chemic can counter-attack by adhering itself to a Power Molek (which are slightly larger than the regular Moleks, and first appear in the game's second world: once the Chemic has adhered itself to one, the adhered Moleks will spin around rapidly, and their speed will decrease to denote the nearing of the Power Molek's ending time limit). But the Atomic has a nasty habit of splitting up and reforming in order to cover more ground, and even the Power Moleks cannot match up to the Atomic's deadly Alpha- and Beta-Rays which can instantly cause them to float away (along with the regular Moleks) on contact; there are total of eighteen unique patterns which must be duplicated in the game, and every fourth stage is a \"challenging stage\" where the Chemic can fire yellow Moleks in four directions at the Atomic.","popularity":1.333333333333333,"games":[60044,25222,25646,56279,20329,8197,51485,26223,14047,36794],"tags":[1,268435465,268435489,536872407,536873081,536873787,1073741828],"developers":[263],"publishers":[263],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[1495,2169,2875],"themes":[1],"genres":[9,33],"first_release_date":441676800000,"platforms":[34,52,39],"release_dates":[{"category":0,"platform":34,"date":1433808000000,"human":"2015-Jun-09","y":2015,"m":6},{"category":0,"platform":39,"date":1326672000000,"human":"2012-Jan-16","y":2012,"m":1},{"category":2,"platform":52,"date":441676800000,"region":5,"human":"1983","y":1983,"m":12}],"alternative_names":[{"name":"フォゾン","comment":"Japanese title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/avzxupfryv4jcny1qkj0.jpg","cloudinary_id":"avzxupfryv4jcny1qkj0","width":250,"height":351},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Phozon"}]}