{"id":41545,"name":"Great Wall Street Fortune Hunt","slug":"great-wall-street-fortune-hunt","url":"https:\/\/www.igdb.com\/games\/great-wall-street-fortune-hunt","created_at":1498824043566,"updated_at":1500272743695,"summary":"THE GREAT WALL STREET FORTUNE HUNT is an authentic computerized model of the real investment world. The opportunities for investment in the game represent the thousands of alternatives available on the various exchanges. \n \nYou'll find conservative blue chips like IBM (International Business Machines Corporation) and high risk high flyers like WOW (Wildcat Oil Western). You'll find the fast food industry represented by McDonald's Corporation and high technology manufacturers represented by Texas Instruments. \n \nEach of the companies available for investment not only represents itself but other similar companies as well. Therefore the Standard Oil Company (Indiana) also represents Shell, Mobil, Arco and the other large petroleum companies. \n \nEach of the investments has a different sensitivity to the news flashes which come across the TV screen. For example - some investments will go up at a time of world crisis and others will go down. The inherent sensitivity of each investment to the various categories of news is graphically displayed on the gameboard. \n \nYour ultimate objective is to anticipate investment fluctuations swiftly enough to take full advantage of the many buying and selling opportunities which will occur in a different way every time you play. \n \nThe rules of The Great Wall Street Fortune Hunt are designed to replicate real life as closely as possible. You can play it at four levels. It is highly recommended that you feel thoroughly comfortable at one level before incorporating the next level as part of the game. Have fun! Make money!!!","popularity":1.333333333333333,"games":[11362,73075,9760,33603,36962,55888,65827,2015,32283,33383],"tags":[268435471],"category":0,"genres":[15],"first_release_date":381369600000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":381369600000,"region":8,"human":"1982-Feb-01","y":1982,"m":2}]}