{"id":48145,"name":"Laser Invasion","slug":"laser-invasion","url":"https:\/\/www.igdb.com\/games\/laser-invasion","created_at":1499956076781,"updated_at":1516158733375,"summary":"A summer offensive in the year 1999. Never in your military career have you been in such a hot spot, as the world's most threatening power, Sheik Toxic Moron, deploys his arsenal of TechnoScorch Weapons. To achieve total victory over 4 intense levels, you must possess numerous skills, including precision reflexes for air combat, a cut throat mentality for land assaults, the brains to gather secrets from underground informants, and a keen sense for surviving 3-D battle mazes. If you've got the guts to match those skills, then prepare for action. Because it'll really heat up the second you blast across the Sheik's firing line, piloting the world's most advanced super weapon - the Mach 4 Laser Invasion Helijet, which can go from hovering to a six \"G\" vertical climb in a heartbeat. From the moment you activate your Vulcan Cannons and Sidewinder Missiles, you'll take dead aim on an insane assault, featuring Anti-Copter Rocket Launchers, High-Altitude Bombers and Aerial Mines. But the battle's just begun, and there's no time to kill between firefights!","popularity":1.333333333333333,"games":[27314,36718,68287,19341,28751,36781,34919,28552,10039,25311],"tags":[1,268435461,268435469,536870968,536871365,536871501,536871904,536871937,536871969,536871971,536875075,536875242,536875358,536876028,536876348,536880223,1073741825],"category":0,"player_perspectives":[1],"keywords":[56,453,589,992,1025,1057,1059,4163,4330,4446,5116,5436,9311],"themes":[1],"genres":[5,13],"first_release_date":671673600000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":671673600000,"region":8,"human":"1991-Apr-15","y":1991,"m":4}],"alternative_names":[{"name":"Gun Fight","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cvgpbgk9la2epnglxvgv.jpg","cloudinary_id":"cvgpbgk9la2epnglxvgv","width":1539,"height":2100}}