{"id":51545,"name":"Super Hot VR","slug":"super-hot-vr","url":"https:\/\/www.igdb.com\/games\/super-hot-vr","created_at":1500575908271,"updated_at":1533702944509,"summary":"Blurring the lines between cautious strategy and unbridled mayhem, SUPERHOT VR is the definitive VR FPS in which time moves only when you move. No regenerating health bars. No conveniently placed ammo drops. It's just you, outnumbered and outgunned, grabbing the weapons of fallen enemies to shoot, slice, and maneuver through a hurricane of slow-motion bullets. \n \nBODIES ARE DISPOSABLE \nMIND IS SOFTWARE \nBODIES ARE DISPOSABLE \nMIND IS SOFTWARE \n \nDecisive winner of dozens of VR Game of the Year awards, SUPERHOT VR is a title reimagined and redesigned from the ground up for VR and hand tracking controllers. The fruit of over three years of close cooperation between the critically acclaimed SUPERHOT Team and Oculus, SUPERHOT VR brings the intensely visceral action of SUPERHOT directly into your head and soul. And now also - directly into your Vive. \n \n🏆 DICE Awards Immersive Reality Game of The Year 2017 Winner \n🏆 New York Game Awards Best Virtual Reality Game 2017 Winner \n🏆 Unity Vision Summit Virtual Reality Game 2017 Winner \n🏆 Pixel.Awards Best Virtual Reality Game 2017 Winner \n🏆 Digital Dragons Best Virtual Reality Game 2017 Winner \n🏆 GDCA Best VR Game 2017 Nominee \n🏆 SXSW Trending Game of the Year 2017 Nominee \n \n \nSUPERHOT VR now also includes the massive SUPERHOT FOREVER update, bringing hours of new replayable challenges, achievements and hardcore endless levels to SUPERHOT VR's time-bending gameplay, including: \n- Test your aim where only headshots take out enemies. \n- Race against your best scores in bullet-time and real-time. \n- Try to complete the game without shooting. \n- Get hardcore with faster enemies and less reaction time. \n \nThe game will test your limits. It will make you hurt. The good kind of pain. But at the end you will prevail. You will be one with the system.","hypes":2,"popularity":1.333333333333333,"category":0,"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/osfeh1fcfb6bvwdn7wna.jpg","cloudinary_id":"osfeh1fcfb6bvwdn7wna","width":1280,"height":720}}