{"id":56345,"name":"FIFA Mobile Soccer","slug":"fifa-mobile-soccer","url":"https:\/\/www.igdb.com\/games\/fifa-mobile-soccer","created_at":1504276852237,"updated_at":1523427014835,"summary":"FIFA Mobile has been reimagined to bring you the most authentic and exciting mobile soccer game you’ll ever experience! Score a bonus Cristiano Ronaldo item to start building and managing your team. Train any player to superstar status, attack opponents, and keep coming back for daily content all season long. Plus, get into the game on the go with a download size of under 100 MB. Whether you’re a savvy veteran or just starting out on the pitch, FIFA Mobile is your source for soccer. \nBUILD YOUR ULTIMATE TEAM™ \nDevelop the most competitive squad when you choose any 11 players from over 550 real teams, including stars from past and present, and train them to over 100 OVR. Add depth to your roster, manage your lineup on the fly, and quickly tweak tactics before every match. Make the right calls and watch your club become the Ultimate Team. \nATTACK TO WIN \nTake on thrilling matches that drop you into your offensive possessions with VS Attack mode. This innovative level of competition kicks your game into high gear while you strive to dominate 90-second matches, climb the leaderboards, and earn seasonal rewards year-round. \nKEEP UP WITH REAL-WORLD EVENTS \nStay connected to real-world soccer as it happens across the globe. Test your skills in single-player Campaign mode, then challenge yourself with uniquely themed Events where you can earn incredible prizes. \nQUICKLY JOIN A LEAGUE AND CONQUER THE WORLD \nA truly social experience that allows you to join forces and strive for glory with friends and gamers around the globe. Test your skills in inter-league championships, or take on the best gamers worldwide in League vs. League Tournaments to climb the leaderboards and prove your talent on the pitch. \n \nSQUAD BUILDING CHALLENGES \nAn immersive new experience rolling out weekly, Squad Building Challenges lets you strategically build different line-ups to earn amazing and meaningful rewards for your Ultimate Team. Take it one step further and carry these specific squads through VS Attack Tournaments all weekend long for even more great rewards. \nThis app: Requires a persistent Internet connection (network fees may apply). Requires acceptance of EA’s Privacy & Cookie Policy and User Agreement. Includes in-game advertising. Contains direct links to the Internet and social networking sites intended for an audience over 13. The app uses Google Play Game Services. Log out of Google Play Game Services before installation if you don’t want to share your game play with friends. \nUser Agreement: http:\/\/terms.ea.com \nPrivacy and Cookie Policy: privacy.ea.com\/en \nVisit http:\/\/help.ea.com\/en\/# for assistance or inquiries. \nEA may retire online features after 30 days’ notice posted on ea.com\/service-updates.","rating":80,"popularity":1.333333333333333,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[34919,55715,19341,25311,55077,33644,23835,44242,28465,37419],"tags":[1,268435469,268435470],"category":0,"themes":[1],"genres":[13,14],"first_release_date":1476057600000,"pulse_count":1,"platforms":[34,39],"release_dates":[{"category":0,"platform":39,"date":1476144000000,"region":8,"human":"2016-Oct-11","y":2016,"m":10},{"category":0,"platform":34,"date":1476057600000,"human":"2016-Oct-10","y":2016,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f8aizk2s2mqfiu3akw1v.jpg","cloudinary_id":"f8aizk2s2mqfiu3akw1v","width":2208,"height":1242},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/efv09iuwrblxqni7u3qe.jpg","cloudinary_id":"efv09iuwrblxqni7u3qe","width":2208,"height":1242},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fu02utpxicxzqfjillyz.jpg","cloudinary_id":"fu02utpxicxzqfjillyz","width":2208,"height":1242},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b4qmcqbqskxomhogbvci.jpg","cloudinary_id":"b4qmcqbqskxomhogbvci","width":2208,"height":1242}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ougleqc5zbonv2jpadbe.jpg","cloudinary_id":"ougleqc5zbonv2jpadbe","width":250,"height":250},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/fifa-soccer\/id1094930513?mt=8&uo=4"}]}