{"id":7845,"name":"Heroes Chronicles: Warlords of the Wasteland","slug":"heroes-chronicles-warlords-of-the-wasteland","url":"https:\/\/www.igdb.com\/games\/heroes-chronicles-warlords-of-the-wasteland","created_at":1413221967337,"updated_at":1517271112716,"summary":"Heroes Chronicles: Warlords of the Wasteland is the first game in the Heroes Chronicles series. Launched on 27 September 2000, simultaneously with three other Chronicles games, Warlords acts as the first chapter of the new saga, telling the story of Tarnum from before he became the Immortal Hero.\r\nAs all the Heroes Chronicles games, Warlords is based on the Heroes of Might and Magic III engine, and consists of a campaign, a tutorial, and previews of other three Chronicles games (Heroes Chronicles: Conquest of the Underworld, Heroes Chronicles: Masters of the Elements and Heroes Chronicles: Clash of the Dragons). This totals 12 scenarios. Unlike Heroes III, in Warlords importing extra scenarios or playing in multiplayer is prohibited.","storyline":"This story takes place before the foundation of the kingdom of Erathia. Once upon a time, the great barbarian King Jarg ruled over those lands. But then the Wizards of Bracaduun came and enslaved the barbarian people. Young Tarnum learns the long-lost history of his people from the last bards and decides to do anything to break the Wizards' rule. Becoming the new Barbarian King, he leads the clans against Bracaduun.\r\n\r\nAfter the death of the woman he fell in love with, Yalla, and the murder of one of the bards by the wizards, Tarnum's noble intentions become a sinister quest for blood and revenge. Decided to destroy the Wizard-Kings at all costs, he enslaves the inhabitants of the Mudlands and orders villages of \"traitors\" to be burned to the ground, even causing the death of one of his long-lost sisters.\r\n\r\nAfter months of campaign and terrible battles, his advisors express their hope to get back to their home, but Tarnum doesn't listen, obsessed by taking the fortress of Steelhorn. To avoid a rebellion, he has his advisors poisoned, including his old friend Hardac. Accusing the Wizards of his crime, he turns his army into a blood-thirsty Horde. Victory is at hand, but at a terrible cost: Tarnum is now known as the Barbarian Tyrant and has become everything he despised in the Wizards.\r\n\r\nSome time later, survivors from Bracaduun flee to the north and found the kingdom of Erathia. During a campaign to conquer the young kingdom, Tarnum is defeated by its first king Rion Gryphonheart. Tarnum soon discovers that Paradise is closed to him. Because of his crimes against his own people, the Ancestors have cursed him to wander the world eternally until he make up for \"the tremendous wrongs he performed\".\r\n\r\nIt is also worth noting that Gavin Magnus, the future Immortal King of Bracada, was present at the battle of Steelhorn and \"killed\" by one of Tarnum's behemoths. He then discovered he was in fact immortal.","collection":194,"franchise":458,"franchises":[458],"rating":50.506631866198,"popularity":1.333333333333333,"total_rating":50.506631866198,"total_rating_count":6,"rating_count":6,"games":[932,27209,11800,26766,26841,17583,12632,26391,36534,11567],"tags":[17,268435471,268435472,536871138,536871208,536871327,536871938,536872835,536874094,536874694,536874830,536875257,536875455,536876847,536877767,536878073,536880744,536881021,1073741827],"developers":[97],"publishers":[99],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[226,296,415,1026,1923,3182,3782,3918,4345,4543,5935,6855,7161,9832,10109],"themes":[17],"genres":[15,16],"first_release_date":970012800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":970012800000,"region":2,"human":"2000-Sep-27","y":2000,"m":9},{"category":0,"platform":6,"date":974419200000,"region":1,"human":"2000-Nov-17","y":2000,"m":11}],"alternative_names":[{"name":"Хроники Героев: Воины степей"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c6fzgq7rzxks5yowi3le.jpg","cloudinary_id":"c6fzgq7rzxks5yowi3le","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/juukl8i0rtzwob7umaym.jpg","cloudinary_id":"juukl8i0rtzwob7umaym","width":800,"height":600}],"videos":[{"name":"Game intro","video_id":"Ni4hXNixnAM"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qa1uqyco2wgghkiklxkd.jpg","cloudinary_id":"qa1uqyco2wgghkiklxkd","width":800,"height":600},"esrb":{"rating":3},"websites":[{"category":2,"url":"http:\/\/mightandmagic.wikia.com\/wiki\/Heroes_Chronicles:_Warlords_of_the_Wasteland"}]}