{"id":86945,"name":"Cooking Dash","slug":"cooking-dash--1","url":"https:\/\/www.igdb.com\/games\/cooking-dash--1","created_at":1518614996804,"updated_at":1523427093910,"summary":"Flo cooks her way to TV fame as a celebrity chef in this fast-paced time management game – COOKING DASH!\n\nSharpen your skill as you prepare, cook, and serve delicious menu items in each exotic restaurant… in front of a live studio audience! Hear them gasp and cheer as you earn profits in each exciting episode! Quirky customers, superstar VIPs, fast-paced kitchen action, and TV fame await!\n\nExcel as a chef to beat Series Finales and compete in the Trial of Style, where you can earn adorable Pets & Outfits!\n\nCOOK YOUR WAY TO STARDOM!\nControl the fast-paced chaos as you dash your way around the kitchen, preparing meals for crazy customers! Collect tons of tips for excellent service and make those profits! YOU ARE DESTINED FOR FABULOUS TV CHEF MEGA-FAME!\n\nHUNDREDS OF EPISODES TO COMPLETE!\nTons of fun cooking play across unique restaurant shows like the Vegas-themed Table Steaks, crazy Taco Train, and trendy Hip Stir Cafe with many more on the way! \n\nCOLLECT AND UPGRADE!\nWanna get more successful and famous? Spend your profits on upgrades for food and appliances for your restaurant! Upgrade to shiny stoves, fancy food prep stations, and more to ensure all customers get three-star service!\n\nPRIZE WHEELS!\nIntroducing Weldon Brownie’s brand new game show - Spin to Win! Spin a free Prize Wheel every day to win prizes like Gold, Prep Recipes, VIP Tickets, Auto Chefs, Outfits, Pets, and more!\n\nOUTFITS & PETS!\nDress up Flo in fun outfits themed for each Show, and equip Pets to help you out in the kitchen by auto-serving Prep Recipes!\n\nSERIES FINALES!\nWant to test your skill? Face a gauntlet of challenging levels in a Venue’s Series Finale - experts only! Beat every episode in a Venue with 4 or more Stars to unlock!\n\nTRIAL OF STYLE!\nTry your luck in the Trial of Style! This multiplayer event features different Venues each time - do you have what it takes to be the best?\n\nPREP AWESOME RECIPES FOR MORE CUSTOMERS!\nMake special Recipes in the Prep Kitchen and attract customers with their favorite dishes! They’ll get you more and more famous, drop cool items, and give you special powers to blast your coffers with mega-profits and keep your star on the rise! \n\nBECOME SUPER-FAMOUS!\nFan the flames of your fame as you start your OWN SHOW full of the most elite VIPs coming to see YOU and your amazing cheffing skills! It’s FOOD and FAME for you as you host the hippest dinner parties in the WORLD in front of MILLIONS of VIEWERS! It’s a TV Chef dream come true! \n\nPLAY WITH FRIENDS!\nExchange gifts and compete with friends on your never-ending quest to be the best!\n\nWHAT ARE YOU WAITING FOR?!?\nShow your stuff and feed the hungry stomachs -- and fragile egos -- of the guests and VIPs! Download the FREE Cooking Dash® today! THIS IS THE MOST INSANELY FUN DASH GAME EVER!\n\nCOOKING DASH now supports iPhone X in true wide-screen! See your favorite Venues in all their glory!\n\nPLEASE NOTE: \n- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.\n- Please buy carefully.\n- Advertising appears in this game.\n- This game permits users to interact with one another (eg. chat rooms, player to player chat, messaging). Linking to social networking sites are not intended for persons under age 13.\n- A network connection is required to play.\n- A network connection is required to enable certain features\/access certain content. \n- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com\/privacy\n- If you have a problem with this game, please contact us at: www.Glu.com\/support","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"version_parent":16068,"version_title":"iOS version","games":[11362,9760,33603,36962,55888,73075,65827,2015,32283,75065],"tags":[268435471,268435489],"category":0,"genres":[15,33],"first_release_date":1434412800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1434412800000,"region":8,"human":"2015-Jun-16","y":2015,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vzxklal3p9tkm8mdozm5.jpg","cloudinary_id":"vzxklal3p9tkm8mdozm5","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zu1kreotefeqgdxbpng2.jpg","cloudinary_id":"zu1kreotefeqgdxbpng2","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/antcz6yljtggtakxvzqi.jpg","cloudinary_id":"antcz6yljtggtakxvzqi","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pq3ulorp2rflqmkhmxqc.jpg","cloudinary_id":"pq3ulorp2rflqmkhmxqc","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eucwx6mqv76u5w6394su.jpg","cloudinary_id":"eucwx6mqv76u5w6394su","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/suxdtbzeasvotyszi76e.jpg","cloudinary_id":"suxdtbzeasvotyszi76e","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fnvrmsv0e5p7j5fk04am.jpg","cloudinary_id":"fnvrmsv0e5p7j5fk04am","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jdfgxsiargiu2uyvij2b.jpg","cloudinary_id":"jdfgxsiargiu2uyvij2b","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xsld2m9dnzqnbjjmr6ue.jpg","cloudinary_id":"xsld2m9dnzqnbjjmr6ue","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zoqyq0p9brjyhmutfjrg.jpg","cloudinary_id":"zoqyq0p9brjyhmutfjrg","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jnty78zqug1yx5qaxppz.jpg","cloudinary_id":"jnty78zqug1yx5qaxppz","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/cooking-dash\/id978866413?mt=8&uo=4"}]}