{"id":94445,"name":"Rascal","slug":"rascal","url":"https:\/\/www.igdb.com\/games\/rascal","created_at":1521401988893,"updated_at":1547238402040,"summary":"Rascal is a platform game developed by Traveller's Tales[1] and published by Psygnosis exclusively for the PlayStation. The main character and several enemies were designed by Jim Henson's Creature Shop. \n \nbut to his horror two aliens in spacecraft appear and chase him down the corridor. \n \nRascal finally makes it to his father's lab by going through the safe door entrance. He is shocked to find Chronon, the evil master of time, torturing his dad for unknown reasons, and holding him at gunpoint with another of his dad's inventions called the \"Bubble Gun\", but Chronon accidentally activates the controls for the time machine and he and the Professor are sucked into the time portal. The Bubble Gun manages to be released from the portal and lands at the feet of Rascal, who picks it up, vowing to save his dad. \n \nRascal chases the two through time, from the medieval Castle Hackalott, to the Aztec Temple at Chichimeca, to the lost city of Atlantis, to the Jolly Raider pirate ship and Dodgy City in the old West, travelling to each location's past and present forms and collecting the pieces of a Time Clock from both before fighting Chronon in each area's future. Afterwards Rascal travels to the Corridors of Time, Chronon's lair within the space-time continuum where, after defeating its guardians brought from each of the other time periods, he successfully defeats Chronon and rescues his dad. After escaping using another time portal, Rascal and his dad safely return home, leaving the portal to shatter and trap Chronon in interdimensional time forever. \n \nGameplay \nIn the game, the player assumes the role of Rascal armed with the Bubble Gun, in a mission through five worlds involving a medieval castle, ancient Aztec ruins, the aquatic city of Atlantis, a pirate ship and a Western town.[1] Each world has three forms: past, present, and future[1] (e.g. Castle Hackalott appears as a medieval castle in the past where in the present day, it has become a museum). \n \nThe player needs only to complete the past level to gain access to the next world. In each past and present level, the player has to find the six pieces of the Time Clock in order to access the Time Bubble at the end and be able to access the next form of that world. Each future level has a boss fight against Chronon. Defeating him in all five gives access to the final world. The Bubble Gun has limited ammo, and which bubbles it shoots depends on how much ammo is left.","storyline":"Professor Casper Clockwise is in his lab making the final adjustments to his time travelling device, when suddenly someone creeps behind him. Meanwhile, his son Callum \"Rascal\" Clockwise is walking through a secret route under the house to get to his father's lab when suddenly the lights go out and an alarm sounds. Rascal rushes down to see the problem, but to his horror two aliens in spacecraft appear and chase him down the corridor. \n \nRascal finally makes it to his father's lab by going through the safe door entrance. He is shocked to find Chronon, the evil master of time, torturing his dad for unknown reasons, and holding him at gunpoint with another of his dad's inventions called the \"Bubble Gun\", but Chronon accidentally activates the controls for the time machine and he and the Professor are sucked into the time portal. The Bubble Gun manages to be released from the portal and lands at the feet of Rascal, who picks it up, vowing to save his dad. \n \nRascal chases the two through time, from the medieval Castle Hackalott, to the Aztec Temple at Chichimeca, to the lost city of Atlantis, to the Jolly Raider pirate ship and Dodgy City in the old West, travelling to each location's past and present forms and collecting the pieces of a Time Clock from both before fighting Chronon in each area's future. Afterwards Rascal travels to the Corridors of Time, Chronon's lair within the space-time continuum where, after defeating its guardians brought from each of the other time periods, he successfully defeats Chronon and rescues his dad. After escaping using another time portal, Rascal and his dad safely return home, leaving the portal to shatter and trap Chronon in interdimensional time forever.","popularity":2.333333333333333,"games":[1070,1073,76253,10039,103316,29032,109460,103312,23852,16746],"tags":[1,268435464,536871298,1073741826],"developers":[292],"publishers":[764],"category":0,"player_perspectives":[2],"keywords":[386],"themes":[1],"genres":[8],"first_release_date":891302400000,"platforms":[7],"release_dates":[{"category":0,"platform":7,"date":891302400000,"region":2,"human":"1998-Mar-31","y":1998,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5woi.jpg","cloudinary_id":"sc5woi","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5woh.jpg","cloudinary_id":"sc5woh","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5wog.jpg","cloudinary_id":"sc5wog","width":640,"height":480}],"videos":[{"name":"Gameplay video","video_id":"SGqqhC1FaVk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1ikc.jpg","cloudinary_id":"co1ikc","width":256,"height":250},"esrb":{"rating":3},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Rascal_(video_game)"}]}