{"id":38747,"name":"Pathways into Darkness","slug":"pathways-into-darkness","url":"https:\/\/www.igdb.com\/games\/pathways-into-darkness","created_at":1498031619003,"updated_at":1513086914353,"summary":"A first-person shooter paired with RPG elements with a few survival elements added in. You start exploring a pyramid after getting separated from the rest of your team.","storyline":"Sixty-four million years ago, a large extra-terrestrial object struck the Earth in what would later be called the Yucatan Peninsula, in southeastern Mexico. The dust and rock thrown up by the resulting explosion caused enormous climactic changes in the ensuing years, and many of the Earth's species became extinct during the long winter that followed. \n \nThe object itself was buried thousands of feet below ground, its nearly two kilometer length remarkably intact. It remained there, motionless, for thousands of years before it finally began to stir- and to dream. It was a member of a race whose history began when the Milky Way was still a formless collection of dust and gas- a powerful race of immortals which had quickly grown bored of their tiny universe and nearly exterminated themselves in war. \n \nThis particular being, whose name no human throat will ever learn to pronounce, was part of the cataclysmic battle that formed Magellanic Clouds, billions of years ago. It died there, or it came as close to dying as these things can, and drifted aimlessly for millions of light years before striking the Earth. \n \nThe heat of impact liquefied the rock around it, which later cooled and encased the dead god's huge body far below ground. As it began to dream, it wrought unintentional changes in its environment. Locked deep beneath the Earth, strange and unbelievable things faded in and out of reality. Vast caverns and landscapes bubbled to life within the rock, populated by horrible manifestations of the dead god's dream. \n \nOnly during the last few centuries has the god begun to effect changes on the surface of the Earth. Grotesque creatures have been sighted deep in the trackless forest of the Yucatan, and strange rumors of an ancient pyramid- which is neither Aztec nor Mayan- in the same area have been circulating in the archaeological community since the early 1930's. \n \nThe god is awakening.","popularity":1.333333333333333,"games":[13189,29525,25646,27314,26914,11296,26192,28552,37016,44076],"tags":[1,19,268435461,268435487,536870915,536871365,536871939,536872032,536872225,536872286,536876237,536876251,536877216,536885139,1073741825],"developers":[620],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[3,453,1027,1120,1313,1374,5325,5339,6304,14227],"themes":[1,19],"genres":[5,31],"first_release_date":744163200000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1365465600000,"region":8,"human":"2013-Apr-09","y":2013,"m":4},{"category":0,"platform":14,"date":744163200000,"region":8,"human":"1993-Aug-01","y":1993,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvfgsm6xzg8srqoffl6b.jpg","cloudinary_id":"yvfgsm6xzg8srqoffl6b","width":480,"height":360}],"videos":[{"name":"Gameplay video","video_id":"5XhUWrxuE1E"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wkcwaoherzrefglmdwgo.jpg","cloudinary_id":"wkcwaoherzrefglmdwgo","width":256,"height":331},"websites":[{"category":5,"url":"https:\/\/twitter.com\/bungie"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Pathways_into_Darkness"},{"category":2,"url":"http:\/\/bungie.wikia.com\/wiki\/Pathways_into_Darkness"},{"category":1,"url":"https:\/\/www.bungie.net\/en\/AboutUs#page=games&game=10127"}]}