{"id":39747,"name":"Walden","slug":"walden","url":"https:\/\/www.igdb.com\/games\/walden","created_at":1498199030280,"updated_at":1513086756654,"summary":"Walden, a game, is a first person simulation of the life of American philosopher Henry David Thoreau during his experiment in self-reliant living at Walden Pond. The game begins in the summer of 1845 when Thoreau moved to the Pond and built his cabin there.  \n \nPlayers follow in his footsteps, surviving in the woods by finding food and fuel and maintaining their shelter and clothing. At the same time, players are surrounded by the beauty of the woods and the Pond, which hold a promise of a sublime life beyond these basic needs. The game follows the loose narrative of Thoreau’s first year in the woods, with each season holding its own challenges for survival and possibilities for inspiration.  \n \nThe audience for the game is broad: from experimental game players to lovers of Thoreau and Transcendental literature. As such, the game offers more opportunities for reflective play than strategic challenge. The piece has a subtle narrative arc, in homage to the original text, which is not an adventure of the body pitted against nature, but of the mind and soul living in nature over the course of a New England year.  \n \nWe have just opened a quiet early access alpha on Itch.io if you'd like to play now and give feedback. For those of you asking why we haven't updated this site in a while ... well, we've been very busy building a six-hour open world game with a tiny team of developers! But, we're really close now and are looking forward to releasing the final version in time for the 200th anniversary of Thoreau's birth this year.","popularity":1.333333333333333,"games":[28465,34919,33603,36962,55888,65827,16468,40524,27266,28277],"tags":[268435488,536871415,536873491],"category":0,"keywords":[503,2579],"genres":[32],"status":4,"pulse_count":2,"platforms":[6,14],"release_dates":[{"category":7,"platform":14,"human":"TBD"},{"category":7,"platform":6,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/knsjbcev2nn56n3ya7g0.jpg","cloudinary_id":"knsjbcev2nn56n3ya7g0","width":640,"height":360}],"videos":[{"name":"Trailer","video_id":"eoc8OnYvZfw"}],"websites":[{"category":1,"url":"http:\/\/waldengame.com\/"}]}