{"id":48047,"name":"Cooking Guide Can't Decide to Eat?","slug":"cooking-guide-cant-decide-to-eat","url":"https:\/\/www.igdb.com\/games\/cooking-guide-cant-decide-to-eat","created_at":1499954041360,"updated_at":1500367105868,"summary":"Want to make yourself a quick dinner after a long day at work? Want to plan a week of meals for your family? Or do you want to make a Sunday roast for 10? Cooking Guide can help you solve all these and many other meal dilemmas. Choose from 250 recipes from all over the world. Cooking Guide takes you through every step from compiling a shopping list, preparation of ingredients and utensils through to a step-by-step guide of how to make your chosen meal. \n \nInteractive cooking aid that takes you through 250 recipes from scratch. \n \n- Takes the user through every stage of cooking - from purchasing ingredients in the supermarket through to each stage of cooking. \n \n- The recipes are enhanced with many demonstrational videos which go beyond the capabilities of printed cook books offering a blend between a traditional cookbook and a DVD but in a more convenient package. \n \n- Additional functionalities are included to facilitate the cooking and preparation process, including a shopping list application, the ability to add notes, timers and quantity calculators for all recipes. \n \n- The software guides the user through a recipe by enunciating the cooking instructions and can be voice controlled while cooking.","popularity":1.333333333333333,"games":[44242,24491,28465,75579,75275,34919,75102,33603,36962,55888],"tags":[268435469],"category":0,"genres":[13],"first_release_date":1230076800000,"platforms":[20],"release_dates":[{"category":0,"platform":20,"date":1230076800000,"region":8,"human":"2008-Dec-24","y":2008,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iop5xgp20fjh2elidp3b.jpg","cloudinary_id":"iop5xgp20fjh2elidp3b","width":1500,"height":1333}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zz4geccdo9iogt0gihrw.jpg","cloudinary_id":"zz4geccdo9iogt0gihrw","width":1500,"height":1332}}