{"id":51347,"name":"Jazz Jackrabbit 2: The Secret Files","slug":"jazz-jackrabbit-2-the-secret-files","url":"https:\/\/www.igdb.com\/games\/jazz-jackrabbit-2-the-secret-files","created_at":1500065046019,"updated_at":1515679254985,"summary":"Jazz Jackrabbit 2: The Secret Files is an old dos game, published in 1999 by Epic Megagames. Main genre of this old game is action. We gave this game stunning rating of 88 and you can download it for free right here. If I say green, crazy, running and hopping hare, many will surely now think about the famous computer character - Jazz Jackrabitt and they would guessed who am I thinking about. The game Jazz Jackrabbit 2: The Secret Files is an extension to the second game from 1998 and it adds one more episode. \n \nIn this game, you might choose to play as one of three characters: of course, there is Jazz Jackrabbit and there is also his brother Spaz and Lori, his lost sister. The story is classic, it's about kidnapping a almost the same as in the game from 1998 (Jazz was about to het married to his longtime girlfriend Eva Earlong, but his arch-enemy, turtle Devan Shell, stole the wedding ring, captured Eva's mom and you, together with your brother imprisoned in the dungeon. The goal is clear: together with your brother, you must escape from prison, recover the precious jewel and save your future mother-in-law (who would do that, right? :)). You can play as Lori too and there numbers of different routes in every level you can take.","collection":180,"popularity":1,"games":[55752,36868,10039,25646,37094,29525,6732,36950,19289,51485],"tags":[1,268435461,268435464,268435465,268435466,268435487,536871049,536871306,536872961,536875073,536875088,536875712,536875904,536877056,536880232],"category":0,"keywords":[137,394,2049,4161,4176,4800,4992,6144,9320],"themes":[1],"genres":[5,8,9,10,31],"first_release_date":897177600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":897177600000,"region":8,"human":"1998-Jun-07","y":1998,"m":6}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rqb6a4b1wset2yjfkug7.jpg","cloudinary_id":"rqb6a4b1wset2yjfkug7","width":640,"height":480}}