{"id":70647,"name":"The Hidden: Source","slug":"the-hidden-source","url":"https:\/\/www.igdb.com\/games\/the-hidden-source","created_at":1506600053572,"updated_at":1537625506825,"summary":"The Hidden is a multiplayer total conversion for the popular Half-Life 2 computer game. The gameplay revolves around the retrieval of an escaped research subject where the subject is highly agile, incredibly strong, and nearly invisible. The first beta version was released on June 13, 2005 and its latest release was September 8, 2007.","storyline":"In the early 1950s human genetics experimentation was taking its first, tentative steps. Amongst many other black projects, a team of British scientists working at an Infinitum Research experimental station stumbled across some remarkable phenomena involving DNA manipulation. This led to deeper research with dangerously unpredictable results, often leading to human patients losing their lives in irresponsible and immoral experiments. \n \nTime passed on, and by the mid 1990s the failure rate of the experiments had been reduced from 75% to a mere 15%, enough for Infinitum to move onto the next stage: Biological Light Refraction. The British team were hoping to unravel the possibilities of light manipulation to create the perfect covert military agent. Early into the new millennium, due to a gross miscalculation, a series of tests on Subject 617 led to a massive synaptic trauma leaving the patient with multiple genetic anomalies. \n \nThe subject was left in constant pain and with unstable DNA. The subject escaped captivity, killing anyone that got in its way. The I.R.I.S. (Infinitum Research Interception Squad) team have been deployed to return the subject to a maximum security Infinitum Research facility for further study and dissection. The entire project was considered a failure: all funding ceased and development was discontinued while all records and traces of the experiments were destroyed. Infinitum Research denies all knowledge of any form of human DNA manipulation but are more than happy to comment on the possibilities of cloning human organs inside suitable animal donors. It is believed that these organ cloning experiments form the main cover for their human genetic manipulation experimentations. \n \nSubject 617, known as 'The Hidden', must turn the tables and become the hunter instead of the hunted as the I.R.I.S. team close their net around him. \n g their lives in irresponsible and immoral experiments.","popularity":1,"game":233,"games":[28751,29525,55038,36950,15536,68287,27011,18088,37016,7350],"tags":[1,18,19,268435461,536870913,536870915,536871041,536871044,536871365,536871506,536871882,536872032,536872695,536873297,536874743,536874947,536875098,536875171,536875216,536875242,536875249,536875287,536875420,536875483,536875572,536875743,536875745,536875792,536876660,536876687,536876690,536877077,536880066,536881468,536882912,536883035,1073741825],"game_engines":[3],"category":4,"player_perspectives":[1],"keywords":[1,3,129,132,453,594,970,1120,1783,2385,3831,4035,4186,4259,4304,4330,4337,4375,4508,4571,4660,4831,4833,4880,5748,5775,5778,6165,9154,10556,12000,12123],"themes":[1,18,19],"genres":[5],"first_release_date":1189209600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1189209600000,"human":"2007-Sep-08","y":2007,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lljr4kvn3bjesh8rsgx6.jpg","cloudinary_id":"lljr4kvn3bjesh8rsgx6","width":480,"height":360},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/The_Hidden_(video_game)"},{"category":1,"url":"http:\/\/www.hidden-source.com"}]}