{"id":8747,"name":"Perfect World","slug":"perfect-world","url":"https:\/\/www.igdb.com\/games\/perfect-world","created_at":1422076791064,"updated_at":1529206529996,"summary":"Discover your place in the struggle for power amidst a realm of stunningly beautiful, fantastical environments. Fly freely to access new heights, set out on new adventures, and obtain more power to spread your name throughout the land.\n\nTake to the skies now and discover the secrets of Perfect World!","storyline":"In the beginning of time, the first God of the universe, Pan Gu, lived an immortal life. But with no subjects to lord over, Pan Gu grew tired of his solitary existence and decided to decompose his body into five elements-fire, metal, wood, earth, and water. With his divine power, Pan Gu forged these elements into air, land, mountains, rivers, seas, and plant life and laid the foundation for a new world. It was then that Pan Gu made his first attempt to fill this new world with life. From his shadow he formed the first sentient beings. These unnamed creatures were uncivilized, and before long, they began turning on one another and corrupting the world around them. Pan Gu saw that what he had created had become an Imperfect World, and moved quickly to rectify his mistake. He built a floating city known as Heaven's Tear, and placed within the city the few creatures that had yet to be corrupted. Then, with the power of water and wind, Pan Gu created a massive flood, which swept through the land and destroyed all life in its path.\nThe world now cleansed, Pan Gu set about creating a new world, one filled with beings who were capable of Spiritual Cultivation. He created three races that possessed the traits he most treasured in himself. The Human race was born of Pan Gu's spirit, and demonstrated morality, honor, and an unlimited imagination. The race of the Untamed, born of Pan Gu's body, embodied freedom and peace, and possessed a unique connection with the natural order of the world. And the third race, the Winged Elves, were born of Pan Gu's own blood, and exemplified beauty, grace, and purity. Between the three races, the Perfect World was created.\nThe chief quality that Pan Gu gave all three races was free will. He vowed never again to eradicate an entire species, so all conflicts between the races were to be resolved amongst themselves. One such conflict arose between the Humans and Winged Elves when the two races discovered the city of Heaven's Tear. A war erupted as they fought for control of the great city, bringing out the worst in both races. The Untamed remained neutral, as they were content with living in harmony with the natural world. As the war intensified, and neither side relented, a new threat emerged.\nThe race that was thought to have been eradicated in the great flood returned in full force. These creatures were not quite living, but not quite dead, and thus came to be known as wraiths. The wraiths appeared to possess a singular objective: to destroy the other races and corrupt the beautiful world around them. Rumors swirled that the wraiths were capable of possessing other living things. Not much is known about the true nature of this evil, but one thing is clear. The three races Human, Untamed, and Winged Elf must set aside their differences and unite to preserve their way of life, halt the spread of corruption, and above all, protect the Perfect World.","collection":1178,"franchise":521,"franchises":[521],"rating":64.6942962659007,"popularity":2.666666666666667,"total_rating":64.6942962659007,"total_rating_count":6,"rating_count":6,"games":[18337,603,1911,9804,2933,72945,26359,1223,23198,1081],"tags":[1,17,22,38,268435468,536871138,536871139,536871148,536871208,536871213,536871283,536871422,536871470,536871504,536871812,536871865,536871938,536872010,536872245,536872449,536872647,536873066,536873089,536873297,536873364,536873473,536874040,536874398,536874831,536875073,536875161,536875169,536875196,536875197,536875271,536875304,536875307,536875311,536875314,536875356,536875372,536875380,536875455,536875457,536875496,536875525,536875735,536875738,536875790,536875791,536875798,536875799,536875822,536875897,536875952,536876232,536876281,536876286,536876388,536876503,536876537,536876546,536876718,536877992,536878359,536878391,536880421,536880755,536881122,536883035,536883865,1073741826],"developers":[4678],"publishers":[917,4678],"game_engines":[167,168,169],"category":0,"player_perspectives":[2],"game_modes":[5],"keywords":[226,227,236,296,301,371,510,558,592,900,953,1026,1098,1333,1537,1735,2154,2177,2385,2452,2561,3128,3486,3919,4161,4249,4257,4284,4285,4359,4392,4395,4399,4402,4444,4460,4468,4543,4545,4584,4613,4823,4826,4878,4879,4886,4887,4910,4985,5040,5320,5369,5374,5476,5591,5625,5634,5806,7080,7447,7479,9509,9843,10210,12123,12953],"themes":[1,17,22,38],"genres":[12],"first_release_date":1120176000000,"pulse_count":2,"platforms":[6],"release_dates":[{"category":1,"platform":6,"date":1120176000000,"region":6,"human":"2005-Jul","y":2005,"m":7},{"category":2,"platform":6,"date":1230681600000,"region":1,"human":"2008","y":2008,"m":12},{"category":0,"platform":6,"date":1220313600000,"region":2,"human":"2008-Sep-02","y":2008,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cl58zvjrim44rz3p4jvu.jpg","cloudinary_id":"cl58zvjrim44rz3p4jvu","width":732,"height":471},"esrb":{"rating":5},"pegi":{"rating":3},"websites":[{"category":1,"url":"http:\/\/www.pwrd.com\/en\/index.htm"}]}