{"id":93847,"name":"Call of Duty: Ghosts - Multiplayer","slug":"call-of-duty-ghosts-multiplayer","url":"https:\/\/www.igdb.com\/games\/call-of-duty-ghosts-multiplayer","created_at":1521378455376,"updated_at":1532538695023,"summary":"New DLC AvailableNemesis - the 4th DLC pack for Call of Duty®: Ghosts.GOLDRUSH - Abandoned gold mine with a network of narrow tunnels and perilous shafts. SUBZERO - Snowbound Canadian submarine base complete with control room, submarine pen and research facilities. DYNASTY - Chinese lakeside village surrounded by mountains.SHOWTIME - Remake of \"Shipment\" from Call of Duty(r) 4: Modern Warfare(r). Re-imagined as a futuristic death arena, ideal for close quarters combat. Extinction - Episode 4: ExodusYour team must try to evacuate key personnel to a low orbit space station as earth becomes overrun by Cryptids. To do so you must fight through Ancestors, the deadliest of enemies.Weapon - The Maverick: Outfitted with a lightweight wood stock and a digital screen display, players can choose to use the Maverick as either an assault rifle or sniper rifle, depending on their tactical needs.Weapon - The Ripper: Provides players with two different configurations: medium to short-range capability as a Sub Machine-Gun (SMG), and medium to long-range as an Assault Rifle (AR).Bling Character Pack: Live the high life head-to-toe with the Bling Character Pack. Blind your enemies with a gold and diamond accented uniform and 2 different headgear options.Blunt Force Character Pack: Arm yourself with the Blunt Force Character Pack and enemies will experience chronic defeat at your hands. The pack comes complete with a leafy uniform and 2 different headgear options.Inferno Character Pack: A firefight really becomes a fire fight with the Inferno Character Pack. Burn down any multiplayer match by equipping this eye-catching uniform and 2 different headgear options.Abstract Pack: Sometimes you have to engage in Post-modern warfare. Deploy with the vivid Abstract Personalization Pack, complete with a masterfully painted camo, ink-splattered reticle, patch, playercard and background.Hydra Pack: More dragon heads equal more fire, and that is just what the Hydra Personalization Pack delivers thanks to a fiery camo, reticle, patch, playercard and background. Leopard Pack: Stalk your prey in the shadows with the Leopard Personalization Pack, featuring an animal print camo for your weapons, plus a themed reticle, patch, playercard and background.Nebula Pack: Look light-years ahead of your competition with the Nebula Personalization Pack. This pack comes complete with a nebular camo, reticle, patch, playercard and background.Skulls Pack: Send your enemies to the grave with the Skulls Personalization Pack. Deck your kit out with an undead themed camo, reticle, patch, playercard and background.Tattoo Pack: The Tattoo Personalization Pack gets you ready for life on the high seas. Set sail with a nautical camo, anchored reticle, as well as patch, playercard and background.Call of Duty®: Ghosts Gold EditionCall of Duty®: Ghosts Gold Edition, includes the full game download for Call of Duty: Ghosts as well as Onslaught, the first DLC pack for Ghosts. Onslaught features four new multiplayer maps, The Maverick, an all new dual-purpose Assault Rifle\/Sniper Rifle and Extinction Episode 1: Nightfall, the first of a four part episodic series. As an added bonus, you also get The Wolf, a character skin that transforms your multiplayer Guard Dog killstreak into a Wolf.All for one great low price.About the GameOutnumbered and outgunned, but not outmatched.Call of Duty®: Ghosts is an extraordinary step forward for one of the largest entertainment franchises of all-time. This new chapter in the Call of Duty® franchise features a new dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive.Fueling this all new Call of Duty experience, the franchise's new next-gen engine delivers stunning levels of immersion and performance, all while maintaining the speed and fluidity of 60 frames-per-second across all platforms.Single Player CampaignTen years after a devastating mass event, America’s borders and the balance of global power have changed forever. As what's left of the nation's Special Operations forces, a mysterious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power.A New Call of Duty Universe: For the first time in franchise history, players will take on the underdog role with Call of Duty: Ghosts; outnumbered and outgunned, players must fight to reclaim a fallen nation in an intensely personal narrative. Gamers will get to know an entirely new cast of characters and visit locales in a changed world unlike anything seen in Call of Duty® before.MultiplayerIn Call of Duty: Ghosts you don't just create a class, you create a soldier, a first for the franchise. In the new Create-A-Soldier system, players can change the physical appearance of their soldier by choosing the head, body type, head-gear and equipment, and for the first time in a Call of Duty® game, the player can also choose their gender. With 20,000 possible combinations, this is the most flexible and comprehensive character customization in Call of Duty history.New dynamic maps are the evolution of multiplayer. They include interactive elements and player triggered events that make the environment evolve as each match goes on. The entire landscape can shift and force players to change tactics and strategies.Call of Duty: Ghosts introduces new tactical player movements. The new contextual lean system now allows players to lean around obstacles without adding button combinations or fully leaving cover. The new mantling system allows fluid movement over objects, while maintaining momentum. The knee slide allows for a natural transition from sprinting crouching to prone.Call of Duty: Ghosts delivers over 20 NEW Kill Streaks such as Juggernaut Maniac, the Helo Scout, the Vulture and the ODIN Strike. Players can even bring in guard dog Riley, from the single-player campaign, to protect and also to attack enemies. There are also over 30 NEW weapons, including an entirely new weapon class: Marksman Rifles. SquadsBuild your team and take up to 6 of them into battle in the all new Squads mode. This mode takes the best parts of the multiplayer experience and allows you to play either solo or cooperatively with the custom soldiers created and leveled up in multiplayer.The load-out choices you make for your Squad members will directly change the AI behavior of your squad-mates. Give your soldier a sniper rifle and he'll behave like a sniper, and an SMG guy will be more run and gun.","popularity":1,"developers":[438],"publishers":[66],"category":0,"game_modes":[1,2],"themes":[1],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zigpkdyroxnnwxsnq07g.jpg","cloudinary_id":"zigpkdyroxnnwxsnq07g","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ma9gnn9rkevujfjmizgv.jpg","cloudinary_id":"ma9gnn9rkevujfjmizgv","width":1920,"height":1079},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p3ttpim1hdcznb8cwi0p.jpg","cloudinary_id":"p3ttpim1hdcznb8cwi0p","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ytqimhuhcdk6dpbyp54o.jpg","cloudinary_id":"ytqimhuhcdk6dpbyp54o","width":1620,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dzh0bieux585lg3egejw.jpg","cloudinary_id":"dzh0bieux585lg3egejw","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tddpijf0z1vcarkloc3p.jpg","cloudinary_id":"tddpijf0z1vcarkloc3p","width":1920,"height":1080}],"websites":[{"category":1,"url":"http:\/\/www.callofduty.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/209160"}],"external":{"steam":"209170"}}