{"id":17081,"name":"Spaceforce Homeworld","slug":"spaceforce-homeworld","url":"https:\/\/www.igdb.com\/games\/spaceforce-homeworld","created_at":1454425231524,"updated_at":1523260447966,"summary":"Spaceforce Homeworld, missile hell of epic proportions, with PowerUps and Reinforcement Calls will bring back the nostalgia of classic retro arcade shooter games.\n\nFor hundreds of years humans have searched for an answer to the eternal question: Are we alone in the universe?\n\nGet armed, kill the enemy. Follow the story as you explore the levels and call for help. If you keep improving, your 3 types of tanks or Valkyrie and Fighter spaceships can keep you a step ahead of the enemy. Can you save the capital cities of earth? Defeat is not an option, humanity could be annihilated.\n\nSpaceforce HOMEWORLD is a game in which the player combats a large number of alien forces, by shooting at them while dodging their fire. Both on land and in space it is a classic struggle filled with droves of aliens and weapon power-ups.\nGet your plasma gun, rocket or laser firing because the aliens are invading!\n\nBattle through 50+ levels facing continuous swarms of allied alien vessels that randomly change shape and size, attack pattern and weapon type. Pick up valuable power-ups including weapon upgrades that can turn your tank or spaceship into a lethal machine!  Bravery is a necessity, in order to accomplish your mission sometimes, you will nearly sacrifice yourself.\n\nTank and spaceship mines and missiles will also be a welcome addition to your arsenal. It will help take out hostile alien clusters. There are three different tanks in the game, each of them can be upgraded by collecting power-ups. The two spaceships: Valkyrie and Fighter, will help your mission to annihilate the alien motherships responsible for destroying earth's capital cities!","popularity":1,"games":[36608,2940,40524,34919,71581,29660,1070,23175,76438,16468],"tags":[1],"developers":[8332],"publishers":[8332],"category":0,"game_modes":[1],"themes":[1],"first_release_date":1388707200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1388707200000,"human":"2014-Jan-03","y":2014,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vdvrsk2if1ui0astfbkf.jpg","cloudinary_id":"vdvrsk2if1ui0astfbkf","width":1280,"height":960},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uwxamzbi2rpsihd8qhyw.jpg","cloudinary_id":"uwxamzbi2rpsihd8qhyw","width":1280,"height":960},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qfzyujyqkdkco5c6zrtb.jpg","cloudinary_id":"qfzyujyqkdkco5c6zrtb","width":1280,"height":960},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uyk7iftffgon3ns0bitd.jpg","cloudinary_id":"uyk7iftffgon3ns0bitd","width":1280,"height":960},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tgfjxepcegkfvgvm3lbn.jpg","cloudinary_id":"tgfjxepcegkfvgvm3lbn","width":1280,"height":960}],"websites":[{"category":1,"url":"http:\/\/www.dreamatrix.net\/site\/index.php\/spaceforce-homeworld.html"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/278850"}],"external":{"steam":"278850"}}