{"id":181,"name":"Grim Fandango","slug":"grim-fandango","url":"https:\/\/www.igdb.com\/games\/grim-fandango","created_at":1300188151000,"updated_at":1545096781437,"summary":"A neo-noir adventure to the Land of the Dead.\nSomething's rotten in the land of the dead, and you're being played for a sucker. Meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their four-year journey to eternal rest. But there's trouble in paradise. Help Manny untangle himself from a conspiracy that threatens his very salvation.","storyline":"The game is divided into four acts, each taking place on November 2 on four consecutive years. Manuel \"Manny\" Calavera is a travel agent at the Department of Death in the city of El Marrow, forced into his job to work off a debt \"to the powers that be\". Manny is frustrated with being assigned clients that must take the four-year journey and is threatened to be fired by his boss, Don Copal, if he does not come up with better clients. Manny steals a client, Mercedes \"Meche\" Colomar, from his co-worker Domino Hurley. The Department computers assign Meche to the four-year journey even though Manny believes she should have a guaranteed spot on the \"Number Nine\" luxury express train due to her pureness of heart in her life. After setting Meche on her way, Manny investigates further and finds that Domino and Don have been rigging the system to deny many clients Double N tickets, hoarding them for the boss of the criminal underworld, Hector LeMans. LeMans then sells the tickets at an exorbitant price to those that can afford it. Manny recognizes that he cannot stop Hector at present and instead, with the help of his driver and speed demon Glottis, he tries to find Meche on her journey in the nearby Petrified Forest. During the trip Manny encounters Salvador \"Sal\" Limones, the leader of the small underground organization Lost Souls Alliance (LSA), who is aware of Hector's plans and recruits Manny to help. Manny arrives at the small port city of Rubacava and finds that he has beaten Meche there, and waits for her to show up.\n\nA year passes, and the city of Rubacava has grown. Manny now runs his own nightclub off a converted automat near the edge of the Forest. Manny learns from Olivia Ofrenda that Don has been \"sprouted\" for letting the scandal be known and that Meche was recently seen with Domino leaving the port. Manny gives chase and a year later tracks them to a coral mining plant on the Edge of the World. Domino has been holding Meche there as a trap to lure Manny. All of Domino's clients who had their tickets stolen are also being held there and used as slave labor, both to make a profit with the coral mining and as a way to keep Hector's scandal quiet. Domino tries to convince Manny to take over his position in the plant seeing as he has no alternative and can spend the rest of eternity with Meche but he refuses. After rescuing Meche, Manny defeats Domino by causing him to fall into a rock crusher. Manny, along with Meche, Glottis and all the souls being held at the plant then escape from the Edge of the World.\n\nThe three travel for another year until they reach the terminus for the Number Nine train before the Ninth Underworld. Unfortunately, the Gate Keeper to the Ninth Underworld won't let the souls progress without their tickets, mistakenly believing they have sold them. Meanwhile, Glottis has fallen deathly ill. Manny learns from demons stationed at the terminus that the only way to revive Glottis is to travel at high speeds to restore Glottis' purpose for being summoned. Manny and the others devise a makeshift fuel source to create a \"rocket\" train cart, quickly taking Manny and Meche back to Rubacava and saving Glottis' life. The three return to El Marrow, now found to be fully in Hector's control and renamed as Nuevo Marrow. Manny regroups with Sal and his expanded LSA and with the help of Olivia, who volunteered to join the gang earlier in Rubacava, and is able to learn about Hector's current activities. Further investigation reveals that Hector not only has been hoarding the Number Nine tickets, but has created counterfeit versions that he has sold to others. Manny tries to confront Hector but is lured into another trap by Olivia, who has also captured Sal, and is taken to Hector's greenhouse to be sprouted. Manny is able to defeat Hector after Sal sacrifices himself to prevent Olivia from interfering. Manny and Meche are able to find the real Double N tickets, including the one that Meche should have received. Manny makes sure the rest of the tickets are given to their rightful owners; in turn, he is granted his own for his good deeds. Together, Manny and Meche board the Number Nine for their happy journey to the Ninth Underworld.","collection":1167,"rating":85.9371692373376,"popularity":4.666666666666666,"total_rating":85.9371692373376,"total_rating_count":176,"rating_count":176,"games":[11270,10232,9927,11118,11333,2993,3035,10795,7342,7635],"tags":[27,268435458,268435465,268435487,536871087,536871088,536871133,536871196,536871208,536871262,536871470,536871533,536871570,536871641,536871878,536871939,536872048,536872070,536872328,536872406,536872435,536872647,536872666,536872695,536872957,536873011,536873073,536873074,536873075,536873236,536873249,536873455,536873878,536874727,536874916,536875006,536875046,536875050,536875058,536875059,536875062,536875081,536875089,536875100,536875111,536875114,536875179,536875182,536875199,536875223,536875252,536875259,536875271,536875310,536875319,536875325,536875326,536875327,536875436,536875437,536875453,536875499,536875504,536875523,536875531,536875538,536875542,536875575,536875638,536875639,536875751,536875758,536875769,536875772,536875808,536875825,536875852,536875880,536875910,536876122,536876182,536876227,536876274,536876277,536876317,536876384,536876393,536876400,536876418,536876421,536876428,536876429,536876482,536876493,536876533,536876759,536876833,536876851,536877025,536877176,536877322,536877440,536877867,536877960,536878220,536878398,536878466,536878482,536878491,536878510,536878531,536879788,536880168,536880256,536880403,536881061,536881269,536883372,536886622,1073741828],"developers":[10],"publishers":[10],"game_engines":[145,144],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[175,176,221,284,296,350,558,621,658,729,966,1027,1136,1158,1416,1494,1523,1735,1754,1783,2045,2099,2161,2162,2163,2324,2337,2543,2966,3815,4004,4094,4134,4138,4146,4147,4150,4169,4177,4188,4199,4202,4267,4270,4287,4311,4340,4347,4359,4398,4407,4413,4414,4415,4524,4525,4541,4587,4592,4611,4619,4626,4630,4663,4726,4727,4839,4846,4857,4860,4896,4913,4940,4968,4998,5210,5270,5315,5362,5365,5405,5472,5481,5488,5506,5509,5516,5517,5570,5581,5621,5847,5921,5939,6113,6264,6410,6528,6955,7048,7308,7486,7554,7570,7579,7598,7619,8876,9256,9344,9491,10149,10357,12460,15710],"themes":[27],"genres":[2,9,31],"first_release_date":909532800000,"pulse_count":8,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":909532800000,"human":"1998-Oct-28","y":1998,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sudsgzwqtw3yo4195rjk.jpg","cloudinary_id":"sudsgzwqtw3yo4195rjk","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ww6uc8qw6csitmbtbkef.jpg","cloudinary_id":"ww6uc8qw6csitmbtbkef","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ffau33wsghzrz94lz5rd.jpg","cloudinary_id":"ffau33wsghzrz94lz5rd","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/srxnavvnzqjqmmpjmncz.jpg","cloudinary_id":"srxnavvnzqjqmmpjmncz","width":800,"height":600}],"videos":[{"name":"Trailer","video_id":"hV1NBHL9Fa4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l7mtkr6stxqq3pqeaelp.jpg","cloudinary_id":"l7mtkr6stxqq3pqeaelp","width":256,"height":341},"esrb":{"rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Mild bad language - Non realistic looking violence towards fantasy characters","rating":3},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Grim_Fandango"}]}