{"id":21581,"name":"WorldShift","slug":"worldshift","url":"https:\/\/www.igdb.com\/games\/worldshift","created_at":1469406931308,"updated_at":1515742470827,"summary":"WorldShift is a cyber-fantasy RTS game where you discover the mysteries of an object called Shard Zero","storyline":"\"In the 21st century, shortly after the colonization of our Solar System had begun, a huge dark object appeared beyond the orbit of Pluto. The object, called ‘Shard Zero’ by the scientists, possessed some kind of a deadly aura, spreading mysterious ‘plague’ of cosmic scale around itself, twisting and disrupting the very nature of space and life. There was no time for reaction, and all attempts to study the anomaly remained futile. When we finally realized the object is moving on a collision course with our planet, it was too late. Shard Zero hit Earth and that was the end of our civilization.\r\n\r\nWorldShift is set thousands of years later, when our civilization is no more than a fading myth. The remains of Shard Zero still are spreading its Plague, twisting and re-shaping Earth and its nature, sometimes in the course of centuries and sometimes in a matter of hours. Humans developed a new culture and now live in 5 mega-cities, struggling every day for the precious resources they need to survive. The rest of Earth is populated by the Tribes, successors of early humans, that were affected by the Plague.\"","popularity":1.333333333333333,"aggregated_rating":56,"aggregated_rating_count":1,"total_rating":56,"total_rating_count":1,"games":[9789,8773,26766,19301,11582,25300,11550,16513,36950,55029],"tags":[18,268435467,268435471,536870915,536871882,536871938,536872383,536874094,536874694,536875162,536875887,1073741827],"developers":[952],"publishers":[952,384,176,6022,1363],"category":0,"player_perspectives":[3],"game_modes":[1,2,3],"keywords":[3,970,1026,1471,3182,3782,4250,4975],"themes":[18],"genres":[11,15],"first_release_date":1209600000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1209600000000,"region":1,"human":"2008-May-01","y":2008,"m":5},{"category":0,"platform":6,"date":1257897600000,"region":2,"human":"2009-Nov-11","y":2009,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qdqrk5s2rgbmazkxaf4q.jpg","cloudinary_id":"qdqrk5s2rgbmazkxaf4q","width":445,"height":589},"esrb":{"synopsis":"This is a real-time strategy game (RTS) in which players control different factions vying for control of a fantastical, post-apocalyptic world. Viewed from a top-down perspective, the game allows players to control a small army of soldiers and command them to attack buildings, futuristic monsters, robots, and other enemy units. Players use guns, lasers, grenades, and rockets to kill enemies that react to damage by crying out in pain and emitting small splashes of blood. Blood sometimes accumulates in small puddles on the ground.","rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Realistic looking violence towards non human looking characters - Non realistic looking violence towards human characters\r\nThis game allows the player to interact with other players ONLINE","rating":3},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/WorldShift"}]}