{"id":30481,"name":"Spooky Night","slug":"spooky-night","url":"https:\/\/www.igdb.com\/games\/spooky-night","created_at":1495547059683,"updated_at":1522320796319,"summary":"This game is dedicated to my 3 year old son Alek whose love for Halloween and spooky things inspired this game I love you alek. \nYou were walking in a cemetery one late night and notice a pot of sweet delicious candy. Being the curious child that you are you want to take the pot. Out of nowhere a voice appears, Its the witch Gremelda! She has trapped you inside her cemetery and you must fight your way out. Defeat her minions and keep the candy, but should you loose you will become one of her minions for ever. This is an fps cartoon style shooter for kids with a cute story line. Fight your way through 7 challenging levels as you defeat, Skeletons, Zombies,Mummy's,Werewolf's, Goblin's, and Dragons. See who can get the furthest with the most points , kills and areas cleared. Use the trigger to fire at your enemy's and use the grips to punch your enemy's when they get close to you. The candy pot is considered your health, when the enemy's bite the pot your candy will disappear every five bites. The control's will vibrate letting you know the enemy is attacking the candy pot. You don't get hurt, it is the candy pot that receives damage. \nWhen you loose you turn into one of her minions and it will be randomly selected and shown in front of you. Now if you win you will see the candy pot with the amount of candy's left over that you won by defeating her minions. At the top of the tomb stone you will see your score, your kills, and areas cleared, the game will then restart. It is very fun and challenging game.","popularity":1,"games":[25640,34919,33603,36962,40524,55888,25311,65827,16468,32283],"tags":[1,268435471,268435488],"category":0,"game_modes":[1],"themes":[1],"genres":[15,32],"first_release_date":1483142400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1483142400000,"region":8,"human":"2016-Dec-31","y":2016,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xkcr4d3dmt6gdh6ykvvl.jpg","cloudinary_id":"xkcr4d3dmt6gdh6ykvvl","width":1749,"height":1014},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kvneostqjomolqdyhdqm.jpg","cloudinary_id":"kvneostqjomolqdyhdqm","width":1366,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fuyuqsyyvxiedjntxig1.jpg","cloudinary_id":"fuyuqsyyvxiedjntxig1","width":1366,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f46rqt5xnah8ccswxvfb.jpg","cloudinary_id":"f46rqt5xnah8ccswxvfb","width":1366,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/civqhfdlgv5e60bzmjz1.jpg","cloudinary_id":"civqhfdlgv5e60bzmjz1","width":1366,"height":768}],"websites":[{"category":1,"url":"http:\/\/www.aurealstudio.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/557670"}],"external":{"steam":"557670"}}