{"id":57581,"name":"The Sacred Amulet","slug":"the-sacred-amulet","url":"https:\/\/www.igdb.com\/games\/the-sacred-amulet","created_at":1504616157324,"updated_at":1540213426353,"storyline":"A young Aztec named Little serpent from the village of Atoyac (near Tenochtitlan) is out hunting, he sees a noble, mortally wounded by a otomi warrior. The dying noble gives him an ornate necklace and utters the name Tlatli. Snakeling is thought to be the killer. After learning, that his parents have been taken away and the land is affected by a strange disease, Snakeling searches for the poet in Tlatelolco. Eventually Snakeling infiltrates Moctezuma's palace. There has a limited time to find the nature of the disease, before his parents sacrificed. Finding a link to several necklaces, Snakeling enters the temple of the Ceremonial Center, where a noble and priestess are responsible for the disease, trying to overthrow the emperor. The leader of this cult is \"Black Flower\", who forces Snakeling to poison the water or drink the poison. Snakeling escapes and eventually makes his way back to his village. He is arrested and about to be scarified, but is saved thanks to a bracelet he got from a beggar. Snakeling and his family are giving an official pardon.","popularity":1.666666666666667,"games":[36044,13189,25222,22425,41895,22482,59218,71590,11296,28309],"tags":[268435487,536871939,536876067,536878528],"developers":[234],"publishers":[16369],"category":0,"keywords":[1027,5155,7616],"genres":[31],"first_release_date":992217600000,"platforms":[6,7],"release_dates":[{"category":0,"platform":6,"date":992217600000,"region":1,"human":"2001-Jun-11","y":2001,"m":6},{"category":0,"platform":7,"date":992217600000,"region":1,"human":"2001-Jun-11","y":2001,"m":6}],"alternative_names":[{"name":"Aztec: The Curse in the Heart of the City of Gold"}],"videos":[{"name":"Game intro","video_id":"PZbR_chAAaI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sazutgvklgzhwqlxhfh4.jpg","cloudinary_id":"sazutgvklgzhwqlxhfh4","width":504,"height":595},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Aztec:_The_Curse_in_the_Heart_of_the_City_of_Gold"}]}