{"id":8281,"name":"Colony Wars: Vengeance","slug":"colony-wars-vengeance","url":"https:\/\/www.igdb.com\/games\/colony-wars-vengeance","created_at":1418227678878,"updated_at":1536940881783,"summary":"After the first Colony Wars game, the Earth Empire was defeated... and the remnants of this regime sealed inside of the Sol System, cut off from the rest of the galaxy by some unknown technology. Within Sol, the Earth Empire civilization has fallen apart. Various tribes and factions, warring with one another have left the once great home system of humanity a wreck of salvage and waste from used up resources. One leader however, a Commander Kron, seeks to unite the warring clans under a banner of vengeance... and together find some way to break out from this solar prison. \n \nThe game is space combat, done from a cockpit view. Different combinations of weapons can be equipped on your space fighter prior to launch. Missions take place in space as well as inside planet atmospheres. Various buttons cycle weapons, activate tractor beams, communicate responses and navigate your ship. In typical space combat fashion, you are equipped with 360 degrees of movement as well as thrust and braking options. The game does not feature realistic inertia and objects will gradually \"slow\" in space.","collection":1112,"popularity":1.333333333333333,"games":[17130,34823,13200,17686,22425,8773,54996,17111,55038,25311],"tags":[1,18,268435469,536870936,536871859,536871882,536871970,536872060,536872129,536872983,536873066,536874743,536875271,536875767,536875822,536876446,536884032,536884863,1073741825],"developers":[764],"publishers":[764],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[24,947,970,1058,1148,1217,2071,2154,3831,4359,4855,4910,5534,13120,13951],"themes":[1,18],"genres":[13],"first_release_date":909792000000,"platforms":[7],"release_dates":[{"category":0,"platform":7,"date":909792000000,"human":"1998-Oct-31","y":1998,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m1uplwrvx5rg7igs1y9h.jpg","cloudinary_id":"m1uplwrvx5rg7igs1y9h","width":256,"height":256},"esrb":{"rating":3}}