{"id":86981,"name":"Ellen's Road to Riches Slots","slug":"ellens-road-to-riches-slots","url":"https:\/\/www.igdb.com\/games\/ellens-road-to-riches-slots","created_at":1518615330317,"updated_at":1521705803500,"summary":"Play FREE Ellen-inspired slot machines on your quest to meet your favorite TV host!\n\nEllen wants you on her show! What are you waiting for? Pack your bags and let’s go!\n\nFrom the familiar fun of watching Ellen on TV to the rhythmic revelry of dancing in her audience, your journey to The Ellen DeGeneres show starts now! Spin and win as you make your way through the exciting slots and worlds in Ellen’s Road to Riches Slots.\n\nAre you the #1 fan? Make your mark by climbing the ranks of the Ellen’s Road to Riches Slots Loyalty Ladder! You’ll unlock top-tier benefits, exclusive slot machines, and daily Party XP bonuses! Ready to get on the fast track? Join the Monthly Subscription Program to rev up for greater riches and unlock special perks.\n\nWith an awesome Welcome Bonus of 5,000,000 free credits and so many ways to get more, you’ll win big time in no time!\n\nEllen’s Road to Riches Slots is the social casino that brings together all of your favorite things: The Ellen DeGeneres Show, winning, dancing, free stuff, and – of course – kittens!\n\nMain Features:\n► Play on 15 unique Ellen-themed slot machines across 4 vibrant worlds;\n► Participate in exciting bonus games and interactive features such as the Wheel of Riche$, What’s in the Box, and many more;\n► Reap the benefits of a highly rewarding Loyalty system;\n► Join our Monthly Subscription program, and enjoy exclusive perks and bonuses such as the cutest Piggy Bank you’ve ever had;\n► Complete Ellen-inspired puzzles to unlock even more rewards;\n► Collect increasing bonuses simply by logging into the game.\n\nSign up for our Monthly Subscription Program to unlock the Piggy Bank feature:\n► The Piggy Bank steadily fills up with free credits, even when you’re away from the game;\n► It fills up even faster while you’re spinning;\n► You can break the Piggy Bank every 6 hours to collect your saved-up credits and keep spinning;\n► The Piggy Bank grows bigger and BIGGER as you level up. \n\nIf you want to preview our Monthly Subscription Program, you can start your free 1-week trial directly in-game.\n\nSubscription payment will be charged to your iTunes account at the confirmation of purchase. Your subscription will automatically renew itself unless you turn off the auto-renew feature at least 24 hours before the end of the current period. Your account will be charged for renewal within 24 hours prior to the end of the current period. After your purchase, you may manage your subscription options and turn off the auto-renewal function by going to your user Account Settings. Please note that any unused portion of a free trial period will be forfeited when purchasing a subscription prior to the end of the free trial period.\n\nLike us on Facebook: https:\/\/www.facebook.com\/EllensSlots\/\n\nEllen’s Road to Riches Slots is intended for an adult audience and is intended for entertainment purposes only.\n\nCredits in Ellen’s Road to Riches Slots have no real monetary value and cannot be exchanged for prizes or monetary rewards.\n\nSuccess in Ellen's Road to Riches Slots does not translate into success in venues where there is real money gambling.\n\nhttp:\/\/www.doubledowninteractive.com\/terms\/index.html\nhttp:\/\/www.doubledowninteractive.com\/privacy\/index.html","popularity":1,"games":[91012,87087,86987,86969,86911,86811,59426,43296,95679,91038],"tags":[536871523],"category":0,"keywords":[611],"first_release_date":1509408000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1509408000000,"region":8,"human":"2017-Oct-31","y":2017,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nq891hqticounlleplwz.jpg","cloudinary_id":"nq891hqticounlleplwz","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/if0fhnrgts9hqkb4vj3q.jpg","cloudinary_id":"if0fhnrgts9hqkb4vj3q","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c0rqcidzk5nilrmiky1f.jpg","cloudinary_id":"c0rqcidzk5nilrmiky1f","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sjdijdrb4lec2zjh4ra2.jpg","cloudinary_id":"sjdijdrb4lec2zjh4ra2","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pyvucd46lqh2ntlanvga.jpg","cloudinary_id":"pyvucd46lqh2ntlanvga","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bntqkps0bdapmvy9gh2x.jpg","cloudinary_id":"bntqkps0bdapmvy9gh2x","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dltz1apxavnzomxotttg.jpg","cloudinary_id":"dltz1apxavnzomxotttg","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ufrhpiloz9majakof7bs.jpg","cloudinary_id":"ufrhpiloz9majakof7bs","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/skjvtf4rkmthlxf1uptv.jpg","cloudinary_id":"skjvtf4rkmthlxf1uptv","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bvde6sbev3wwfnbhol9i.jpg","cloudinary_id":"bvde6sbev3wwfnbhol9i","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wytoamufr31vblazicus.jpg","cloudinary_id":"wytoamufr31vblazicus","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/ellens-road-to-riches-slots\/id1227480878?mt=8&uo=4"}]}