{"id":11733,"name":"Hover!","slug":"hover","url":"https:\/\/www.igdb.com\/games\/hover","created_at":1440084818237,"updated_at":1515801562383,"summary":"Hover! was a video game that was included on CD-ROM versions of the Microsoft Windows 95 operating system. It was a showcase for the advanced multimedia capabilities available on personal computers at the time. It is still available from Microsoft and will run on all of Microsoft's 95-compatible operating systems, from Windows 95, up to and including Windows 7 and 8. Additionally, Hover! will run in WINE on Unix-like systems.\n\nThe game is a combination of bumper cars and capture the flag.\n\nOn October 2, 2013, Microsoft released an online version of Hover! in collaboration with an independent developer. It is available at www.hover.ie. This version has a touch interface and 3D graphics. The game claims to be optimized for Internet Explorer 11, but will work on any WebGL-enabled browser.\n\nA Windows 8 version of Hover is available on the Windows App Store for free.\n\n\nINTERFACE:\nAcross the top of the game window is the flag area, which indicates the number of flags in play. When the player captures a flag, the flag becomes solid; blue for the flags the player has collected, and red for the flags the drones have picked up. Next to the flag area is the rear view, which (when enabled) displays the area behind the player's Hover 950, and the score area indicates the player's current score. The middle of the Hover! window is the main view outside the front of the player's Hover 950. The bottom of the window contains the object area which contains information about jump, wall, and cloak pods. Each object area shows the number of objects picked up, the time remaining for that object, and the key associated with each object. Also along the bottom of the window are the map area, which is a bird's-eye view of the current playing field, and the craft area, which shows the remaining time the player is invincible to hold pads, skid pads, and flag removers; it also shows the direction the player's craft is moving, and its current speed.\n\nThe map can be magnified and rotated. Flags are represented as blinking dots: blue dots are the player's flags and red dots are the enemy flags. Drones carrying flags are represented as yellow triangles, drones with no flags are blue triangles, attack drones are green triangles, and the red triangle in the center of the map is the player's craft.\n\n\nLEVELS:\nHover! has three mazes, repeated with gradient difficulty levels. They resemble a medieval castle, a futuristic city, and a sewer. Each maze has its own unique texture maps, music theme, and spawn locations.\n\n\nEASTER EGGS:\nHover! has one Easter egg: the ability to view portraits of the developers who worked on the project. There are 18 in total. In order to view the Easter egg begin at the screen that says \"Press F2 to start a game of Hover!\". Hold Ctrl+Shift and type \"IBMAB\" (the game's code name, \"Bambi\", backwards). After you have entered this combination correctly the \"Press F2\" screen will disappear and your hovercraft will be able to roam freely in a small room with portraits of the developers and their respective role in the development of Hover!.\n\n\nOFFICIAL MICROSOFT RE-RELEASE:\nHover! was officially re-released by Microsoft at hover.ie. It is web-based, and requires a browser that supports WebGL. It is single player and multiplayer, allowing you to play on your own, or a 2, 4, 6, or 8 player game (always split into 2 teams). To play the classic version, simply type \"bambi\" before clicking anything; this will open a fake Windows 95 desktop, and you can even tweet and post to Facebook from it.\n\nHover! was also officially re-released by Microsoft with partnership with Internet Explorer for Windows 8 and 8.1. It has three vehicles you can choose from. These include Chicago, Bambi, and Explorer with different stats. The game is available on the Windows App Store.","popularity":2.666666666666667,"games":[76566,57187,68287,25311,55038,36950,17130,34823,13200,55077],"tags":[1,18,268435466,268435470,268435471,536871067,536871599,536871882,536872375,536872693,536872694,536872695,536875069,536875242,536877930,1073741825],"developers":[128],"publishers":[128],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[155,687,970,1463,1781,1782,1783,4157,4330,7018],"themes":[1,18],"genres":[10,14,15],"first_release_date":820368000000,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":820368000000,"human":"1995","y":1995,"m":12}],"alternative_names":[{"name":"Hover 950"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lx60wzbwukmxfb3ync4g.jpg","cloudinary_id":"lx60wzbwukmxfb3ync4g","width":919,"height":688},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yiwrjwd9jahdn6jqblqb.jpg","cloudinary_id":"yiwrjwd9jahdn6jqblqb","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/olsigryyt8iukvhehnak.jpg","cloudinary_id":"olsigryyt8iukvhehnak","width":707,"height":565},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zqtsnrn3kwdvxw3mphj2.jpg","cloudinary_id":"zqtsnrn3kwdvxw3mphj2","width":315,"height":266},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fyoichy2eqhj98cvieoi.jpg","cloudinary_id":"fyoichy2eqhj98cvieoi","width":712,"height":575}],"videos":[{"name":"Gameplay video","video_id":"JQa3OM6zBJ4"},{"name":"Gameplay video","video_id":"L2lXPeNR3eo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gc8rs3rftyiakqfqpwwq.jpg","cloudinary_id":"gc8rs3rftyiakqfqpwwq","width":400,"height":300}}