{"id":22733,"name":"Dolphin","slug":"dolphin","url":"https:\/\/www.igdb.com\/games\/dolphin","created_at":1471495392638,"updated_at":1546470089665,"summary":"Listen! An endangered dolphin is calling you! Only by learning the dolphin's sonic language can you guide her through schools of seahorses, battling a monstrous squid, to gain magic powers from and elusive seagull. Hurry! Lend an ear... \n \nYou will guide your dolphin through openings in the seahorse schools by listening to sonic tones and catching waves. Pay attention to the following: \n \nTHE SEAGULL:  \nPeriodically, a seagull will fly overhead. You'll know he's coming when the squid changes color. Have your dolphin leap up, touch the seagull and then quickly turn and chase the squid. This is the best way to gain points. Also, the game resets at the next difficulty level putting distance between your dolphin and the squid. \n \nTHE SLIP:  \nAnother great way to outsmart the squid is by giving him \"the slip\". If the squid is right on your tail, wait until he catches a good wave. Then, reverse your dolphin's direction and swim under him immediately. As long as the squid's good wave remains on the screen, he won't be able to reverse and catch you. \n \nSCORING:  \nPoints are earned in a variety of ways. Every time your dolphin touches a seagull, or a squid, you score points. The number of points depends on the color of the squid. Scoring peaks at 800 per seagull and 8000 per squid. \n \nAlso, you'll score 100 points each time your dolphin catches a good wave or each time you run the squid into a bad wave. And, when your dolphin swims through the seahorses, you'll score 0 to 50 points, depending on your degree of accuracy in getting her through the opening.","popularity":1.666666666666667,"games":[87728,15851,16998,76253,54510,22712,103312,76747,37419,13192],"tags":[1,268435489,536871751,536872952,536873064,536873300,536875088,536875352,536875404,536875674,536875852,536876214,536876517,536876713,536876718,536877771,536881311,1073741828],"developers":[66],"publishers":[66],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[839,2040,2152,2388,4176,4440,4492,4762,4940,5302,5605,5801,5806,6859,10399],"themes":[1],"genres":[33],"first_release_date":441676800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12}],"videos":[{"name":"Trailer","video_id":"yFzv_wmNCsA"},{"name":"Gameplay video","video_id":"1lCmfc6kJZg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iufom2lpnopd1nqaoanz.jpg","cloudinary_id":"iufom2lpnopd1nqaoanz","width":1000,"height":1357},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCpDtYQW0MRcl043vxAs5fJA"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Dolphin_(video_game)"}]}