{"id":2433,"name":"Bloodstone: An Epic Dwarven Tale","slug":"bloodstone-an-epic-dwarven-tale","url":"https:\/\/www.igdb.com\/games\/bloodstone-an-epic-dwarven-tale","created_at":1372956581488,"updated_at":1515669313233,"summary":"Bloodstone is a 1993 high fantasy role-playing video game developed and published by Mindcraft Software. The game is a prequel to The Magic Candle series and uses the Magic Candle III engine. \n \nThe game begins with a cut scene of the main character's clan being attacked by the vicious Taldor (default name \"Danat\" if male, or \"Danta\" if female). Then you choose three members for your party and the game begins. \n \nThe Taldor are goblin-like creatures who seem to be cursed with violent bloodlust. The main objective of the game is to retrieve Khamalkhad and join the warring tribes of the North and South. \n \nThe game employs an interesting pantheon of gods. The player can go to the resting points of the sleeping gods and receive a permanent skill increase by whispering a prayer to them. The game employs creatures like the Tlengle (Lizardfolk), Humans, Dwarves, Talador, Wizards, and Amazons. Magic is done in an odd way; the amount of a specific spell numbers one to ninety-nine. As the player casts a spell they use up one \"use\" when they run out of uses they either forget the spell or buy a totem, to learn the specific spell by assigning the character to study the magic.","popularity":1.333333333333333,"games":[36792,18398,36534,26163,37088,47823,16468,26766,12632,1221],"tags":[17,268435468,268435487,536871938,536871939,536872978,1073741827],"developers":[1165],"publishers":[1165],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[1026,1027,2066],"themes":[17],"genres":[12,31],"first_release_date":757296000000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":757296000000,"human":"1993","y":1993,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sg7j17zegmki1xhvilzt.jpg","cloudinary_id":"sg7j17zegmki1xhvilzt","width":2474,"height":2846}}