{"id":43033,"name":"Rage: Anarchy Edition","slug":"rage-anarchy-edition","url":"https:\/\/www.igdb.com\/games\/rage-anarchy-edition","created_at":1499086169895,"updated_at":1500564056266,"summary":"RAGE is a groundbreaking first-person shooter set in the not-too-distant future after an asteroid impacts Earth, leaving a ravaged world behind. You emerge into this vast wasteland to discover humanity working to rebuild itself against such forces as bandit gangs, mutants, and the Authority - an oppressive government regime that has a special interest in you in particular. Featuring intense first-person shooter action, breakneck vehicle combat, an expansive world to explore and jaw-dropping graphics powered by id's revolutionary id Tech 5 technology, RAGE promises an experience like no other. Story: Fearing a planet-wide extinction from a massive asteroid headed towards Earth, world leaders are faced with the inexorable task of ensuring human survival. Left with few alternatives, life-sustaining pods filled with select people are buried deep beneath the earth's surface. You are one of the chosen members of these modern day arks and abruptly enter the RAGE universe after surfacing alone. Leaving you to your own devices to stay alive in a world filled with those who prefer you dead, RAGE combines powerful storytelling with heart-pounding action. Key Features: Visceral 1st-person gunplay and exploration: Take on bandit gangs and hordes of mutants using an arsenal of exotic weapons and special items, such as wingsticks, personal turrets, sentry bots, and remote-controlled bomb cars. Frenetic 3rd-person vehicular mayhem: Burn rubber across the wasteland in your very own super buggy! Upgrade and customize your car with special parts, paint jobs and weapons, then test your skills as you battle four-wheeling bandit clans and participate in deadly races. Three ways to play for unlimited action: Immerse yourself in a rich story-driven single-player experience, grab a friend for exclusive co-op modes, or go online for all-out multiplayer mayhem.","popularity":1.333333333333333,"category":0,"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y7ztvrggts1vqoikwxzp.jpg","cloudinary_id":"y7ztvrggts1vqoikwxzp","width":1516,"height":1703}}