{"id":86733,"name":"Sudoku Deluxe","slug":"sudoku-deluxe","url":"https:\/\/www.igdb.com\/games\/sudoku-deluxe","created_at":1518601849398,"updated_at":1518700952167,"summary":"Play world’s most popular brain game on your Mac and enjoy all the best features you can’t get anywhere else – thousands of grid designs, four difficulty levels, extensive statistics, Undo & Redo, Auto-Save, Auto-Correct, Auto-Fill hints and more...\n\nThanks to thousands of grid designs, you can be sure you’re buying really many hours of playtime. Impressive realistic interface with interactive tools around is easy to use and will let you choose from four difficulty levels from Easy to Insane, suited for all players from beginners to hard-core sudoku veterans. And don’t forget to use next-gen features such as Auto-Correct or Auto-Fill and track your best times in General Stats.\n\nSmooth and clever annotations system does not cover cells around selected one and deleting or adding solved numbers has never been so easy. Want to leave immediately and not to lose your precious unfinished game? No problem, Auto-Save function will get you right back to your last move.\n\nCan’t finish your own paper Sudoku? Fill it in and Sudoku Deluxe will solve it for you using Auto-Fill function. Also, you can design your very own sudoku to be played by your friends or simply for your own brain-teasing pleasure.\n\nFEATURES:\u2028\n\n– Unlimited playtime with thousands of grid designs\n– Impressive realistic interface with two layouts to choose from\n– Four levels of difficulty – from Easy to Insane\n– Smooth and clever annotations system\n– Undo & Redo functions\n– Next-gen features such as Auto-Correct and Auto-Fill\n– Can’t finish your own paper Sudoku? Fill it in and Sudoku Deluxe will solve it for you\n– Statistics – track your best times for each one of difficulty levels\n– Auto-Save function – leave the game and then get right back to your last move","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[87082,87073,86889,86709,86684,56827,19222,27266,11588,41348],"tags":[40,268435465,536872030],"category":0,"keywords":[1118],"themes":[40],"genres":[9],"first_release_date":1303430400000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1303430400000,"region":8,"human":"2011-Apr-22","y":2011,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ob9mruvhpzlgvmdbhhqb.jpg","cloudinary_id":"ob9mruvhpzlgvmdbhhqb","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/syhkb6i7zy3vfihh9411.jpg","cloudinary_id":"syhkb6i7zy3vfihh9411","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l9lj3e8zwd1nyebj2fr5.jpg","cloudinary_id":"l9lj3e8zwd1nyebj2fr5","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fgb78bacf2eajfzbxk0i.jpg","cloudinary_id":"fgb78bacf2eajfzbxk0i","width":512,"height":512},"websites":[{"category":1,"url":"http:\/\/sudoku.crowdcafe.com"}]}