{"id":17557,"name":"Buzz Aldrin's Space Program Manager","slug":"buzz-aldrins-space-program-manager","url":"https:\/\/www.igdb.com\/games\/buzz-aldrins-space-program-manager","created_at":1455281457259,"updated_at":1523252541664,"summary":"Buzz Aldrin's Space Program Manager (SPM) Road to the Moon is the ultimate game of space exploration. It is the mid 1950s and the race for dominance between the US and the Soviet Union is about to move into a new dimension: space. Take charge of the US or Soviet space agencies - your duty is be the first to the moon. Carefully manage your budget by opening programs, spending R&D funds on improving the hardware, recruiting personnel and launching space missions in this realistic turn based strategy game. \n \nRoad to the Moon features the race to the Moon, the historical event that started in the early 1960s and that ended in July 1969, after the successful completion of the Apollo 11 mission. \n \nThe game features both a campaign and a sandbox mode. In campaign mode, you will be able to play as the Director of either NASA or the Soviet Space Agency in order to beat the other side to be the first on the Moon. You can also lead the Global Space Agency (GSA), an fictional space agency that combines programs from all the major space agencies in the world . In the GSA campaign, you will need to address the requests and short-term goals issued by government, and is geared towards those players who prefer a game experience focused on exploration instead of competition. Alternatively, all three space agencies feature a Sandbox mode, which provides a more open-ended experience and allows you to try out different approaches without any political pressure. \n \nYou will be able to develop dozens of programs. Some examples include the X-15 and the PKA space planes, the Sputnik satellite, the Mercury, Voskhod, Apollo and Soyuz manned spacecraft and the Mars Viking probe. You are not limited to missions that did launch, as as the game also allows you to try out many concepts that were planned but that never left the drawing board. For example, instead of sending men to the Moon using the Lunar Orbit Rendezvous (LOR) approach used by Project Apollo in the late 1960s and early 1970s, you will be able to rewrite history and use either the alternative Gemini Earth Orbit Rendezvous (EOR) or Gemini Direct Ascent (DA) schemes. The number of options available ensure every game will be different and there is huge replay value. \n \nTo verify its accuracy and authenticity, the game, is being developed in consultation with Dr. Buzz Aldrin, former U.S. Air Force combat pilot (66 missions in Korea) and NASA astronaut, who took part in the first Moon landing mission and became the second human being to walk on the Moon. \n \nIf you have any interest in space exploration and the events that transpired during the 'Race to the Moon', this is a game you just do not want to miss.","rating":60,"popularity":4,"total_rating":60,"total_rating_count":0,"rating_count":0,"games":[31515,18623,55036,29173,11524,79134,55590,55689,17519,32457],"tags":[17,22,268435469,268435471,536871906,536872060,536875067],"developers":[8299],"publishers":[8833],"category":0,"game_modes":[1,2],"keywords":[994,1148,4155],"themes":[17,22],"genres":[13,15],"first_release_date":1409875200000,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1409875200000,"human":"2014-Sep-05","y":2014,"m":9},{"category":0,"platform":14,"date":1409875200000,"human":"2014-Sep-05","y":2014,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zy6szzvr0zpn6dpwz4bu.jpg","cloudinary_id":"zy6szzvr0zpn6dpwz4bu","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nfz6ethkovvcm20qv1gd.jpg","cloudinary_id":"nfz6ethkovvcm20qv1gd","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vjpcdhwxmkzg6nryreqo.jpg","cloudinary_id":"vjpcdhwxmkzg6nryreqo","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fjw6p9xgpjgshftqrsus.jpg","cloudinary_id":"fjw6p9xgpjgshftqrsus","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oxfwjj7z35v2qveb6xv1.jpg","cloudinary_id":"oxfwjj7z35v2qveb6xv1","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lovykcvctiyamjytjwuo.jpg","cloudinary_id":"lovykcvctiyamjytjwuo","width":565,"height":800},"websites":[{"category":1,"url":"http:\/\/slitherine.com\/games\/BA_SPM_Pc"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/308270"}],"external":{"steam":"308270"}}