{"id":25557,"name":"Boner","slug":"boner","url":"https:\/\/www.igdb.com\/games\/boner","created_at":1478049908191,"updated_at":1517270863850,"summary":"Inspired by the old Boulder Dash game that I played endlessly as a kid I have released a new game called Boner where you get to guide a dog to collect bones, coins, diamonds, etc through a wide range of levels that become increasingly difficult as the game goes on. Each level requires thoughtful consideration in order to collect the required amount of bones within the allotted time.\n\nThroughout the game you will need to avoid Mandy the evil witch as she will steal your diamonds, coins and even your home and given the opportunity will kill your dog. Avoid her mindless helpers and enlist the support of the Abz and Tilly's to achieve your goals. The few people that have had the opportunity to test the game so far have loved it so feel free to give it a try and let me know what you think. At this stage I've only released the game on Android however I'm working towards an Apple version. The game is a free download in the Google Play store.","storyline":"Move rocks and guide your dog to collect diamonds, coins and bones within the allotted time whilst avoiding Mandy the evil witch and her mindless helpers.  Over 20 challenging levels that require careful consideration in order to complete each level.","popularity":1.666666666666667,"games":[51485,34919,36794,36608,16468,24199,59516,23175,41828,28029],"tags":[1,41,268435489,536872847,536873026,536873920,536873921,536873922,536873923,536873924,1073741826],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[1935,2114,3008,3009,3010,3011,3012],"themes":[1,41],"genres":[33],"first_release_date":1478044800000,"status":4,"platforms":[34],"release_dates":[{"category":0,"platform":34,"date":1478044800000,"region":8,"human":"2016-Nov-02","y":2016,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zptzlmtxy5dioapsiiaw.jpg","cloudinary_id":"zptzlmtxy5dioapsiiaw","width":1269,"height":743}],"esrb":{"rating":4},"pegi":{"rating":1},"websites":[{"category":1,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.FFS.Boner"}]}