{"id":457,"name":"StarCraft II: Heart of the Swarm","slug":"starcraft-ii-heart-of-the-swarm","url":"https:\/\/www.igdb.com\/games\/starcraft-ii-heart-of-the-swarm","created_at":1300889701000,"updated_at":1548604541465,"summary":"You are Sarah Kerrigan, former Queen of Blades. Once the most feared entity in the galaxy, you now wait in a cell in the depths of a high-security research laboratory. Before the murderous forces of the Terran Dominion close in, you must plot your escape to the dark reaches of space… and reclaim your living empire at the Heart of the Swarm.","storyline":"Following the events of Wings of Liberty, Terran Dominion forces attack Sarah Kerrigan and her allies in a research facility in the territory of the Umojan Protectorate. Kerrigan and other residents escape to the flagship of Raynor's Raiders, the Hyperion, but Commander Jim Raynor is cut off by the Dominion. The Hyperion escapes, but Kerrigan remains behind to locate Raynor, only to hear a Dominion newscast announcing that he has been captured and executed. Enraged, Kerrigan returns to Zerg territory to retake control of the swarm and overthrow the tyrannical Dominion. \n \nOn the volcanic planet Char, Kerrigan subdues a renegade brood before attacking the occupying Dominion forces. Kerrigan, in a rage, destroys a Dominion command fortress and kills its commander, General Horace Warfield. After a change of heart, she allows the wounded and the unarmed to evacuate. On the frozen planet Kaldir, she annihilates the local Protoss forces, reclaiming the local brood and evolving the swarm to survive in harsh climate. \n \nZeratul visits Kerrigan and advises her to regain her powers by traveling to Zerus, the original homeworld of the Zerg. On Zerus, Kerrigan learns that a fallen Xel'Naga named Amon was responsible for making the Zerg what they are: A warring swarm, bound to a single overriding will. Some primal Zerg, however, eluded and remained independent constantly evolving creatures. One such zerg named Zurvan, known as the \"Ancient One\", lies dormant in hibernation and must be awoken by Kerrigan for its knowledge on the origins of the Zerg. Upon awakening, Zurvan advises Kerrigan to seek out a primordial spawning pool to regain her former powers. Kerrigan enters the ancient spawning pool and transforms into a primal Queen of Blades. She kills and absorbs the genetic essences of four powerful hostile primal leaders and Zurvan after it attempts to collect her essence for itself. A primal leader called Dehaka and his pack join her, provided that she gives them essence to collect. \n \nKerrigan is contacted by a Zerg-infested Alexei Stukov, a former Vice Admiral of the United Earth Directorate who was apparently killed by Duran at Braxis. With Stukov's aid, Kerrigan assaults a research station where Emil Narud, a servant of Amon, is breeding Protoss-Zerg hybrids. After eliminating Dominion facility security forces and Tal'Darim loyal to Narud, Kerrigan confronts Narud in a showdown of power. Morphing first into Raynor and then into Kerrigan's human form, Narud impales Kerrigan before being fatally wounded. Revealing that Amon is revived, he perishes. \n \nMeanwhile, Emperor Arcturus Mengsk contacts Kerrigan and claims Raynor is kept alive and imprisoned, as a bargaining chip against Kerrigan attacking the Dominion throne world of Korhal IV. Kerrigan relays the news to the Hyperion. They plan to hack the Dominion network to locate Raynor, but the only one with such expertise is Colonel Orlan, held captive by Mira Han, a mercenary who refuses to release him. Thus, the Hyperion attacks Mira's mining operations, forcing her to comply. Orlan locates Raynor on a prison ship that constantly changes location. Kerrigan assaults the ship and rescues Raynor, who is revolted by Kerrigan's reversion of form. Although he cannot bring himself to shoot Kerrigan, he tells her that they are done despite her confession that she loves him. \n \nHaving united all Zerg under the swarm, Kerrigan launches an invasion of Korhal, concentrating on the capital city of Augustgrad. With the aid of Dehaka and his pack, she destroys Mengsk's Psi Destroyer, a device that hurts the swarm from afar but is ineffective on the primal Zerg. As Kerrigan sends the swarm to assault Mengsk's palace, Crown Prince Valerian urges her to slow down her invasion to minimize civilian losses; she accepts, understanding that Valerian is not like his father. Midway through the final battle, Raynor arrives to assist Kerrigan, much to her surprise. Together, they succeed in breaching the imperial palace. In the confrontation that follows, Mengsk reveals that he has the Xel'Naga artifact in his possession, intending to use it to kill Kerrigan. Before Mengsk can do so Raynor interferes, allowing Kerrigan to impale Mengsk. Kerrigan kills Mengsk by injecting psionic energy causing him to explode. \n \nAs the dust settles, Kerrigan thanks Raynor before joining her swarm. With her quest for vengeance completed she renounces everything she once was or had and prepares to face Amon, the enemy of all living things, in a conflict that will not only decide the fate of the Koprulu Sector, but the entire Galaxy.","collection":52,"franchise":589,"franchises":[589],"rating":87.6932445117515,"popularity":3.666666666666667,"aggregated_rating":89.1111111111111,"aggregated_rating_count":9,"total_rating":88.4021778114313,"total_rating_count":133,"rating_count":124,"game":457,"games":[55029,78550,8773,30229,25311,44102,6985,34269,11666,76424],"tags":[1,18,39,268435467,268435471,536871198,536871438,536872383,536878370,1073741827],"developers":[51],"publishers":[51],"category":4,"player_perspectives":[3],"game_modes":[1,2],"keywords":[286,526,1471,7458],"themes":[1,18,39],"genres":[11,15],"standalone_expansions":[457],"first_release_date":1363046400000,"pulse_count":5,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1363046400000,"human":"2013-Mar-12","y":2013,"m":3},{"category":0,"platform":14,"date":1363046400000,"human":"2013-Mar-12","y":2013,"m":3}],"alternative_names":[{"name":"HotS","comment":"Acronym"},{"name":"StarCraft 2: Heart of the Swarm","comment":"Other"},{"name":"StarCraft 2 - Heart of the Swarm","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ja7iiexuc08tyf7dopw7.jpg","cloudinary_id":"ja7iiexuc08tyf7dopw7","width":704,"height":440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uuxjebpe2ycnzdn7isc0.jpg","cloudinary_id":"uuxjebpe2ycnzdn7isc0","width":704,"height":440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lzzutibqdsjx2jwephdr.jpg","cloudinary_id":"lzzutibqdsjx2jwephdr","width":704,"height":440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g8spbmpb4dfquceafjes.jpg","cloudinary_id":"g8spbmpb4dfquceafjes","width":704,"height":440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kl30iqqnfd5uxiscy8ou.jpg","cloudinary_id":"kl30iqqnfd5uxiscy8ou","width":704,"height":440}],"videos":[{"name":"Trailer","video_id":"SG_3R9BoVvg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lekqpzoikgzinjtpsc5k.jpg","cloudinary_id":"lekqpzoikgzinjtpsc5k","width":300,"height":421},"websites":[{"category":14,"url":"https:\/\/www.reddit.com\/r\/starcraft2"},{"category":9,"url":"https:\/\/www.youtube.com\/Starcraft"},{"category":6,"url":"https:\/\/www.twitch.tv\/starcraft"},{"category":5,"url":"https:\/\/twitter.com\/StarCraft"},{"category":4,"url":"https:\/\/www.facebook.com\/Starcraft"},{"category":1,"url":"https:\/\/us.battle.net\/shop\/en\/product\/starcraft-ii-heart-of-the-swarm"}]}