{"id":7557,"name":"Big Rigs: Over the Road Racing","slug":"big-rigs-over-the-road-racing","url":"https:\/\/www.igdb.com\/games\/big-rigs-over-the-road-racing","created_at":1406959150865,"updated_at":1541709445253,"summary":"Big Rigs: Over the Road Racing (often simply referred to as Big Rigs) is a 2003 third-person racing video game developed by Stellar Stone and published by GameMill Publishing for Microsoft Windows PC systems. The game was released as a largely unfinished product and many parts of it do not work properly at all. \n \nThe packaging of Big Rigs states that the main objective of the game is to race a semi-trailer truck (known colloquially as a \"big rig\") in order to safely deliver illegal cargo being carried by the vehicle, while avoiding the local police force. In actuality, there are no police in the game, no such objectives are presented within the game itself and there is no load attached to the truck.[1] Much of the game instead centers on the player racing their truck against fellow drivers to the finish line; however, in the earlier versions the player's computer-controlled opponent vehicles have no AI and never move from the starting position. In a later version, the computer-controlled opponent will race around the track, but will stop just before crossing the finish line. The timer in the game is merely aesthetic and has no limit on the gameplay. In addition, due to a lack of collision detection, there are no obstacles to navigate within the game, and the player is able to phase through environments and leave the game altogether. \n \nBig Rigs: Over the Road Racing was critically panned. The game's criticism is largely directed at its \"blatantly unfinished\"[2] state: lack of collision detection and frequent violation of the laws of physics, frequent and major software bugs, poor visuals, and severe lack of functionality. As a result, the game is now widely regarded as one of the worst video games of all time","rating":19.932781102671,"popularity":2.333333333333333,"total_rating":19.932781102671,"total_rating_count":10,"rating_count":10,"games":[1905,3070,76566,3772,27378,27553,36662,2177,94,28075],"tags":[1,268435466,536871317,536871931,536872107,536872695,536873362,536874115,536874706,536875064,536875069,536875089,536875151,536875154,536875261,536875271,536875488,536875545,536875743,536875822,536876419,536876542,536876576,536876616,536877101,536877517,536877619,536878228,536879989,536881998,536884420,1073741826],"developers":[3125],"publishers":[2329],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[405,1019,1195,1783,2450,3203,3794,4152,4157,4177,4239,4242,4349,4359,4576,4633,4831,4910,5507,5630,5664,5704,6189,6605,6707,7316,9077,11086,13508],"themes":[1],"genres":[10],"first_release_date":1069286400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1069286400000,"region":2,"human":"2003-Nov-20","y":2003,"m":11}],"videos":[{"name":"Gameplay video","video_id":"z1mASlkurOE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dmgdllnduoywmgzkhqx9.jpg","cloudinary_id":"dmgdllnduoywmgzkhqx9","width":902,"height":1280},"esrb":{"rating":3}}