{"id":89557,"name":"Hellscreen","slug":"hellscreen","url":"https:\/\/www.igdb.com\/games\/hellscreen","created_at":1519782938530,"updated_at":1519782967089,"summary":"\"Hellscreen is a single player level based first-person shooter for PC, in the fast, frantic style of classic FPS games from the 1990s (such as Doom, Quake, Unreal etc).\"","storyline":"\"Millennia ago, the ancient gods built a machine for all eternity that would determine the transition to the afterlife process. They no longer wished to burden themselves with the effort of deciding who should go to the afterlife and who should go to Hell. They built it so they themselves could die and leave the oppression of immortality behind and have their fate determined in the most objective way possible. The machine, filled with lifeforms artificially created as part of the mechanism, continued to run but without the supervision and maintenance of its creators, it began deteriorating. Eventually, it began to make errors and blur the lines between life, death, heaven & hell. You are one of those errors. Wrongfully pulled from the afterlife to the Hellscreen dimension, you are caught in a cycle of death and resurrection & must fight to destroy the machine once and for all to let the natural order of things reign again. Perhaps then, you, like the ancient gods can finally rest for all time.\"","popularity":1,"games":[10039,32902,34919,16468,54639,28029,40524,55289,64204,68324],"tags":[1,268435461,268435488,536871436,536872879,536873337,536875377,1073741825],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[524,1967,2425,4465],"themes":[1],"genres":[5,32],"pulse_count":1,"platforms":[6],"release_dates":[{"category":7,"platform":6,"region":8,"human":"TBD"}],"videos":[{"name":"Trailer","video_id":"gVPfBLxvGFg"}],"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCz81AVSOBcEMm0FvFLNkAQg"},{"category":5,"url":"https:\/\/twitter.com\/Hellscreen_Game"},{"category":4,"url":"https:\/\/www.facebook.com\/Hellscreengame"}]}