{"id":114154,"name":"A meadow Piece","slug":"a-meadow-piece","url":"https:\/\/www.igdb.com\/games\/a-meadow-piece","created_at":1548080243224,"updated_at":1548103153150,"summary":"This is a meadow simulator with slightly different flowers. Either just watch the flowers grow. Or defend yourself against strange aliens. Actively intervene in the development of the meadow. Play with your friends, either as a team or against each other. \n \nThe unique evolution system is the core of A meadow Piece. This ensure that every meadow develops slightly different. You have to intervene to be sure that the meadow evolves the way you want it to. After all, you can just enjoy this chilling simulation part of the game. In contrast, you can try to increase the viability of a meadow and test it by calling on enemy aliens. \nAlmost everything in the game has a function. Even the daytime and the weather affects the meadow. A meadow Piece is a sophisticated simulation, so that one needs a while to understand the underlying mechanisms. It is completed with a chilling soundtrack that is created with an innovative mixing system to produce a broad variety of music experience.","storyline":"The flowers that grow on this meadow simulation continue to evolve. This means they pass on their characteristics to their offspring and accidental mutations can occur. You can, of course, actively control the development of your meadow by removing specific modifications from certain flowers and using them for other flowers. Simple modifications support the flowers in many ways. Complex modifications either positively or negatively interact with the flowers around them. There are 23 simple and 23 complex modifications; you can incorporate two of each of type of modification into a flower. This is equivalent to more than 75,000 possible combinations per flower! \n \nYou can either simply observe the meadow or actively intervene. Each time, different flowers will dominate the meadow. If, during the course of the game, flowers appear that are better adapted to their environment, different flowers might start to dominate. This means that each meadow evolves in a different way. To find out if flowers are successful, you can call on enemy aliens and use them to test your meadow’s viability. \n \nThe simulation game can be played with up to four players at a time. Players can either evolve the meadow together or defend the meadow against strange aliens. You can also fight each other directly. When you play together, resources will soon become scarce. You can only use modifications that have evolved on the meadow.","popularity":1,"games":[33603,107226,65827,55888,36962,82117,31515,18623,29173,36553],"tags":[268435465,268435469,268435471,268435488,1073741827],"developers":[17607],"game_engines":[603],"category":0,"player_perspectives":[3],"game_modes":[1,2,3],"genres":[9,13,15,32],"first_release_date":1553990400000,"status":3,"platforms":[6,14],"release_dates":[{"category":3,"platform":14,"date":1553990400000,"region":8,"human":"2019-Q1","y":2019,"m":3},{"category":3,"platform":6,"date":1553990400000,"region":8,"human":"2019-Q1","y":2019,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5zsk.jpg","cloudinary_id":"sc5zsk","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5zsj.jpg","cloudinary_id":"sc5zsj","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5zsi.jpg","cloudinary_id":"sc5zsi","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"u7yU1cfv3Rk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1itg.jpg","cloudinary_id":"co1itg","width":630,"height":500},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/964100\/A_meadow_Piece\/"},{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCJ6RYa2CMpdOzcqWR6YY6FA"},{"category":5,"url":"https:\/\/twitter.com\/genlivpat"}],"multiplayer_modes":[{"platform":14,"offlinecoop":false,"onlinecoop":true,"lancoop":true,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":0,"onlinecoopmax":4,"onlinemax":4,"offlinemax":1},{"platform":6,"offlinecoop":false,"onlinecoop":true,"lancoop":true,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":0,"onlinecoopmax":4,"onlinemax":4,"offlinemax":1}]}