{"id":1854,"name":"Tom Clancy's Rainbow Six: Shadow Vanguard","slug":"tom-clancy-s-rainbow-six-shadow-vanguard","url":"https:\/\/www.igdb.com\/games\/tom-clancy-s-rainbow-six-shadow-vanguard","created_at":1356701495453,"updated_at":1516773622779,"summary":"For the first time on iPhone and iPod touch, enjoy a new FPS experience that allows you to lead a team of elite soldiers! \nA global terrorist organization threatens the world balance. Only one team can prevent this: The Rainbow Unit!\n\nThese colors never run.\n\nAN ICONIC BRAND FINALLY AVAILABLE ON THE APP STORE \nOne of the most popular video game brands finally lands on your iPhone and iPod touch.\n\nAN ORIGINAL TITLE WITH EPIC MISSIONS\nPlay 11 thrilling missions to defeat a dangerous and well-organized terrorist group.\nPlay recreated and enriched levels based on the original Rainbow Six game like the Embassy Hostage Crisis, an oil platform assault or the infiltration of a rebel camp in Africa.\n\nJoin a new Rainbow Unit complete with 3 new members, each with their own unique abilities like recon, demolition or stealth.\n\nEXPERIENCE CO-OP AND A RICH MULTIPLAYER MODE\nJoin up to 2 friends and challenge the entire game together in Local and Online Co-op modes.\nYou can also go head-to-head with the best unit leaders in the world on 5 exclusive and thrilling maps in Multiplayer mode - up to 10 players. \n\nTHEY’LL NEVER SEE IT COMING\nInfiltrate enemy compounds without them ever knowing you’re there thanks to a wide range of state-of-the-art gadgets. Use snake cameras to spy around corners, silencers to keep your kills discreet and many more covert tools and weapon upgrades.\n\nBE THE LEADER OF AN ELITE UNIT \nAn exclusive real-time tactical system for iPhone that lets you lead your teammates through each level. Order them to cover, shoot or use grenades to clear rooms before an assault!","collection":127,"popularity":1.333333333333333,"games":[28751,17446,18088,36718,28029,27314,54539,7843,10039,28552],"tags":[1,39,268435461,536870913,536871365,536875046,536875171,536876378,1073741825],"developers":[61],"publishers":[61],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[1,453,4134,4259,5466],"themes":[1,39],"genres":[5],"first_release_date":1300320000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1300320000000,"human":"2011-Mar-17","y":2011,"m":3}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r8bmbgaymcqdo5trntxj.jpg","cloudinary_id":"r8bmbgaymcqdo5trntxj","width":480,"height":360},"esrb":{"rating":1},"multiplayer_modes":[{"platform":39,"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":true,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":0,"onlinecoopmax":3,"onlinemax":0,"offlinemax":0}]}