{"id":39254,"name":"Lifeline: Silent Night","slug":"lifeline-silent-night","url":"https:\/\/www.igdb.com\/games\/lifeline-silent-night","created_at":1498122851270,"updated_at":1516646666845,"summary":"Taylor is back in a suspenseful, new, real-time adventure for Android and Android Wear – Lifeline: Silent Night! Your choices shape the story as you play, and could mean life or death for one intrepid space explorer. \nThe hearts and imaginations of countless players worldwide were captured when the original Lifeline took Android by storm and now Taylor needs your help again in Lifeline: Silent Night! \n \nAcclaimed author Dave Justus returns with a suspenseful new story that plays out in real time, delivering notifications throughout your day. Keep up as they come in, or catch up later when you’re free. You can even respond to Taylor directly from your Android Wear device. Your choices shape the story as you play. \n \nSimple actions can have a profound effect. Complete any single path in the game and then go back and see what happens when you make a different choice. \n \nLifeline: Silent Night is a deep, immersive story of survival and perseverance, and it’s up to you to save the White Star before it’s too late for its intrepid crew. The fate of Taylor, and the world, is in your hands!","collection":3143,"hypes":1,"popularity":1.333333333333333,"games":[25211,43130,57524,39253,13486,14605,23175,27266,28277,17469],"tags":[268435487,536873308,536875172],"category":0,"keywords":[2396,4260],"genres":[31],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v8anb35oma4yer8tkrs1.jpg","cloudinary_id":"v8anb35oma4yer8tkrs1","width":720,"height":749},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/grfnrdxow5d5z5vznajn.jpg","cloudinary_id":"grfnrdxow5d5z5vznajn","width":720,"height":749}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xzqcrnp44rqxsblcetmf.jpg","cloudinary_id":"xzqcrnp44rqxsblcetmf","width":175,"height":175}}