{"id":48654,"name":"Saint Seiya: Ougon Densetsu Kanketsu Hen","slug":"saint-seiya-ougon-densetsu-kanketsu-hen","url":"https:\/\/www.igdb.com\/games\/saint-seiya-ougon-densetsu-kanketsu-hen","created_at":1499967544920,"updated_at":1513086817987,"summary":"Saint Seiya: Ougon Densetsu Kanketsu Hen is an RPG based around the anime and manga series known as Saint Seiya. It was developed and published by Bandai in 1988 for the Famicom. It is the sequel to the first Famicom Saint Seiya game, Saint Seiya: Ougon Densetsu. \n \nAs with the original game, the story draws heavily from the first story arc of the series. This version picks up where the original left off, with the Bronze Saints about to take on all twelve of the Gold Saints in order to save Saori before time runs out. The game remains faithful to the original story, to the extent that your options are limited if you try to choose match ups that didn't occur in the show. \n \nThe gameplay mixes side scrolling action scenes where a saint must survive long enough to reach a particular Gold Saint's temple, with a turn based combat system against the Gold Saints. In order to be successful at these turn based battles, the player must distribute a pool of Seven Senses to a Saints Life and Cosmos. When Life is lost, certain Saints can be revived under certain conditions, but many are taken out of play. Other Saints and characters become available at particular points along the story.","collection":2319,"popularity":1.333333333333333,"games":[12632,25300,36926,59516,55289,25311,55803,28010,19448,47823],"tags":[1,268435468,268435487,536870947,536870990,536871938,536871939,536875053,536875054],"category":0,"keywords":[35,78,1026,1027,4141,4142],"themes":[1],"genres":[12,31],"first_release_date":583632000000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":583632000000,"region":8,"human":"1988-Jun-30","y":1988,"m":6}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pdxjh4b48lbjzs4ucujl.jpg","cloudinary_id":"pdxjh4b48lbjzs4ucujl","width":300,"height":208}}