{"id":86954,"name":"Snowboard Party: Aspen","slug":"snowboard-party-aspen","url":"https:\/\/www.igdb.com\/games\/snowboard-party-aspen","created_at":1518615083555,"updated_at":1519363131508,"summary":"Snowboard Party is back, and this time, we are bringing you to the slopes of Aspen! Explore a new mountain with 9 brand new runs with perfect snowboarding conditions. Customize your rider with a choice of 100+ snowboards and 30+ outfits! Practice and improve your tricks on halfpipes, rails, and jumps. Compete in freestyle competitions to see how your skills rank with the pros of Aspen. Grab your crew, grab your board, it’s time to head to Aspen!\n\nFREESTYLE\nFreestyle is all about the tricks! The rider uses natural and man-made features such as rails, jumps, boxes, logs, rocks and innumerable other objects to perform the sickest tricks! \n\nBIG AIR\nGo big or go home! Big air competitions are contests where riders perform tricks on massive jumps while going downhill at high speed. You have limited jumps, so make them count!\n\nHALFPIPE \nPerform a wide range of tricks while going down some of the world’s biggest halfpipes. Chain multiple tricks in a row to gain more points and achieve a better score.\n\nBONUS SNOWBOARDING CHALLENGES\nEvery 4 hours, you will have the opportunity to complete a new snowboarding challenge! Complete the bonus challenge to earn rewards, lift tickets, coins, and exclusive gear.\n\nMASSIVE SNOW GEAR SELECTION\nFeel like a pro rider with our largest selection of gear yet! Choose from over 100 snowboards and 30 outfits to complement your rider’s tricks, skills, and style. Earn coins to spend on upgrading your rider stats, unlock brand new boards, and upgrade your outfits!\n\nBECOME A MASTER SNOWBOARDER\nThe more you ride, the more your snowboarder will level up! With over 180 course objectives to complete, there are many ways to earn rewards. Each level objective unlocks prize boxes containing coin rewards, XP rewards, and even exclusive gear! Access the trick bank trophy room to learn every trick in the game! \n\nASPEN AND BEYOND\nReady to go above and beyond the pro level? Time to make a global name for yourself! Over 35 new global game achievements to complete and earn coins that will increase your rider’s status worldwide. \n\n\nLOADED WITH MANY MORE FEATURES\n- Supports all the latest generation devices and optimized for high-resolution displays.\n- High definition to provide the best experience in mobile action sports games.\n- Fully customizable control system. You can adjust everything! \n- 9 mountain courses to compete on.\n- Snowboarding’s biggest events including freestyle, halfpipe, and big air.\n- 180+ course objectives to complete\n- 35+ global game achievements to complete.\n- Trick bank trophy room to stomp every trick in the game!\n- Bonus challenges every 4 hours to earn extra rewards!\n- Customize your look with over 100 snowboards and 30 outfits! \n- Play often to gain experience points and upgrade your snowboarder’s stats. \n- Ability to purchase experience points or special items using in-app purchases. \n- Available in the following languages: English, French, German, Italian, Spanish, Russian, Japanese, Korean, Portuguese and Chinese \n\nJoin the Snowboard Party community on Facebook!: http:\/\/bit.ly\/snowfacebook\n\nSUPPORT: http:\/\/www.maplemedia.io","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[36608,34919,55715,40524,14713,23175,16468,1070,2940,68324],"tags":[1,268435470],"category":0,"themes":[1],"genres":[14],"first_release_date":1513814400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1513814400000,"region":8,"human":"2017-Dec-21","y":2017,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qmk0tnge2gi6ovbcse4s.jpg","cloudinary_id":"qmk0tnge2gi6ovbcse4s","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jla7np33dehojfwnp1jt.jpg","cloudinary_id":"jla7np33dehojfwnp1jt","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dnz7l7prk3bqpi1cwimt.jpg","cloudinary_id":"dnz7l7prk3bqpi1cwimt","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwzklv7equg5h3ebua2w.jpg","cloudinary_id":"vwzklv7equg5h3ebua2w","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jymdqbwbjfbkjsiifcaq.jpg","cloudinary_id":"jymdqbwbjfbkjsiifcaq","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v4ea3p6ailb0bw9nwa97.jpg","cloudinary_id":"v4ea3p6ailb0bw9nwa97","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rv0zsrhr7dlcjj3tr3xl.jpg","cloudinary_id":"rv0zsrhr7dlcjj3tr3xl","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/snowboard-party-aspen\/id1294854606?mt=8&uo=4"}]}