{"id":87154,"name":"Texas Hold'em - Daily Poke it!","slug":"texas-holdem-daily-poke-it","url":"https:\/\/www.igdb.com\/games\/texas-holdem-daily-poke-it","created_at":1518621093400,"updated_at":1518710649974,"summary":"no-limit Texas Hold'em, you can win unlimited chips ever dreamed! Whether you are Tight or Loose, Aggressive or Passive!\nDaily login to get *FREE* bonus chips!\n[WARN] Quit the game to Menu Scene will lose all bet chips in the current round!\n\nTexas hold 'em (also known as hold 'em or holdem) is a variation of the standard card game of poker. The game consists of two cards being dealt face down to each player and then five community cards being placed face-up by the dealer—a series of three (\"the flop\") then two additional single cards (\"the turn\" and \"the river\" or \"fourth and fifth street\" respectively), with players having the option to check, bet, raise or fold after each deal; i.e., betting may occur prior to the flop, \"on the flop\", \"on the turn\", and \"on the river\". Texas Hold 'em is the \"H\" game featured in H.O.R.S.E and in H.O.S.E.\n\nObjective:\n\nIn Texas hold 'em, as in all variants of poker, individuals compete for an amount of money or chips contributed by the players themselves (called the pot). Because the cards are dealt randomly and outside the control of the players, each player attempts to control the amount of money in the pot based either on the hand they are holding, or on their prediction as to what their opponents may be holding.\n\nThe game is divided into a series of hands or deals; at the conclusion of each hand, the pot is typically awarded to one player (an exception in which the pot is divided between more than one is discussed below). A hand may end at the showdown, in which case the remaining players compare their hands and the highest hand is awarded the pot; that highest hand is usually held by only one player, but can be held by more in the case of a tie. The other possibility for the conclusion of a hand occurs when all but one player has folded and have thereby abandoned any claim to the pot, in which case the pot is awarded to the player who has not folded.\n\nThe objective of winning players is not to win every individual hand, but rather to make mathematically and psychologically correct decisions regarding when and how much to bet, raise, call or fold. By making such decisions, winning poker players can maximize their expected gain on each round of betting, thereby increasing their long-term winnings.\n\nTexas Hold'em are divided into the following steps:\n1) Compulsory bets,\n2) Pre-flop,\n3) Flop,\n4) Turn,\n5) River,\n6) Showdown\nAfter Showdown, the bet chips are awarded to the winners.\n\nFor more information, you can refer to:\nhttp:\/\/en.wikipedia.org\/wiki\/Texas_hold_%27em","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[44242,28465,34919,33603,36962,55888,65827,75102,43130,28277],"tags":[268435469,536874083],"category":0,"keywords":[3171],"genres":[13],"first_release_date":1367193600000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1367193600000,"region":8,"human":"2013-Apr-29","y":2013,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xepzpllag0eggwx0q2wk.jpg","cloudinary_id":"xepzpllag0eggwx0q2wk","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zffwwaqpj1w4hfabbvzi.jpg","cloudinary_id":"zffwwaqpj1w4hfabbvzi","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ankbslawb7m5mhdjjhwk.jpg","cloudinary_id":"ankbslawb7m5mhdjjhwk","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dkxljrggtza1iw4ais5d.jpg","cloudinary_id":"dkxljrggtza1iw4ais5d","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/texas-holdem-daily-poke-it\/id641393871?mt=12&uo=4"}]}