{"id":23788,"name":"World of Warcraft: Wrath of the Lich King Collector's Edition","slug":"world-of-warcraft-wrath-of-the-lich-king-collectors-edition","url":"https:\/\/www.igdb.com\/games\/world-of-warcraft-wrath-of-the-lich-king-collectors-edition","created_at":1473330685629,"updated_at":1515493964982,"summary":"The Lich King Arthas has set in motion events that could lead to the extinction of all life on Azeroth. With the armies of the undead and the necromantic power of the plague threatening to sweep across the land, only the mightiest heroes can oppose the Lich King's will and end his reign of terror for all time. \n\nLearn the craft of spell augmentation with the new Inscription profession. Brave the harsh new continent of Northrend, the icy domain of the Lich King. Engage in epic siege warfare, deploying mighty siege engines to lay waste to destructible buildings in your path. Transform your hero's look with new character-customization options, including new hairstyles and dances. Explore perilous new dungeons filled with some of the deadliest creatures -- and greatest treasures.\n\nThe Collector's Edition included:\n\nThe Art of World of Warcraft: Wrath of the Lich King, a 208-page book featuring never-before-seen images from the game.\n\nAn exclusive in-game pet: Frosty, the baby frost wyrm.\n\nA behind-the-scenes DVD containing over an hour of developer interviews, the \n\nWrath of the Lich King intro cinematic with director's commentary, and more.\n\nThe official soundtrack CD, containing 21 epic tracks from the game, along with exclusive bonus tracks.\n\nA mouse pad featuring a map of the newly opened continent of Northrend.\n\nTwo World of Warcraft Trading Card Game March of the Legion starter decks, along with two exclusive cards available only in the Collector's Edition.","collection":27,"franchise":135,"franchises":[135],"popularity":1.666666666666667,"aggregated_rating":80,"aggregated_rating_count":1,"total_rating":80,"total_rating_count":1,"game":123,"version_parent":228,"version_title":"Collector's Edition","games":[16468,13196,5613,19698,49414,28010,36792,23719,25636,22480],"tags":[17,268435468],"category":2,"themes":[17],"genres":[12],"first_release_date":1226534400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1226534400000,"region":8,"human":"2008-Nov-13","y":2008,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x6rllvlhtqnfwils77bm.jpg","cloudinary_id":"x6rllvlhtqnfwils77bm","width":800,"height":896}}