{"id":41888,"name":"Battlefield 3: Premium Edition","slug":"battlefield-3-premium-edition","url":"https:\/\/www.igdb.com\/games\/battlefield-3-premium-edition","created_at":1499003042505,"updated_at":1515493922105,"summary":"Battlefield 3 is a first-person shooter video game developed by EA Digital Illusions CE and published by Electronic Arts. It is a direct sequel to 2005's Battlefield 2, and the eleventh installment in the Battlefield franchise. \n \nThe game was released in North America on 25 October 2011 and in Europe on 28 October 2011 for Microsoft Windows, PlayStation 3, and Xbox 360.[4] EA Mobile also confirmed a port for the iOS platform. The game sold 5 million copies in its first week of release,[5] and received critical acclaim from most game reviewers. It is the first game in the series that does not support versions of Windows prior to Windows Vista as the game only supports DirectX 10 and 11.[6] The PC version is exclusive to EA's Origin platform,[7] through which PC users also authenticate when connecting to the game. The game's sequel, Battlefield 4, was released on 29 October 2013. \n \nIn Battlefield 3 '​s campaign, players take on the personas of several military roles: a U.S. Marine, an F-18 weapons system officer, an M1A2 Abrams tank operator, and a Spetsnaz GRU operative. The campaign takes place in various locations, including Iran to New York City; and follows the stories of Sergeant Henry Blackburn and Dimitri Mayakovsky. \n \nThe full standard edition of Battlefield 3 (minus any DLC) was made free to download for Origin users from 28 May 2014 until 3 June 2014 as part of Origin's On The House promotion.[8]","collection":34,"popularity":1.666666666666667,"version_parent":343,"version_title":"Premium Edition","games":[37088,16468,17446,36594,28029,76246,19341,10039,76229,28010],"tags":[1,17,22,39,268435461],"category":0,"themes":[1,17,22,39],"genres":[5],"first_release_date":1347321600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1347321600000,"human":"2012-Sep-11","y":2012,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zx4bu1x6eba4v13ml1am.jpg","cloudinary_id":"zx4bu1x6eba4v13ml1am","width":271,"height":377}}