{"id":55888,"name":"Computer Tycoon","slug":"computer-tycoon","url":"https:\/\/www.igdb.com\/games\/computer-tycoon","created_at":1504264330096,"updated_at":1545743083230,"summary":"Computer Tycoon is an indie business strategy game about Computer Evolution. Start your company in the 70s. Invent until 2034, create the best hardware and operating system, upgrade your infrastructure and handle your marketing! Promote games, rule the global market and become an immortal!","storyline":"Computer Tycoon is an indie business strategy game about Computer Evolution and starting your own company in the 70s. Lead the research race until 2034, create the best hardware and operating system, take care of your infrastructure and even handle your marketing. Find video game gems to promote them on your platforms, conquer the global market and became literally immortal! \n \nComputer Tycoon is different from other building\/tycoon games because it has a \"grand strategy game\" aspect. You will control your \"computer empire\" viewing a world map and managing resources. \nA journey through computer history \nStart your adventure in the 70s as a small business somewhere in the world. Learn more about hardware and software inventions that were the first steps to our current modern world, and get a taste of what is waiting for us in the future. Find the classic video games and help a new culture to be born. \nCreate computers your way! \nIn Computer Tycoon the decisions you make during development really matter. Take advantage of the technology, upgrade and design combinations! Does your product need more computing capacity or should you focus more on features, low price or prestige? Maybe change to portable computers or develop more easy-to-use Operating Systems? These decisions will have a major impact on the success of your company. \nExpand your multinational corporation \nExpand your corporation in a smart way into multiple countries, build more offices, factories, laboratories and other required facilities. Poor countries have cheaper labor, but richer countries will give you more educated engineers. \nMarket your computers! \nHaving the best product isn't enough. You must take care of people's needs or even \"change their needs\" using different marketing tools. Balance your budget well between development, production, marketing, and expansion. \nYou have only one life \nWe'll all die one day... but not in Computer Tycoon! You can win the game by becoming a monopoly or reaching the technological singularity if you are fast and healthy enough. Healthy? Yes, you have a small chance to die in the game, so you should regularly check your health. \n \n \nThe game is in an EA alpha state. It has bugs and missing\/simplified features. Everything is subject to change. Please read the EA details! Also here is a brief list of what is and isn't included (yet): \n \nFeatures implemented \n- Start a computer manufacturer company in the 70s \n- Design and create hardware, home computers, personal computers, portable computers and handheld computers \n- Rule the market of the world on a grand strategy level \n- Research and study the technology of the earliest models to the near future computers \n- Expand your industrial sites across the globe \n- Basic AI opponents \n- World Map with algorithmically generated data for increased replayability \n \n \nFeatures not implemented yet \n- Reviews about your products \n- Historical world map with more realistic population\/economy\/border data \n- Multiple industrial site environments (I will give some industrial environment variations) \n- Smarter AI opponents \n- Random events \n- Achievements \n- Localizations","rating":60,"popularity":31.66666666666667,"total_rating":60,"total_rating_count":1,"rating_count":1,"games":[33603,65827,36962,31515,109339,82117,18623,79134,29173,28277],"tags":[268435469,268435471,268435488],"developers":[12437],"publishers":[12437],"category":0,"game_modes":[1],"genres":[13,15,32],"first_release_date":1507766400000,"status":4,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1507766400000,"region":8,"human":"2017-Oct-12","y":2017,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tjsoyptxbah461bummwa.jpg","cloudinary_id":"tjsoyptxbah461bummwa","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cn8nqtjcz6zaayshotlu.jpg","cloudinary_id":"cn8nqtjcz6zaayshotlu","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ejiqvncj615diegxirhh.jpg","cloudinary_id":"ejiqvncj615diegxirhh","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dwpbilxppfhdq6xdg1op.jpg","cloudinary_id":"dwpbilxppfhdq6xdg1op","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nh2fhqa0zvzwxgeendou.jpg","cloudinary_id":"nh2fhqa0zvzwxgeendou","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fgqhqhncqz3fqrc9fg7l.jpg","cloudinary_id":"fgqhqhncqz3fqrc9fg7l","width":3115,"height":1793},"websites":[{"category":1,"url":"http:\/\/www.computertycoon.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/686680"}],"external":{"steam":"686680"}}