{"id":12113,"name":"Gateway to the Savage Frontier","slug":"gateway-to-the-savage-frontier","url":"https:\/\/www.igdb.com\/games\/gateway-to-the-savage-frontier","created_at":1441187239172,"updated_at":1540241628927,"summary":"As the story opens, you and your companions are celebrating in triumph. The caravan you've been guarding has just completed its dangerous passage to the trading town of Yartar. But the realms are full of danger and there is tension in the air. Great armies are on the move, and the relative peace of recent times will soon be shattered. Your party becomes a problem to the evil forces whose plans lie behind the current troubles. Only by the swiftness of your sword--on land and water--will you live to save the region from certain destruction.","storyline":"The game revolves around a standard (for Gold Box adventures) party of six adventurers who inadvertently get caught up in a plot by the Zhentarim to conquer the entire Frontier area. \n \nThe storyline, in rough terms, follows: \n \n  The party starts off in Yartar, having just escorted a caravan from the dwarven stronghold Citadel Adbar (ruled by the dwarf king Harbromm). At the tavern, while the party is enjoying the feast and spirits, something is slipped into their food that causes them to pass out, and they are robbed of all gold and gear, especially the magic longsword that one member used to slay a griffon at Longsaddle. Fortunately, each character keeps a purse of coins under their pillow so they can buy armour and weapons. \n  Through rescuing the NPC Krevish, the party being hired by the Kraken in Yartar to assassinate a cleric of Bane at Nesme, only to discover that this evil priest was the only individual standing in the way of the conquest. \n  Rescuing the magic user Amelior Amanitas from Everlund, an eccentric and somewhat absent-minded wizard who explains how to stop the Zhentarim. Returning to Yartar, the party is captured and imprisoned in a Kraken base below the city. There, the magic longsword stolen at the start is recovered but the party has to fight four giant squid in a huge tank before escaping. \n  Finding four magical statues scattered across the frontier before the Zhentarim, led by a General Vaalgamon, gets to them. \n  Traveling to the dead city of Ascore to end the Zhentarim plot. \n \nBasically, Zhentil Keep plans to use these magical statues to open a way through an otherwise-unpassable desert for their armies. If successful, the party is hailed as the \"Heroes of Ascore,\" which is carried over into the sequel.","collection":3395,"franchise":43,"franchises":[43],"popularity":1.333333333333333,"games":[22387,28309,14474,18398,55092,26765,26553,12761,55038,28168],"tags":[17,268435468,268435487,536870984,536871138,536871139,536871208,536871237,536871504,536871648,536871938,536871939,536872647,536872835,536872978,536873364,536875160,536875356,536875380,536875455,536875735,536875738,536875803,536876301,536877554,536878358,536886005,1073741825,1073741826],"developers":[1046],"publishers":[528],"game_engines":[165],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[72,226,227,296,325,592,736,1026,1027,1735,1923,2066,2452,4248,4444,4468,4543,4823,4826,4891,5389,6642,7446,15093],"themes":[17],"genres":[12,31],"first_release_date":694137600000,"platforms":[13,16,15],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":2,"platform":13,"date":694137600000,"human":"1991","y":1991,"m":12},{"category":7,"platform":15,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kcnvoahmjackie21kxjg.jpg","cloudinary_id":"kcnvoahmjackie21kxjg","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hyooxxvxo4slatguafte.jpg","cloudinary_id":"hyooxxvxo4slatguafte","width":320,"height":256}],"videos":[{"name":"Gameplay video","video_id":"3XQr8hH1BWg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ezuoi1vqt7icnjtnfjaa.jpg","cloudinary_id":"ezuoi1vqt7icnjtnfjaa","width":800,"height":1228},"esrb":{"rating":5},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Gateway_to_the_Savage_Frontier"}]}