{"id":3013,"name":"FireFall","slug":"firefall","url":"https:\/\/www.igdb.com\/games\/firefall","created_at":1381742013955,"updated_at":1517270834608,"summary":"Firefall is a massively multiplayer online team-based action shooter role-playing computer game from Red 5 Studios, a studio founded by Mark Kern. It is currently in its open beta stage and it will attempt to mix elements from the MMORPG and MMOFPS genres when it is released.  \n \nThis game should not be confused with the Macintosh game from Pangea Software that was rereleased as shareware on June 13 in 2000.","storyline":"Firefall is an event that takes place almost 200 years in the future. An asteroid was predicted to fly right next to Earth and be a near miss. However, the asteroid instead entered the gravity well of the Moon and shattered. Many of these shards began to slam into the Earth while the bulk of the asteroid entered a low, descending orbit around the Earth, pelting it with even more debris that continued to break off of the asteroid. Eventually the asteroid itself crashed into the Earth, and with this event, plummeted mankind into a new dark age known as the Nine Year Winter. Many of the larger governments fragmented during this time, while other nations bound together, forming a strong, unified alliance.  \nHowever, during this dark age, scientists in Japan stumbled upon a new element called crystite. What they first observed was not real crystite, but seed crystite. Only later when sifting through the crash site were they able to find this new element, but only a gram or two was actually uncovered through the sifting of the earth. Many of the studies on crystite showed that it turns the known laws of physics on their head, and crystite quickly became a way to generate a massive amount of power with almost unlimited potential. Soon it became the primary power source in the world and a new golden age came to pass. However, crystite is a foreign element that came from the asteroid that impacted into the Earth, and although it is a resource potentially without limits, the world wanted more.  \nHumanity was able to plot the trajectory of the asteroid and figure out that the asteroid came from the star system of Alpha Centauri. Space-faring ships were then built and sent out on the long journey to discover the source of the original crystite. After four years of space travel, the first colonists arrive and find a world with an abundance of crystite. The first colony was created and established with the name Alpha Prime. As the first massive load of crystite arrived back on earth, seven more ships were created and began to ferry resources between the two star systems.  \nDespite this new source of energy, the world governments begin to fear that with their reliance on crystite, if there was ever a revolt on Alpha Prime, they could potentially bring Earth to its knees. Fearing this, they began to create and perfect a technology called arcfolding which effectively creates a wormhole capable of transporting matter large distances in a short time. The first tests, however, showed that whatever was moved using arcfolding technology would freeze to almost absolute zero. Eventually, an energy field was created and was able to shield organic life; the first successful test was a mouse sent from Cambridge to San Francisco with only a location deviation of 0.2 millimeters. With this technology, instead of ships taking an eight-year round trip voyage, a ship could do each leg of the journey in as little as eight days.  \nAnd so the creation of the Arclight came to pass. With the resources and collaboration of the entire world, the creation of the ship took only a few years from start to finish. A huge ship roughly the size of a small city with two massive crystite reactors to assist with safely arcfolding the crew and all those inside. It was meant to be a symbol of power over Alpha Prime and to serve as a headquarters from which Earth could secure its future. However, something went dreadfully wrong with its maiden launch.  \nThe Arclight attempted its first arcfold from a Lagrange point in its orbit for stability purposes. As the Arclight began to fold space it created what seemed to be a large tear in the fabric of the universe from which The Melding, a giant energy storm, began to pour out of the rift. The Melding itself has now settled in swaths across the Earth, leaving only small pockets of the Earth habitable.  \nThe Melding mutates and transforms all life and even the terrain of the planet. Recently, humanity has come under attack by a race calling themselves The Chosen, who have emerged from The Melding. The player takes on the role of a surviving member of the human race in the fight to push back The Chosen and to rid the Earth of The Melding.[1]  \nAt this point in time it is known that the Arclight itself crashed in Fortaleza, Brazil, but the field the Arclight generates from the seed crystite powering its still active engines has been able to keep The Melding at bay. Engineers are scared to cannibalize the Arclight because the field residue, known as a STIZ bubble, is vital to Fortaleza and doing so would surely jeopardize all those living under its protection.","rating":70.3279970753059,"popularity":5,"aggregated_rating":59,"aggregated_rating_count":4,"total_rating":64.66399853765296,"total_rating_count":15,"rating_count":11,"games":[25657,1939,11544,17112,55038,36950,1265,9509,1886,47823],"tags":[1,17,18,33,38,39,268435461,268435468,268435487,536870979,536870982,536871060,536871377,536871378,536871379,536871474,536871487,536871812,536871931,536871937,536872070,536872245,536872647,536873023,536873364,536874706,536874916,536875046,536875073,536875095,536875109,536875173,536875196,536875199,536875242,536875281,536875309,536875311,536875312,536875436,536875437,536875440,536875480,536875624,536875743,536875782,536875798,536875799,536875822,536875839,536875897,536876205,536876218,536876221,536876243,536876262,536876367,536876476,536877028,536877162,536877211,536877263,536877264,536877288,536877433,536877439,536877521,536877547,536877742,536877950,536878004,536878284,536878314,536878315,536878415,536878550,536879065,536879132,536879888,536880004,536881334,536882034,536882051,536882442,536882694,536883101,536883353,1073741825,1073741826],"developers":[1413],"publishers":[1413],"game_engines":[519],"category":0,"player_perspectives":[1,2],"game_modes":[2,3,5],"keywords":[67,70,148,465,466,467,562,575,900,1019,1025,1158,1333,1735,2111,2452,3794,4004,4134,4161,4183,4197,4261,4284,4287,4330,4369,4397,4399,4400,4524,4525,4528,4568,4712,4831,4870,4886,4887,4910,4927,4985,5293,5306,5309,5331,5350,5455,5564,6116,6250,6299,6351,6352,6376,6521,6527,6609,6635,6830,7038,7092,7372,7402,7403,7503,7638,8153,8220,8976,9092,10422,11122,11139,11530,11782,12189,12441],"themes":[1,17,18,33,38,39],"genres":[5,12,31],"first_release_date":1373328000000,"status":5,"pulse_count":6,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1373328000000,"human":"2013-Jul-09","y":2013,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kb60mbcqqkhkyu7wxgey.jpg","cloudinary_id":"kb60mbcqqkhkyu7wxgey","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nub3stkhat1coce2oims.jpg","cloudinary_id":"nub3stkhat1coce2oims","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hslpbqjogil19ka10q5z.jpg","cloudinary_id":"hslpbqjogil19ka10q5z","width":1000,"height":625},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r31cq5fh9b14zk3l3mnc.jpg","cloudinary_id":"r31cq5fh9b14zk3l3mnc","width":1000,"height":625},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dbpko8jsbkbdcpiy0wkj.jpg","cloudinary_id":"dbpko8jsbkbdcpiy0wkj","width":1000,"height":625}],"videos":[{"name":"Trailer Playlist","video_id":"qH6b_bDpp74"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cwispd4nm31cn8bvspf1.jpg","cloudinary_id":"cwispd4nm31cn8bvspf1","width":630,"height":900},"esrb":{"rating":5},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/227700"},{"category":1,"url":"http:\/\/www.firefall.com"}],"external":{"steam":"227700"},"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":true,"splitscreenonline":false,"splitscreen":false,"dropin":true,"offlinecoopmax":0,"onlinecoopmax":5,"onlinemax":0,"offlinemax":0}]}