{"id":46913,"name":"Castle Blast","slug":"castle-blast","url":"https:\/\/www.igdb.com\/games\/castle-blast","created_at":1499705105886,"updated_at":1513031237817,"summary":"Castle Blast is shoot'em up based on the 5th screen of Atari's 2600 Phoenix where you take on the mothership. Castle Blast is Ronen Habot's first foray into programming the Atari 5200. Ronen used this experience as a means to write a tutorial on Atari 5200 programming to assist others who might want to write games for the system. \n \nCastle Blast made its debut at the 2002 Classic Gaming Expo, where it was sold with a box, manual and cart. AtariAge held a Castle Blast Label Contest in April, 2002. Castle Blast may be ordered directly from the author, Ronen Habot, by visiting the Castle Blast Development Page. \n \nThe object of this game is to destroy the Castle on the Mothership. You fire Vertical Trajectory Missiles, or VTMs, at the shield on the bottom of the Mothership. When you penetrate the shield, then blast the Castle. To score extra points, you can also shoot the enemy spaceships flying overhead. \n \nIf you destroy the Castle, you advance to the next level, where you will need to contend with Focused Energy Beams, or FEBs, fired from the Mothership. There will also be stars appearing in the sky, making it harder to target the spaceships. \n \nIf you manage to obliterate the Castle again, you will proceed to the next level, which adds ground-based tanks assaulting you. You have Horizontal Trajectory Missiles, or HTMs, to deal with this new enemy but do not lose sight of your primary goal. \n \nYour joystick moves you left or right. The lower button fires VTMs, the upper button fires HTMs.","popularity":1.333333333333333,"games":[34919,19341,25311,44242,36608,28465,37419,54999,55715,33603],"tags":[1,268435469],"category":0,"themes":[1],"genres":[13],"first_release_date":1031616000000,"platforms":[66],"release_dates":[{"category":0,"platform":66,"date":1031616000000,"region":8,"human":"2002-Sep-10","y":2002,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sjbvhdubb0em0hoanq3h.jpg","cloudinary_id":"sjbvhdubb0em0hoanq3h","width":1534,"height":2100}}