{"id":48513,"name":"Deep Dungeon IV: Kuro no Youjutsushi","slug":"deep-dungeon-iv-kuro-no-youjutsushi","url":"https:\/\/www.igdb.com\/games\/deep-dungeon-iv-kuro-no-youjutsushi","created_at":1499966580673,"updated_at":1513086819123,"summary":"Deep Dungeon IV: Kuro no Yōjutsushi (ディープダンジョンIV 黒の妖術師?, lit. Deep Dungeon IV: The Black Sorcerer) is the fourth and final installment in the Deep Dungeon series. \n \nUnfortunately this game has removed the custom character feature of the previous game. Through the game, the player will meet up to two additional playable characters with predetermined class. This game also reverts to the standard practice or randomizing characters' stat growth when gaining an experience level. New to this engine is that the player can eventually learn to summon two monsters to function as a temporary additional party member for a single battle. It also removed the feature that stops random battles when the player is significantly more powerful than the enemies. This isn't as bad as it seems as the maps in this game are also much smaller (whereas the previous games used multi-floor dungeons up to 32x32 tiles, the dungeons in this game are either single floor, or multiple floors that can fit within a single 32x32 map) In this game, the player can accept \"requests\" from the non-player characters. These are optional tasks that will reward the player with bonus items, experience or money when finished.","collection":3383,"popularity":1.333333333333333,"games":[26766,25300,36926,59516,36534,18398,13189,55289,72412,36792],"tags":[268435468,268435487,536871938,536871939,536872983,536875472,536879765],"category":0,"keywords":[1026,1027,2071,4560,8853],"genres":[12,31],"first_release_date":641952000000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":641952000000,"region":8,"human":"1990-May-06","y":1990,"m":5}],"alternative_names":[{"name":"Deep Dungeon 4: Kuro no Youjutsushi","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p62b5swysgxqejy0luvb.jpg","cloudinary_id":"p62b5swysgxqejy0luvb","width":640,"height":463}}