{"id":6113,"name":"Home Mahjong","slug":"home-mahjong","url":"https:\/\/www.igdb.com\/games\/home-mahjong","created_at":1397821816473,"updated_at":1515840529585,"summary":"Mahjong is a game that originated in China. It is commonly played by four players (with some three-player variations found in South Korea and Japan). Mahjong is a game of skill, strategy, and calculation and involves a degree of chance. The game is played with a set of 144 tiles based on Chinese characters and symbols, although some regional variations use a different number of tiles. In most variations, each player begins by receiving 13 tiles. In turn players draw and discard tiles until they complete a legal hand using the 14th drawn tile to form four groups (melds) and a pair (head). There are fairly standard rules about how a piece is drawn, stolen from another player and thus melded, the use of simples (numbered tiles) and honours (winds and dragons), the kinds of melds, and the order of dealing and play. However there are many regional variations in the rules; in addition, the scoring system and the minimum hand necessary to win varies significantly based on the local rules being used. This game is the digital rendition of Mahjong.","storyline":"None.","popularity":1.333333333333333,"games":[11588,25217,19083,51157,50724,43520,41397,37487,28213,27266],"tags":[268435465,268435482,536873513,536875051,1073741828],"developers":[112],"publishers":[112],"category":0,"player_perspectives":[4],"keywords":[2601,4139],"genres":[9,26],"first_release_date":473299200000,"platforms":[84],"release_dates":[{"category":2,"platform":84,"date":473299200000,"region":5,"human":"1984","y":1984,"m":12}],"alternative_names":[{"name":"ホーム麻雀","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uk4up72su4kbth1vgbmr.jpg","cloudinary_id":"uk4up72su4kbth1vgbmr","width":429,"height":600}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f4hlnkpahpelyxnbvzhu.jpg","cloudinary_id":"f4hlnkpahpelyxnbvzhu","width":640,"height":909}}