{"id":75813,"name":"First Feudal","slug":"first-feudal","url":"https:\/\/www.igdb.com\/games\/first-feudal","created_at":1510592334425,"updated_at":1547596959531,"summary":"Become a real medieval feudal lord: start with a small village and build it up into a great impenetrable castle. You will have to repel enemy raids: hide behind thick walls, lure your enemies into strategically placed traps and even lead your loyal peasants into the battlefield. \n \nYou start the game with a couple of peasants and limited resources to eventually turn your small settlement into a real medieval castle. Build, mine resources, grow crops, manufacture equipment, trade, and advance science on your own or by delegating tasks to your people. Greedy bandits will regularly raid your settlement, making you gather militia troops and repel the enemy. \n \nKey features \n• Managing peasants. \n Each peasant can have one of nine available professions. Once assigned, they will start executing corresponding tasks and orders — you don’t need to keep track of each individual resident. However, if you think that a regular peasant with three grades of education is not good at tactics, you can directly command groups of units or individual ones in combat \n• Develop the infrastructure. Start by processing stone and lumber, then advance your technologies to open new ways of growing your settlement: manufacturing, trade, lighting, comfort, equipment, defense. Your character and peasants will also be able to advance and improve their skills while doing useful work. \n• Settlers. \nIn order to make a village attractive to new settlers, you need to take care of its residents’ comfort. Peasants need cozy houses and good food. However, for particularly lazy peasants in addition to carrot there is a whip. \n• Battles. \nBandits will regularly raid your settlement. You can lead the militia or stay out of combat by letting your people defend themselves. To reduce casualties, you can hide behind powerful walls or lure the enemy into meticulously placed traps. \n• Agriculture. \nCollection and hunting solve the hunger problem at early stages only. In a highly developed settlement, you need to start growing various crops and farming animals. \n• Trade. \n The village will be regularly visited by merchants. They will offer their goods and buy your produce. With time, you will be able to send trade caravans to other locations. \n \nE-mail: contacts@holistic.games","rating":70,"popularity":30,"total_rating":70,"total_rating_count":1,"rating_count":1,"games":[109339,9472,25311,33603,55077,26145,65827,107226,55888,18176],"tags":[268435468,268435471,268435488,1073741827],"developers":[13969],"publishers":[13969],"game_engines":[221],"category":0,"player_perspectives":[3],"game_modes":[1],"genres":[12,15,32],"first_release_date":1512000000000,"status":4,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1512000000000,"region":8,"human":"2017-Nov-30","y":2017,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vaqy7rnn49txrdtnwsjj.jpg","cloudinary_id":"vaqy7rnn49txrdtnwsjj","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wgtpcxehtzoi9teacyae.jpg","cloudinary_id":"wgtpcxehtzoi9teacyae","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qdumxeutulhrvqg7umum.jpg","cloudinary_id":"qdumxeutulhrvqg7umum","width":1921,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tzzvkebm8o7qsw1ax2ms.jpg","cloudinary_id":"tzzvkebm8o7qsw1ax2ms","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ileuxsn2tbfrszjrf7l3.jpg","cloudinary_id":"ileuxsn2tbfrszjrf7l3","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"IpxeiDKpdoE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1io8.jpg","cloudinary_id":"co1io8","width":701,"height":934},"websites":[{"category":1,"url":"https:\/\/www.holistic.games\/"},{"category":5,"url":"https:\/\/twitter.com\/FirstFeudal"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/733460"}],"external":{"steam":"733460"}}