{"id":7613,"name":"The Devil's Men","slug":"the-devil-s-men","url":"https:\/\/www.igdb.com\/games\/the-devil-s-men","created_at":1407956302722,"updated_at":1516594469043,"summary":"In “The Devil’s Men” players will influence the storyline with every move and decision they make. Gamers will have to consider all the possible ways to solve a puzzle, because every decision might change the story. \n \nAuthor Kevin Mentz, known for his critically acclaimed fantasy-adventure Memoria, invented with “The Devil’s Men” a world made of steampunk elements amidst a fictitious Victorian England. In classic adventure gameplay, challenging puzzles are cleverly combined to a thrilling criminal case.","storyline":"England, 1871: A sleepy seaside town -- once venue of a legendary world exhibition – is kept in suspense by a bizarre series of murders. The trace leads to the old exhibition grounds, where ruins of steel and glass are the new shelter to a gang of waifs and strays, misfits and tramps -- known as \"The Colony\". To buoy up, the colony pursues more and more influence in the town and doesn’t shirk from ruthless means. \n \nThe 20-year-old Adelaide Spektor feels threatened by this menace. Adelaide was still a child when she was left by her father, the famous detective Karol Spektor. Since then, she is hiding on the town’s streets and lives in fear to be discovered by the colony and to get swept up in a life of crime, contrary to the morals of her family. When she witnesses the murder of her father’s old friend, she sees her chance to find Karol Spektor and reclaim her former place in society. But only the notorious colonist and double murderer Emily can help take up Adelaide’s father’s trail. Together the two women get entangled in a plot leading to the “Devil’s Men” – a coterie of scientists who have exceeded the limits of the spiritual and material world decades ago, yet are bizarrily perishing one after another. Will Adelaide and Emily manage to track down Karol Spektor? And what is his connection to the Devil’s Men?","hypes":4,"popularity":4.666666666666666,"games":[236,62151,25222,13189,55038,65503,18011,11490,24426,81249],"tags":[17,18,268435458,268435487,536871464,536871818,536871939,536872490,1073741828],"developers":[2248],"publishers":[2248],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[552,906,1027,1578],"themes":[17,18],"genres":[2,31],"first_release_date":1546214400000,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s0oya2h210jwb1grgkws.jpg","cloudinary_id":"s0oya2h210jwb1grgkws","width":1918,"height":1062},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x3hleyfyqc98kqkaynnp.jpg","cloudinary_id":"x3hleyfyqc98kqkaynnp","width":2054,"height":1062},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ucj9r12yflobddt9xksd.jpg","cloudinary_id":"ucj9r12yflobddt9xksd","width":2174,"height":1063},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m8eetuznb8fajork9i69.jpg","cloudinary_id":"m8eetuznb8fajork9i69","width":1899,"height":967},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zww6kdxzd6yr5yzdrm6s.jpg","cloudinary_id":"zww6kdxzd6yr5yzdrm6s","width":1678,"height":1062}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lcci2tfdco2rzjh3gkdj.jpg","cloudinary_id":"lcci2tfdco2rzjh3gkdj","width":1400,"height":930},"websites":[{"category":1,"url":"http:\/\/www.daedalic.de\/en\/game\/The_Devils_Men"}]}