{"id":89113,"name":"Angry Birds Classic HD","slug":"angry-birds-classic-hd","url":"https:\/\/www.igdb.com\/games\/angry-birds-classic-hd","created_at":1519425763931,"updated_at":1523428163201,"summary":"Use the unique powers of the Angry Birds to destroy the greedy pigs' defenses!\u2028\u2028\n\nThe survival of the Angry Birds is at stake. Dish out revenge on the greedy pigs who stole their eggs. Use the unique powers of each bird to destroy the pigs’ defenses. Angry Birds features challenging physics-based gameplay and hours of replay value. Each level requires logic, skill and force to solve.\u2028\u2028\n\nIf you get stuck in the game, you can purchase the Mighty Eagle! Mighty Eagle is a one-time in-app purchase in Angry Birds that gives unlimited use. This phenomenal creature will soar from the skies to wreak havoc and smash the pesky pigs into oblivion. There’s just one catch: you can only use the aid of Mighty Eagle to pass a level once per hour. Mighty Eagle also includes all new gameplay goals and achievements!\u2028\u2028\n\nIn addition to the Mighty Eagle, Angry Birds now has power-ups! Boost your birds’ abilities and three-star levels to unlock secret content! Angry Birds now has the following amazing power-ups: Sling Scope for laser targeting, King Sling for maximum flinging power, Super Seeds to supersize your birds, and Birdquake to shake pigs’ defenses to the ground!\u2028\u2028\n\nHAVING TROUBLE? Head over to https:\/\/support.rovio.com where you can browse FAQs or submit a request to our support flock!\n\n#1 IPHONE PAID APP in US, UK, Canada, Italy, Germany, Russia, Sweden, Denmark, Finland, Singapore, Poland, France, Netherlands, Malta, Greece, Austria, Australia, Turkey, UAE, Saudi Arabia, Israel, Belgium, Norway, Hungary, Malaysia, Luxembourg, Portugal, Czech Republic, Spain, Ireland, Romania, New Zealand, Latvia, Lithuania, Estonia, Nicaragua, Kazakhstan, Argentina, Bulgaria, Slovakia, Slovenia, Mauritius, Chile, Hong Kong, Pakistan, Taiwan, Colombia, Indonesia, Thailand, India, Kenya, Macedonia, Croatia, Macau, Paraguay, Peru, Armenia, Philippines, Vietnam, Jordan and Kuwait. \u2028\u2028\n\n#1 IPHONE PAID GAME in more countries than we can count!\n\nTerms of Use: http:\/\/www.rovio.com\/eula\u2028\nPrivacy Policy: http:\/\/www.rovio.com\/privacy\u2028\n\nThis application may require internet connectivity and subsequent data transfer charges may apply.\n\n\nImportant Message for Parents\n\nThis game may include:\n- Direct links to social networking websites that are intended for an audience over the age of 13.\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.\n- Advertising of Rovio products and also products from select partners.\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.","rating":60,"popularity":1,"total_rating":60,"total_rating_count":0,"rating_count":0,"games":[101949,101946,101939,101661,101660,101575,101559,101513,101381,101373],"tags":[268435489],"category":0,"genres":[33],"first_release_date":1270080000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1270080000000,"region":8,"human":"2010-Apr-01","y":2010,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/loynszymnerxddn82pic.jpg","cloudinary_id":"loynszymnerxddn82pic","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ehjzy991winbbhdi2hzx.jpg","cloudinary_id":"ehjzy991winbbhdi2hzx","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xkj39qxj62zodfw6f9he.jpg","cloudinary_id":"xkj39qxj62zodfw6f9he","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sfxtsdyx0babsognoa3f.jpg","cloudinary_id":"sfxtsdyx0babsognoa3f","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pnunatsk0nedsrywapij.jpg","cloudinary_id":"pnunatsk0nedsrywapij","width":576,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/usmvlzwj2yovdhafwqiu.jpg","cloudinary_id":"usmvlzwj2yovdhafwqiu","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/angry-birds-classic-hd\/id364234221?mt=8&uo=4"}]}