{"id":41400,"name":"Nazoler Land Dai 2 Gou","slug":"nazoler-land-dai-2-gou","url":"https:\/\/www.igdb.com\/games\/nazoler-land-dai-2-gou","created_at":1498816409657,"updated_at":1516738412134,"summary":"The second game in the Nazoler Land series of minigame compilations published by SunSoft for the Famicom Disk System. \n \nNazoler Land Dai 2 Gou is the sequel to Nazoler Land Soukan Gou and is similarly a minigame connection with a magazine theme. It contains six minigames, rather than its predecessor's eight. A notable feature of this compilation is that all the minigames are represented as Famicom disks on the select screen, and once a game is chosen an animation shows the disk being loaded in the Famicom Disk System. \n \nThe minigames include: \n \nPatalick \nA panel-switching puzzle game that shares some similarities with Q*Bert (specifically, switching panel colors and the isometric perspective) but is far more cerebral and less active in nature. The goal is to use the shape-shifting protagonist (who transforms from an angel to a devil form) to switch all the panels on the screen to the same color, keeping in mind that every panel in a horizontal and vertical line will flip over. \n \nGeographic Nazoler Quiz \nLike the transportation quiz from the first Nazoler Land, this is a quiz game with a geographical theme. Rather than crossing over Japan in various types of transport, the goal is to travel the world and answer questions on different countries. Answering enough questions correctly allows the player to buy a ticket to the next location and progress forward. \n \nStraw Pistil \nA gambling game in which the player barters against AI opponents for money. The opponents are unpredictable, so the game is largely based on luck. \n \nBlast Tomo \nAs with \"Save Princess Momoko\" from Nazoler Land Soukan Gou (or the Cheetahmen from Action 52), Blast Tomo is the \"major feature\" of the compilation. The goal is to help a schoolgirl, Tomo, reach the bottom of a stage with the strategic placing of a finite number of bombs to destroy blocks in the way. The player must also not any let mice touch Tomo on the way down. \n \nNazoler Boys' Detective Club \nA parody of Famicom Tantei Club, the player is the leader of a detective club currently investigating a mansion supposedly hiding incriminating evidence. Should the player make too many wrong decisions while exploring, the rest of the group will stop listening to them. \n \nNazoler BOX \nNot so much a game as a more overtly magazine section where an animated character (Tomo, from Blast Tomo) reads mail from players of the previous game as well as discuss promotional features of the Nazoler Land series. There's also a section where players can draw their own images, as part of a contest for Nazoler Land Dai 3 Gou.","collection":3369,"popularity":1.333333333333333,"games":[107226,95776,87507,80174,43800,41399,19222,90766,10225,101563],"tags":[268435465,536871186,536875240],"category":0,"keywords":[274,4328],"genres":[9],"first_release_date":550454400000,"platforms":[51,58],"release_dates":[{"category":0,"platform":51,"date":550454400000,"region":5,"human":"1987-Jun-12","y":1987,"m":6},{"category":0,"platform":58,"date":553046400000,"region":8,"human":"1987-Jul-12","y":1987,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xsjuagzddyy2i0gepx5l.jpg","cloudinary_id":"xsjuagzddyy2i0gepx5l","width":577,"height":640}}