{"id":600,"name":"Apache","slug":"apache","url":"https:\/\/www.igdb.com\/games\/apache","created_at":1317745755000,"updated_at":1517270522698,"summary":"You're in command as your AH-64D Apache Longbow combat helicopter lifts off from its forward base. You're going into combat against the best the enemy can offer, but you've got the most advanced fighting helicopter in the world at your fingertips, packed with a devastating array of lethal weapons and state-of-the art technology.\n\nYou're ready to rock and roll but so is the enemy! They're waiting for you with combat helicopters of their own, backed up by radar-guided anti-aircraft guns and missiles and fixed wing aircraft. It's not going to be a cakewalk but you and your Apache are up to the challenge. Across four theaters of war-- Fort Hood where you train and then in war zones in Cyprus, Yemen, and Korea--you will fly the most fearsome helicopter that has ever been designed against enemies on land, sea, and air.\n\nApache Longbow took flying simulators to the next level. The developers constructed the flight model with fanatical attention to detail, going so far as to bring in Apache pilots to fly the in-game chopper and offer their feedback on how real the experience felt. Every flight simulator enthusiast will be pleased with the complexity and realism this game has to offer. Meanwhile, to make the game more accessible there is also an arcade mode where the flight mechanics aren't nearly as realistic, but there's still tons of fun to be had. So whichever you are - a slow-and-low hardcore sim fan or someone who just likes to fly about and blow things up - this game has something for you.","popularity":1,"aggregated_rating":91,"aggregated_rating_count":1,"total_rating":91,"total_rating_count":1,"games":[44242,18623,22470,29173,22425,26145,21642,55590,55689,22406],"tags":[39,268435469,536870913,536870933,536870943,536870968,536871904,536872060,536872818,536875171,536875531,1073741825],"developers":[467],"publishers":[467,466],"category":0,"player_perspectives":[1],"game_modes":[1,2,3],"keywords":[1,21,31,56,992,1148,1906,4259,4619],"themes":[39],"genres":[13],"first_release_date":807148800000,"platforms":[14,13],"release_dates":[{"category":0,"platform":13,"date":807148800000,"human":"1995-Jul-31","y":1995,"m":7},{"category":0,"platform":14,"date":807148800000,"human":"1995-Jul-31","y":1995,"m":7}],"alternative_names":[{"name":"Apache Longbow","comment":"Other"}],"videos":[{"name":"Gameplay video","video_id":"Iox5JXGY35E"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zmaokvadzctygkgessmf.jpg","cloudinary_id":"zmaokvadzctygkgessmf","width":431,"height":500}}