{"id":9300,"name":"Youda Sushi Chef 2","slug":"youda-sushi-chef-2","url":"https:\/\/www.igdb.com\/games\/youda-sushi-chef-2","created_at":1427873079131,"updated_at":1493488721898,"summary":"Step into the delicious world of Youda Sushi Chef 2, where you put your culinary skills to use. Prepare dishes in 6 restaurants all over the world. Learn mouth-watering recipes from the local cuisines by heart. Serve a ‘Diner Delight’, the ‘Venice pie’ and a spicy ‘Tortilla poncho'. Don’t forget to keep an eye on your supplies and order fresh ingredients on time. Manage your restaurant like a pro.  \n  \nSwarms of hungry customers take their seat in your restaurant. You'll have work fast to take orders and serve the dishes to keep your customers happy and coming back for more. Reservations and big orders start rolling in. Serve the correct sauces and drinks and be sure to have at least one fresh cup of coffee in the machine!  \n  \nUpgrade your kitchen to speed up preparation time, get a faster conveyor belt and perform better tricks. Purchase a better coffee machine and upgrade your telephone to order multiple fresh ingredients at once! Get “Star power” to create irresistible puddings, instantly re-fill your ingredient stack, do magic tricks or just freeze all customers to buy some time; anything is possible!  \n  \nEarn enough stars to progress to the next level with even higher pace, more customers and new unique tastes! Prove that you are the best chef and beat your boss in each restaurant’s final Boss Battle.","collection":1255,"popularity":1.333333333333333,"category":0,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sxr4xtsuad2npscszxwj.jpg","cloudinary_id":"sxr4xtsuad2npscszxwj","width":640,"height":450},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/w5qojbyponqxpkrl5boo.jpg","cloudinary_id":"w5qojbyponqxpkrl5boo","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mdgt6q1qitgdlgn8j6ee.jpg","cloudinary_id":"mdgt6q1qitgdlgn8j6ee","width":640,"height":480}],"videos":[{"name":"Trailer","video_id":"wVzqonGvsQM"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dcmueotjn6ziukm6rgsx.jpg","cloudinary_id":"dcmueotjn6ziukm6rgsx","width":960,"height":640}}