{"id":95100,"name":"Cartoon Network Match Land","slug":"cartoon-network-match-land","url":"https:\/\/www.igdb.com\/games\/cartoon-network-match-land","created_at":1521819529605,"updated_at":1523334667385,"summary":"Build a team of your favorite Cartoon Network characters to conquer a unique match 3 adventure in Cartoon Network Match Land!\n\nMATCH 3 WITH A TWIST\nOnce you make a match, you can keep on matching until the timer runs out. How many matches can you string together? Plus, you can move pieces diagonally to put a whole new angle on classic match 3 gameplay.\n\nFOOD FIGHT FRENZY\nBattle a horde of sentient food items to keep the Cartoon Network Food Festival running. Punch a pizza! Clash with cupcakes! Fight some french fries!\n\nYOUR FAVORITE CHARACTERS\nChoose your heroes from 20 different Cartoon Network characters with unique abilities. And keep your eyes peeled for CN cameos among the customers and shop owners!\n\nUPGRADES GALORE\nLevel up your heroes, then evolve them into much more powerful versions. Earn gold from 20 different food shops you can unlock and upgrade.\n\nLUNAR SEA SPIRE ARENA\nGet even more gold, gems, tokens, and other goodies in the Lunar Sea Spire, an entirely separate arena mode that lets you test your team’s true power for awesome rewards.\n\nMatch your way to victory in CARTOON NETWORK MATCH LAND!\n\n**********\n\nThis game is available in the following languages: English, French, Italian, Spanish, Portuguese, Russian, Korean and Japanese.\n\nIf you're having any problems with this app, feel free to contact us at advanced.platforms@turner.com. Tell us about the issues you're running into as well as what device and OS version you're using. \n\n**********\n\nThis app includes the option for adults to unlock or buy additional in-game items with real money to enhance game play, ranging from $1.99-$99.99 USD (or equivalent amount in the applicable regional currency). You may disable in-app purchases by adjusting your device settings. \n\niOS will keep you logged on for 15 minutes after an initial in-app purchase. Additional purchases won’t require a re-entry of your password during this 15-minute interval. This is a function of the iOS software and not within our control\n\nIMPORTANT CONSIDERATIONS: \nThis app may contain ads that feature other products, services, shows or offers from Cartoon Network and our partners.\n\nPRIVACY INFORMATION: \nYour privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc. This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below. This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services. Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes. By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device. The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Apple, Inc. Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Apple or your wireless carrier. \n\nTerms of Use: http:\/\/www.cartoonnetwork.com\/legal\/termsofuse.html \nPrivacy Policy: http:\/\/www.cartoonnetwork.com\/legal\/privacy\/mobile.html","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[49414,25636,36608,19222,21842,41348,28080,75102,18862,10225],"tags":[268435465,268435468],"category":0,"genres":[9,12],"first_release_date":1521590400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1521590400000,"region":8,"human":"2018-Mar-21","y":2018,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mlgfsxpnnwz9b6in9zva.jpg","cloudinary_id":"mlgfsxpnnwz9b6in9zva","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aaygodhxegbqcylrmurr.jpg","cloudinary_id":"aaygodhxegbqcylrmurr","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/px3elr75vt6d7vix2ano.jpg","cloudinary_id":"px3elr75vt6d7vix2ano","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nvraha6mksfzycngxvfk.jpg","cloudinary_id":"nvraha6mksfzycngxvfk","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sweeqjvqcyyphyujl1w0.jpg","cloudinary_id":"sweeqjvqcyyphyujl1w0","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xtlthw7tpavmyy0p0if3.jpg","cloudinary_id":"xtlthw7tpavmyy0p0if3","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/baeytnxlu1yqyknyhxod.jpg","cloudinary_id":"baeytnxlu1yqyknyhxod","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ltdipub6oipxzchv55nu.jpg","cloudinary_id":"ltdipub6oipxzchv55nu","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zevjyiwv83kiuhzbgsh9.jpg","cloudinary_id":"zevjyiwv83kiuhzbgsh9","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jwfnbnb2k16ovde6ei5p.jpg","cloudinary_id":"jwfnbnb2k16ovde6ei5p","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/crvrdtpyn9a6dv43fzmg.jpg","cloudinary_id":"crvrdtpyn9a6dv43fzmg","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/cartoon-network-match-land\/id1272183758?mt=8&uo=4"}]}