{"id":96400,"name":"Crest - an indirect god sim","slug":"crest-an-indirect-god-sim","url":"https:\/\/www.igdb.com\/games\/crest-an-indirect-god-sim","created_at":1523832643518,"updated_at":1540668097591,"summary":"Become a god in this indirect god sim. Influence and try to control your followers using commandments but beware, free will leaves these open to interpretation. Will you create a flourishing civilization or lead them into cannibalism?","storyline":"Welcome to Crest, an indirect god sim where the only way to interact with your followers is by issuing commandments written in a pictographic language. \n \nHow these commandments are interpreted and remembered is not set in stone. What you communicate and what experiences your followers have with the environment is the basis for their religion. Over time, commandments can develop different associations and completely change their meaning. After all, your followers still have free will and will sometimes do what they think is best for them, regardless of what you had in mind. \n \nConsequences of your actions may not always be clear and you will need to be aware of the ever-changing environment and your people's disposition, amongst others their disposition towards you. Expressing yourself is the key of Crest; you will do so through your people and the world they shape. \nKey Features \n \nExplore the high-concept of religion by building your own \n- Interact with your followers solely by issuing commandments using a pictographic language \n- Sandbox-style gameplay: set your own goals and how much you interfere with the world \n- Progress by unlocking new words, increasing the complexity of your commandments \n- Observe how your followers evolve as a result of your decisions \n- Oversee a world where weather, vegetation, mineral deposits, drought and animal behavior will create surprises \n- Express yourself in a game without end-goal nor winning condition, allowing you to purely focus on building your legacy in a world where you are the god of everyone","franchise":1251,"franchises":[1251],"popularity":1,"games":[29173,55590,36269,34823,35463,31515,13200,18623,36553,17130],"tags":[268435469,268435471,268435488,536871013,536871027,536871029,536872060,536874694,1073741827],"developers":[15347],"publishers":[15347],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[101,115,117,1148,3782],"genres":[13,15,32],"first_release_date":1520035200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1520035200000,"region":8,"human":"2018-Mar-03","y":2018,"m":3}],"videos":[{"name":"Teaser","video_id":"R5WiMM2gYa8"},{"name":"Trailer","video_id":"m1uxjhBtnnI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e4yhnhrirdiye4xzqskh.jpg","cloudinary_id":"e4yhnhrirdiye4xzqskh","width":460,"height":215},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/341710\/Crest__an_indirect_god_sim"},{"category":9,"url":"https:\/\/youtube.com\/eatcreatesleep"},{"category":6,"url":"https:\/\/twitch.tv\/eatcreatesleepstudio"},{"category":5,"url":"https:\/\/twitter.com\/eatcreatesleep"},{"category":4,"url":"https:\/\/facebook.com\/eatcreatesleep"},{"category":1,"url":"https:\/\/eatcreatesleep.net\/"}]}