{"id":47103,"name":"Expect No Mercy","slug":"expect-no-mercy","url":"https:\/\/www.igdb.com\/games\/expect-no-mercy","created_at":1499713505055,"updated_at":1515661360689,"summary":"The Virtual Arts Fighting Academy is the latest way of teaching deadly martial arts. Students are put through ruthless training using the most advanced Virtual Reality gear. They train and light in virtual worlds with Virtual Reality opponents yet the pain is real. The academy is also a cover for a deadly group of mercenary assassins willing to kill for a price. You are an undercover agent tor the covert government agency known as the Federal Security Bureau. Your mission is to destroy the Virtual Arts Fighting Academy and bring down its leader. \n \nBut the mission is not as simple as it seems. Expect the most brutal lights ever seen, virtual masters, intoxicating virtual reality worlds and the most explosive visual effects ever seen in a fighting game. \n \nMicroforum is proud to present the most realistic, fast action, lighting game ever! Real actors, state-of-the-art animation and graphics. ruthless martial arts fights. intelligent enemies, exciting play levels bizarre cast of virtual opponents, explosive special effects, deadly battles and traps. woven into a suspenseful story line based on the fealure film “EXPECT NO MERCY.\"","popularity":1.333333333333333,"games":[19448,68287,26766,25300,36950,71455,27314,142,64204,10039],"tags":[1,18,268435460,536871019,536871506,536871882,536875057,536875081,536875151,536875426,536875822,536875920,536876694,536877551],"category":0,"keywords":[107,594,970,4145,4169,4239,4514,4910,5008,5782,6639],"themes":[1,18],"genres":[4],"first_release_date":816134400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":816134400000,"region":8,"human":"1995-Nov-12","y":1995,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kwiwtgva1vtii3ulvim7.jpg","cloudinary_id":"kwiwtgva1vtii3ulvim7","width":304,"height":394}}