{"id":57103,"name":"Daily Chthonicle","slug":"daily-chthonicle","url":"https:\/\/www.igdb.com\/games\/daily-chthonicle","created_at":1504599599430,"updated_at":1545509544791,"summary":"This game lets you try on the role of a Supernatural Newspaper Agency boss and editor. The world it takes place in is a dark and haunted one, with ghosts, zombies, monsters and even shapeshifting murderers, pretending to be human after they have stolen their victims' bodies or infiltrated the humanity. It was inspired heavily by the works of H.P.Lovecraft and it builds on the atmosphere of uncertainty and noir of the 1940s. \n \nSend your sextet of weathered journalists, detectives and occult specialists to investigate murder, affair, and horror in the Town. \n \nEach time, the story will be different. Sometimes, a werewolf is shredding innocent (and less innocent) victims to pieces and it is your task to unmask the creature. Other times, it will be a body stealing alien from outer space, a mummy that some misfortunate archeologist has excavated and is now haunting them. Perhaps it will be Jack the Ripper, still mysteriously alive and lurking in the streets at night. \n \nOr maybe there is a really bad big tentacled monster hidden in the cellar of the University? \n \nIt is for you to find out and entertain your readers while bravely standing up against ancient evil.","popularity":1.333333333333333,"games":[25311,28277,37419,36334,29348,26145,51991,26878,76397,27266],"tags":[19,268435468,268435469,268435487,268435488],"developers":[11242],"publishers":[10955],"category":0,"game_modes":[1],"themes":[19],"genres":[12,13,31,32],"first_release_date":1475193600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1475193600000,"human":"2016-Sep-30","y":2016,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hfn1nvofthsb6gk23q0n.jpg","cloudinary_id":"hfn1nvofthsb6gk23q0n","width":460,"height":215},"websites":[{"category":1,"url":"http:\/\/sinistersystems.com\/home\/?m=games&t=daily_chthonicle"}]}