{"id":86903,"name":"Third Grade Learning Games","slug":"third-grade-learning-games","url":"https:\/\/www.igdb.com\/games\/third-grade-learning-games","created_at":1518611610293,"updated_at":1518710598629,"summary":"15 fun and educational games to help your child learn 3rd Grade lessons! Teach them multiplication, division, grammar, geometry, sentences, reading, rounding, place values, and more. Whether they are just starting Third Grade, or need to review and master the subjects, this is a perfect learning tool for kids aged 7-10. Math, language, science, STEM, reading, and critical thinking skills are all tested and practiced in these games.\n\nAll lessons and activities are designed using real third grade curriculums, so you can be sure these games will help give your child a boost in the classroom. And with helpful voice narration and exciting games, your 3rd grade student won't want to stop playing and learning! Improve your child's homework with these 3rd grade teacher approved lessons, including science, STEM, language, and math.\n\nThese learning games include dozens of important lessons for third grade, including:\n• Decimals and Fractions - Convert from decimals to fractions, and add decimals\n• Multiplication - Word problems, solve for x problems, multiply 3-factor and more\n• Geometry - Perimeter, area, and different types of angles\n• Measurement - Measure length, volume, temperature, and time\n• Division - Basic division and word problems\n• Rounding - Round numbers to the nearest 10 or 100, and identify place values\n• Sentence Jumble - Help with reading compression and grammar\n• Parts of Speech - Adverbs, pronouns, prepositions, adjectives, nouns, and verbs\n• Syllables - Sound out words to figure out how many syllables they have\n• Grammar and Tense - Learn the difference between past, present, and future tense\n• Analogies - Compare words to complete the analogy\n• Prefixes - Use a prefix to build words in a fun asteroid space game\n• Food Chain - Identify types of animal and their role in the food chain\n• Solar System - Learn about the planets and bodies in our solar system\n• Water Cycle - Study the phases of the water cycle and how they interact\n\nPerfect for 3rd grade kids and students who need a fun and entertaining educational game to play. This bundle of games helps your child learn important math, grammar, spelling, multiplication, language, science, and problem solving skills used in third grade all while having fun! 3rd Grade teachers around the world use this app in their classroom to help reinforce math, language, and STEM subjects.\n\nAges: 7, 8, 9, and 10 year old children and students.\n\n=====================================\n\nPROBLEMS WITH THE GAME? \nIf you are having any issues please email us at help@rosimosi.com and we will get it fixed for you ASAP.\n\nLEAVE US A REVIEW!\nIf you're enjoying the game then we'd love for you to leave us a review! Reviews help small developers like us to keep improving the game.","popularity":1,"games":[86696,11588,19083,36792,86988,8167,28213,52432,54639,87166],"tags":[35,40,536872030],"category":0,"keywords":[1118],"themes":[35,40],"first_release_date":1455062400000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1455062400000,"region":8,"human":"2016-Feb-10","y":2016,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lxkhgoxfsjh0d74jmigm.jpg","cloudinary_id":"lxkhgoxfsjh0d74jmigm","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/w0sf2bfweuocnivzdy0u.jpg","cloudinary_id":"w0sf2bfweuocnivzdy0u","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mnhed1mhruxkvtqfke4r.jpg","cloudinary_id":"mnhed1mhruxkvtqfke4r","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/enalm62bfr00bnlzcty2.jpg","cloudinary_id":"enalm62bfr00bnlzcty2","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nryedzijv8r50h0bzl09.jpg","cloudinary_id":"nryedzijv8r50h0bzl09","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gj170bbxehzjykqhsiln.jpg","cloudinary_id":"gj170bbxehzjykqhsiln","width":512,"height":512}}