{"id":10940,"name":"Littlewitch Romanesque","slug":"littlewitch-romanesque","url":"https:\/\/www.igdb.com\/games\/littlewitch-romanesque","created_at":1433253128050,"updated_at":1517270844764,"summary":"As Domino, you must mentor Aria and Kaya in their training to become witches, mastering the magical arts. Take them to the classroom to grow the skills required to master powerful spells. Send them on quests to test their progress and show them the dangers that exist in the world.","storyline":"An alternate world ruled by swords, magic, and monsters where four moons can be seen in the sky. The dark and chaotic twilight of the “Age of Tower” ended for this world called Stellamund and it entered the prosperous “Age of Crown”. But the wizards who triggered the great war during the Age of Tower no longer hold the power they used to have, and quietly researched the great magics that were lost, in a magical academy called Grimoire.\n\nThis is a story expanding three years of an extraordinary great wizard who was born in such age, the girls who become his pupils, a ruin from the old age, “Black Tower” that they live in, and the people that gather around them.\n\nThe main character Domino became the 9th great wizard of the Grimoire Academy. It was a very special case for a young wizard to be so successful, but Domino soon grew tired of the Grimoire. The other great wizards were only seeing magic as means for personal success than an important research. The research of magic has been put off and all they were doing was fighting over authority.\n\nDomino left the capital and decided to live by himself in the sealed Black Tower on the frontier, rumored that a great wizard in the Age of Tower lived. But the other great wizards didn’t think well of that and gave him a test.\n\nThat test was to “Raise a full fledged wizard within three years”. Normally it would take decades to raise a proper wizard. On top of that, the two students that he was suppose to look after, Aria Vancliff and Kaya Xavier, were two of the most troublesome girls in the academy. Will Domino be able to complete this difficult task...?","popularity":1.333333333333333,"games":[12328,25311,47158,29730,19290,33603,24048,36962,55888,65827],"tags":[17,268435469,268435471,268435487,536870990,536871006,536871138,536872181,536872225,536872299,1073741828,1073741829],"developers":[5835],"publishers":[5835,5836,3020],"category":0,"player_perspectives":[4,5],"game_modes":[1],"keywords":[78,94,226,1269,1313,1387],"themes":[17],"genres":[13,15,31],"first_release_date":1120176000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1120176000000,"region":5,"human":"2005-Jul-01","y":2005,"m":7},{"category":0,"platform":6,"date":1419206400000,"region":8,"human":"2014-Dec-22","y":2014,"m":12}],"videos":[{"name":"Trailer","video_id":"HxuzrFmUlIE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tu3oa7wtoepylftsbbai.jpg","cloudinary_id":"tu3oa7wtoepylftsbbai","width":256,"height":364},"websites":[{"category":1,"url":"http:\/\/littlewitch.us\/"}]}