{"id":4740,"name":"Cake Mania","slug":"cake-mania","url":"https:\/\/www.igdb.com\/games\/cake-mania","created_at":1391189701697,"updated_at":1523279390280,"summary":"Over the past few years, we’ve watched Jill Evans grow from a fresh-out-of-baking-school student to a world-class culinary celeb. Now, Jill confronts her greatest challenge yet - planning her dream wedding – in Cake Mania® 3, the highly anticipated follow-up to one of the most popular casual games of all-time!\n                    As Jill nervously prepares for her long anticipated wedding day, disaster strikes when a mysterious, long-forgotten time bender crashes to the ground and shatters into pieces. As Jill’s family and friends rush to pick up the scattered shards, they are suddenly sent hurtling through time.  Now, to ensure her wedding goes off without a hitch, Jill herself must travel to remote periods in time - from Ancient Egypt and Revolutionary France, to an unknown future where anything is possible - and work her cake-making magic on a wide variety of locals in order to get herself and her guests back before the ceremony begins!\n                    \n                    Access to new bonus levels, customers and outfits with Sandlot Connect\n                    Over 350 possible level combinations\n                    More than 30 hilarious new customers\n                    All-new power-ups, kitchen upgrades and customizable bakeries\n                    \n                     \n                    \n                    After re-opening the Evans Bakery, and sending her grandparents on an exotic Hawaiian cruise, Jill is back in an all-new, out-of-this-world series of adventures! Help Jill’s college friend Risha in her posh, northwestern, rooftop bakery; rescue her old flame, Jack, in his underwater theme park located on the ocean floor, or wind up in 4 other far-flung bakery locations, each with its own unique layout!\n                    What awaits Jill? Fame? Fortune? Love? In Cake Mania® 2, you choose which path Jill pursues, with each decision leading to new baking challenges and dilemmas. With 204 levels of baking and frosting madness, 6 different possible endings and a branching, non-linear storyline, it’s your decision to make in Cake Mania 2!\n                    \n                    Customize Jill’s bakeries with 50 unique kitchen upgrades \n                    18 all-new quirky, demanding customers, ranging from Federal Agents to mysterious Aliens, keep Jill on her toes\n                    10 deliciously different cake styles with 6 fabulous frostings\n                    8 wild cake toppers for earning extra cash\n                    See how you measure up in a new Endless Baking mode \n                    \n                     \n                    \n                    Welcome to Cake Mania®! Jill, our hero, has returned from culinary school, only to find her beloved grandparents' bakery closed down. Business has taken a drastic downturn because a new Mega-Mart store opened in the neighborhood.\n                    Help Jill save the day by opening a bakery, and earn enough money to re-open her grandparents' shop in this beautiful, fast-paced adventure. Upgrade your equipment and set up 4 different bakeries in exotic locales. Serve up seasonal confectionary delights to a variety of customers. See if you have what it takes to save the Evans Bakery!\n                    \n                    Over 45 fast-paced levels of baking! \n                    Bake in four unique locales \n                    Customize your Kitchen in the Shop Screen  \n                    Post your High Scores Online","collection":1927,"rating":50,"popularity":1.333333333333333,"aggregated_rating":48,"aggregated_rating_count":2,"total_rating":49,"total_rating_count":2,"rating_count":0,"games":[31515,18623,25311,29173,55590,17130,26145,17111,35371,34823],"tags":[1,268435469,268435471,536871670,536871671,536872060,536872070,536875356,536877305],"developers":[584],"publishers":[584],"category":0,"game_modes":[1],"keywords":[758,759,1148,1158,4444,6393],"themes":[1],"genres":[13,15],"first_release_date":1158278400000,"platforms":[6,38,20,5,55,8],"release_dates":[{"category":0,"platform":20,"date":1167609600000,"region":2,"human":"2007-Jan-01","y":2007,"m":1},{"category":0,"platform":6,"date":1158278400000,"human":"2006-Sep-15","y":2006,"m":9},{"category":0,"platform":5,"date":1158278400000,"human":"2006-Sep-15","y":2006,"m":9},{"category":0,"platform":55,"date":1158278400000,"human":"2006-Sep-15","y":2006,"m":9},{"category":0,"platform":38,"date":1158278400000,"human":"2006-Sep-15","y":2006,"m":9},{"category":0,"platform":8,"date":1158278400000,"human":"2006-Sep-15","y":2006,"m":9},{"category":0,"platform":20,"date":1158278400000,"human":"2006-Sep-15","y":2006,"m":9}],"alternative_names":[{"name":"Cake Mania: In the Mix!"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kreoxhghmywwk85fp0e0.jpg","cloudinary_id":"kreoxhghmywwk85fp0e0","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tfo0uxjburknbd5clds5.jpg","cloudinary_id":"tfo0uxjburknbd5clds5","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/baxfwirsvygnqhg26ioe.jpg","cloudinary_id":"baxfwirsvygnqhg26ioe","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dkvgezmcfhes25bzl15i.jpg","cloudinary_id":"dkvgezmcfhes25bzl15i","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rwjm4aylkafz93x48yu2.jpg","cloudinary_id":"rwjm4aylkafz93x48yu2","width":800,"height":600}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ywhaan0vxevueowgacl7.jpg","cloudinary_id":"ywhaan0vxevueowgacl7","width":250,"height":239},"esrb":{"rating":3},"external":{"steam":"36180"}}