{"id":49340,"name":"Thunder Alley","slug":"thunder-alley","url":"https:\/\/www.igdb.com\/games\/thunder-alley","created_at":1500021167794,"updated_at":1516665000950,"summary":"THUNDER ALLEY for Game Boy Advance features characters first presented to the gaming community in TEN PIN ALLEY and TEN PIN ALLEY 2 available for Play Station 1 and Saturn systems. The stock car racing game comes loaded with tons of fast-paced action and entertaining tracks. Choose from eight different characters to blaze out on one of four diverting tracks. The game was created with the realistic laws of physics that are applied to real stock car racing to provide a realistic racing feel. The game offers a practice racing mode that allows players to get the feel for the basic controls including 'A' for accelerate and 'B' for brake. Tournament mode has players racing to earn points that are awarded based on the finishing position of each player's character. Every course has its own unique set of obstacles that can get in the way, but the player can drive over them with power ups. Power ups also provide the driver with improved steering and speed. If the player wins the game's final tournament, a secret play mode is unlocked and can be played by the winner. Fans of racing games including cart or other forms of transportation should give THUNDER ALLEY a try and won't be disappointed. In a game that offers fun graphics, sound effects, and tracks that can be played over and over again, this game guarantees hours of unique and endless entertainment.","collection":3937,"popularity":1.333333333333333,"games":[68287,71455,28029,36950,25300,64204,25311,27314,19448,26766],"tags":[1,18,268435466,536871882],"category":0,"keywords":[970],"themes":[1,18],"genres":[10],"first_release_date":1089504000000,"platforms":[24],"release_dates":[{"category":0,"platform":24,"date":1089504000000,"region":8,"human":"2004-Jul-11","y":2004,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zf7fnaasyq9rcztq8tfi.jpg","cloudinary_id":"zf7fnaasyq9rcztq8tfi","width":450,"height":450}}