{"id":12352,"name":"Blackjack Academy","slug":"blackjack-academy","url":"https:\/\/www.igdb.com\/games\/blackjack-academy","created_at":1441473642060,"updated_at":1513018837684,"summary":"Everything you wanted to know about blackjack but were too shy to ask. From the novice to the pro, BlackJack Academy will help you learn to play blackjack or brush up before you hit the tables. BlackJack Academy features a five player table so you and four friends can all play, multiple table rules like Las Vegas, Reno, Atlantic City as well as the ability to specify your own table rules. BlackJack Academy offers on-line help for all the different play options and will even give you the optimal play for the current hand if you like. Color selectability, game save and retrieve, and different play strategies are some of the other features of Blackjack Academy. We are sure you and your friends will have many hours of fun and education with Blackjack Academy. Microillusions is proud to have you sitting at our table.\n\nOther features include: sound toggle, play speeds from slow to very fast, card counting toggle, player card total toggle, money management guide, any dollar amount can be selected from table minimum to $9999.00 (individual totals can get to be much, much higher during the play of the game), as well as a pocket size quick reference guide for optimal play when you are at the tables.","collection":1771,"popularity":1.333333333333333,"games":[44242,18623,22470,29173,22425,26145,55590,55689,23867,22406],"tags":[268435469,268435472,536871158,536871641,536872060,536874083,536875182,536875258,1073741827],"publishers":[7178],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[246,729,1148,3171,4270,4346],"genres":[13,16],"first_release_date":567907200000,"platforms":[115,16],"release_dates":[{"category":2,"platform":16,"date":567907200000,"human":"1987","y":1987,"m":12},{"category":2,"platform":115,"date":567907200000,"human":"1987","y":1987,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nlnurb39ogydd8pd2sfg.jpg","cloudinary_id":"nlnurb39ogydd8pd2sfg","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/llfycrrsxgnqp80yzilc.jpg","cloudinary_id":"llfycrrsxgnqp80yzilc","width":651,"height":640}}