{"id":12552,"name":"Crazy Cars III","slug":"crazy-cars-iii","url":"https:\/\/www.igdb.com\/games\/crazy-cars-iii","created_at":1442349620633,"updated_at":1517270792838,"summary":"The game is essentially an upgrade from Titus Interactive previous entry in the Crazy Cars series, Crazy Cars III. It adds a two player mode and a few more options. The objective of the game is to become the undisputed champion of illegal races in the U.S.A.. To do so, the player must race against a group of computer controlled opponents in a variety of illegal races across the country. The races are divided into three leagues, each one with increasingly harder opponents, and the player needs to regularly upgrade his Lamborghini Diablo in order to keep him above the rest of drivers, by using the money from bets as well as the bonuses obtained when finishing races in the first place.\nThe races themselves take place in a variety of scenarios (mountain roads, the desert, urban settings) and they include weather conditions such as rain and snow. At the end of each league, and in order to be able to join the next one, the player has to go through a \"challenge\", consisting of a timed race in a highway infested with trucks.\n\nDespite the game obtaining mostly positive reviews, a major source of complaints came from the saving system. Players are allowed to save their progress once every four races. Since the game requires the player to always finish in first place in order to progress further into the game, this means players needed to win four races in a row before saving their progress.","collection":1661,"popularity":1.333333333333333,"games":[28856,36662,14363,58785,40470,67625,73422,46923,6426,26709],"tags":[268435466,536871641,536872695,536872983,536874337,536875069,536875117,536879193,536879765,536880637,1073741826],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[729,1783,2071,3425,4157,4205,8281,8853,9725],"genres":[10],"first_release_date":725760000000,"platforms":[16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12}],"alternative_names":[{"name":"Crazy Cars 3","comment":"Other"},{"name":"Lamborghini American Challenge","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xibuewihqqj3tnffc2n7.jpg","cloudinary_id":"xibuewihqqj3tnffc2n7","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uol85wamvopb0hcw4h1r.jpg","cloudinary_id":"uol85wamvopb0hcw4h1r","width":465,"height":640}}