{"id":46852,"name":"Quester","slug":"quester","url":"https:\/\/www.igdb.com\/games\/quester","created_at":1499702438136,"updated_at":1515771859033,"summary":"As with many other ball-and-paddle games (including Namco's own Gee Bee trilogy), the player must take control of a paddle at the bottom of the screen, and move it left and right to deflect a ball into the formation of bricks above it (and if you can keep that ball in play for a preset period of time, it will split into three balls) - certain bricks will also leave powerups when destroyed that will increase the size of the paddle, generate several extra balls in force-field when the initial ball goes into it and even create a line below the paddle that will prevent the balls from going out of play when collected. The seventh, fourteenth, twenty-first and twenty-eighth rounds are also \"bonus rounds\", where you have to destroy all the bricks in the formation within a preset time limit (unless all your balls go out of play); the thirty-third and final round is also a \"boss round\", where you are up against \"Burida\" (who is protected by a metal wall with a vulnerable spot on its top side, but does not attack by spitting lethal mirrors like Doh did to both Vaus in Arkanoid and the human Bubblun & Bobblun in Rainbow Islands). Once you have hit that vulnerable spot on the top side of the wall five times, it will leave Burida vulnerable - and once you have hit him, you will receive 100000 points for every life you have left and the game will be over.","popularity":1.666666666666667,"games":[55752,12632,36926,27209,68324,10039,1070,47823,26766,25300],"tags":[1,268435464,536871208,536871938,536872961,536875071,536875472],"category":0,"keywords":[296,1026,2049,4159,4560],"themes":[1],"genres":[8],"first_release_date":560044800000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":560044800000,"region":8,"human":"1987-Oct-01","y":1987,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tvfwzpfcifouyks62ktr.jpg","cloudinary_id":"tvfwzpfcifouyks62ktr","width":274,"height":397}}