{"id":64752,"name":"Block-Man 1","slug":"block-man-1","url":"https:\/\/www.igdb.com\/games\/block-man-1","created_at":1505206530736,"updated_at":1516570591660,"summary":"The player controls Block-man. Block-Man is in a game-area bounded by red bricks and flaming torches, representing the room he's in. Every room has an exit and from his starting position Block-Man must get to that exit. In his way are walls and pits that he must overcome. The only available resource are building bricks. The only commands available are move left \/ right. pick up\/put down and climb (a maximum of one brick only). Using these commands the player must solve the puzzle and get Block-Man to the exit of each room. \n \nThe shareware game consists of ten levels. The full, registered, game has more levels, and for a further fee a constructor option that allows the player to create and play their own levels and those of other game owners is available.","storyline":"The story behind the game is that once upon a time King Triangulos ruled the kingdom of Bentangle. The king loved blocks, he'd played with them since he was a child and he loved them almost as much as he loved his daughter, the beautiful Princess Pentaguin. The princess must marry someone worthy so the king had a series of rooms constructed such that extreme cleverness in moving and using blocks was necessary to escape from each. The suitor who could complete all these puzzles would be a fit match for his daughter. Block-man is a commoner in the land of Bentangle but he loved the princess nonetheless and vowed to win her hand in marriage.","popularity":2.666666666666667,"developers":[14480],"publishers":[14480],"category":0,"first_release_date":788832000000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":788832000000,"human":"1994","y":1994,"m":12}],"alternative_names":[{"name":"Blockman 1"},{"name":"Block-Man"}],"videos":[{"name":"Gameplay video","video_id":"L0xDwnn0Rmw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k0jrfjy4ljjnql1ovz4t.jpg","cloudinary_id":"k0jrfjy4ljjnql1ovz4t","width":800,"height":949}}