{"id":68652,"name":"DUPLICATEAM2R (Another Metroid 2 Remake)","slug":"duplicateam2r-another-metroid-2-remake","url":"https:\/\/www.igdb.com\/games\/duplicateam2r-another-metroid-2-remake","created_at":1506515382484,"updated_at":1545366057612,"summary":"AM2R, short for Another Metroid 2 Remake, is an action-adventure video game developed by Milton Guasti under the pseudonym DoctorM64, and released in August 2016 for Microsoft Windows, coinciding with the 30th anniversary of the Metroid series. It is an unofficial, enhanced remake of Nintendo's Game Boy game Metroid II: Return of Samus (1991), borrowing the art style and overall feeling of the Game Boy Advance game Metroid: Zero Mission (2004). Shortly after the game's release, Nintendo sent DMCA notices to websites hosting AM2R; download links to the game were removed from its official website, but Guasti said that he still planned to continue working on the game privately. In September 2016, he ended the development of AM2R after receiving a DMCA takedown request from Nintendo. An official remake, Metroid: Samus Returns, was released in 2017. \n \nThe game follows Samus Aran, who aims to eradicate the parasitic Metroids from their home planet SR388. It includes several new features, including redone graphics and music, a map system, and new areas and minibosses. The controls were changed to be less \"floaty\", in line with the gameplay of later titles in the series. Video game journalists appreciated the game, frequently calling it impressive and commenting on the improved visuals compared to those of the original Metroid II, although one thought the conditions required to win battles against Metroids were too specific considering how often they occur. The game was nominated for The Game Awards 2016, but was later removed from the nominations page without notice.","collection":243,"franchise":756,"franchises":[756],"popularity":1.333333333333333,"games":[18862,79862,102112,88253,76696,27796,19909,100801,47319,96159],"tags":[536872006],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[1094],"themes":[18],"genres":[5,8],"first_release_date":1470441600000,"status":6,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1470441600000,"human":"2016-Aug-06","y":2016,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tisdrdqtt8bnhytn8uvj.jpg","cloudinary_id":"tisdrdqtt8bnhytn8uvj","width":1280,"height":720}],"videos":[{"name":"Gameplay video","video_id":"SXnRYZb2xN8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dep5xvg4og2dyhhgvcat.jpg","cloudinary_id":"dep5xvg4og2dyhhgvcat","width":2629,"height":1229},"websites":[],"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}