{"id":9352,"name":"Delta Force: Xtreme 2","slug":"delta-force-xtreme-2","url":"https:\/\/www.igdb.com\/games\/delta-force-xtreme-2","created_at":1427927894307,"updated_at":1547994153725,"summary":"Enemies lurk in locations around the globe, waiting for the right opportunity to strike. As part of Delta Force, the U.S. Army's most secretive and highly trained unit, you have the skills and the firepower to hunt them down and take them out. Get ready to insert yourself into critical situations by air, land and sea, and show you have the courage to take the fight to the enemy and overcome overwhelming odds to achieve victory.\n\t\t\t\t\tIn Delta Force: Xtreme 2, you'll take control of Delta Force, employing the most dangerous and effective commando tactics and state-of-the-art weaponry at your disposal to defeat the enemy. Track enemies across a variety of expansive landscapes scattered across the globe in 10 single-player scenarios, and take them down with more than 20 real-world weapons. Insert into danger zones using dangerous HALO jumps, and use choppers, tanks and high-speed watercraft to roar into the midst of the action. Create your own exciting custom levels with the Battle Editor tool, and battle players from all over in five challenging online multiplayer game types.\n\t\t\t\t\tFeatures \n\t\t\t\t\tCommand the secretive, highly trained Delta Force and use commando tactics and state-of-the-art weapons to take out dangerous enemies \n\t\t\t\t\tInsert yourself into the action by land, air and sea using choppers, tanks and high-speed watercraft \n\t\t\t\t\tExperience realistic, accurate and deadly shooting via enhanced ballistics \n\t\t\t\t\tEmploy the powerful and easy-to-use MED level editor to create custom levels or recreate historical fights \n\t\t\t\t\tCustomize urban, jungle and mountain environments using 10 new and 20 classic highly detailed terrains \n\t\t\t\t\tAdd dynamic weather effects and real-time lighting as well as thousands of objects and buildings to create a realistic environment \n\t\t\t\t\tUp to 64 players may battle online in Deathmatch, Team Deathmatch, Capture the Flag, Team King of the Hill and Flagball multiplayer games \n\t\t\t\t\tExperience a fair fight every time using the game's anticheat technology, and see how you measure up with persistent stats that track your performance \n\t\t\t\t\tAssemble an impressive squad and manage it via the new NovaWorld Community","collection":164,"rating":50,"popularity":4.333333333333334,"total_rating":50,"total_rating_count":2,"rating_count":2,"games":[28751,18088,8422,10964,64311,14758,68287,77956,19549,7843],"tags":[1,39,268435461,268435480,536870913,536871365,536871378,536871475,536871576,536871937,536875171,536880818,536881277,536883621,1073741825,1073741826],"developers":[92],"publishers":[92],"category":0,"player_perspectives":[1,2],"game_modes":[1,2],"keywords":[1,453,466,563,664,1025,4259,9906,10365,12709],"themes":[1,39],"genres":[5,24],"first_release_date":1243382400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1243382400000,"region":2,"human":"2009-May-27","y":2009,"m":5},{"category":0,"platform":6,"date":1251936000000,"region":1,"human":"2009-Sep-03","y":2009,"m":9},{"category":0,"platform":6,"date":1245283200000,"region":8,"human":"2009-Jun-18","y":2009,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h2w6tolhag81b6y6okdx.jpg","cloudinary_id":"h2w6tolhag81b6y6okdx","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vcxumuftxwqbesevnsh1.jpg","cloudinary_id":"vcxumuftxwqbesevnsh1","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ogpvv0xentkckcefoln6.jpg","cloudinary_id":"ogpvv0xentkckcefoln6","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ydtyclgbcpco5eygwpxe.jpg","cloudinary_id":"ydtyclgbcpco5eygwpxe","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/owfz0trq3sdfwvocpbne.jpg","cloudinary_id":"owfz0trq3sdfwvocpbne","width":1024,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yedtislci6rxpqxjuwh1.jpg","cloudinary_id":"yedtislci6rxpqxjuwh1","width":513,"height":724},"esrb":{"synopsis":"This is a first-person shooter in which players engage in combat missions throughout Eastern Europe and Southeast Asia. Players use a variety of weapons (e.g., pistols, rifles, rocket launchers) to infiltrate bases, kill enemies, and retrieve military information. Realistic gunfire and cries of pain can be heard as enemies are shot and killed. Small puffs of red blood spray off opponents to indicate successful hits. One mission involves taking out enemies that are described as 'drug smugglers.'","rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\nIt contains: Realistic looking violence\nThis game allows the player to interact with other players ONLINE.","rating":4},"websites":[{"category":1,"url":"http:\/\/www.novalogic.com\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/32610"}],"external":{"steam":"32610"}}