{"id":12762,"name":"Sensible Golf","slug":"sensible-golf","url":"https:\/\/www.igdb.com\/games\/sensible-golf","created_at":1442650490179,"updated_at":1516160315442,"summary":"Sensible Golf is a 2D golf simulation. \n \nHaving been quite successful with their cute action soccer game Sensible Soccer, Sensible Software decided that the concept of \"No fuss, just fun\" could be applied to other sports, too. They chose golf. \n \nSensible Golf is not an accurate simulation of golf, but an action adaptation of the sport streamlined for quick and easy gameplay. Consequently, complications such as wind and terrain heights are not featured, although the green has little arrows indicating the slopes. Apart from that, the player's only concerns are the water and sand hazards, and the distance to the hole. As a result, Sensible Golf is instead a practice in target shooting, rather than a golf game. \n \nStriking involves only two action: Aiming the pointer in the desired direction, and pressing the action button three times. The game uses the well-known three-click-control, with which you set power and swerve of the strike. The computer automatically suggests a proper club, but the player may change it manually. A pop-up map helps one find their bearing. \n \nThe courses are fictional, composed from a pool of holes which often appear in multiple courses, sometimes with minor variations. Play modes include single 18-hole rounds, a complete season and a tournament. Up to 72 human players may participate in the latter.","popularity":1,"games":[79640,74720,68674,60885,47744,22610,6087,22690,86491,72781],"tags":[268435470,536870942,536872078,1073741827],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[30,1166],"genres":[14],"first_release_date":820368000000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":820368000000,"human":"1995","y":1995,"m":12},{"category":7,"platform":13,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ftphyite4dcxpqdpw8am.jpg","cloudinary_id":"ftphyite4dcxpqdpw8am","width":620,"height":328}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yopsmlrl2eot0tchd2bd.jpg","cloudinary_id":"yopsmlrl2eot0tchd2bd","width":640,"height":833}}