{"id":14662,"name":"Dragon Fighter","slug":"dragon-fighter","url":"https:\/\/www.igdb.com\/games\/dragon-fighter","created_at":1448201177524,"updated_at":1515663417893,"summary":"The player takes control of a magical human fighter who has the ability to transform himself into a flying dragon. As the fighter, the player can run, crouch, jump, and attack with his sword as he would in most side-scrolling action games. Underneath his life gauge is a \"metamorphosis gauge\" that will gradually be filled as the player destroys his enemies. When the metamorphosis gauge begins to flash, the player can transform into the dragon by pressing up and A button after jumping. As a dragon, the player will hover in the air while the screen scrolls automatically to the right, similarly to a side-scrolling shoot-'em-up game. The dragon's main attack is his fire breath. While the player can fly in any of the eight directions, they cannot turn around and the dragon will only face and attack to the right. While in dragon, the player's metamorphosis gauge will gradually be drained out. The player will transform back to a fighter if the metamorphosis gauge empties out completely or when the player rapidly taps the A button again. \nAs the fighter, the player can also shoot a projectile attack by holding the B button until the character begins to flash. The types of projectile fired by the player depends on the color of the player's outfit, which can be changed by picking up certain power-up items labeled with the letters G (green, the player's default color), B (blue), and R (red). Changing the color of the player's outfit will also change the pattern of the dragon's fire breath attack. Other power-ups includes energy restoring potions, a flower that helps fill the metamorphosis gauge faster, and a ring that destroys all on-screen enemies. At the end of each stage, the player will receive a staff that will increase their maximum health. \nThere are six stages in all, each with their own guardian awaiting to challenge the warrior at the end. The game will end if the player loses all of their life power and only three chances are provided to continue at the stage where they died before the player is forced to start all over.","popularity":1,"games":[47823,11560,36926,68287,36950,11567,12632,37088,11169,36534],"tags":[1,17,268435461,268435487,268435489,536871208,536871244,536871904,536871937,536872010,536872622,536874209,536874398,536875055,536875083,536875148,536875214,536875672,536876277,536876348,536876585,536876607,536877954,536878599,1073741825,1073741828],"developers":[7188],"publishers":[7188],"category":0,"player_perspectives":[1,4],"game_modes":[1],"keywords":[296,332,992,1025,1098,1710,3297,3486,4143,4171,4236,4302,4760,5365,5436,5673,5695,7042,7687],"themes":[1,17],"genres":[5,31,33],"first_release_date":694137600000,"platforms":[16],"release_dates":[{"category":2,"platform":16,"date":694137600000,"human":"1991","y":1991,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ej6ex3w6e0uahbdjbqrc.jpg","cloudinary_id":"ej6ex3w6e0uahbdjbqrc","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bfuudzupemglxdm9bsvl.jpg","cloudinary_id":"bfuudzupemglxdm9bsvl","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jxleuaqcz5amlx8h8xlg.jpg","cloudinary_id":"jxleuaqcz5amlx8h8xlg","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rxg2vgk39l8fanm9wpjz.jpg","cloudinary_id":"rxg2vgk39l8fanm9wpjz","width":630,"height":754}}