{"id":25862,"name":"Indiana Jones in the Lost Kingdom","slug":"indiana-jones-in-the-lost-kingdom","url":"https:\/\/www.igdb.com\/games\/indiana-jones-in-the-lost-kingdom","created_at":1479403791346,"updated_at":1517270869260,"summary":"Indiana Jones in the Lost Kingdom is a puzzle video game developed by Michael J. Hanson and published by Mindscape for the Commodore 64. The game is based on the Indiana Jones series, and was released in North America around January 1985, while a U.K. version was released in March 1985. \n \nGameplay requires the player to think like fictional archaeologist Indiana Jones to solve the puzzles of each level, as the game does not provide the player with any rules or gameplay information; the game's cover advertised, \"Nobody told Indiana Jones the rules. And no one will tell you.\" \n \nIndiana Jones in the Lost Kingdom features six levels played across a \"Lost Kingdom.\" Playing as Indiana Jones, the player must solve a puzzle in each level to progress through the game. The player's ultimate goal is to retrieve a valuable artifact that contains the secrets of a lost civilization, before Jones' arch-rival, Ivar Reiss, can take it for himself. Indiana Jones is armed only with a mystical cane, and must battle against numerous enemies and perils throughout the game, including bats, monsters, steep cliffs, twisting mazes, and \"killer snowflakes\". Joystick movements vary between each level, requiring the player to relearn the control scheme throughout the game. A two-player option is also available. \n \nNo rules or gameplay information is provided to the player, who is left to use logic and intuition to solve each puzzle, as Indiana Jones would. Solving each puzzle requires the player to pay close attention to subtle changes in each level's surroundings or musical score, as well as other possibilities, testing the player's \"Indiana Jones Quotient\" (IJQ). However, the game's instruction manual does feature clues at the bottom of each page. Each clue is presented as a hieroglyphic, and must be deciphered by the player using a magic viewer, similar to 3D glasses. A \"clue hotline\" was also available for players, providing them with pre-recorded hints on how to finish each level.","collection":2019,"franchise":2,"franchises":[2],"popularity":1.333333333333333,"games":[1070,25646,10039,37094,1073,51485,26848,1188,19289,58479],"tags":[1,268435464,268435465,536873017,536875778,1073741826],"publishers":[11247],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[2105,4866],"themes":[1],"genres":[8,9],"first_release_date":473299200000,"platforms":[15],"release_dates":[{"category":2,"platform":15,"date":473299200000,"region":2,"human":"1984","y":1984,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g4qsls8u1jbjdyshnpzl.jpg","cloudinary_id":"g4qsls8u1jbjdyshnpzl","width":1000,"height":1197}}