{"id":5662,"name":"Bomb Squad","slug":"bomb-squad","url":"https:\/\/www.igdb.com\/games\/bomb-squad","created_at":1396149471476,"updated_at":1534909470910,"summary":"Start the game with a view of the code number display which is damaged. In order to find the code which disarms the bomb, the player has to repair the various circuits in order to fix the display. By selecting a square on the code number display, the player will be brought to the corresponding circuit which can be repaired using cutters, pliers, and soldering iron. The player's partner, Frank, will guide through the repairs by telling the player what needs to be done, in what order repairs should be performed, and by helping the player position the tools. Depending on the circuit, the player may need to cut out parts or replace parts (spare parts are located at the top of the screen). If the player use an incorrect replacement part, or perform the repairs in the wrong order, the player will lose time or even cause the bomb to explode. \n \nOn the more difficult skill levels, circuit parts may even overheat and cause a fire; luckily, the player also have a fire extinguisher with you to deal with this situation! When enough circuits have been repaired, the player can decipher the code, enter it into the computer, and the bomb will be disarmed (an incorrect guess will cause it to explode, however). The player may choose to have a one, two, or three digit code to guess and several difficulty levels are available.","popularity":1.333333333333333,"games":[27092,34269,76731,29173,14314,55036,90108,32510,55590,25646],"tags":[1,268435465,268435471,536872315,536874694,536875206,536875262,536878268,536878426,536883136,1073741825],"developers":[2521],"publishers":[2521],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[1403,3782,4294,4350,7356,7514,12224],"themes":[1],"genres":[9,15],"first_release_date":402278400000,"platforms":[67],"release_dates":[{"category":1,"platform":67,"date":402278400000,"region":2,"human":"1982-Oct","y":1982,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qhkujwx0qdbfysah9qpj.jpg","cloudinary_id":"qhkujwx0qdbfysah9qpj","width":256,"height":360}}