{"id":6262,"name":"The Elder Scrolls Travels: Shadowkey","slug":"the-elder-scrolls-travels-shadowkey","url":"https:\/\/www.igdb.com\/games\/the-elder-scrolls-travels-shadowkey","created_at":1398047059233,"updated_at":1515654090932,"summary":"The Elder Scrolls Travels: Shadowkey was the third game in the Elder Scrolls Travels series, developed by Vir2L, Babel, TKO, and Nokia. While being published by Bethesda and Nokia. \n \nYour village has safely remained just out of reach of The War of the Bend'r-mahk, but now danger strikes from another direction. You must save your village from marauders who are but pawns in the struggle to capture Shadowmage Skelos Undriel -- a piece in a darker and more sinister game. You'll journey through rugged terrain, despoiled temples, bandit lairs, and murderous caverns. You'll fight many foes in your search for the power of the Shadowkeys and the Star Teeth, and your journey will lead you to the Crypt of the Heart where you'll face the ultimate test. \n \nShadowmage Skelos Undriel is on the run from Battlemage Jagar Tharn, driven from the heart of Tamriel by Tharn's agents, who are in dogged pursuit. Undriel chooses to flee to the Western Reach, an area in the throes of The War of the Bend'r-mahk between High Rock, Hammerfell and Skyrim. The Shadowmage hides himself in the chaos swirling about Dragonstar. Skelos Undriel then hatches a desperate scheme to collect the Star Teeth sown about the region hoping their power is sufficient to thwart Tharn's agents, and perhaps even destroy the Battlemage himself. \n \nKey Features \n \n* First-person RPG set in the best-selling, award-winning world of The Elder Scrolls. \n \n* Artwork and design by members of the award-winning Elder Scrolls and Morrowind teams. \n \n* Explore 20 large dungeon levels ranging from wilderness levels to dense and complex city and hideout levels in a detailed and open-ended fantasy setting. You can even play the dungeons with your friends in cooperative multiplayer mode via Bluetooth. \n \n* Play the classic Elder Scrolls nine character classes and eight character races. Character classes include Assassin, Barbarian, Battlemage, Knight, Nightblade, Rogue, Spellsword, Sorcerer, and Thief. Races include Argonian, Breton, High Elf, Dark Elf, Khajiit, Nord, Redguard, and Wood Elf. \n \n* Shadowkey has over 25 magic spells, more than 60 opponents, and over 100 weapons and items. \n \n* Multiplayer (via Bluetooth): Share quests and adventures with two friends in cooperative multiplayer","collection":6,"popularity":2,"games":[23198,1907,7329,1081,36926,18822,1593,25300,2368,6452],"tags":[1,268435468,536870984,536871008,536871041,536871139,536871470,536871938,536872232,536872622,536872647,536872798,536875161,536875196,536875242,536875265,536875302,536875316,536875319,536875330,536875488,536875525,536875677,536875699,536875738,536875778,536875803,536875831,536875891,536876233,536876606,536876607,536876974,536877851,536877870,536878073,536878132,536879059,536880386,536880932,536881260,536882279,536882286,536883213,536884022,1073741825],"developers":[2090,848],"publishers":[2421],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[72,96,129,227,558,1026,1320,1710,1735,1886,4249,4284,4330,4353,4390,4404,4407,4418,4576,4613,4765,4787,4826,4866,4891,4919,4979,5321,5694,5695,6062,6939,6958,7161,7220,8147,9474,10020,10348,11367,11374,12301,13110],"themes":[1],"genres":[12],"first_release_date":1101254400000,"platforms":[42],"release_dates":[{"category":0,"platform":42,"date":1101254400000,"human":"2004-Nov-24","y":2004,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ybzdhcleh6rwo80rermf.jpg","cloudinary_id":"ybzdhcleh6rwo80rermf","width":1078,"height":1048},"esrb":{"rating":5}}