{"id":662,"name":"Anno 1404","slug":"anno-1404","url":"https:\/\/www.igdb.com\/games\/anno-1404","created_at":1317748760000,"updated_at":1548618029413,"summary":"Anno 1404 is a city-building and economic simulation game with real-time strategy elements. Released in 2009, it was developed by Related Designs, produced by Blue Byte, and published by Ubisoft. Though the game centers on a series of fictional events, the overall concept of the storyline is based upon real life aspects of medieval and renaissance history such as the Crusades, advancements in gothic architecture, construction of cathedrals, and hanseatic trade involving the rise of patrician merchants and early forms of capitalism.","storyline":"The campaign begins when the player is sent to administer a fief granted to him by the Emperor, in the Occident. The Emperor is unwell and Lord Richard Northburgh, cousin and treasurer of the Emperor, is building a magnificent Cathedral to pray for the Emperor's health. Meanwhile, Cardinal Lucius is making preparations for a Crusade against the Saracens of the Orient, aided by Guy Forcas. \n \nIn the first few chapters of the campaign, the player learns the basics of game-play and the economy by assisting Northburgh and Forcas with supply and construction tasks, as well as meeting some of the other main characters. \n \nAs the Crusader ships leave the harbour, Northburgh begins to uncover clues to a mysterious plot. He and the player travel to the Orient and befriend the Grand Vizier of the Sultan, Al Zahir, who helps the player to defeat a band of Corsairs and break up a child trafficking scheme. The plot thickens as further clues reveal that a main character is implicated in a sinister conspiracy to overthrow the Emperor himself. Because he comes too close to the truth, Lord Northburgh is captured and the player is tasked with unravelling the mystery. \n \nOver the next several chapters, the player must win over new allies, convince the leaders of the Crusade that they are being manipulated under false pretenses, and survive dire circumstances in order to defeat the villains and restore the Emperor to his rightful place. \n \nThe campaign is divided into eight chapters and each chapter can be played on 3 different difficulties: easy, medium, and hard. Apart from the story elements, the campaign serves as a tutorial to prepare the player for the more rigorous scenarios and continuous game modes. \n \nAll of the main characters encountered in the campaign are also encountered in the scenarios mode and can be selected as computer opponents in continuous games, although the actions of the characters during the campaign are unrelated to their actions in these modes apart from having similar personalities. Lord Northburgh and Al Zahir act as mentors and trade partners in the other modes, much like they do in the campaign.","collection":158,"rating":80.4820363866813,"popularity":23.33333333333333,"aggregated_rating":72,"aggregated_rating_count":3,"total_rating":76.24101819334065,"total_rating_count":67,"rating_count":64,"games":[20776,80410,5447,2040,28325,2002,303,8395,18425,9789],"tags":[17,22,268435467,268435469,268435471,268435487,536870972,536871304,536871506,536871518,536871561,536871906,536872015,536872060,536872070,536872383,536872544,536872640,536872649,536873822,536874445,536874694,536875067,536875679,536875784,536875910,536876237,536876274,536876281,536876330,536876695,536877079,536877144,536877557,536877679,536878484,536879058,536880294,536882386,1073741827],"developers":[646,647],"publishers":[104],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[60,392,594,606,649,994,1103,1148,1158,1471,1632,1728,1737,2910,3533,3782,4155,4767,4872,4998,5325,5362,5369,5418,5783,6167,6232,6645,6767,7572,8146,9382,11474],"themes":[17,22],"genres":[11,13,15,31],"dlcs":[8227],"first_release_date":1245715200000,"platforms":[6,20,5],"release_dates":[{"category":0,"platform":6,"date":1245715200000,"region":2,"human":"2009-Jun-23","y":2009,"m":6},{"category":0,"platform":20,"date":1245715200000,"region":2,"human":"2009-Jun-23","y":2009,"m":6},{"category":0,"platform":5,"date":1245715200000,"region":2,"human":"2009-Jun-23","y":2009,"m":6},{"category":0,"platform":6,"date":1245888000000,"region":1,"human":"2009-Jun-25","y":2009,"m":6},{"category":0,"platform":20,"date":1245888000000,"region":1,"human":"2009-Jun-25","y":2009,"m":6},{"category":0,"platform":5,"date":1245888000000,"region":1,"human":"2009-Jun-25","y":2009,"m":6}],"alternative_names":[{"name":"Anno 1404","comment":"Other"},{"name":"Anno: Create A New World","comment":"Other"},{"name":"Dawn of Discovery"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bwqsfkclbu2qyaibx5c6.jpg","cloudinary_id":"bwqsfkclbu2qyaibx5c6","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vvpeyj0iyu5fj3b5nql1.jpg","cloudinary_id":"vvpeyj0iyu5fj3b5nql1","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wbmlj9frflkcyufifv9h.jpg","cloudinary_id":"wbmlj9frflkcyufifv9h","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/euyfb0fzxpswc2700klw.jpg","cloudinary_id":"euyfb0fzxpswc2700klw","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/skzl76ty0edmyakbyixa.jpg","cloudinary_id":"skzl76ty0edmyakbyixa","width":1280,"height":720}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lnw6tp2ahdpkvvpk3qae.jpg","cloudinary_id":"lnw6tp2ahdpkvvpk3qae","width":400,"height":571},"esrb":{"synopsis":"This is a strategy game in which players can sail on ships to explore new lands, build settlements and cities, and interact with new cultures. Players have the ability to create military units comprised of knights and battleships and engage in battle against pirate ships and rival armies. Battles are depicted from a bird's eye perspective, as cannonball fire, catapults, and trebuchets (Middle Age siege engines) are used to defeat enemies. During the city building phases, players can construct a gallows platform that has a few red bloodstains on it. Some dialogue contains expletives (e.g., 'damn' and 'hell') and references to suggestive behavior (e.g., '…playing an over-sexed womanizer and braggart didn't bother me a bit'). One character makes a brief joke about smoking hemp at the end of the credits.","rating":5},"pegi":{"rating":2},"websites":[{"category":1,"url":"http:\/\/anno.us.ubi.com\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/33210"}],"external":{"steam":"33210"}}