{"id":7262,"name":"Helldorado","slug":"helldorado","url":"https:\/\/www.igdb.com\/games\/helldorado","created_at":1402007437778,"updated_at":1540834772487,"summary":"Helldorado is a brand-new, standalone 3D-real-time tactics game at highest level. The story leads the six heroes around John Cooper into a dusky precipice of a deadly conspiracy and through completely new and thrilling locations of the Wild West. \n \nClever combo-actions offer the player numerous unimagined tactical possibilities to put the fear of God into the opponents using tricky teamwork. \n \nWith the integrated movie-mode planned actions of the heroes can be recorded Hollywood-like with slow-motion and changing camera views, watched afterwards or even exported and shared with friends. \n \nA mature and clear interface makes tactical planning and quick reactions on the opponents' behaviour easier. With an integrated tutorial mission and with three elaborated difficulty levels players will find their appropriate challenge in the Wild West. \n \nJoin the heroes and lead John Cooper and his five companions in thrilling and diversified missions through their most dangerous adventure. \n \nReal-time strategy and tactics in a hard-edged adventure in the old American Wild West. \nBreathtaking scenarios including the forgotten Rochester’s Jail, a stormy train robbery in a relay station, a bloody sunset in Santa Fe, an ambush in the dark and gruesome Blackwater, and a visit to the beautiful New Orleans \nEnhanced Quick Actions: Unique to Spellbound games, this feature allows players to pre-schedule their heroes’ movements. Helldorado introduces a visual representation of intended actions combined with pause mode, keywords overview and tactical waypoint display \nCombo Actions pair skills from any combination of two heroes for added tactical versatility \nMovie Mode for recording, watching and exporting of your own heroic deeds. Be your own Hollywood director! \nSwitch instantly between freely rotatable and zoomable isometric and 3rd person views to gain the greatest tactical advantage. \nPowerful, effective and fast-paced hero control using an extremely reactive and easy to learn interface \nExciting step-by-step tutorial gets you into the action fast – for beginners and experienced heroes, both. \n3 well-balanced difficulty levels – tailor-made for your basic tenderfoot, average cow puncher, or hard-drivin’ gunslingers. \nMore than one way to play… and more than one way to score your reward. Play it your way… or all ways! \nAvoid unpleasant – and deadly – surprises with Helldorado’s intelligent early warning system. If you’re clever and observant, you’ll survive longer. \n60 different enemies with tactical behavior driven by our advanced AI system. \nUse your enemies’ weaknesses against them. Use alcohol or seduction as weapons in a game of deadly cat and mouse.","storyline":"Santa Fe in the late summer of 1883. Lester Lloyd Goodman is dead and buried, and his railway empire lies in ruins. \n \nCooper enjoys his bittersweet revenge, but only for a short while, because something else is wrong: Doc McCoy has disappeared. He was kidnapped and poisoned. The person behind the disappearance seems to be Goodman’s widow. \n \nShe meets Cooper in a church in Santa Fe, where she makes him a diabolical offer: she will spare Doc’s life if Cooper will carry out a few assignments that will brand him as a criminal. Cooper agrees. \n \nTogether with his friends he sets out to free Doc McCoy. But the more enmeshed they become in the crime, the clearer it becomes that much more is involved than the revenge of a young woman.","collection":986,"rating":50,"popularity":2.666666666666667,"total_rating":50,"total_rating_count":3,"rating_count":3,"games":[9760,28794,32283,103210,76550,55036,79134,107218,53189,27804],"tags":[23,268435471,268435480,536870921,1073741827,1073741825],"developers":[580],"publishers":[2301],"category":0,"player_perspectives":[1,3],"game_modes":[1],"keywords":[9],"themes":[23],"genres":[15,24],"first_release_date":1180051200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1180051200000,"region":8,"human":"2007-May-25","y":2007,"m":5}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nydxvjdt8odyskv1zmkv.jpg","cloudinary_id":"nydxvjdt8odyskv1zmkv","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aznmoyilg9fimse6gnnb.jpg","cloudinary_id":"aznmoyilg9fimse6gnnb","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n9hirpkmrtcjjjqntuhu.jpg","cloudinary_id":"n9hirpkmrtcjjjqntuhu","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gmesg8mjmzc6ytloaiqn.jpg","cloudinary_id":"gmesg8mjmzc6ytloaiqn","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jnfn38d634kxasafjy8o.jpg","cloudinary_id":"jnfn38d634kxasafjy8o","width":1024,"height":768}],"videos":[{"name":"Trailer","video_id":"vbFnFuUxFI0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tqpuowrjb8sy4kygq7dq.jpg","cloudinary_id":"tqpuowrjb8sy4kygq7dq","width":600,"height":856},"websites":[{"category":1,"url":"http:\/\/www.helldorado.spellbound.de\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/18470"}],"external":{"steam":"18470"}}