{"id":72762,"name":"Terrain of Magical Expertise","slug":"terrain-of-magical-expertise","url":"https:\/\/www.igdb.com\/games\/terrain-of-magical-expertise","created_at":1507095231037,"updated_at":1507095318664,"summary":"\"A turn-based RPG about a turn-based RPG! Play as the mysterious \"White-Hat Hacker\" and help your fellow players achieve victory against a group of filthy cheaters! Based on the \"Terrain of Magical Expertise\" webseries by Chris Niosi!\"","storyline":"\"You assume the role of a young White-Hat Hacker (a hacker who uses their abilities for good), gifted a copy of the latest and greatest Massively Multiplayer Online game: TOME! But it's not just for simply playing around. At the time of your first login, an event titled \"The Campaign of Champions\" is underway, which pits the game's many guilds of rival players against each other in four weekly competitions...with major prize money as the stakes! However, an assortment of underhanded Black-Hat Hackers (hackers who uses their abilities for...not-so-good) seek to win each of the four weekly events by way of cheating right under the moderators' noses! \n \nAs a favor to a close (and mysterious) friend, you create an inconspicuous account and log in to the world of TOME to stomp out the filthy cheaters and level the playing field for all competing players in the Campaign of Champions. However...before you know it, you become involved with one such guild hoping to win it big. Thus, the story begins...\"","popularity":1.333333333333333,"tags":[1073741827],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[426,2399,2586],"themes":[17,18],"genres":[12],"platforms":[6,14],"release_dates":[{"category":7,"platform":14,"region":8,"human":"TBD"},{"category":7,"platform":6,"region":8,"human":"TBD"}],"alternative_names":[{"name":"TOME","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nvx8z8o0lzoi6sbyzcdm.jpg","cloudinary_id":"nvx8z8o0lzoi6sbyzcdm","width":1279,"height":721},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sq1n6hx1n4nkiwtqb9hz.jpg","cloudinary_id":"sq1n6hx1n4nkiwtqb9hz","width":1279,"height":720}],"videos":[{"name":"Trailer","video_id":"Tl49seYbgVc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qkcinc1tpnotrgmyqmbb.jpg","cloudinary_id":"qkcinc1tpnotrgmyqmbb","width":1024,"height":576}}