{"id":12590,"name":"Floor 13","slug":"floor-13","url":"https:\/\/www.igdb.com\/games\/floor-13","created_at":1442390738384,"updated_at":1515577296681,"summary":"Somewhere in London is a secret organization that is based on the 13th floor of an office building. The sole purpose for this organization’s existence is to keep the current British government in power at any cost - specifically, that means helping the current Prime Minister keep ahead of his competition in the polls.\n\nFloor 13 is a management simulation controlled by a menu-based system (similar to Darklands) and is presented in black and white for a film noir feel. Players take the role of the Director General in this secret organization, and are given a target date of 20 days to attend to their duties. During this period, performance will be evaluated based on the Prime Minister's polling results. If the PM is doing well, the agency will be expanded and will have more equipment and services available to handle the situations it will encounter later in the game. If the PM is behind, Floor 13 risks reduction in the number of services it has available or even the player's continued employment. After each successful 20 day period, another 20 days are added to the calendar, full of new problems and objectives.\n\nDuring the time between target dates, players will have to deal with various problems, both externally and internally. Some examples include: saving the son of the U.S. President from terrorists, breaking up a drug ring controlled by a VIP recently honored by the Queen, or even prevent a scientist in the British space agency from publicly stating that their latest achievement has been a total sham (shades of the film \"Capricorn One\"). While you are completing these tasks there is another secret society that will pressure you to have its goals completed, and this may very well interfere with the missions officially assigned to Floor 13.\n\nThe Floor 13 organization is not a benevolent one and players will need to do some rather unpleasant things to ensure that the democratic machine runs smoothly. Examples of activities include: searching and looting people’s homes, calling in commando units for heavy assault purposes, wire-tapping and trailing people without bothering to go through legal channels, discrediting notable people through the media and infiltrating established organizations. At times, you might even need to detain citizens and torture them (the torture bits can get rather graphic at times, though it's doled out through a text report), or even assassinate troublesome proles (one of the few political policy games, along with Shadow President and CyberJudas, to allow for such an activity). However if players become too eager at performing these \"black hat\" activities, they may draw too much attention to the agency and may summon the attention of a certain \"Mr. Garcia\" (who is good at helping noisy Director Generals fly through office windows).","popularity":1.333333333333333,"games":[19301,19934,9789,29173,23212,55590,11582,18623,25311,19847],"tags":[18,20,268435469,268435471,536871126,536871133,536871882,536872060,536872114,536872131,536872451,536872581,536872691,536873308,536873652,536874694,536875252,536875547,536876219,536876385,536877147,536877451,536877726,536878029,536884825,1073741825],"publishers":[141],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[214,221,970,1148,1202,1219,1539,1669,1779,2396,2740,3782,4340,4635,5307,5473,6235,6539,6814,7117,13913],"themes":[18,20],"genres":[13,15],"first_release_date":694137600000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":2,"platform":13,"date":694137600000,"human":"1991","y":1991,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kke7m4hhqlkizfodhg8e.jpg","cloudinary_id":"kke7m4hhqlkizfodhg8e","width":640,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jd5bgx5inpwpuovfepqf.jpg","cloudinary_id":"jd5bgx5inpwpuovfepqf","width":640,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/csp2fk0hjbjef6e237or.jpg","cloudinary_id":"csp2fk0hjbjef6e237or","width":640,"height":512}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/figk1uwjdgeffl4kiiio.jpg","cloudinary_id":"figk1uwjdgeffl4kiiio","width":640,"height":792}}