{"id":23690,"name":"No Place For Bravery","slug":"no-place-for-bravery","url":"https:\/\/www.igdb.com\/games\/no-place-for-bravery","created_at":1473195882560,"updated_at":1531926663394,"summary":"\"No Place for Bravery is an atmospheric minimalist roguelike where you play as a group of adventurers wandering through an eerie, devastated high fantasy world on a quest to slay the godlike entities that brought down humankind. \n \nIt is basically an action RPG with super neat, Hyper Light Drifter inspired pixel art, minimalist controls, procedurally generated maps and a time manipulation mechanic similar to Super Time Force's that lets the player control more than one character simultaneously by playing with one character and then rewinding time and playing with another character alongside the first one: not only the player has to plan every move, he also has to synchronize everything. \n \nBravery is, like many other roguelikes, filled with unique random events. The idea is to use these events to craft the game’s mythology. The game doesn't use regular exposition to tell it's story, rather, the player will absorb the nuances of Bravery’s narrative by exploring its gorgeous environment, experiencing the aesthetics of its mechanics or by simply making sense of the vast array of mysterious random events. \n \nAlso, the game gets rid of all the grinding: Skinner Box mechanics and ''artificial'' stats-based progression have no place here: I'm talking about a game with absolutely no numbers and very, very few written words. \n \nNo Place for Bravery is an extremely hard and completely skill and strategy based game. The world is to be relentless, and the player feels the mediocrity before such a world in each step that is taken.\"","hypes":2,"popularity":12.66666666666667,"games":[80916,28070,47823,81249,25311,106987,26163,55038,29032,37419],"tags":[1,17,268435468,268435487,268435488,536871197,536871489,536871490,536871717,536871738,536872341,536872609,536872617,536872879,1073741827],"developers":[10865],"publishers":[10865],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[285,577,578,805,826,1429,1697,1705,1967],"themes":[1,17],"genres":[12,31,32],"first_release_date":1546214400000,"platforms":[6,14],"release_dates":[{"category":2,"platform":6,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12},{"category":2,"platform":14,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12}],"videos":[{"name":"Trailer","video_id":"nuw66XndfOk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kmipjooigpu8zapgtyai.jpg","cloudinary_id":"kmipjooigpu8zapgtyai","width":1200,"height":675},"websites":[{"category":1,"url":"http:\/\/noplaceforbravery.com\/"},{"category":5,"url":"https:\/\/twitter.com\/BraveryGame"},{"category":4,"url":"https:\/\/www.facebook.com\/braverygame\/"}]}