{"id":8290,"name":"Heavy Metal: F.A.K.K.²","slug":"heavy-metal-f-dot-a-k-dot-k-2","url":"https:\/\/www.igdb.com\/games\/heavy-metal-f-dot-a-k-dot-k-2","created_at":1418297302206,"updated_at":1544871850323,"summary":"Heavy Metal: F.A.K.K.² is a third-person shooter video game made by Ritual Entertainment in 2000. A sequel to the Heavy Metal 2000 animated movie, the game stars Julie in her quest to save her home planet of Eden from GITH, an ancient entity seeking to conquer the universe. Using a variety of weapons, Julie must now fight off GITH's forces while at the same time uncovering a secret hidden deep within the planet.","storyline":"F.A.K.K.² stands for Federation-Assigned Ketogenic Killzone to the second level, and is the alias both of the heroine, Julie, and also her homeworld. Before the game begins, we are told that Julie has previously killed a tyrant and \"would-be God\" named Lord Tyler (during the events of Heavy Metal 2000), and brought the remnant of her people to a planet called Eden. The people of Eden have made a startling discovery: the waters of the planet grant an eternal life to those who drink it, and they have restored ti-rural paradise, pasturing 'creepers' (large bull-like creatures) and peacefully going about their business. \n \nThis planet is camouflaged by a FAKK2 beacon and made to look like a biohazard-strewn wasteland in the hope that it will remain hidden from any threat. However, a creature named Gith, who appears only as a disembodied cybernetic head, runs a hyper-corporation called Gith Industries whose \"employees\" are little more than slaves. He scavenges the universe in a ship composed of three-quarters of a planet, and is headed for a place called Na'ChThraThull, or the \"place of the soft machines\", which turns out to be Eden. \n \nThen a series of explosive asteroids take the planet's shield down, and a number of nasties (actually, Gith's employees) invade the planet. These include huge mosquitoes and their source, a large queen called the Vymish Mama, skinless bearlike Grawlix, plants that shoot poison darts, huge flesh-eating plants, Gith's cybernetic Fleshbinders and Soul Harvesters. Julie, with the help of gunsmith Otto and other citizens, crawls through besieged Eden to reset the shield, in vain as it turns out, then journeys through the swamps to find a character called Gruff, who unlocks the path to the Temple of the We for her. She then overcomes the four challenges of the We before entering the final temple where the Heart of the We is kept. However, Gith is waiting for her, and he steals the Heart and uses it to bring Lord Tyler back to life, so he could have his revenge on Julie. However, Julie fights and kills Lord Tyler and wins the Heart, banishing Gith. She returns to town only to find out that her pregnant sister is kidnapped by Gith, who returns in a giant space station, thus leaving room for a sequel and\/or suggesting future action.","rating":80.080249987506,"popularity":1.333333333333333,"aggregated_rating":70,"aggregated_rating_count":1,"total_rating":75.040124993753,"total_rating_count":10,"rating_count":9,"games":[55038,36950,24426,62151,68441,68287,55092,25300,28168,22387],"tags":[1,17,18,268435461,268435465,268435487,536870958,536870991,536871139,536871208,536871874,536871882,536871937,536871938,536872070,536873066,536873787,536874182,536875057,536875178,536875271,536875331,536875437,536875484,536875572,536875728,536876199,536876706,536876816,536877628,536879042,536882381,536883629,536884031,1073741826],"developers":[149],"publishers":[204],"game_engines":[56],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[46,79,227,296,962,970,1025,1026,1158,2154,2875,3270,4145,4266,4359,4419,4525,4572,4660,4816,5287,5794,5904,6716,8130,11469,12717,13119],"themes":[1,17,18],"genres":[5,9,31],"first_release_date":965347200000,"platforms":[6,14,3],"release_dates":[{"category":0,"platform":6,"date":965347200000,"region":8,"human":"2000-Aug-04","y":2000,"m":8},{"category":0,"platform":14,"date":965347200000,"region":8,"human":"2000-Aug-04","y":2000,"m":8},{"category":0,"platform":3,"date":1005696000000,"region":8,"human":"2001-Nov-14","y":2001,"m":11}],"alternative_names":[{"name":"Heavy Metal: FAKK 2"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvctikqlgbisptcyu38u.jpg","cloudinary_id":"yvctikqlgbisptcyu38u","width":620,"height":496},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bebumwvh0ox7mosfnbeb.jpg","cloudinary_id":"bebumwvh0ox7mosfnbeb","width":620,"height":496},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lwhjvmafdnhegjyjb84c.jpg","cloudinary_id":"lwhjvmafdnhegjyjb84c","width":620,"height":496},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tgkxldcezheqe3phx0u8.jpg","cloudinary_id":"tgkxldcezheqe3phx0u8","width":620,"height":496}],"videos":[{"name":"Trailer","video_id":"yEe7T7MK6Q4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kizwh8plza1sq4kpnavx.jpg","cloudinary_id":"kizwh8plza1sq4kpnavx","width":471,"height":600},"esrb":{"rating":6},"websites":[{"category":1,"url":"http:\/\/www.ritualistic.com\/"}]}