{"id":86690,"name":"Ultimate Savanna Simulator","slug":"ultimate-savanna-simulator","url":"https:\/\/www.igdb.com\/games\/ultimate-savanna-simulator","created_at":1518600719717,"updated_at":1518701430090,"summary":"Dash into a brand new adventure as a lightning fast Cheetah, enormous Elephant, or a deadly Crocodile! For the first time ever, choose from TEN PLAYABLE ANIMALS! Hunt down food on the grassy plains, raise your family, and unlock exciting new playable animals as you experience life in the African savanna!\n\nDownload the Ultimate Savanna Simulator today while it's 50% OFF for a very limited time!\n\nBrand New Features\nREALISTIC SIMULATOR\nYou'll need to maintain your health, hunger, thirst, and energy while ruling over the African plains!\n\nTEN PLAYABLE ANIMALS\nChoose from your favorite species of african animals in a single game! Become a Cheetah, Hyena, Gazelle, Rhinoceros, Zebra, Elephant, Hippopotamus, Crocodile, Vulture, and a Warthog! Each species has their own families, experience, and levels!\n\nDANGEROUS BOSS BATTLES\nTest your skills against SIX thrilling boss battles! A massive tiger rules over the jungle oasis! A legendary animal awaits you in the sun soaked plains and will push your skills to their limits!\n\nBUILD YOUR FAMILY\nDominate other animals or bring them a treat to recruit them to your family! Customize and play as any animal in your pack and create a powerful family!\n\nRAISE YOUR BABIES\nBreed babies that will grow into powerful members of your family! Care for you babies while they are are young, finding food for them and carrying them in your mouth!\n\nCUSTOMIZE YOUR ANIMAL\nChoose your animal’s name, appearance, skills, and attributes to complement your pack members and become a more powerful group!\n\nLEVEL UP YOUR ANIMAL\nGain experience by catching and eating your prey, caring for your family, and completing missions! Level up your animal to increase their health and attack damage, earn points to upgrade your stats, and increase the size of your pack!\n\nEARN STAT POINTS\nStat Points can be used to provide bonus’s to traits like Health, Critical Attack Chance, Run Speed, and much more! \n\nUPGRADEABLE BUFFS\nBuff Points can be used to upgrade your Snarl and Roar Buffs, which create temporary Stat Boosting auras around your animal when active! \n\nRAGDOLL PHYSICS\nYour prey now realistically dangles from your jaws as you carry them!\n\nDYNAMIC WEATHER, SEASONS AND DAY\/NIGHT CYCLE\nProcedural weather system with unique storms, clouds, sun, and stars! And the BRAND NEW changing seasons!\n\nMASSIVE REALISTIC 3D ENVIRONMENT\nExplore a world so big we created TWELVE unique dens for your animals to live in! Explore grassy plains, a dense jungle oasis, an arid sandy dunes of the desert!\n\nDOZENS OF ENEMIES\nHunt down animals like hyena, gazelle, impala, elephant, rhinoceros, snake, fish, flamingo, stork, crocodile, african dog, rabbit, water buffalo, wildebeest, warthog, tiger, giraffe, cheetah, lion, vulture, hippo and many more!\n\nOPTIONAL BLOOD EFFECTS\nIf you are of age or have your parents permission, turn on the BRAND NEW blood effects for added combat ferocity!\n\nGLUTEN-FREE PROMISE\nWith all of our games you will always get the full game with no ads or additional purchases!\n\nDownload the Ultimate Savanna Simulator to transport yourself to the a wild African world filled with hidden dangers and live the life of your favorite wild animal!\n\nIf you liked living as on the Savanna then you'll love our other animal simulators! Find your favorite animal and live their life in the wild!\n\nGive us a shout and let us know what you want to play next!\nfacebook.com\/glutenfreegames\ntwitter.com\/glutenfreegames","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[75102,49414,25636,74378,25311,26145,44242,75398,36608,28465],"tags":[268435468,268435469],"category":0,"genres":[12,13],"first_release_date":1475452800000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1475452800000,"region":8,"human":"2016-Oct-03","y":2016,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wf4dhqrkpvkybbkjndiv.jpg","cloudinary_id":"wf4dhqrkpvkybbkjndiv","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mury254ph7plqbaz1wxy.jpg","cloudinary_id":"mury254ph7plqbaz1wxy","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bnqpny0omrfhiqakzyx4.jpg","cloudinary_id":"bnqpny0omrfhiqakzyx4","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gabd59z5x9ciiljgqzgv.jpg","cloudinary_id":"gabd59z5x9ciiljgqzgv","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xekjlq5o0xylhnyavqfs.jpg","cloudinary_id":"xekjlq5o0xylhnyavqfs","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lo40tictumkqxakwamzj.jpg","cloudinary_id":"lo40tictumkqxakwamzj","width":512,"height":512}}