{"id":87890,"name":"Slingo Supreme HD","slug":"slingo-supreme-hd","url":"https:\/\/www.igdb.com\/games\/slingo-supreme-hd","created_at":1519226376998,"updated_at":1523240674899,"summary":"Slingo is the addictive and fun combination of SLOTS and BINGO!\n\nWith Slingo Supreme, we really wanted to pull out all the stops and make the ultimate Slingo game that would be a flagship product for all the Slingo fans. Slingo Supreme is the game that we've always wanted to play on our iPads, it is the most polished, full-featured Slingo game ever.\n\nThe heart of this fun new Slingo game is the innovative Supreme mode.\n\nIn Supreme, as you play, you will unlock powerups. These powerups will then let you build your own custom Slingo game! Unlock more powerups, and build even more types of Slingo games. Each combination makes a totally new play experience. And get this, with 12 types of powerups, you can combine them each in different ways to create over 16,000 ways to play!!! Can you create your own favorite game to give you that top score? \n\nBut we just didn't stop there. We've always heard from fans about features they wanted. And in Slingo Supreme, we are delivering them.\n\nHate the Devil? Is this game, instead of just taking half your points, you now finally get to beat him at his own game. Slingo Supreme contains the New Devil Mini Games that let you get back at the devil.\n\nBummed out when you don't get a match? Now you can enable Reel Nudge which will give you another chance to make a match by knocking the reels when no match exists. Nothing like banging the machine to demand a match!\n\nWant a new challenge every day? Now, the game will create a custom challenge for you each day. And check this out, it does it dynamically so you will never run out of daily challenges.\n\nSo get ready to play Slingo Supreme, and get ready to unlock new powerups, conquer daily challenges and build your own top scoring Slingo game!\n\nSlingo Supreme is truly a SUPREME casual game and is just PERFECT for your iPad!\n\n***** Discover more Fun from Funkitron! *****\n\nAt Funkitron, we design and create top quality casual games that provide fun and relaxation for our fans . Founded in 2001, Funkitron, Inc is a developer, publisher and distributor of casual games. Find even more fun at www.funkitron.com.\n\nWe have many other great games including: \n\n- Solitaire Kingdom Supreme\n- Solitaire Kingdom Supreme HD for iPad\n- Slingo Supreme\n- Slingo Supreme HD for iPad\n\nYou can always find an updated list at www.funkitron.com\n\nFollow us on Twitter: https:\/\/twitter.com\/#!\/funkitron\n\nBecome a fan on Facebook: http:\/\/www.facebook.com\/funkitron","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[19222,41348,10225,27266,86955,236,27725,60044,25222,25646],"tags":[268435465,536871523],"category":0,"keywords":[611],"genres":[9],"first_release_date":1292716800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1292716800000,"region":8,"human":"2010-Dec-19","y":2010,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j8vr2qbuzgz9zmoc5kyc.jpg","cloudinary_id":"j8vr2qbuzgz9zmoc5kyc","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/adhllujimwzq6ljplata.jpg","cloudinary_id":"adhllujimwzq6ljplata","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l7whtjua7hd8adag5kg6.jpg","cloudinary_id":"l7whtjua7hd8adag5kg6","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bv3blhbgrbik2zsvelhm.jpg","cloudinary_id":"bv3blhbgrbik2zsvelhm","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kthoztt8q3wchefkd96k.jpg","cloudinary_id":"kthoztt8q3wchefkd96k","width":552,"height":414}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qzjn3c5pvgktsc7doznw.jpg","cloudinary_id":"qzjn3c5pvgktsc7doznw","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/slingo-supreme-hd\/id409890132?mt=8&uo=4"}]}