{"id":88190,"name":"Bloons TD 4 HD","slug":"bloons-td-4-hd","url":"https:\/\/www.igdb.com\/games\/bloons-td-4-hd","created_at":1519233142495,"updated_at":1523427745401,"summary":"Update News: new winter track & challenges, celebrating the release of Bloons TD 5 on iPad!\n\nWe are committed to bringing you the very best updates over the coming weeks so stay tuned.\n\nUpdate history :\n\n2.8 - Added 2 new Challenges.\n2.7 - Added 2 new Challenges.\n2.6 - Added Retina display for new iPad.\n2.5 - Added Beehive Map, Extreme Challenges and new Mystery Tower.\n2.4 - Added 2 new Challenges.\n2.3 - Added 2 new Challenges.\n2.2 - Added Monkey Heart Map, 2 new Challenges and Jolly Roger Extreme Map.\n2.1 - Added new tower Spike Factory.\n2.0 - Added 2 Holiday themed Maps, 2 new Challenges, Holiday Towers and Double XP.\n1.9 - Added Challenges with Unique Gameplay\n1.8 - Added Trick or Treat Map and Spooky Surprise Towers.\n1.7 - Added Firecracker Map, Blue Laser Challenge and Extreme Maps IAP.\n1.6 - Added Brand New Challenge Mode.\n1.5 - Added Sweet Tooth Map.\n1.4 - Added new tower Dartling Gun.\n1.3 - Added DNA Test Map\n1.2 - Added Deflation Mode and IAP for Premium Upgrades\n1.1 - Added Apopalypse Mode and Spring themed Daisy Chain track.\n\nBloons TD 4 finally receives the HD treatment and Bigger is definitely Better!\n\nFeaturing a brand new HUD layout designed to take full advantage of the larger screen space, the Bloons TD experience just got better. All towers, upgrades and important information are now always at hand just where you need them. Combine this with gorgeous, crisp HD graphics and Bloons TD 4 HD may just be the definitive version!\n\nThis time the monkeys are serious and are ready to take down the enemy from the land, air and sea. Utilising a new ranking system you can build up your experience and gain access to even more powerful towers and upgrades. Call in mortar strikes, deploy the monkey aces and harness the power of banana farms as you bid to take down the enemy in true bloon popping fashion. \n\nBloons TD 4 HD features a mix of classic tracks from the online game as well as a whole host of new tracks for you to master. The medal ranking system is also back to add a new level of difficulty to the challenge. Can you battle through all 75 rounds to earn the gold medal? \n\nOf course, even if you do, the fun doesn't stop there and you can continue the madness in freeplay mode. Discover how many rounds can you survive before the enemy overpowers you then challenge your friends to beat your score using Game Centre high scores. \n\nBloons TD 4 HD combines all of this with Game Centre achievements and there is even some special bonuses which you can discover and unlock by mastering the tracks!\n\nFeatures:-\n\n* All new HUD layout designed for the larger touch screen, now all of your towers and upgrades are easily accessible and important information is always at hand.\n\n*Crisp, vibrant HD graphics, perfectly suited to the iPad.\n\n*25 different tracks + 5 Extreme Tracks (available through IAP).\n\n*3 difficulty settings on each map, Easy, Medium and Hard for varying degrees of challenge. \n\n* Challenge Mode and all new Extreme Challenges.\n\n*Continue the popping frenzy in freeplay mode once you master a track.\n\n*Game Centre high score tables and achievements. \n\n* Special bonus unlocks.\n\n* Now includes Apopalypse and Deflation modes.","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[11362,9760,33603,36962,55888,73075,65827,2015,32283,75065],"tags":[268435471,268435489],"category":0,"genres":[15,33],"first_release_date":1301616000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1301616000000,"region":8,"human":"2011-Apr-01","y":2011,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oasyjzgudtvwyefvi3ob.jpg","cloudinary_id":"oasyjzgudtvwyefvi3ob","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eelnzoh4xpscq73lm6oa.jpg","cloudinary_id":"eelnzoh4xpscq73lm6oa","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dygiltzaqblgkeivbvbp.jpg","cloudinary_id":"dygiltzaqblgkeivbvbp","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m3utffwirrtabyydoctj.jpg","cloudinary_id":"m3utffwirrtabyydoctj","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zl8q83fyuexwojufv2lm.jpg","cloudinary_id":"zl8q83fyuexwojufv2lm","width":552,"height":414}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hzxdx2vq8jfmkuht7n30.jpg","cloudinary_id":"hzxdx2vq8jfmkuht7n30","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/bloons-td-4-hd\/id426415634?mt=8&uo=4"}]}