{"id":112427,"name":"War Clicks","slug":"war-clicks","url":"https:\/\/www.igdb.com\/games\/war-clicks","created_at":1542719778017,"updated_at":1542882074087,"summary":"Description \nGet under the wing of General MasterClicker in this unique idle\/clicking game mashup! Train, upgrade and manage your army to prepare for waging endless battles in the War Zone. Focus on becoming the most renowned Warlord and provider of arms or chase glory on the battlefield as you climb military ranks! \n \nThe game starts off in Boot Camp where you focus on building a powerful army. Unlock new units, upgrade their production, deploy units off to battle in exchange for attracting dirty army contractors that will super-size your production! Best of all, you can amass trainers that will do all the work for you, even while you're away. \n \nAnd once you're ready, head off to the War Zone where you will fight battles for glory... and loot! All that precious gold you can gather via various activities and completing missions, will provide you that extra boost to your Boot Camp production as well as improve the strength of your army. \n \nBut to really stand out from rest of the competition, you will have to collaborate with your countrymen in invasions where you destroy enemy bases to get massive war spoils! If you are focused on chasing that glory as a hero or care more about your renown in the world, there's plenty of options that are presented to you during the game to differentiate from others and focus on your priorities! \n \nControls \nEverything is controlled via mouse\/tap (it is playable on mobile, though NOT optimized for it). \nThere's a tutorial guiding your through ins and outs of the game so just get in there and you'll know what to do! :)","storyline":"KEY FEATURES \n \n-> You’re managing the army \n \n-You’re starting as a manager of the Boot Camp \n-Produce many army units and don’t forget to hire Trainers\/ Investors as there is no way you can do everything on your own \n-Your managerial decisions boost your Boot Camp powers \n-Reach for Renown titles while becoming an experienced soldier \n-Once you've built enough army units you can Deploy them to War Zone \n-Use long-lasting boosts and start from scratch with way-faster progression \n \n \n-> Test your pre-built powers on the battlefield \n \n-Test different strategies while attacking the enemies \n-Fight Invasions, fight single mode or fight together with your countrymen for common country goals \n-Reach for the highest Rank titles and collect badges the army rewards you with \n \n-> Compete with other soldiers around the globe \n \n-Massively competitive game if you decide so (play for purposes of single mode, or check your rankings on the global rankings with other army enthusiasts) \n-Competitions based not only on your single playing, but also on the fields of Country fighting\/powers \n \n-> Strategy matters \n \n-Discover various options and features that affect how your progress in War Zone and Boot Camp intertwines \n-Choose when you might want to sacrifice your progress to gain huge long-lasting boosts that snowball your power \n-Various mini-games and tasks you can complete to become stronger \n-There is no limit when it comes to how powerful you can become! \n \n-> Social elements for more fun \n \n-Say hello to your countrymen or other players inside the in-game chat \n-Chat to get more details on a specific feature, chat on strategies, common country goals, voting types, country upgrades,… \n \n-> Idle Clicker mechanics \n-Trainers are working also while you are offline \n-Time management game mechanics let you grow your Boot Camp quickly or steadily \nover time \n \n-> Controls \n-Everything is controlled via mouse\/tap (it is playable on mobile, though NOT optimized \nfor it) \n-Hint: Use Hotkeys on Keyboards to control your fighting via faster way \n-Follow other in-game instruction or ask other players for help inside the in-game chat","popularity":1.333333333333333,"games":[29173,31515,55590,32283,78550,55689,11814,35371,17111,25311],"tags":[28,39,268435469,268435471,268435488,536870972,536871106,536871166,536871198,536871291,536871305,536871475,536871906,536872019,536872041,536872205,536872413,536872414,536872654,536872742,536872890,536872984,536873297,536873442,536873554,536873758,536874294,536875312,536875356,536876026,536877064,536879634,536887915,536889135,536889439,536889551,536894276,1073741829],"developers":[16959],"publishers":[16959],"category":0,"player_perspectives":[5],"game_modes":[1,3],"keywords":[60,194,254,286,379,393,563,994,1107,1129,1293,1501,1502,1742,1830,1978,2072,2385,2530,2642,2846,3382,4400,4444,5114,6152,8722,17003,18223,18527,18639,23364],"themes":[28,39],"genres":[13,15,32],"first_release_date":1458086400000,"status":4,"platforms":[6,14],"release_dates":[{"category":0,"platform":14,"date":1458086400000,"region":8,"human":"2016-Mar-16","y":2016,"m":3},{"category":0,"platform":6,"date":1458086400000,"region":8,"human":"2016-Mar-16","y":2016,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5q90.jpg","cloudinary_id":"sc5q90","width":1000,"height":550},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5q8z.jpg","cloudinary_id":"sc5q8z","width":1000,"height":550},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5q8y.jpg","cloudinary_id":"sc5q8y","width":1000,"height":550},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5q8x.jpg","cloudinary_id":"sc5q8x","width":1000,"height":550},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5q8w.jpg","cloudinary_id":"sc5q8w","width":1000,"height":550}],"videos":[{"name":"Trailer","video_id":"eGa9U7vZJFI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1hof.jpg","cloudinary_id":"co1hof","width":162,"height":100},"websites":[{"category":14,"url":"https:\/\/warclicks.page.link\/UK94"},{"category":5,"url":"https:\/\/warclicks.page.link\/yPz9"},{"category":4,"url":"https:\/\/warclicks.page.link\/L8ha"},{"category":1,"url":"https:\/\/warclicks.page.link\/fdga"},{"category":2,"url":"https:\/\/incremental.wikia.com\/wiki\/Warclicks"}],"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":true,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}