{"id":18427,"name":"Stellar Track","slug":"stellar-track","url":"https:\/\/www.igdb.com\/games\/stellar-track","created_at":1458304250962,"updated_at":1515700663820,"summary":"Stellar Track is a text- and turn-based strategy game where the player controls a Terran Super Warship that must clear out alien ships from all quadrants of a galaxy. It was a conversion of a college mainframe Star Trek game released by Sears in 1981. It is a suitably primitive game where you have to run scans to locate enemies and starbases on a 6 x 6 galactic map. You run scans to find the enemies then must warp to their quadrant to confront them with either phasers or photon torpedoes. You use the joystick to determine the numerals of where you intend you to travel to.","storyline":"The Terran race, even though they have high standards in art, philosophy, and science, is lacking hyperwarp drive technology, which would allow them to travel to other planets. The Terrans became discovered by extraterrestrial life, who allowed a trade of their hyperwarp technology for Terran art and science. \n \nTension between the aliens and Terrans begin as the two races started competing over riches, so the Terran government built an indestructible Starfleet and two Galactic Starbases to keep the aliens at bay, recruiting a commander for their Super Warship to destroy the aliens.","popularity":1.333333333333333,"games":[29173,25311,55590,19301,18623,19290,19934,26145,22425,76731],"tags":[18,268435461,268435469,268435471,268435472,268435487,536872060,536874694,1073741826,1073741829],"developers":[2406],"publishers":[2519],"category":0,"player_perspectives":[2,5],"game_modes":[1],"keywords":[1148,3782],"themes":[18],"genres":[5,13,15,16,31],"first_release_date":378604800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":378604800000,"region":2,"human":"1981","y":1981,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pjxnkbvu6pcetswzpou3.jpg","cloudinary_id":"pjxnkbvu6pcetswzpou3","width":600,"height":843}}