{"id":27727,"name":"PatientZ: Survivalist","slug":"patientz-survivalist","url":"https:\/\/www.igdb.com\/games\/patientz-survivalist","created_at":1489143061820,"updated_at":1517270788366,"summary":"PatientZ: Survivalist is a Post-Apocalyptic game. The game is going to be a single player\/co-op and multiplayer game.. \n \nVehicles \nQuad Bikes, Bicycles, Skateboards, Cars and Para gliders take advantage of quick transport to ground from mountains \n \nCrafting \nA basic crafting system is implemented allowing you to create weapon variations or items to aid you in your adventure. \n \nDynamic Item Spawns \nWeapons and items will usually be found in logical places, but can also be found anywhere in the world. Be sure to check everywhere for items – lockers, stoves, cupboards, and many more. Some appliances can be opened to look inside. \n \nPersistent Characters \nYour character’s stats and items will be saved when you exit the game. When you log back in, you will have your health, items and location all restored. \n \nComprehensive Inventory System \nStore items on your character and collect weapons, ammo and other useful items. You can also find additional items to increase the amount of storage space your character has – like backpacks, shirts, and pants. \n \nFood and Water Systems \nKeep your hunger and water levels up in order for your character to function at maximum efficiency. Low levels of food and hunger have a negative impact on your character’s performance. \n \nLoot \nWhen you die all of the items you were carrying stay with your character’s corpse. Other player’s can take them, or you can retrieve them yourself if they are still there when you get back to the place you died. \n \nFree-for-all PVP \nKill anyone at anytime and steal their loot. There are no safe zones. However, it will be very beneficial in the long run to make a few friends. Use your surroundings for advantages. \n \nFull Day\/Night Cycles \nCharge in during the day or wait until night time for a sneaky approach. \n \nFirst and Third Person Camera Views \nSwitch views based on personal preference. \n \nWe really hope you can give us a shot at making our game a reality. We are working very hard to produce something that could possibly be the reason for the reputation of the survival genre to be better. \n \nWe understand the reputation of the survival genre and we hope you don't down us. We understand that you hate most early access games however this is different. We are taking time and ensuring that most bugs and glitches are fixed before release to steam. We are going to be doing Closed Betas for the time being so that people who are our fans can test it and try with friends. \n \nWe don't believe in P2W (Pay to win) games and we definitely won't bring out DLC like other games have even thought they haven't finished their game yet. Which we know is wrong. Another thing we are not is money grabbers, when we do start gathering funds we will be hosting events with it, improving the game for you. And most importantly providing a better experience for our users. \nFacebook","popularity":1.333333333333333,"games":[26192,44076,25646,29525,18167,6036,25300,7329,13189,37016],"tags":[1,19,21,23,38,268435461,268435471,268435487,268435488,536870981,536871365,536872032,536874401,536874402,536874403,536874404,536874405,536874406,536874694,1073741826,1073741825],"game_engines":[439],"category":0,"player_perspectives":[1,2],"game_modes":[1,2,3,4],"keywords":[69,453,1120,3489,3490,3491,3492,3493,3494,3782],"themes":[1,19,21,23,38],"genres":[5,15,31,32],"first_release_date":1489104000000,"platforms":[92],"release_dates":[{"category":0,"platform":92,"date":1489104000000,"region":8,"human":"2017-Mar-10","y":2017,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l4got81cog4scu7c6m0s.jpg","cloudinary_id":"l4got81cog4scu7c6m0s","width":2048,"height":1120},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xeg3isjrrtk4lh1iwnuq.jpg","cloudinary_id":"xeg3isjrrtk4lh1iwnuq","width":1911,"height":989}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sspaqjzgzc8rtco9axgd.jpg","cloudinary_id":"sspaqjzgzc8rtco9axgd","width":800,"height":800},"esrb":{"rating":6}}