{"id":39527,"name":"Die Hard Arcade","slug":"die-hard-arcade","url":"https:\/\/www.igdb.com\/games\/die-hard-arcade","created_at":1498129788950,"updated_at":1529435484882,"summary":"Die Hard Arcade is a beat 'em up for two players, who play as either John McClane or Chris Tompsen (Bruno Delinger and Cindy Holiday in the original Japanese version). Players fight their way through waves of enemies, using their fists, feet, and a variety of weapons that can be collected from enemies or the environment, from household items such as brooms and pepper shakers to high-damage missile launchers and anti-tank cannons. Most weapons are automatically lost at the end of each action scene, but hand guns can be retained so long as they have ammunition remaining. The typical level structure is a number of minions the player must defeat in many rooms, followed by a boss. Bosses can be anything from human minions of White Fang to spider robots. Quick Time Events are interspersed between many of the scenes. In these events, the player(s) may be running and turning a corner and they face an enemy, so they must perform a designated command to avoid being injured or to help defeat an enemy. In some cases failing a Quick Time Event will result in loss of health, as is usual for QTEs, but failing most will put the player characters into an additional action scene which they otherwise would not have to complete. Cut scenes are interspersed into the action.","collection":4076,"popularity":1.333333333333333,"games":[10039,103020,18088,103281,68287,36832,76888,103298,76253,2413],"tags":[1,268435460,268435461,268435481,536870973,536871213,536871470,536871889,536871894,536871937,536872010,536872581,536874743,536875054,536875216,536875219,536875271,536875358,536875418,536875420,536875731,536876184,536876208,536876273,536876458,536876694,536876823,536876901,536876990,536877325,536878192,536878199,536881997,536883126,536886583],"category":0,"keywords":[61,301,558,977,982,1025,1098,1669,3831,4142,4304,4307,4359,4446,4506,4508,4819,5272,5296,5361,5546,5782,5911,5989,6078,6413,7280,7287,11085,12214,15671],"themes":[1],"genres":[4,5,25],"first_release_date":823132800000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":823132800000,"region":8,"human":"1996-Feb-01","y":1996,"m":2}],"alternative_names":[{"name":"Dynamite Deka","comment":"Other"}],"esrb":{"rating":5}}