{"id":48827,"name":"Pro Yakyuu Family Stadium '87","slug":"pro-yakyuu-family-stadium-87","url":"https:\/\/www.igdb.com\/games\/pro-yakyuu-family-stadium-87","created_at":1499971908291,"updated_at":1516737697408,"summary":"Not so much a sequel to Pro Yakyuu Family Stadium than an enhanced rerelease with updated rosters. It was published by Bandai for the Famicom in late 1987. \n \nPro Yakyuu Family Stadium '87 is the second game in Namco's long running Family Stadium series, also known as Famista. It's a traditional baseball game that allows one human player against the CPU, two competing human players and two competing CPU players in a \"Watch\" spectator mode. \n \nRather than being a full sequel to Pro Yakyuu Family Stadium the game is instead an updated version of the original, which was reflected in its lower price at release. It adds a few features and updates the official rosters for the athletes, but is functionally identical to the original Family Stadium. This specific type of annualization would become common practice for sports game franchises such as Madden NFL and NHL. \n \nIt's worth noting that this game is unrelated to R.B.I. Baseball 2 from Tengen. The original R.B.I. Baseball and Family Stadium were one and the same, the former receiving a name change to appeal to a Western audience, but after that initial game both franchises diverged. R.B.I. Baseball specifically favored more realistic looking athlete sprites while Family Stadium would persist with the cartoonish \"super deformed\" sprites.","collection":3166,"popularity":1,"games":[48304,83137,48847,48309,42558,37872,37833,80390,46605,37836],"tags":[268435470,536870932,536875141,536875570],"category":0,"keywords":[20,4229,4658],"genres":[14],"first_release_date":567129600000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":567129600000,"region":5,"human":"1987-Dec-22","y":1987,"m":12},{"category":0,"platform":18,"date":569808000000,"region":8,"human":"1988-Jan-22","y":1988,"m":1}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kkdooslw6ngurje9cdqd.jpg","cloudinary_id":"kkdooslw6ngurje9cdqd","width":320,"height":461}}