{"id":96027,"name":"Red Faction: Guerrilla Re-Mars-tered","slug":"red-faction-guerrilla-re-mars-tered","url":"https:\/\/www.igdb.com\/games\/red-faction-guerrilla-re-mars-tered","created_at":1522329334803,"updated_at":1545255936023,"summary":"Set 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: Guerrilla re-defines the limits of destruction-based game-play with a huge open-world, fast-paced guerrilla-style combat, and true physics-based destruction. \n \nKey Features \n \nOpen World Guerrilla Warfare - You decide who, when, where and how to battle. Utilize guerrilla tactics, improvised weaponry, and modified vehicles to lead insurgent attacks on EDF targets. Launch attacks based on your own gameplay style, take on missions in any order you choose, or engage in destructive activities to weaken the EDF's grip on Mars. \n \nStrategic Destruction - Use destruction to your tactical advantage, setting ambushes or chain reaction explosions to attack enemy strongholds and permanently modify the game environment. Leverage fully-dynamic physics-based destruction to improvise on the fly: blow holes in a wall or floor to set an ambush or escape, take out a staircase to stop your pursuers, or drive vehicles through blown out walls. \n \nEvolving & Emergent Gameplay - Carve your path through an ever changing landscape as you improvise your combat tactics - mixing gameplay styles, vehicles, weapons and explosives to defeat the EDF. \n \nEpic Sci-Fi Setting - Explore the huge, unforgiving Martian landscape, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos; then tear through the fully destructible open-world environments swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire. \n \nMultiplayer Combat - There is no place to hide when you put your guerrilla warfare skills to the test in a variety of highly destructive multiplayer combat modes. \n \nRe-Mars-tered Features \n \nFully reworked graphics – Heavily reworked textures and graphic features adding for example specular maps. \n \nImproved shadow rendering \n \nImproved Lighting \n \nShader & Postprocessing rework \n \nNative 4k support for the finest up to date mars destruction experience ever","storyline":"Alec Mason, a mining engineer, arrives on Mars Tharsis Region to reunite with his brother Dan and begin a new life. While on work detail, Dan testifies about the Earth Defense Force's (EDF) cruelty to the Martian people and asks Alec to join the Red Faction, of which Dan is a member. Dan is soon after gunned down by air support from an EDF assault team. Alec is rescued by Red Faction guerrillas and reluctantly becomes a freedom fighter for the group alongside avid inventor \"Sam\" Samanya, rambling psychotic Randy Jenkins, and commander Hugo Davies(although in the game known as RF commander) Between Davies's command and Alec's skill and bravery, the EDF are quickly driven out of the sector known as Parker. \n \nThe campaign against the EDF continues in the Dust sector, and Alec is eventually assigned to routine surveillance of the Marauders, a mysterious and violent warrior tribe living in the inhospitable Badlands, in hopes of recovering stolen weapons. Alec tracks them to an abandoned Ultor base that promptly comes under massive assault from the EDF. During the fracas, Alec escapes with a device called the Nano Forge. This brings attention to Admiral Kobel, commander of a powerful warship called the Hydra, along with General Roth, commander of the EDF forces on Mars, who declares Alec Mason an outlaw. General Roth turns his attention to Dust and the EDF responds by pulling out of the sector and ordering the artillery base in the Free Fire Zone to bomb Dust into oblivion. Alec is tasked with saving members of the Red Faction and intel on the EDF from the bombardment, which he succeeds in doing. \n \nAlec temporarily loses faith in the movement, citing that no matter how determined their efforts are, the EDF will simply bomb them to submission. However, Sam analyzes the Nano Forge and discovers it can create catastrophic nanites that can disintegrate any object. She builds a prototype rifle from the device and entrusts it to Alec's care. \n \nAfter determining a series of blind spots in its coverage a successful run against an EDF artillery base commences, allowing the group to begin take the fight to EDF territories, The Red Faction prepares to launch a massive coordinated offensive against the EDF. Consequently, the EDF stages an assault against the Red Faction, resulting in the abortion of the offensive, the annihilation of the Badlands camp and the death of Commander Davies. Only Sam, Alec and a handful of other fighters survive the assault. They learn afterward that the Hydra is nearing Mars, with Kobel intending to use its firepower to put an end to the Red Faction and, if necessary, all planetary life. Sam declares that they need support from the Marauders if their campaign is to continue. When Alec remains dubious, she reveals that she was a Marauder herself. The pair head to a Marauder stronghold to meet with their ruler, Vasha, Sam's sister. Sam requests the usage of the Marauders' particle accelerator technology, with plans to combine it with the Nano Forge, creating a weapon capable of destroying the Hydra. Vasha agrees to let the Red Faction use their technology in exchange for possession of the Nano Forge once the war is finished. \n \nAfter capturing a broadcasting station and using it to regroup the Red Faction, Sam and Alec lead the remaining Red Faction and Marauders on a final assault on EDF Central Command. The two groups converge on Mt. Vogel to assemble the machine, however a surprise EDF blitzkrieg led by General Roth wipes out the Marauders guarding the summit end of the accelerator and Vasha along with them. Alec storms the mountain with a modified missile-pod tank, defeating General Roth's army and killing Roth. Sam's plan succeeds and the accelerated Nano Forge is successful in vaporizing the Hydra. As the survivors of Mars celebrate, Sam declares the war over, but Alec responds that the EDF will return, stating \"We'll be ready for 'em\". Alec and Sam approach the crowds of civilians gathered, and Alec raises his hammer in the air, showing the sign of the Red Faction and their long-waited victory.","collection":100,"rating":60,"popularity":3.333333333333333,"aggregated_rating":65.6,"aggregated_rating_count":5,"total_rating":62.8,"total_rating_count":8,"rating_count":3,"version_parent":846,"version_title":"Re-Mars-tered","games":[90099,55038,36950,113114,81249,101211,25311,76747,54842,25300],"tags":[1,18,38,39,268435461,268435468,268435487,536872235,536873142,536876365,1073741826],"developers":[507],"publishers":[10075],"game_engines":[599],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[121,160,287,478,897,970,1025,1027,1158,1308,1323,1459,1494,1529,2230,2392,4004,4150,4151,5453,16877],"themes":[1,18,38,39],"genres":[5],"first_release_date":1530576000000,"pulse_count":40,"platforms":[6,48,49],"release_dates":[{"category":0,"platform":6,"date":1530576000000,"region":8,"human":"2018-Jul-03","y":2018,"m":7},{"category":0,"platform":48,"date":1530576000000,"region":8,"human":"2018-Jul-03","y":2018,"m":7},{"category":0,"platform":49,"date":1530576000000,"region":8,"human":"2018-Jul-03","y":2018,"m":7}],"alternative_names":[{"name":"Red Faction Guerrilla Remastered"},{"name":"Red Faction Guerrilla Remarstered"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dckldjrtbbd3pmjpypon.jpg","cloudinary_id":"dckldjrtbbd3pmjpypon","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/thrqnblekb63nhhogpir.jpg","cloudinary_id":"thrqnblekb63nhhogpir","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/adjvocvj2zijssrygwyq.jpg","cloudinary_id":"adjvocvj2zijssrygwyq","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/awsbd6amreylvfufrgbt.jpg","cloudinary_id":"awsbd6amreylvfufrgbt","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pekfpwrwwx0nioicdhxw.jpg","cloudinary_id":"pekfpwrwwx0nioicdhxw","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ydwdkkxda6v4f1nfhftk.jpg","cloudinary_id":"ydwdkkxda6v4f1nfhftk","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kbovrc0e5cbqwhy4ah33.jpg","cloudinary_id":"kbovrc0e5cbqwhy4ah33","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/obb941udkrx5f6qr13jo.jpg","cloudinary_id":"obb941udkrx5f6qr13jo","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hkwggt08usp6bx3lp0ad.jpg","cloudinary_id":"hkwggt08usp6bx3lp0ad","width":3840,"height":2160}],"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a04rgflrdubq2gibapuu.jpg","cloudinary_id":"a04rgflrdubq2gibapuu","width":9000,"height":5755}],"videos":[{"name":"Trailer","video_id":"jRnn94RoluI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l2ltgopqksr4jugxne6e.jpg","cloudinary_id":"l2ltgopqksr4jugxne6e","width":1538,"height":2000},"esrb":{"synopsis":"This is a third-person shooter in which players assume the role of a resistance fighter (Alex Mason) fighting for freedom on Mars. Players explore open-world environments, complete mission objectives (e.g., escorting VIPs, destroying bases and targets), and use a variety of weapons (e.g., rifles, rocket launchers, explosives) to kill enemy soldiers. Some sequences allow players to pilot mech suits and operate turrets to defeat enemy forces; players can also kill non-adversary characters\/civilians, though this may negatively affect progress and colonist morale. Battles are frenetic with realistic gunfire, large explosions, and blood-splatter effects that stain the environment. The words “f**k” and “sh*t” are heard in the dialogue.","rating":6},"websites":[{"category":1,"url":"https:\/\/www.thqnordic.com\/games\/red-faction-guerrilla-re-mars-tered"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/667720\/Red_Faction_Guerrilla_ReMarstered"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Red_Faction:_Guerrilla"}],"external":{"steam":"667720"},"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"onlinemax":16}]}