{"id":14941,"name":"Cricket Revolution","slug":"cricket-revolution","url":"https:\/\/www.igdb.com\/games\/cricket-revolution","created_at":1449608855155,"updated_at":1523281314600,"summary":"Cricket Revolution is a multiplayer cricket sports action title for the PC. With innovative gameplay, single and multiplayer game modes, local and global tournaments, and challenging AI opponents that learn from your every move, Cricket Revolution is a cricket gaming experience unlike any other. \n \nGet into gear and get ready for global cricket competition in your bid to dominate the online leaderboards. \n \nExperience Authentic Batting Gameplay: Cricket Revolution's batting system lets players command both shot selection and placement seamlessly with action oriented key mappings. Elements like batsman abilities, level, and states, combined with a full set of motion captured cricketing shots makes batting a powerful experience like no other cricket game of the past.  \n \nDominate the Awards and Achievements Leaderboards: Are you the top batsman in the world? Have you taken more hat tricks than anyone to date? Have you never lost a match online? No milestone achieved in Cricket Revolution goes unnoticed! From legendary performances to match winning innings to hat tricks, Cricket Revolution brings a comprehensive list of awards and achievements to cricket games. Get into your gear and win them.View and Track Complete Statistics and Performance Data: Every wicket you take, every century you score, every run you make is tracked, stored, and analyzed after every match to give you a comprehensive statistics tracking system. View scorecards from last season's matches; pull up your batting history and watch your average improve over time; count your wicket victims and watch yourself rise to the top of the leaderboards. \n \nMaster the 'Bowling Gadget': Unleash your bowling mind upon your opponents with complete control and confidence using Cricket Revolution's 'Bowling Gadget'. Speed, turn, swing, seam movement and special deliveries are perfectly orchestrated at the bowler's will. The bowling gameplay allows bowlers to concentrate on mind games with the batsmen instead of wrestling with the bowling controls. \n \nCompete For Glory on the Revolution Servers: Challenge friends and foes alike across the globe in a bid to dominate the Revolution Online leaderboards! Cricket Revolution takes your gaming experience to the next level with a complete in-game community network with chat rooms, friends, tournaments, ranking, and leaderboards.","rating":50,"popularity":1.333333333333333,"aggregated_rating":70,"aggregated_rating_count":1,"total_rating":60,"total_rating_count":1,"rating_count":0,"games":[19290,18623,19934,29173,26145,19376,55590,19301,55689,28465],"tags":[268435461,268435469,268435470,268435488,536871635,536871937,536872060,536872078,536875046,536875070,536875151,536876362],"developers":[7468],"publishers":[7468],"category":0,"game_modes":[1,2],"keywords":[723,1025,1148,1166,4134,4158,4239,5450],"genres":[5,13,14,32],"first_release_date":1251936000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1251936000000,"human":"2009-Sep-03","y":2009,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sbhdo1dmdzgcjvkdwalc.jpg","cloudinary_id":"sbhdo1dmdzgcjvkdwalc","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dfqlf2kdql31sx9o9das.jpg","cloudinary_id":"dfqlf2kdql31sx9o9das","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/btagpkvkqglg0tjzuwpr.jpg","cloudinary_id":"btagpkvkqglg0tjzuwpr","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aem4elzcfnfylkgtpbpp.jpg","cloudinary_id":"aem4elzcfnfylkgtpbpp","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/orxspqdhgzzdvue07jni.jpg","cloudinary_id":"orxspqdhgzzdvue07jni","width":480,"height":359}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/txgprxcdctwhyauvfo6w.jpg","cloudinary_id":"txgprxcdctwhyauvfo6w","width":1350,"height":1900},"external":{"steam":"25500"}}