{"id":17241,"name":"Sea Wolf","slug":"sea-wolf","url":"https:\/\/www.igdb.com\/games\/sea-wolf","created_at":1454447808116,"updated_at":1542176068207,"summary":"Sea Wolf is an arcade game by Midway, originally released in 1976. The player looks through a large periscope to aim at ships moving across the virtual sea line at the top of the screen, using a thumb button on the right handle of the scope to fire torpedoes. The periscope swivels to the right and left, providing horizontal motion of a targeting cross-hair. The cabinet features a mixture of video game and older electro-mechanical technology for player feedback. Using back-lit transparencies reflected inside the scope, the number of torpedoes remaining are displayed, as well as a red \"RELOAD\" light which lights up momentarily when the player has launched five torpedoes. Additionally, when ships are hit on the screen, an explosion \"light\" is reflected inside the scope. A blue overlay is affixed to the screen to provide a \"water color\" to the sea. Sounds include a sonar ping and the sound of the PT Boat racing across the screen. Sea Wolf is time-limited, with the player having an opportunity to win bonus time by reaching an operator-set score. The player's score is shown on the bottom half of the screen as well as the high score, one of the first known instances of a high score in a video game. Targets include destroyers, a fast moving PT Boat, and mines floating across the screen can that serve as obstructions.","popularity":1.333333333333333,"games":[83728,28751,18088,103020,64311,81141,19549,8422,77956,103298],"tags":[1,39,268435461,268435489,536870913,536870931,536875137,536875171,536876737,536880997,1073741828],"developers":[8588],"publishers":[9556,1436],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[1,19,4225,4259,5825,10085],"themes":[1,39],"genres":[5,33],"first_release_date":197078400000,"platforms":[71,52,15],"release_dates":[{"category":3,"platform":52,"date":197078400000,"region":2,"human":"1976-Q1","y":1976,"m":3},{"category":2,"platform":71,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12},{"category":2,"platform":15,"date":410140800000,"region":1,"human":"1982","y":1982,"m":12}],"alternative_names":[{"name":"Seawolf"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xo3hk9shfyrugjelnayk.jpg","cloudinary_id":"xo3hk9shfyrugjelnayk","width":850,"height":1104}}