{"id":37241,"name":"Gravity Force 2","slug":"gravity-force-2","url":"https:\/\/www.igdb.com\/games\/gravity-force-2","created_at":1497605768912,"updated_at":1513049033686,"summary":"GF2, as it is known to its friends, is one of the most advanced cave-flyers available. Borrowing its name and looks from the original Gravity Force by Kingsoft, which was an advanced Thrust clone, it diverts from its namesake by being a two-player-only game. \n \nGF2 stands out not only because of its clean graphics and sense of humour, but also because of its enormous range of preferences in order to customise the physics variables and capabilities of the players ship so as to make the game perfectly suited to each player. Furthermore, it has a stunning amount of levels on varying themes, more of which could be created with the level editor (available to registered users). \n \nThe different levels of GF2 are split up into themes such as Grass Worlds, Lego Worlds, Slime Worlds and Boring Worlds. Each player starts out on his home base with a fully loaded ship. The objective is simply to destroy the player by any means possible, be they to simply shoot him down, bomb him or to ram him into a wall, thereby depleting his shields. If your shields, fuel or ammunition is running low, you must return to your (or even you opponent's) base to refuel. However, landing makes you vulnerable to enemy bombardments. \n \nApart from the plain dogfighting levels, GF2 also offers a large amount of race levels, where the players race around a maze-like level where they must pass check points. Flying your ship around these levels is not as easy as it may seem, since you must fight gravity, just as in Thrust, but unlike Asteroids. \n \nGF2 was part, if not the progenitor, of the cave-flying trend that hit the Amiga in the mid-nineties, alongside games such as Bratwurst or Turboraketti.","collection":2686,"popularity":2,"games":[1070,1073,1188,10039,36608,74863,1066,34919,51485,26848],"tags":[1,268435464,1073741828],"developers":[13975],"publishers":[13975],"category":0,"player_perspectives":[4],"themes":[1],"genres":[8],"first_release_date":773020800000,"platforms":[16],"release_dates":[{"category":0,"platform":16,"date":773020800000,"region":8,"human":"1994-Jul-01","y":1994,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rji9kpsycy6djcnrxuob.jpg","cloudinary_id":"rji9kpsycy6djcnrxuob","width":1008,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mkeudrgufhgz1lgj5wnq.jpg","cloudinary_id":"mkeudrgufhgz1lgj5wnq","width":1008,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bpboq8vruqokraaddloi.jpg","cloudinary_id":"bpboq8vruqokraaddloi","width":1008,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ocso3mobuj3tkyswva9v.jpg","cloudinary_id":"ocso3mobuj3tkyswva9v","width":360,"height":288},"websites":[{"category":4,"url":"https:\/\/www.facebook.com\/gravityforce2"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Gravity_Force"}]}