{"id":38541,"name":"Battle Bakraid","slug":"battle-bakraid","url":"https:\/\/www.igdb.com\/games\/battle-bakraid","created_at":1497975032989,"updated_at":1535053174037,"summary":"The capitalist nation of Randa has long had a history of excellence in the creation of aircraft, attracting the best of engineers in aerodynamics, artillery, and structuring from the world over. Once, even this interest had waned, until the creation of the air show Bakraid, in which the capabilities of the fighters could be demonstrated outside of simulations for all to see. \nAround the time of the seventh Bakraid, a nearby nation, Deneb, had attained an expansionist attitude, forcibly subjugating and annexing several of its neighbors with the assistance of the Shtarterra Security Council. Recently, Deneb has asked to participate in Bakraid. Randa's defense council, perfectly aware that this is just a pretext for Deneb to get its and the SSC's engines of war into Randan borders and more easily prosecute their war from there, give their blessing. However, the council secretly contacts the other Bakraid participants, offering even more prize money than normal if they will perform in a special version of Bakraid--genuine war conditions. In other words, use their own top-of-the-line planes to shatter Deneb's schemes. In all, nine pilots accept this plan, and begin Bakraid two weeks early to catch Deneb unaware...","popularity":1.666666666666667,"games":[64311,28751,15894,18088,8422,353,57288,10209,2933,14758],"tags":[268435461,536870913,536870933,536871015,536871078,536871475,536871823,536872733,536873753,536874398,536874745,536875056,536875083,536875171,536875201,536875934,536876352,536878216],"category":0,"keywords":[1,21,103,166,563,911,1821,2841,3486,3833,4144,4171,4259,4289,5022,5440,7304],"genres":[5],"first_release_date":926035200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":926035200000,"region":8,"human":"1999-May-07","y":1999,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i6pgnmnlmvnocydtum3t.jpg","cloudinary_id":"i6pgnmnlmvnocydtum3t","width":450,"height":680}}