{"id":42041,"name":"Shiryou Sensen","slug":"shiryou-sensen","url":"https:\/\/www.igdb.com\/games\/shiryou-sensen","created_at":1499067453190,"updated_at":1515790066344,"summary":"Shiryou Sensen: War of the Dead is a post apocalyptic and dark Role Playing\/Action game by Victor Musical Industries. \n \nDue to a series of mysterious events, the town of Chany's Hill has been cut off from the rest of the world. People have suddenly gone missing and cannibalistic monsters now roam the land, killing all who cross their path. The protagonist of the game is Laila Arufon, the youngest female member of the S-SWAT (Supernatural and Special Weapon Attack Team). She was born in the small town and has developped strange psychic abilities. Her Psychic Seal (\"PS\") and Mind Force (\"MF\") powers allow her to increase any weapon destruction power but also to increase her defense capability greatly. Her mission is twofold - she must investigate the mysterious and supernatural incident in Chaneys Hill and to rescue all the remaining survivors she can find and lead them to the town's church. \n \nLaila comes equipped with a combat knife and a Hand Gun (SIG\/SAUER P226) - additional weapons appear later in the game including the Assault Rifle (STYER AUG), Grenade launcher (HK MZP1), Flamethrower (M2A1-7), Bazooka (M72A2) and so forth. Although most of the game uses a traditional top-down view, battles quickly drop the game into side-scrolling action phases. There, Laila fights hordes of monsters to gain experience (blue orbs), life (reb orbs), MF points (green orbs) or ammunitions (pink cases). She can also escape at anytime as long as she can reach the edge of the fighting area. The combat items are complemented by more conventional inventory items such as medic packs, psychic pills, keys and so forth. Player's progression is saved through a long password system.","popularity":1.333333333333333,"games":[49414,25636,36608,69505,21842,12632,28080,75102,26766,18862],"tags":[268435468,536871938],"category":0,"keywords":[1026],"genres":[12],"first_release_date":609379200000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":609379200000,"region":8,"human":"1989-Apr-24","y":1989,"m":4}],"alternative_names":[{"name":"Shiryo Sensen","comment":"Other"}]}