{"id":7041,"name":"Spellforce 2: Faith in Destiny","slug":"spellforce-2-faith-in-destiny","url":"https:\/\/www.igdb.com\/games\/spellforce-2-faith-in-destiny","created_at":1401236638843,"updated_at":1544261344866,"summary":"An all new campaign that fits into the SpellForce series and enriches the world of SpellForce, including favourite characters and quests. \n \nAn all new race of demonic enemies are also playable in multiplayer mode, featuring new units and structures. \n \nRide into battle on a fierce dragon and use new spells and effects to enhance your tactical possibilities. \n \nInnovative new Role-Playing-Strategy Genre. \n \nClick'n'Fight and Quick-Action-Buttons: The revolutionary control system guarantees instant action, and a wealth of unique tactical possibilities at your fingertips. \n \nEasy Skill tree system that allows individual character development. \n \nEnjoy a highly detailed and living fantasy world that adapts to the actions of the player: Fight monsters, gather items, adventure, trade and collect mighty artifacts to use for your battles. \n \n5 different fractions: Lead The Realm, The Clans, The Pact, the Shaikan and the Nameless to victory, with 12 very different units consisting of infantry, cavalry and flyers. \n \n10 different races: heroic humans, powerful elves, strong dwarves, barbaric trolls,battle-tested orcs, destructive barbarians, powerful dark elves, unbreakable gargoyles, malicious shadows and mean demonic powers.","storyline":"Four years have passed since the Shaper's defeat through the use of Archfire. During that time scientists, dragons and inventors have tried to find a way to counter the mysterious deterioration of the portals - in vain. \n \nThe portal network has now totally collapsed and the islands are cut off from one another. The dragons and the Shaikan act as the only connection between the races, but even their resources are limited. \n \nNow, with the nations isolated from one another, a new nameless enemy strikes. Eo is completely at the mercy of the attackers ascending from demonic depths. \n \nIn the midst of this chaos a new hero appears. A simple Shaikan and a member of the hand, he searches desperately for answers to his deeply disturbing dreams. This search leads him to the ancestral home of his people, the Iron Fields, to the mountain of the Patriarch Ur. The elders can only tell him that his dreams are connected to his destiny, but nothing more. \n \nUpon arrival all he finds are more questions: Who are these demonic creatures the locals are calling the Nameless? What do the dragons know about the destiny of this world? \n \nAnd what has Professor Twiddles plan to restore the portals to do with all this? \n \nTo discover his destiny, our hero must acquire new skills and do battle with enemies new and old. But wherever he goes - the Nameless always seem to be a step ahead, and futile battles break out in which the hero holds the destiny of all of Eo in his hands.","collection":961,"rating":50,"popularity":1.666666666666667,"total_rating":50,"total_rating_count":1,"rating_count":1,"game":7033,"games":[7615,26940,27092,36263,3700,23183,28182,14394,55092,26841],"tags":[17,22,268435467,268435468,268435471,536871063,536871208,536871938,536872070,536874694,536875046,536875257,536875271,536875453,536876569,536876726,536883865,1073741827,1073741826],"developers":[2981],"publishers":[753],"category":4,"player_perspectives":[2,3],"game_modes":[1,2,3],"keywords":[151,296,1026,1158,3782,4134,4345,4359,4541,5657,5814,12953],"themes":[17,22],"genres":[11,12,15],"first_release_date":1340064000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1340064000000,"region":8,"human":"2012-Jun-19","y":2012,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jfnwtxfqnwqsoswocdqv.jpg","cloudinary_id":"jfnwtxfqnwqsoswocdqv","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qra1fwoafbeiviszxg5n.jpg","cloudinary_id":"qra1fwoafbeiviszxg5n","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p32fdb1txp1jomcmud8u.jpg","cloudinary_id":"p32fdb1txp1jomcmud8u","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/spsbydba3d31r1uut9gt.jpg","cloudinary_id":"spsbydba3d31r1uut9gt","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ym1bcqh9yvopistkuxsf.jpg","cloudinary_id":"ym1bcqh9yvopistkuxsf","width":1280,"height":720}],"videos":[{"name":"Trailer","video_id":"oUWX8AVSWlc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kqendxijdhf5jnn4b8u3.jpg","cloudinary_id":"kqendxijdhf5jnn4b8u3","width":422,"height":600},"pegi":{"rating":3},"websites":[{"category":1,"url":"http:\/\/www.spellforce.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/65530"}],"external":{"steam":"65530"}}