{"id":8041,"name":"Galaxy on Fire 2","slug":"galaxy-on-fire-2","url":"https:\/\/www.igdb.com\/games\/galaxy-on-fire-2","created_at":1414926743966,"updated_at":1530296354661,"summary":"Taking place 35 years after the first installment of the series, Galaxy on Fire 2 has an even bigger adventure in store for Keith T. Maxwell than its predecessor. Time travelling to the far end of the known galaxy by a malfunction of his hyperdrive, the reckless fighter pilot soon finds himself in mine station, headed by Gunant Breh. The mining station is in the orbit of Var Hastra, a planet in a star system he has never heard of. Soon, he learns that he has missed quite a lot... not only has a new faction, the freethinking Mido Confederation founded by Nivellian and Terran runaways and rebels, emerged in the meantime, but also has a new threat started to wreak havoc among all inhabitants of the universe. Coming out of nowhere and launching devastating raids on convoys and freight ships of all factions, the mysterious Voids are about to make the whole galaxy tremble with fear and put the unstable peace among the different alien races to the test. With the help of the clandestine Deep Science society, an equally secretive and progressive union of ingenious scientists led by the beautiful Dr. Carla Paolini, Keith turns against the seemingly unstoppable alien menace and ultimately sets out to face the Voids in their own home world and end their reign of terror once and for all. During this advanture Keith meets his other old comrades, and also has the potential to have his own space station, in the orbit of Planet Kaamo.","collection":1078,"popularity":1.333333333333333,"aggregated_rating":89,"aggregated_rating_count":1,"total_rating":89,"total_rating_count":1,"games":[90099,25300,9552,25311,96437,11364,19249,89554,37419,28029],"tags":[1,18,38,268435461,268435469,268435488,536870936,536870968,536871077,536871886,536871904,536871945,536872110,536875423,536876569,1073741826],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[24,56,165,974,992,1033,1198,4511,5657],"themes":[1,18,38],"genres":[5,13,32],"first_release_date":1345507200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1345507200000,"region":8,"human":"2012-Aug-21","y":2012,"m":8}],"alternative_names":[{"name":"Galaxy on Fire 2 HD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rgxvfbmblngolbkz90eq.jpg","cloudinary_id":"rgxvfbmblngolbkz90eq","width":650,"height":325}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ethwgkiu1z3nfnywe6ez.jpg","cloudinary_id":"ethwgkiu1z3nfnywe6ez","width":600,"height":750},"websites":[{"category":2,"url":"http:\/\/galaxyonfire.wikia.com\/wiki\/Galaxy_on_Fire_2"}]}