{"id":15407,"name":"No More Room in Hell","slug":"no-more-room-in-hell","url":"https:\/\/www.igdb.com\/games\/no-more-room-in-hell","created_at":1450105076297,"updated_at":1539821403218,"summary":"\"When there's no more room in hell, the dead will walk the earth.\" \n \nA tribute to the highly acclaimed film series in which the above quote originated from, No More Room in Hell (PC Gamer's Mod of the Year 2011, ModDB's Editor Choice Multiplayer Mod of the Year 2011), is a co-operative realistic first person survival horror modification for the Source Engine. Taking inspiration from George Romero's \"Of the Dead\" series, the mod is set during a time in which the world is on the verge of collapsing into chaos from a disease whose origin is unknown. Many experts and organizations have their theories and ideas on how such a disease emerged and started to systematically destroy our very way of life, but one fact is clear to all. Whoever perishes from the disease gets up and kills, and the people they killed get up and kill. \n \nThe chances of you surviving this all out war of society and the undead are slim to none. Already, there are millions of the walking dead shambling about, searching for food to eat. There's no known cure. One bite can possibly end it all for you. However, you aren't alone in this nightmare. There are still a handful of uninfected survivors left in this god forsaken hellhole, and with co-operation and teamwork, you may live long enough to fight your way to salvation.Features:Teamwork: Co-operative play with up to eight players. \n \nVoice and Text Communications Limited by Distance: The further you're away the harder it is for other players to hear you. Keep those walkie talkies close. \n \nDynamic Objective Maps: The next playthrough may not be the same as the last! \nSurvival Mode: Defend and maintain your shelter against the undead in the hopes of getting extracted to a safe area. \n \nA Realistic Approach: In short, no crosshairs with limited \"only when you want it\" HUD. In addition, ammo and weapons are extremely scarce. With that in mind, aim down your sights and shoot for the head! \n \nMultitude of Different Opponents: Ranging from the iconic \"walking zombie\" to the more contemporary \"runners\", NMRiH will keep you on your toes with a mix of dangerous foes to face down. However, the most dangerous enemy may not always be the walking dead... \n \nInfection: One bite may be what it takes to bring you down. If infected, you must decide if you want to alert your team to rid you of your burden, or to keep quiet in the hopes of finding a cure...","rating":67.2965004731608,"popularity":1.666666666666667,"total_rating":67.2965004731608,"total_rating_count":7,"rating_count":7,"games":[19686,37016,25646,19817,13210,112425,90099,105979,26658,68287],"tags":[1,19,268435461,268435488,536870917,536870981,536871365,536871937,536872032,536876702,1073741825,1073741831],"developers":[7706],"publishers":[7705],"game_engines":[3],"category":0,"player_perspectives":[1,7],"game_modes":[2,3],"keywords":[5,69,453,1025,1120,5790],"themes":[1,19],"genres":[5,32],"first_release_date":1378252800000,"platforms":[6,14,3],"release_dates":[{"category":0,"platform":6,"date":1378252800000,"human":"2013-Sep-04","y":2013,"m":9},{"category":0,"platform":14,"date":1378252800000,"human":"2013-Sep-04","y":2013,"m":9},{"category":0,"platform":3,"date":1378252800000,"human":"2013-Sep-04","y":2013,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jcupbjfumzpnpmkrhkof.jpg","cloudinary_id":"jcupbjfumzpnpmkrhkof","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvi9xoxm4wragdp4ilmp.jpg","cloudinary_id":"yvi9xoxm4wragdp4ilmp","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fpcaqwclcwo0x6iicks1.jpg","cloudinary_id":"fpcaqwclcwo0x6iicks1","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vxvmi0giblfs5mipiirt.jpg","cloudinary_id":"vxvmi0giblfs5mipiirt","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mojr2ftogz8ddbajle0h.jpg","cloudinary_id":"mojr2ftogz8ddbajle0h","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"BdmkLYYR1K4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/buwwsleyvro5trtnogli.jpg","cloudinary_id":"buwwsleyvro5trtnogli","width":460,"height":215},"websites":[{"category":1,"url":"https:\/\/www.nomoreroominhell.com\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/224260"}],"external":{"steam":"224260"}}