{"id":15907,"name":"Dual Orb II","slug":"dual-orb-ii","url":"https:\/\/www.igdb.com\/games\/dual-orb-ii","created_at":1452599919738,"updated_at":1513086816209,"summary":"Long time ago, a flourishing civilization was destroyed by the rage of a mighty dragon. The Earth was set in flames, and no one escaped the destruction - no one except one man, who managed to launch himself forward, thousand years into the future. There, he was found by people of Kardosa Empire, who soon understood they have in their hands a human who possesses the secret of a superior ancient technology, that was unknown to the primitive civilization of the present... \n \nYou play the role of Aleth, the son of the High Priest in the small kingdom of Garade, whom leads a peaceful life with his friend Lagnus, Prince of Garade. One day Aleth accidentally gains possession of a precious artifact which is sought after by the Kardosa Empire. Aleth and Lagnus get involve in a conflict which will soon lead them to great discoveries of the secrets of the ancient civilization, of the great destruction that occurred thousand years ago, and of their own true identities... \n \nThe game is a console-style RPG: your party meets randomly encountered enemies and bosses, and fights them in turn-based combat viewed from isometric perspective. You upgrade armor by buying it, and also can buy weapons, but weapons can also be upgraded for money to different levels, to create powerful attacks called \"techs\".","collection":1996,"popularity":1.333333333333333,"games":[26766,25300,36926,11567,12632,36950,36534,19333,18398,11214],"tags":[18,268435468,536871138,536871139,536871208,536871882,536871938,536873473,536875081,536875472,536877006,536877501,1073741827],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[226,227,296,970,1026,2561,4169,4560,6094,6589],"themes":[18],"genres":[12],"first_release_date":788659200000,"platforms":[58],"release_dates":[{"category":0,"platform":58,"date":788659200000,"region":5,"human":"1994-Dec-29","y":1994,"m":12}],"alternative_names":[{"name":"Dual Orb 2","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s8cjngnkv64ynbj2hzat.jpg","cloudinary_id":"s8cjngnkv64ynbj2hzat","width":260,"height":226}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c4mgw4qv3loaxknnlf2n.jpg","cloudinary_id":"c4mgw4qv3loaxknnlf2n","width":100,"height":183}}