{"id":28707,"name":"Breakers","slug":"breakers","url":"https:\/\/www.igdb.com\/games\/breakers","created_at":1494603364701,"updated_at":1517270963042,"summary":"Somewhere in Hong Kong, two martial artists face each other in a vast courtyard. The challenger is a stout man in brown skin. The ground has been tainted with blood. However, his crescent blade hasn't touched his opponent yet. It was a one-sided battle. He was already exhausted and it won't be long before he　would fall. \"Fool, you will become one of my family\" resounded the opponent's voice, as the challenger crumbled to the floor and was turned into sand. \n \nThe Fighting Instinct Tournament, or FIST, is a tournament as fierce as its name suggests. There was no shortage of martial artists who entered the tournament seeking fame, and yet there were many who left the tournament as corpses. The last challenger who remains in this lawless tournament gets to challenge the organizer of the tournament, the Head of the Huang Financial Clique, for the chance to win the massive prize money. The martial artist who can manage to defeat him will obtain the honor of truly calling him or herself the strongest. However, none of the martial artists who were chosen to challenge the champion in a private final match have ever come back alive. Nobody knows when exactly the tournament is held, since only an avaricious will was spiraling over there. The sponsor is actually an evil spirit who possessed the body of a modern man from Hong Kong who has established a selection system to amplify his dark powers. The FIST tournament has gathered numerous participants from around the globe and another sacrifice will be chosen this year.","popularity":1.666666666666667,"games":[25222,33726,18011,11490,20342,24426,55038,26223,36950,56033],"tags":[18,268435460,268435465,268435487,536871130,536871882,536871905,536871939,536873787,1073741829],"developers":[9466],"publishers":[608],"game_engines":[467],"category":0,"player_perspectives":[5],"game_modes":[1],"keywords":[218,970,993,1027,2875],"themes":[18],"genres":[4,9,31],"first_release_date":536371200000,"platforms":[63,13,75,15],"release_dates":[{"category":2,"platform":13,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":63,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12},{"category":2,"platform":75,"date":536371200000,"region":2,"human":"1986","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d3zn5rvebib2t4sko0ot.jpg","cloudinary_id":"d3zn5rvebib2t4sko0ot","width":1000,"height":1291}}