{"id":39507,"name":"Relief Pitcher","slug":"relief-pitcher","url":"https:\/\/www.igdb.com\/games\/relief-pitcher","created_at":1498129490702,"updated_at":1516749125188,"summary":"Relief Pitcher is a 1992 baseball video game originally released for video arcades. Versions of the game were also released for the Atari Lynx and Super NES. \n \nSummary[edit] \n \nArcade game ending \nThere are two modes to this game: players can either be the starting pitcher; which is a full 9-inning game for either one or two players or they can be the relief pitcher and do a 12-game season for one player only.An additional relief pitcher mode allows a best of 7 World Series type of play for two players.[2] \n \nThere are four fictitious teams (Boston Bashers, Houston Dusters, Los Angeles Speeders, and Chicago Strokers) to choose from with its own special strength.[2][3] Players must choose their favorite special pitch and dive into the more complicated mechanics of pitching a baseball. All the ballplayers in the game are fictional. There are many meters to use while determining whether to strike out the batter or give him an intentional walk instead. Batters also have to deal with meters that have to do with offense rather than defense.[2] \n \nAfter playing each game, the player is entitled to a certain level of salary. This depends on how good the player performs out in the field. After winning the playoffs in arcade mode, it shows the final box score with a special game over message inside of it.[4] The commentary in this game is done by legendary baseball announcer Jack Buck.[2]","popularity":1,"games":[48635,48469,79833,63218,63217,48310,46261,48811,47383,43878],"tags":[268435470,536870932,536875570,536875580,536876165],"category":0,"keywords":[20,4658,4668,5253],"genres":[14],"first_release_date":770342400000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":770342400000,"region":2,"human":"1994-May-31","y":1994,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o3h04yhrpyznyqxe75gd.jpg","cloudinary_id":"o3h04yhrpyznyqxe75gd","width":475,"height":347}}