{"id":40007,"name":"Lunar Rescue","slug":"lunar-rescue","url":"https:\/\/www.igdb.com\/games\/lunar-rescue","created_at":1498466760242,"updated_at":1516571448845,"summary":"The game starts with the player's spacecraft docked inside the mothership at the top of the screen. Below the mothership is an asteroid field and below that, the surface of the moon. There are three platforms which can be landed on and six stranded astronauts that need rescuing. You control a small spacecraft. The player must press the button to release their spacecraft from the mothership and manoeuvre through the asteroid field. The craft can only move left or right or use up a finite amount of fuel by engaging the thrust (the same button again) to slow its descent. If the craft is landed successfully on one of the available platforms, one of the astronauts will run towards and board the craft. \n \nThe asteroid belt now changes into a swarm of flying saucers, some of which drop bombs. The player must now guide the spacecraft back up to the mothership (the craft ascends without using up fuel), avoiding the flying saucers. The thrust button is now a fire button which can be used to shoot at enemies above (as in Space Invaders). Finally, the craft must be docked with the mothership using the bay opening. If the side of the mothership or any part of the ship outside of the opening is hit, the rescued astronaut falls to the surface and dies. If the mothership is missed altogether, the craft explodes. After all six people have been rescued (or killed providing the player still has lives remaining), the game starts again at a higher level.","hypes":1,"popularity":1.333333333333333,"games":[68287,25300,71455,36950,27314,64204,19448,28029,25311,26766],"tags":[1,18,536870915,536871859,536871882,536872419,536873016,536873064,536875002,536875075,536875608,536877141],"category":0,"keywords":[3,947,970,1507,2104,2152,4090,4163,4696,6229],"themes":[1,18],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v1zwo8vbzikc6kwdmply.jpg","cloudinary_id":"v1zwo8vbzikc6kwdmply","width":850,"height":1200}}