{"id":50207,"name":"Shivers 2: Harvest of Souls","slug":"shivers-2-harvest-of-souls","url":"https:\/\/www.igdb.com\/games\/shivers-2-harvest-of-souls","created_at":1500037900720,"updated_at":1546022320599,"summary":"Your friends of the rock band Trip Cyclone win the Battle of the Bands and decide to make video clips in the secluded desert town of Cyclone, Arizona, located amidst the red rocks of Devil's Mouth Canyon. They stay at the house of aunt Pearl and help her out part-time in her cafe. The town seems to have gotten stuck in time decades ago, people are strange and not welcoming to outsiders. When two hikers do not return from their trip in the canyon, on which people believe an ancient Indian curse rests, the villagers set out for a search expedition, only to lose a local villager in the process. The town is restless, tourists stop coming and the band believes they may not be able to make their rock videos, lacking the money to buy equipment. Then they are approached by a strange man wearing a traditional Indian Kachina mask, who names himself Darkcloud. \n \nDarkcloud expresses strong interest in their music and decides to finance the band, even hiring a technician from LA. It is very suspicious but on the other hand the help is welcome. But then strange events begin - as their videos are broadcasted on the local TV network, people gradually turn into mental zombies, lured to Devil's Mouth Canyon. One by one they disappear. When the band witnessed more than they would like to, and they decide to pack their bags and leave town, a landslide occurs and virtually isolates Cyclone with no more supplies or people going in or out. People are trapped. Only one more person manages to make it to the town after a rough motorcycle ride - you. When you arrive, all people have disappeared, including your friends. What is going on here? Who is Darkcloud? And can you save your friends? Clues are scattered in their videos and in the buildings around the ghost town. Your friends' lives depend on your witts and puzzle-solving skills, Warrior.","collection":1660,"popularity":1.333333333333333,"games":[18011,56033,13189,54678,25222,25646,21641,11296,18020,26658],"tags":[19,268435465,268435487,536871088,536871725,536871939,536872032,536872225,536872328,536873787,536875099,536875549,536875570,536875639,536876131,536882414],"category":0,"keywords":[176,813,1027,1120,1313,1416,2875,4187,4637,4658,4727,5219,11502],"themes":[19],"genres":[9,31],"first_release_date":854755200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":854755200000,"region":8,"human":"1997-Feb-01","y":1997,"m":2}],"alternative_names":[{"name":" \"Harvest of Souls: Stadt der verfluchten Seelen\" -- German Title\n\n\"Cyclone: La Cité des Âmes perdues\" -- French Title\n","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fh2uomj56mnytnk1rs7r.jpg","cloudinary_id":"fh2uomj56mnytnk1rs7r","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yxcdfb0jemmvrddgcs7y.jpg","cloudinary_id":"yxcdfb0jemmvrddgcs7y","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h9cvsk5cw0x3hddcizcp.jpg","cloudinary_id":"h9cvsk5cw0x3hddcizcp","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hlyrhtlwlcop0ef9chcp.jpg","cloudinary_id":"hlyrhtlwlcop0ef9chcp","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ej7wmxjjj7ob5c8a60im.jpg","cloudinary_id":"ej7wmxjjj7ob5c8a60im","width":800,"height":600}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ezmwrlyncifjq2fwbmnz.jpg","cloudinary_id":"ezmwrlyncifjq2fwbmnz","width":660,"height":800},"esrb":{"rating":5}}