{"id":51207,"name":"Scrabble 2007 Edition","slug":"scrabble-2007-edition","url":"https:\/\/www.igdb.com\/games\/scrabble-2007-edition","created_at":1500062104656,"updated_at":1515743381370,"summary":"The most popular letters game of the world is back on PC. Compete in craftiness against the computer or against friends to combine the letters in the most appropriate way. Place your letters wisely to complete already formed words or create new ones and take advantage of bonus squares to increase your score. Developed in partnership with the French Federation of Scrabble, this new edition will make everyone, if they are not already, hardcore players of Scrabble! \n \n  A New Interface : A functional interface allowing players to start the game with three clicks of the mouse. Also features an ergonomics offering with new graphic themes for the board and letters, and various levels of zooms and angles of sight. \n  Includes The Official Scrabble Dictionary: The official Collins dictionary is included and is easily updatable. \n  Six Different Game Modes: Standard & Duplicate Modes (game Mode used in clubs and official championships) Anagram, Enigma, Crossagram and Junior. \n  A Coach to Improve Skills: A mentor to analyze the game and advise you at a strategic level; also includes a library of commented games to improve your skills. \n  Multiplayer: Up to four players on the same computer, which allows participants to play between friends or versus the computer; up to 100 players via the Internet in Duplicate mode. \n  Groundbreaking Artificial Intelligence: An AI game created for novice players as well as experts, corresponding to the expectations of the French Federation of Scrabble and validated by Franck Maniquant (world champion of French Scrabble and Champion of France in 2001). \n \nProduct Description \n \n  A functional interface allowing players to start the game with three clicks of the mouse. \n  Includes The Official Scrabble Dictionary \n  Six different game modes \n  A coach to improve skills \n  Up to four players on the same computer \n  Up to 100 players via the Internet in Duplicate mode. \n  Groundbreaking artificial intelligence","collection":4559,"popularity":1,"games":[60044,25222,14047,8197,26223,9760,33603,36962,55888,65827],"tags":[268435465,268435471,536873787],"category":0,"keywords":[2875],"genres":[9,15],"first_release_date":1189814400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1189814400000,"region":8,"human":"2007-Sep-15","y":2007,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ztqg1lktklnn9aqctnpj.jpg","cloudinary_id":"ztqg1lktklnn9aqctnpj","width":540,"height":477}}