{"id":78107,"name":"Blaze Union: Story to Reach the Future","slug":"blaze-union-story-to-reach-the-future","url":"https:\/\/www.igdb.com\/games\/blaze-union-story-to-reach-the-future","created_at":1513238608382,"updated_at":1530804406908,"summary":"Blaze Union serves as the prequel to Yggdra Union, and shares the same systems with a few minor changes to gameplay. The most notable change is the addition of a mission selection system during two points of the game, which leads up to separate story branches much like a visual novel.","storyline":"Blaze Union takes place three years before Yggdra Union, in the year 1487 M.D., an era that was considered a golden age to the rest of the continent but was a dark age for the empire of Bronquia. Thortie, the current Emperor, was an incompetent ruler who taxed the people heavily to support the army he was attempting to build; the majority of the nobility was corrupt, and bandits plagued the land, preying on the weak and innocent. \n \nIn the trade city of Tiera, the youth Garlot had grown up being crushed under the heel of various forms of oppression, from the unfairness of the rich and the nobility to his own father's brutal abuse; he and his friends Siskier and Jenon decided to do what they could to change the ugly reality surrounding them and formed a band of noble thieves in order to protect their fellow poor. \n \nThe game begins as Garlot and his band close in on a noble named Norn and the mercenaries he has hired, defeat him with the help of the traveler Medoute, and catch the eye of Landgrave Velleman. The landgrave asks for their help in creating order in Bronquia so that it can be stabilized before it destroys itself, and they join forces; Velleman renames their force Gram Blaze. \n \nFrom this point on, the story focuses on Gram Blaze's progress in restoring public order, gathering new allies, and gaining notoriety in Bronquia as the protectors of the people. As much as the plot is a medieval fantasy and adventure tale, it is also a slice of life story chronicling the strengthening of the bonds between Gram Blaze's members and providing a portrait of Garlot, the people surrounding him, and the world they live in. \n \nDepending on the choices of the player, the plot can progress in one of three directions, with four possible conclusions. Important themes include comradeship, racism, revenge, and mental-emotional stress and trauma.","collection":922,"popularity":1,"games":[13196,49414,103020,25636,36608,35737,81249,21842,1506,18862],"tags":[268435468,268435480],"developers":[15842],"publishers":[818],"category":0,"game_modes":[1],"genres":[12,24],"first_release_date":1274918400000,"platforms":[38],"release_dates":[{"category":0,"platform":38,"date":1274918400000,"region":5,"human":"2010-May-27","y":2010,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qogkbxtxkhlxqauzokcw.jpg","cloudinary_id":"qogkbxtxkhlxqauzokcw","width":500,"height":869},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Blaze_Union:_Story_to_Reach_the_Future"}]}