{"id":89707,"name":"QuadcopterFx Simulator","slug":"quadcopterfx-simulator","url":"https:\/\/www.igdb.com\/games\/quadcopterfx-simulator","created_at":1519989044853,"updated_at":1522301393355,"summary":"A Quadcopter \/ Multirotor RC Drone simulator with First Person View (FPV), HUD, Return Home, Course Lock, Home Lock, Camera Gimbal, Acro mode, Acro 3D mode and more..\n\nNow Google Cardboard VR is also supported for immersive flying and FPV experience.\n\nSupport for Controllers\n\nPlease note that this a simulator and Not a game. It is designed for RC enthusiasts to practice Flying skills. \nBasic Tutorial for beginner is in the above description video.\n\nFeatures:\n\n1) Based on real physics Model of Quadcopter\n\n2) Interactive selection of different cameras modes: \n  * Eye level Camera\n  * First Person View Camera\n  * Stabilized Gimbal Camera\n  * Follow Camera \n   You can walk around while flying, looking at the quad either by dragging the middle of screen or by enabling accelerometer button on the left side in the Eye level Camera Mode..\n\n3) Return to Location (RTL) \nWhen on the Quad will automatically Return and Land back in its Landing Position. It will Automatically switch on when the Quad goes out of range.\n\n4) Position Hold\nWhen ON the Quad will try to Hold its position when both control sticks are released.\n\n5) Course Lock \nWhen ON the Forward, Backward, Left and Right will remain same regardless of orientation of Quad. e.g. Moving Right stick Forward will always make the Quad go forward in East Direction even if its pointing towards north.\n\n6) Home Lock\n When ON the Forward will always be Away from you and Backwards will always be towards you regardless of Quads Orientation.\n\n7) Heads up Display(HUD)\n  Displaying real-time Pitch, Roll, Heading, Altitude and Speed.\n\n8) Adjustable Control sensitivity Settings\n\n9) Auto Stabilizing adjustable\n\n10) Altitude Hold Switch\n  If ON the quad will try to maintain the altitude when it was switched on. \n\n11) Advanced Settings\n  If enabled users can change the Total Weight, Static \/ Dynamic thrust, PID setting and Aerodynamic Drag values.\n\n12) Multiple Quad \/ Scene Selection \/ Some basic Challenges for Time Pass..\n\n13) Multiple mode Input Support.\nNow it supports mode1, mode2. mode3, mode4 and accelerometers. You can change via settings page\n\n14) Camera rotation in FPV and Gimbal camera.\nClick and Drag from center of screen on FPV or Gimbal camera. Double click in center to reset. \n\n15) Dynamic Wind\nWind effect will reduce when behind the building.\n\n16) Google cardboard Support for immersive virtual reality and FPV experience.\nMake sure that you have a controller attached to the device because the only way you can control the quadcopter is by controller once the Cardboard VR is enabled. After enabling you have to gaze at the buttons on the UI and press the trigger button on the cardboard to click it. Once you are flying then pressing the trigger anywhere will open the settings page. You can also touch on screen anywhere to execute trigger event instead of pressing the trigger button.\n\n17) Max Tilt Angle \/ Auto Stabilize Sensitivity Slider\nIn Normal Mode the slider changes the Maximum Tilt angle setting. This settings determines the maximum roll \/ pitch angle the quadcopter will tilt. In Sports Mode it changes the Auto Stabilize sensitivity. The higher the settings the more force is applied to stabilize the quadcopter.\n\n18) Acro \/ Acro 3d mode for expert flying\nAuto stabilize will not be applied in these modes. You need to be expert to fly in this mode.In 3D Mode is mode in which the Quadcopter can fly upside down also. The throttle sticks will produce reverse thrust when moved down from the center position. \n\nEnjoy Flying..\nCredits: Some Arteria content is in use.","rating":70,"popularity":1,"total_rating":70,"total_rating_count":0,"rating_count":0,"games":[44242,24491,28465,75579,75275,34919,75102,33603,36962,55888],"tags":[268435469],"category":0,"genres":[13],"first_release_date":1402790400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1402790400000,"region":8,"human":"2014-Jun-15","y":2014,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kodoezdcmjcb2d3jrdmt.jpg","cloudinary_id":"kodoezdcmjcb2d3jrdmt","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dezyt3txndbouzmx24b2.jpg","cloudinary_id":"dezyt3txndbouzmx24b2","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rblhxlidz2alqgajsynk.jpg","cloudinary_id":"rblhxlidz2alqgajsynk","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gfgesjj1of4ooygmu6rq.jpg","cloudinary_id":"gfgesjj1of4ooygmu6rq","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lflmgsktqhlfz0ts8zdk.jpg","cloudinary_id":"lflmgsktqhlfz0ts8zdk","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xllzoedamvoxzg3nezas.jpg","cloudinary_id":"xllzoedamvoxzg3nezas","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eomz24gg48le2d7e3cym.jpg","cloudinary_id":"eomz24gg48le2d7e3cym","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cycaemu8xcgl9o92rlwm.jpg","cloudinary_id":"cycaemu8xcgl9o92rlwm","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zt91l93rn6fiat187njp.jpg","cloudinary_id":"zt91l93rn6fiat187njp","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b36xijbgiwamg1ey7099.jpg","cloudinary_id":"b36xijbgiwamg1ey7099","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/quadcopterfx-simulator\/id884782635?mt=8&uo=4"}]}