{"id":11920,"name":"Assassin","slug":"assassin","url":"https:\/\/www.igdb.com\/games\/assassin","created_at":1441028612163,"updated_at":1513000864882,"summary":"Assassin is a video game for the Commodore Amiga system. It was developed by Psionic Systems and published in 1992 by Team 17. The game is an action game that has platform and shoot 'em up type gameplay. Assassin was updated and re-released in 1994 as Assassin: Special Edition. Assassin's storyline is fairly simple. The character is an assassin that has been hired to kill the antagonist of the game, \"Midan\". He is then dropped behind enemy lines and must first disable Midan's power source, and then assassinate him. The assassin is armed with a boomerang that is razor-edged. There are three skill levels to Assassin, Rookie, Arcade and Ultimate. As well as changing the difficulty, each level unlocks more of the game than the level that is easier than it. The enemies are tougher to defeat in the higher levels, but there are more rewards. The player must guide the assassin through the levels facing enemies ranging from vicious dogs to wall mounted laser cannons. As well as the platforms, the player is able to control the assassin to climb on walls and ceilings as a method of getting around, and avoiding enemies. The player can use the boomerang to attack enemies, or use bonus weapons that are gained by achieving certain requirements. The whole game is controlled by a joystick. Assassin: Special Edition was released 2 years after the original game and various gameplay elements were altered. The first level is gone which means that there no longer are the dogs as enemies, also the boomerang has been replaced with a laser gun.","collection":1862,"popularity":1.333333333333333,"games":[55752,68324,1070,10039,47823,1073,56589,12632,51485,36926],"tags":[1,268435464,536871208,536871971,536872690,536872961,1073741828],"publishers":[614],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[296,1059,1778,2049],"themes":[1],"genres":[8],"first_release_date":725760000000,"platforms":[16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aectrisb3vwddfoqlxzr.jpg","cloudinary_id":"aectrisb3vwddfoqlxzr","width":320,"height":260},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p13jvvlw25c93ulmeckx.jpg","cloudinary_id":"p13jvvlw25c93ulmeckx","width":320,"height":260},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dhqgdikjummobvwekmde.jpg","cloudinary_id":"dhqgdikjummobvwekmde","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qduh4tp2dkf4wullu7qq.jpg","cloudinary_id":"qduh4tp2dkf4wullu7qq","width":640,"height":802}}