{"id":16320,"name":"Wings over Vietnam","slug":"wings-over-vietnam","url":"https:\/\/www.igdb.com\/games\/wings-over-vietnam","created_at":1453046787488,"updated_at":1513023030799,"summary":"Despite the \"Lite\" tag, a fair amount of realism has been built in; 1960s-style bombsights are simulated rather than modern computer-aided aiming reticules. Dive bombing and level bombing techniques have to be worked out by the game player if they are to have success at completing missions.\n\nUS Air to Air missiles in the game consist of early versions of the AIM-9 Sidewinder, AIM-7 Sparrow, and AIM-4 Falcon which are simulated to be as unreliable as the real missiles were. So regardless of having a \"good lock on the target\" there is a good chance the missile will miss. Just like the real accounts from the war suggest most of the dogfights are close in affairs with the nimble MiGs against the heavier less nimble US Aircraft.\n\nThe map of Vietnam has been scaled down slightly so that there is less time spent flying to a target, and also because air-to-air refuelling is not included in the game.\n\nDuring a mission the player will fly in a flight of aircraft in which the computer-controlled planes keep in formation as you fly to a target. This flight can be issued commands; attack other aircraft or ground targets, fly home if they are damaged, or jettison their drop tanks. As you fly many other computer-controlled aircraft will be up in the air and can be viewed as they engage in dogfights or bomb targets.\n\nTrue to the Vietnam theatre the player's aircraft will be met with a high level of radar guided Surface to Air Missiles (SAMS), and a variety of lethal Anti-Aircraft Artillery (AAA). The main SAM is the soviet SA-2, of which early and later versions are included in the game increasing lethality accordingly.\n\nThe player can select a campaign from either Operation Rolling Thunder (1965 to 1968), Linebacker I (1972) or Linebacker II (1972) which are similar in name and aircraft involved to the actual campaigns from the conflict.\n\nSingle Missions are also available, which can be customised to allow the player to practice with specific aircraft and weapons.","collection":3462,"hypes":1,"popularity":1.333333333333333,"aggregated_rating":49,"aggregated_rating_count":2,"total_rating":49,"total_rating_count":2,"games":[44242,18623,22470,29173,22425,26145,55590,55689,22406,23867],"tags":[268435469,536870968,536871546,536871904,536872060,536872651,536873753,536874743,536877511,536882294],"category":0,"keywords":[56,634,992,1148,1739,2841,3831,6599,11382],"genres":[13],"status":2,"alternative_names":[{"name":"Strike Fighters 2: Vietnam","comment":"Other"},{"name":"WOV","comment":"Acronym"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ufwpnobnvtnpnnevjo5h.jpg","cloudinary_id":"ufwpnobnvtnpnnevjo5h","width":256,"height":367},"websites":[{"category":1,"url":"http:\/\/www.thirdwire.com\/index2.htm"}]}