{"id":25920,"name":"Kennedy Approach","slug":"kennedy-approach","url":"https:\/\/www.igdb.com\/games\/kennedy-approach","created_at":1479839259246,"updated_at":1513006159922,"summary":"The player assumes the role of a controller in a Terminal Radar Approach Control, giving instructions to aircraft so that they can safely land, as well as take off and enter their correct flight corridors. The purpose of the game is to manage the flights that are presented to the player without the flights being delayed or exiting\/landing in the wrong location. The aircraft either come flying in on the screen and have preset exit or landing points or show up as wanting to take off with an exit point. It is the player's job to determine the route each aircraft flies and when they may land or take off. \n \nThe aircraft cannot be too close to each other, so the player needs to make sure that they are passing each other on different flight levels or with sufficient distance (three grid dots north\/south or east\/west) between them. When an aircraft is in danger of crashing or is exiting at the wrong location or altitude, the aircraft will inform the air traffic controller. Aircraft do not change course\/altitude unless the player tells them to. Incoming aircraft not given clearance to land, however, will go into a holding pattern and wait until given clearance. When necessary, the player can also give holding instructions to aircraft, as long as their course takes them over a VOR tower which is used as the holding fix. \n \nTo start with, there are few flights at the same time, but at higher GS levels, there are many flights that need management at the same time. Also storms which the aircraft can not pass through show up and some aircraft have very little fuel and have to land fast or they will crash.","popularity":1.333333333333333,"games":[29173,44242,55689,55590,40470,18623,9199,22470,11679,26145],"tags":[32,268435469,536871904,536871906,536872060,1073741827],"developers":[9150],"publishers":[9150],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[992,994,1148],"themes":[32],"genres":[13],"first_release_date":504835200000,"platforms":[63,65,16,15],"release_dates":[{"category":2,"platform":16,"date":631065600000,"region":2,"human":"1989","y":1989,"m":12},{"category":2,"platform":65,"date":504835200000,"region":2,"human":"1985","y":1985,"m":12},{"category":2,"platform":63,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12},{"category":2,"platform":15,"date":504835200000,"region":2,"human":"1985","y":1985,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hr2hitodt8deivlgopyv.jpg","cloudinary_id":"hr2hitodt8deivlgopyv","width":1000,"height":1437}}