{"id":27120,"name":"Planet Colonization","slug":"planet-colonization","url":"https:\/\/www.igdb.com\/games\/planet-colonization","created_at":1486844952397,"updated_at":1529094782573,"summary":"The outstanding Real Time Strategy \/ Simulation with in-depth society management. Explore the planet, build and defend your colony. Trade products and weapons. Experience coexistence with alien lifeforms.","storyline":"In the distant space there is a habitable planet. The planet has solid ground, water and natural resources. The game begins on this new world with initial settlement under your control.       \n      \nPlanet Colonization is a fascinating strategy game with focus on the functioning of society, trade and defending your colony against other colonies. As the ruler of the colony you decide which way the things go. Things that need to be controlled are Funding and Trade, Society and Tax Model, Employment of Colonists, Harvesting of Natural Resources, Production and Industry and Relations to other Colonies.      \n      \nThe society model covers the whole life cycle of a colonist. Young colonists can go to school (if you have one available) and then to college. As the colonists get older they then start working and establishing businesses and earning what they need for living. If there are no jobs available and they have no cash, they will move away unless you provide them with unemployment benefit.      \n      \nThe practical skills and knowledge of workers and managers affects to how efficiently the work is done. If you have skilled workforce in a factory, for example, it will produce more than a factory with less skilled workforce. If you like, you can allow your colonists to became private business owners. In this case they will send you building requests and you then decide, which private businesses are allowed.      \n      \nTo be able to operate defense systems and to build buildings owned by the public sector you need to collect taxes. The tax model can be flexibly chosen from anything between flat tax to a progressive tax model, in which rich colonists pay more taxes than the poor ones.      \n      \nMany kind of natural resources can be found from the planet. Carbon-based life that has existed there for hundreds of millions of years has created deposits of organic natural resources and even oil can be found and drilled from below the surface. However, the explorers will occasionally bump into alien lifeforms that live on the planet and they can be troublesome sometimes.      \n      \nIf the colonists can’t find or produce the necessary items they need, they can buy them from the Interplanetary Exchange. Funding for the purchases is also available from the Interplanetary Bank system as long as the colony doesn’t exceed its credit limit.","popularity":1.666666666666667,"games":[23212,54996,25311,8773,11582,11205,23345,9789,50790,34823],"tags":[18,28,33,41,268435467,268435469,268435471,536870915,536870963,536870984,536871561,536872586,536872914,536874234,1073741827],"developers":[12067],"game_engines":[439],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[3,51,72,649,1674,2002,3322],"themes":[18,28,33,41],"genres":[11,13,15],"status":4,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lseq0jye9m2tzebmg1b4.jpg","cloudinary_id":"lseq0jye9m2tzebmg1b4","width":1200,"height":551},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tcww33sacgld7iwjtkx0.jpg","cloudinary_id":"tcww33sacgld7iwjtkx0","width":767,"height":538},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qlleut93dmlcfpixsmjm.jpg","cloudinary_id":"qlleut93dmlcfpixsmjm","width":1200,"height":675},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j5ffcdrgnpp88g6bj31n.jpg","cloudinary_id":"j5ffcdrgnpp88g6bj31n","width":1200,"height":675},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tudoezdzhbwsa8h28yud.jpg","cloudinary_id":"tudoezdzhbwsa8h28yud","width":981,"height":522},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ekyqnszkd0bfsaeuiusw.jpg","cloudinary_id":"ekyqnszkd0bfsaeuiusw","width":1200,"height":675},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/grlyzjlghbto9cpd7jcv.jpg","cloudinary_id":"grlyzjlghbto9cpd7jcv","width":981,"height":522}],"videos":[{"name":"Teaser","video_id":"sFWjhAdxWF8"},{"name":"Trailer","video_id":"P1sLZUvnKO8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/svcdznugvlh1iesytzmj.jpg","cloudinary_id":"svcdznugvlh1iesytzmj","width":264,"height":372},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCQ8WXXBPgnPaelz48UyhJRw"},{"category":5,"url":"https:\/\/twitter.com\/plcolonization"},{"category":4,"url":"https:\/\/www.facebook.com\/planetcolonization"},{"category":1,"url":"http:\/\/www.planetcolonization.com\/"}]}