{"id":3020,"name":"Shadowrun Returns","slug":"shadowrun-returns","url":"https:\/\/www.igdb.com\/games\/shadowrun-returns","created_at":1381781246790,"updated_at":1546825801299,"summary":"The year is 2054. Magic has returned to the world, awakening powerful creatures of myth and legend. Technology merges with flesh and consciousness. Elves, trolls, orks and dwarves walk among us, while ruthless corporations bleed the world dry. You are a shadowrunner – a mercenary living on the fringes of society, in the shadows of massive corporate arcologies, surviving day-by-day on skill and instinct alone. When the powerful or the desperate need a job done, you get it done… by any means necessary. \n \n \n \nThe unique cyberpunk-meets-fantasy world of Shadowrun has gained a huge cult following since its creation nearly 25 years ago. Now, creator Jordan Weisman returns to the world of Shadowrun, modernizing this classic game setting as a single player, turn-based tactical RPG. \n \n \n \nWith the Shadowrun Returns Editor, everyone is empowered to create and share their own stories and campaigns with the Steam Workshop community. You can even explore the entire Shadowrun Returns Seattle campaign in the Editor directly – see how it was built and borrow as much as you need to jump-start your own creations! No advanced coding or art skills are required to create content using the SRR Editor.","storyline":"The player assumes the role of a shadowrunner who has fallen onto hard times since his or her last shadowrun in 2050. One of the player's teammates from that mission, Sam Watts, sends a pre-recorded video message to the player, where he reveals that he is likely dead, and that his final wish is that the player find whomever killed him. He also announces that he has 100,000 nuyen being held in escrow for the player should he bring whomever was responsible for his death to justice. Knowing that Sam resides in Seattle, the player travels to the city to begin their investigation. \nUpon arriving in Seattle and visiting the morgue where Sam's body is being examined, the player discovers that Sam is the latest victim of the Emerald City Ripper, a serial killer who has been surgically removing organs from his or her victims. The Runner soon enlists the help of one of Sam's friends to help find the killer; Jake Armitage, returning from the SNES Shadowrun game. Jake soon leaves the party as he is being hunted by multiple gangs and corporations over an unrelated shadowrun and must go into hiding, but he points the player to the scene of the crime, and to further leads that could help break the case open. Soon afterwards, the player meets Coyote, a female elf bartender\/shadowrunner who is waging a private war against \"Better-Than-Life\" (\"BTL\") chips and those who trade them. She was a friend of Sam's as well; together they follow the Ripper as he commits more murders across Seattle. During their investigation they assist the more cooperative police officers assigned to the case, as well as the friends and family of the Ripper's victims (including Sam's sister, Jessica Watts), as they attempt to find and identify the Ripper. \nTheir pursuit eventually leads them to Mercy Mental Hospital, where they find that a male elf named Silas Forsberg has taken the identity of the original administrator. Silas has been using the facility as a front for his organ harvesting operation; not only in his role as the Ripper, but also for financial gain (both by selling organs from unrelated victims to street clinics, and by brainwashing particular inmates at the hospital and then selling them as sex slaves). After killing Silas, the player learns he was directed to commit the Ripper murders by another party. They quickly determine that Jessica Watts commissioned Silas to commit the crimes, based partially on an earlier admission that she had been estranged from her brother. Sam and Jessica had lived a comfortable life before their father's passing, and despite his best efforts early on to live a decent life, he cracked under the pressure and spent the family savings on drugs and alcohol. He eventually became a shadowrunner to make ends meet, and to further fuel his self-destructive habits. \nWhen the player confronts Jessica at Sam's funeral Jessica reveals she had indeed ordered her brother's death, and the deaths of the other Ripper victims so her mother could have a proper funeral. She subsequently snaps and orders her bodyguards to kill the player, Armitage (who has briefly come out of hiding to pay his respects) and Coyote. The bodyguards fail, but she and a mysterious elf woman escape. While going over the dead bodies, the party discovers that Jessica is a member of the Universal Brotherhood, which is well known as an international new age spiritualism organization that attracts rich and poor alike. They also discover that the elf at the funeral was Lynne Telestrian; not only is she a high-ranking Brotherhood member, but her family manages Telestrian Industries. Between the corporation and to a lesser extent the Brotherhood, and she and the rest of her kin are extremely wealthy and influential. Armitage, not wanting to get himself in further trouble with the powers that be, goes back into hiding after discovering this. \nThe player and Coyote track Jessica to the Brotherhood chapter near Pike's Market. While Coyote waits outside, the player cases the building and discovers that the Brotherhood are very heavily armed and have been involved in the disappearances of several individuals. Letting Coyote into the building via the service entrance, they break into the \"inner sanctum\" of the facility and discover that the Universal Brotherhood is itself a front for an insect spirit hive. The runners also meet Jessica again, who is says she is quite aware of the Brotherhood's true nature. The team rescues a young elf woman before escaping the facility, finding that they are unable to kill the these exotic spirits with their current weapons. \nThe woman however connects the team with her boyfriend, a decker named Baron Samedi. Under his directions, the team infiltrates Telestrian Industries, as they were working on Project Aegis; a chemical weapon capable of killing spirits easily. The operation is not successful, however, and the player is forced to infiltrate the company a second time alone in order to retrieve the only sample of the Aegis compound. The player acquires the sample but is captured while trying to escape. Given the importance and secrecy assigned to Aegis, the player is brought before the owner of the company, James Telestrian. \nHere the player learns the truth behind Sam Watts and his sister; that they were both half breed children of the Telestrian bloodline, the product an affair between James' father and Sam's mother. To prevent the truth of the affair from becoming public knowledge, the senior Telestrian paid Sam's mother handsomely and they \"officially\" became the offspring of James Watts, another employee at Telestrian Industries. This is important as the young woman who the player rescued from the Brotherhood is actually James' daughter. Jessica, who is also revealed to be the insect shaman of the hive, had become aware of the connection and was going to use the close familial connection help aid her in bridging over a Queen insect spirit into the real world. Also at the mansion is the immortal elf Harlequin, who discusses how insect spirits need to inhabit bodies of sapient life forms to exist in the material world, and also states that the existence of a Queen in the real world be disastrous. Volunteering to help destroy the hive, Harlequin joins the player and his team a the final raid on the Brotherhood chapter. Telestrian gives the player, and Harlequin, each a shotgun able to fire capsules filled with the Aegis compound. Before they leave, the player also discovers that Lynne Telestrian is as fully committed to the hive as Jessica, if not more so. Her loyalty to the Brotherhood led her to blow up the Telestrian Industries factory producing Aegis recently, not only estranging her from James but also leaving the sample and the prototype weapons the only articles remaining from the project. \nThe team infiltrates the hive and they fight their way into the heart of the inner sanctum. There they discover Jessica and Lynne Telestrian in a magical circle; since James' daughter was taken out of their reach and thus can no longer become the host for the Queen, Lynne has volunteered herself to be the host and they are in the process of completing the ritual. The team disrupts the summoning by seriously wounding Jessica and killing most of the insect spirits inside the hive, a feat made possible due to the Aegis weapons. The queen spirit abandons Jessica, and the player is given the option to kill her or arrest her. Lynne survives, but is arrested and eventually sent to a mental hospital. \nThe game concludes with Armitage, Coyote, Harlequin and James Telestrian discussing the fallout of the raid, with Harlequin musing that other Brotherhood chapters across the world also hold hives similar to the one in Seattle. Having satisfactorily solved the circumstances of Sam's death, the player attempts to collect the money he left. Sam's second message congratulating the player asks him to apologize to Jessica for what he put her through, and that he never actually had any money in escrow, and suggests the player ask the people he and his family knew for a reward of some kind, which the player does at a 1,5 million Nuyen payment, garnished after the assault on Telestrian industries to a mere 15,000 Nuyen payout. The player could also ask for the same money Sam promised, a position as Security VP (making them a company man for Telestrian), the resignation of a particular officer or preserving Touristville. \nIn the epilogue following Sam's last message, the game reveals that Aegis was eventually developed into a product called \"Fluorescing Astral Bacteria-3\", or \"FAB-3\". As per the history of the pen-and-paper game Shadowrun Returns is based on, the destruction of the Chicago Universal Brotherhood hive is botched and the city is largely sealed up behind a wall to keep the rampaging insect spirits inside the city. FAB-3 is used some time later to cleanse Chicago of its insect spirit infestation. \n \n- Credits: Wikipedia","collection":554,"franchise":127,"franchises":[127],"rating":81.82991591877129,"popularity":5.333333333333333,"aggregated_rating":72.5,"aggregated_rating_count":11,"total_rating":77.16495795938565,"total_rating_count":69,"rating_count":58,"games":[1593,1962,9806,22387,2114,9938,9278,14394,3025,10126],"tags":[1,17,18,22,268435468,268435471,268435472,268435487,268435488,536870969,536871008,536871015,536871018,536871029,536871041,536871059,536871076,536871134,536871138,536871208,536871213,536871327,536871337,536871338,536871501,536871504,536871882,536871938,536872070,536872073,536872335,536872406,536872435,536872550,536872609,536872712,536872978,536873338,536873772,536874134,536874136,536874694,536874810,536875046,536875050,536875060,536875067,536875083,536875095,536875160,536875161,536875184,536875187,536875192,536875196,536875229,536875265,536875326,536875361,536875460,536875485,536875501,536875510,536875531,536875689,536875700,536875735,536875741,536875743,536875766,536875774,536875779,536875792,536875819,536875869,536875901,536875923,536876083,536876084,536876097,536876174,536876221,536876273,536876276,536876292,536876301,536876314,536876332,536876363,536876366,536876396,536876414,536876429,536876461,536876537,536876576,536876586,536876617,536876666,536876704,536876705,536876711,536876712,536876723,536876748,536876811,536876814,536877211,536877222,536877318,536877363,536877373,536877769,536878349,536878417,536879059,536879062,536879154,536880218,536880270,536880907,1073741827],"developers":[1419],"publishers":[1419],"game_engines":[13],"category":0,"time_to_beat":{"normally":50400,"completely":190800},"player_perspectives":[3],"game_modes":[1],"keywords":[57,96,103,106,117,129,147,164,222,226,296,301,415,425,426,589,592,970,1026,1158,1161,1423,1494,1523,1638,1697,1800,2066,2426,2860,3222,3224,3782,3898,4134,4138,4148,4155,4171,4183,4248,4249,4272,4275,4280,4284,4317,4353,4414,4449,4548,4573,4589,4598,4619,4777,4788,4823,4829,4831,4854,4862,4867,4880,4907,4957,4989,5011,5171,5172,5185,5262,5309,5361,5364,5380,5389,5402,5420,5451,5454,5484,5502,5517,5549,5625,5664,5674,5705,5754,5792,5793,5799,5800,5811,5836,5899,5902,6299,6310,6406,6451,6461,6857,7437,7505,8147,8150,8242,9306,9358,9995],"themes":[1,17,18,22],"genres":[12,15,16,31,32],"standalone_expansions":[8864,22652],"first_release_date":1374710400000,"pulse_count":10,"platforms":[34,6,39,14,3],"release_dates":[{"category":0,"platform":6,"date":1374710400000,"region":8,"human":"2013-Jul-25","y":2013,"m":7},{"category":0,"platform":14,"date":1374710400000,"region":8,"human":"2013-Jul-25","y":2013,"m":7},{"category":0,"platform":34,"date":1380153600000,"region":8,"human":"2013-Sep-26","y":2013,"m":9},{"category":0,"platform":39,"date":1380153600000,"region":8,"human":"2013-Sep-26","y":2013,"m":9},{"category":0,"platform":3,"date":1383091200000,"region":8,"human":"2013-Oct-30","y":2013,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kanulnxk6ddfhwimdxfh.jpg","cloudinary_id":"kanulnxk6ddfhwimdxfh","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wl1mcnlz4g3jk1g04zbe.jpg","cloudinary_id":"wl1mcnlz4g3jk1g04zbe","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uhuvzs56bdawlhbpi3zu.jpg","cloudinary_id":"uhuvzs56bdawlhbpi3zu","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/z3sjobb5d8d524jhxboj.jpg","cloudinary_id":"z3sjobb5d8d524jhxboj","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dvijeekmcfbtcx7nlii9.jpg","cloudinary_id":"dvijeekmcfbtcx7nlii9","width":1920,"height":1200}],"videos":[{"name":"Trailer","video_id":"mg2Zkr4VNUU"},{"name":"Trailer","video_id":"UFYsQ0M2Jrg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bozgqmmoadpl6jzyrej7.jpg","cloudinary_id":"bozgqmmoadpl6jzyrej7","width":661,"height":839},"esrb":{"rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\r\nIt contains: Non realistic looking violence towards human characters - Mild bad language","rating":3},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.harebrainedschemes.shadowrun&hl=en&gl=us"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/234650"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Shadowrun_Returns"},{"category":2,"url":"http:\/\/shadowrun.gamepedia.com\/Shadowrun_Returns"},{"category":1,"url":"http:\/\/harebrained-schemes.com\/shadowrun\/"}],"external":{"steam":"234650"}}