{"id":40720,"name":"Bee-Ball","slug":"bee-ball","url":"https:\/\/www.igdb.com\/games\/bee-ball","created_at":1498483197467,"updated_at":1528642731006,"summary":"In the animal kingdom, bees are widely known as efficient workers. But there's an interesting fact that we as humans don't know--bees enjoy having fun! Every year bees from many places gather in one spot to play in a competitive tournament of Bee-Ball! This unique insect game is a mix of tennis and volleyball where bees hit a honey ball over a net using a racquet. A bee judge watches over the match and serves new balls as needed. If the ball touches the floor or flies out of bounds, a point is scored. Avoid fouling the ball out, use your dexterity to block your opponent's shots, slam the ball to score, learn new tactics to outwit your opponent, and you could be the next Bee-Ball champion! \n \nIn the competitive sport of Bee-Ball, you must score 10 points against your opponent to win a match. You can swing at the ball to send it flying over to the net or block when your opponent is trying to get the ball past you. If the ball is about to fly over your head, you can head butt the ball in an attempt to prevent a point from being scored against you! Points are scored if the ball touches the floor or the ball flies out of bounds, but in order to score you must first successfully serve. \n \nBee-Ball supports single and two player play modes. In single-player mode, you compete against a challenging AI computer opponent. In two-player mode you can compete head-to-head against a friend!","popularity":1.333333333333333,"games":[11588,25222,60044,25217,19083,58129,14047,26223,80330,76755],"tags":[268435465,268435482,536873513,536873787,536875051],"category":0,"keywords":[2601,2875,4139],"genres":[9,26],"first_release_date":1170288000000,"platforms":[59],"release_dates":[{"category":0,"platform":59,"date":1170288000000,"region":8,"human":"2007-Feb-01","y":2007,"m":2}],"videos":[{"name":"Gameplay video","video_id":"GJbDPHG3l84"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/trykn3xicq13iusxb5un.jpg","cloudinary_id":"trykn3xicq13iusxb5un","width":528,"height":260}}