{"id":42020,"name":"Blood Gear","slug":"blood-gear","url":"https:\/\/www.igdb.com\/games\/blood-gear","created_at":1499067052274,"updated_at":1516767588436,"summary":"The Deguna Empire is terrorizing the planets and their inhabitants, using their unbeaten military force consisting of \"Powered Gears\", giant combat robots piloted by human fighters from the inside. One day, a squad of Empire robots assaulted a laboratory, in which two scientists were working on their own Powered Gear project. One of the scientists, heavily wounded, still managed to deliver a Powered Gear control device to his young apprentice Aref, before he died from his wounds. Enraged, Aref swears revenge to the Empire and everything it represents. With his own new Powered Gear, and perhaps a few allies who think alike, the idea might not be as suicidal as it sounded first... \n \nBlood Gear is a role-playing game with action-based combat. The general gameplay system is somewhat similar to that of the Exile series: town exploration is performed from the standard \"RPG-like\" top-down view, while all hostile areas are presented as side-scrolling levels, sometimes with elaborate platform structures. \n \nThe player fights enemy robots in real-time combat, similarly to a regular side-scrolling action game. Player-controlled Powered Gear can be equipped with a variety of weapons. Both melee and ranged weapons (pistols, assault rifles, laser guns, etc.) can be purchased in stores and\/or found while exploring hostile areas. Health is restored with repair kits of various efficiency, which can also be purchased, found, or randomly dropped by enemies.","popularity":1.333333333333333,"games":[36950,68287,25300,28751,21063,11253,27314,10039,28029,26766],"tags":[1,18,268435461,268435464,536870913,536870979,536870990,536871079,536871487,536871501,536871882,536871938,536871969,536871971,536875081,536875171,536875258,536875358],"category":0,"keywords":[1,67,78,167,575,589,970,1026,1057,1059,4169,4259,4346,4446],"themes":[1,18],"genres":[5,8],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mprt386bwrnqa2edszgi.jpg","cloudinary_id":"mprt386bwrnqa2edszgi","width":400,"height":400}}