{"id":50920,"name":"Prince of Persia: The Sands of Time Trilogy","slug":"prince-of-persia-the-sands-of-time-trilogy","url":"https:\/\/www.igdb.com\/games\/prince-of-persia-the-sands-of-time-trilogy","created_at":1500057430180,"updated_at":1516597611889,"summary":"Return to a compelling world filled with peril and adventure in the Prince of Persia Sands of Time Trilogy, containing three classic titles from the Prince of Persia universe: The Sands of Time, Warrior Within and The Two Thrones. Assume the role of the famed prince as you embark on an epic journey that will take you from boyhood to manhood. Summon your courage as you confront deadly enemies and engage in incredible battles in your quest to save your kingdom once and for all from the forces that would tear it asunder. \n \nPrepare for daring action, astonishing acrobatics and challenging puzzles as you dive into the excitement of this powerful trilogy. Become the master of your own dark powers and wield the Dagger of Time. Unleash amazing Parkour-style acrobatics to vault past obstacles in your path, and use the deadly Daggertail to dangerous effect in combat. Ensure your safety and that of your kingdom by evading the Dahaka, confronting the Empress of Time and challenging the Vizier who poses a threat to your kingdom. Will you have the strength of body and mind it will take to restore peace to your homeland? \n \nPrince of Persia: The Sands of Time \n \nPrince of Persia: Warrior Within \n \nPrince of Persia: The Two Thrones","collection":183,"popularity":1,"games":[47823,37088,23175,17001,25300,43003,16468,55092,26848,1221],"tags":[1,17,22,268435487,536871738,536871872,536871945,536875067,536875151,536875276,536875358],"category":0,"keywords":[826,960,1033,4155,4239,4364,4446],"themes":[1,17,22],"genres":[31],"first_release_date":1234396800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1234396800000,"region":8,"human":"2009-Feb-12","y":2009,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ei8qatdagtpztop4ufol.jpg","cloudinary_id":"ei8qatdagtpztop4ufol","width":500,"height":496}}