{"id":76620,"name":"Adj","slug":"adj","url":"https:\/\/www.igdb.com\/games\/adj","created_at":1512192753447,"updated_at":1512575620854,"summary":"Don't have any card games to play with your friends? Need an icebreaker over a phone conversation? Try and play Adj! It's free and no installation nor registration required! :) \n \nYour friends try to guess your chosen card, while you describe it using only adjectives, and AND and OR! No other words allowed! Say... \"big AND dark\", \"sour OR sweet, AND round, AND green\"!","storyline":"* Requires at least 2 players to play, and both should have smartphones--or any device with a browser--that have internet \n* You can set-up a mobile hotspot with your own phone if your playmates do not have internet \nWhile in the lobby, create a Player by entering a name, then click 'New Game', and enter a password. Then, share that password to your playmates. They themselves also need to create a Player, and then they would click the newly created game that will pop-up on the 'Lobby' page, and enter the password to join the game. \n* Choose your Team in the Team Selection screen, and click 'Ready'. If everyone has clicked 'Ready' already, the game will then start immediately afterwards. \n* On the \"Cards Selection\" screen, a deck of 24 random cards will be available to play, 4 of which will be drawn at the start. Turn order will be automatically assigned to each of you. You'll know if it's your turn already if you see the \"Your turn\" message at the very top, just right above the cards. If you do not see it, then it is currently someone else's turn. \nIf it's your turn, talk with your teammates, and decide wisely which of the four back-facing cards you are going to choose and have them guess. Upon clicking (selecting) a card, it will flip and reveal itself only on your screen, and won't show up to the other players. The timer countdown would then immediately start to tick. \n  - The \"Bomb\" icon means that the time-limit is 15 seconds, half of the normal 30 seconds. \n  - The \"Question\" icon means that the card can be ANY category. This card therefore is a lot harder to guess, but is why it has +2 extra stars count than its normal supposed value \n  - The \"Stars\" represent the 'unpopularity' of the card (as evaluated by Google Trends: 0-33 = 3 stars; 34-66 = 2 stars; 67-100 = 1 star). Each star gives +1 point to your score. Therefore, if you managed to guess a 3-star card, then your team will get +3 points. \n* As the timer ticks, you should describe the card through adjectives, AND, and OR only. You need to be fast! reactive! and... imaginative! :) No nouns and verbs allowed! Example... \"Animal: small AND black OR white AND furry\". Guess what? a cat! :D \n* Your teammates can try to guess as much as they want within the time limit. If they didn't succeed, then the other teams each have just one chance to guess the card. Should everyone guessed incorrectly, then no points shall be given. \n* After all cards have been used up, the highest scoring team will be the winner! That's just about it! :) Enjoy!","popularity":11,"games":[13189,25222,236,27725,26239,28751,11588,54639,11679,52432],"tags":[40,268435458,536871850,536872991,536873297,536873304,1073741825],"category":0,"player_perspectives":[1],"game_modes":[2,3],"keywords":[938,2079,2385,2392],"themes":[40],"genres":[2],"first_release_date":1511654400000,"platforms":[82],"release_dates":[{"category":0,"platform":82,"date":1511654400000,"region":8,"human":"2017-Nov-26","y":2017,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yq4saee0dkfg1tllrlv2.jpg","cloudinary_id":"yq4saee0dkfg1tllrlv2","width":2880,"height":1800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xb2romzah2gpxyyvrxka.jpg","cloudinary_id":"xb2romzah2gpxyyvrxka","width":1440,"height":2560},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o2qopwfzmz6yqysxmxtx.jpg","cloudinary_id":"o2qopwfzmz6yqysxmxtx","width":1440,"height":2560}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ulnggqcxarku6pkbr0v4.jpg","cloudinary_id":"ulnggqcxarku6pkbr0v4","width":519,"height":519},"websites":[{"category":5,"url":"https:\/\/twitter.com\/JRPolidario"},{"category":4,"url":"https:\/\/www.facebook.com\/playadj.io"},{"category":1,"url":"https:\/\/playadj.io\/"}],"multiplayer_modes":[{"platform":82,"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"onlinecoopmax":99,"onlinemax":99},{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false},{"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"onlinecoopmax":9999,"onlinemax":9999}]}