{"id":8320,"name":"Psychotoxic","slug":"psychotoxic","url":"https:\/\/www.igdb.com\/games\/psychotoxic","created_at":1418470082925,"updated_at":1513086762915,"summary":"This was the only game developed by NuClearVision before it closed its doors shortly after its release due to its overwhelmingly negative reception.","storyline":"NEW YORK 2022 - An international crisis shakes the world order. Cities crumble, wars rage on all continents. The USA is in a state of emergency. Public order can only be maintained with the help of the military. Amidst this madness there is Angie Prophet. Angie is a very attractive young woman who was raised an orphan by her Aunt Julie in Brooklyn New York. A few years ago she moved to Washington to live her own life. Her employment at the Devil's Inn, a name that commands considerable respect toughened her up.  \n \nShortly before Christmas the doorbell rang and she was dragged into a wild, unexpected adventure that would change her life forever. Although Angie could certainly imagine more pleasant things, it is her task to prevent the bombing of New York with thermonuclear weapons. In order to prevent this she must battle the Fourth Horseman of the Apocalypse, a mystical machine from Ancient Babylon. The Fourth Horseman is located in a series of caves beneath New York City, where he is constantly producing microscopic nanobots. These nanobots spread rapidly around the world and are programmed to increase the potential for human violence by manipulating certain parts of the brain. Angie's worldly opponent is the satanic Aaron Crowley, the man who activated the Fourth Horseman. His influence extends all the way to the top of the US government and he does not hesitate to use this power against Angie in order to prevent the Horseman from being destroyed. In the course of the game, Angie will discover why she is the only one who can stop the Fourth Horseman and why she possesses peculiar powers that will be essential to complete her task. In order to overpower the superior numbers of her enemy Angie finds a virtual sidekick Max on her side. Angie must fight her way through 19 levels in the real world and through 10 dream levels with different themes before she reaches her biggest challenge: the final battle with the Fourth Horseman and Aaron Crowley. On the way to her destination Angie must face zombies, cyborgs with flamethrowers, insane policemen and FBI-agents, deep sea monsters and psycho killers to name but a few.  All in all she will meet more than 90 different enemies and she will have 19 weapons to fight them with.","popularity":1.333333333333333,"games":[68287,27314,142,36950,28029,64204,71455,29525,28751,25300],"tags":[1,18,268435461,536871365,536871378,536871835,536871874,536871882,536871937,1073741825],"developers":[4244],"publishers":[1477,157],"game_engines":[45],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[453,466,923,962,970,1025],"themes":[1,18],"genres":[5],"first_release_date":1109548800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1110758400000,"region":2,"human":"2005-Mar-14","y":2005,"m":3},{"category":0,"platform":6,"date":1109548800000,"region":1,"human":"2005-Feb-28","y":2005,"m":2}],"alternative_names":[{"name":"Психотоксик: Врата Ада","comment":"Russian title"},{"name":"Psychotoxic: The 4th Horseman","comment":"Working title"},{"name":"Psychotoxic: Gateway to Hell","comment":"Working title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/en87b5jkznzipdxytenr.jpg","cloudinary_id":"en87b5jkznzipdxytenr","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r68hbm1ev0afcvghxgy7.jpg","cloudinary_id":"r68hbm1ev0afcvghxgy7","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qhojfqlsayuezq53pheu.jpg","cloudinary_id":"qhojfqlsayuezq53pheu","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jfv10x8mzlvnnsffp402.jpg","cloudinary_id":"jfv10x8mzlvnnsffp402","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fr734hmxdiqwktsgrakb.jpg","cloudinary_id":"fr734hmxdiqwktsgrakb","width":1024,"height":768}],"videos":[{"name":"Trailer","video_id":"NWrNhH78Q8Q"},{"name":"Trailer","video_id":"ZMBPPAjcoxg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kzftjl4ayrer8kjal39w.jpg","cloudinary_id":"kzftjl4ayrer8kjal39w","width":897,"height":1286},"esrb":{"rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\r\nIt contains: Realistic looking violence.","rating":4}}