{"id":86720,"name":"Blackjack 21: Casino Card Game","slug":"blackjack-21-casino-card-game","url":"https:\/\/www.igdb.com\/games\/blackjack-21-casino-card-game","created_at":1518601430621,"updated_at":1518700993386,"summary":"Blackjack 21 is an exciting game that any player is sure to enjoy. Place a bet, get more points than the dealer and win chips. Feel the risk as you dive into a casino atmosphere and catch fortune by the tail. \n\nBlackjack is also know as 21 or twenty-one is a widely played casino banking game. \n\nBlackjack is one of the easiest games to play in a casino and offers you one of the strongest odds of winning. Without a doubt, it is the most popular table game in the United States. \n\nThe objective of the game is to beat the dealer. In order to beat the dealer, you need to get cards that get you close to 21, but not over. While not going over 21, you have to outscore the dealer or have him go bust. \n\nWhen the game of blackjack 21 starts the player is dealt with a two cards and add together the value of their cards. The Face cards which are kings, queens and jacks are counted as 10 points. The dealer and the player count an ace as 1 point or 11 points, and all other cards are counted according to the numeric value shown on the card. The players after receiving their first two cards, have an option of getting a hit by taking an additional card, Stand, Double or Split. The player or the dealer wins by having a score of 21 or by having the higher score that is less than 21. \n\nHaving a score higher than 21 is going bust or called busting which will result in a loss. The player playing blackjack 21 can win by having any score equal to or less than 21 if the dealer 'busts'\n\nBlackjack is most certainly a game of decisions, and what you decide has an effect on your outcome. \n\nWith our Blackjack 21, you can sit in the comfort of your home, without the risk of losing all your money.\n\nSo what are you waiting for? Sharpen your Blackjack 21 skills before visiting the casinos and win those big bets!! \n\nTry Blackjack 21 HD today– just make sure you don’t exceed 21 points!\n\nDownload it today! \n\n**** Blackjack 21 Features ****\n\n1. Split and Double to win big bets\n3. Intuitive Gameplay and Interface\n3. Insurance\n\nPlease take your time to rate your experience with this addictive game Blackjack 21 and write a short Review.\n\nWe will be grateful to hear your opinions and improve - whenever needed - in future versions.\n\nHave a nice time using Blackjack 21!","rating":20,"popularity":1,"total_rating":20,"total_rating_count":0,"rating_count":0,"games":[95679,91038,91010,90981,90964,89131,89098,88867,88817,88781],"tags":[536871523,536874083],"category":0,"keywords":[611,3171],"first_release_date":1513123200000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1513123200000,"region":8,"human":"2017-Dec-13","y":2017,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uiqn1errvjh1o0ij2cjy.jpg","cloudinary_id":"uiqn1errvjh1o0ij2cjy","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gjjkwqoj6v3uro63yn3d.jpg","cloudinary_id":"gjjkwqoj6v3uro63yn3d","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m5fw8gtoizope1z7u7zl.jpg","cloudinary_id":"m5fw8gtoizope1z7u7zl","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nqssuxcnbsdvslksstzh.jpg","cloudinary_id":"nqssuxcnbsdvslksstzh","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d2fa1bt9c5jqxnjtxz9a.jpg","cloudinary_id":"d2fa1bt9c5jqxnjtxz9a","width":512,"height":512}}