{"attributes":{"content-rating":{"content-descriptors":[{"description":"Fantasy Violence","name":"Fantasy Violence","url":null}],"contentInteractiveElement":[],"rating-system":"ESRB","url":"https:\/\/cdn-a.sonyentertainmentnetwork.com\/grc\/images\/ratings\/hd\/esrb\/e.png"},"content-type":"1","default-sku-id":"","dob-required":false,"file-size":{"unit":"","value":null},"game-content-type":"Bundle","genres":[],"is-igc-upsell":false,"is-multiplayer-upsell":false,"kamaji-relationship":"bundles","legal-text":"","long-description":"In Super Stardust™ HD, your mission is simple: destroy everything in sight! Visit different planets and fend off giant asteroids and waves of enemies by utilizing three upgradeable weapons to save the solar system from total annihilation.<br><br>\r\nThis bundle includes the hit game plus the Solo and Team add-ons, all together at a discounted price. The full game features five planets to save, intense 1080p HD graphics, online rankings and Trophy support. The Solo add-on introduces three new game modes - Endless, Survival and Time Attack - plus remixed music tracks and revamped visuals. The Team Pack add-on features split-screen versus and co-op modes. Co-op mode allows two players to play through the game cooperatively, while versus multiplayer allows up to 4-player split-screen competition in modes such as Deathmatch and King of the Hill. The Team Pack also features a Ship Editor feature that allows players to customize their spacecraft, as well as enhanced visual effects. <br>\r\n<br>\r\nSuper Stardust™ HD is now available in 3D to provide the most immersive gaming experience ever, along with Simulview support in co-op, so you and a friend can view two completely different game views on the same 3D TV screen! 3D TV not required to play Super Stardust™ HD.\r\n<br><br>\r\nPurchase and use of this item is subject to the PlayStation®Network Terms of Service\/User Agreement, this item’s use restrictions, and other terms and conditions located at www.us.playstation.com\/termsofuse.  If you do not wish to accept all those terms, do not purchase this item.  One-time license fee for downloads to up to 2 console systems that are associated with the purchasing account. <br> \r\n<br>\r\nVideo output in HD requires cables and an HD-compatible display, both sold separately.  This game supports displays ranging from standard definition to 1080p displays. <br> \r\n<br>\r\nRequires PS3™ firmware v3.30 or higher. Full HD 3D television with compatible 3D active glasses and high-speed HDMI cable.\r\n<br><br>\r\nSome people may experience discomfort (such as eye strain, eye fatigue, or nausea) while watching 3D video images or playing stereoscopic 3D games on 3D televisions. If you experience such discomfort you should immediately discontinue use of your television until the discomfort subsides.\r\n<br><br>\r\nSCE recommends that all viewers take regular breaks while watching 3D video, or playing stereoscopic 3D games. The length and frequency of necessary breaks may vary from person to person – please take breaks that are long enough to allow any feelings of discomfort to subside. If symptoms persist, consult your doctor.\r\n<br><br>\r\nThe vision of young children (especially those under six years old) is still under development. Consult with a doctor (such as a pediatrician or eye doctor) before allowing a young child to watch 3D video images or play stereoscopic 3D games.\r\n<br><br>\r\nSuper Stardust™ HD ©2007 Sony Computer Entertainment Europe.  Developed by Housemarque OY.  Super Stardust is a trademark of Sony Computer Entertainment Europe.","macross-brain-context":"game","media-list":{"preview":[],"promo":{"images":[],"videos":[]},"screenshots":[]},"name":"Super Stardust™ HD Game Bundle","nsx-confirm-message":"","parent":null,"platforms":["PS3"],"primary-classification":"DOWNLOADABLE_GAME","provider-name":"Sony Interactive Entertainment","ps-camera-compatibility":"incompatible","ps-move-compatibility":"incompatible","ps-vr-compatibility":"incompatible","release-date":"2008-10-09T00:00:00Z","secondary-classification":"GAME","star-rating":{"score":null,"total":null},"subtitle-language-codes":[],"tertiary-classification":"BUNDLE","thumbnail-url-base":"https:\/\/store.playstation.com\/store\/api\/chihiro\/00_09_000\/container\/US\/en\/999\/UP9000-NPUA80068_00-SSHD_GAME_BUNDLE\/1520398302000\/image","top-category":"downloadable_game","voice-language-codes":[]},"id":"UP9000-NPUA80068_00-SSHD_GAME_BUNDLE","relationships":{"children":{"data":[]},"legacy-skus":{"data":[]}},"type":"game"}