{"attributes":{"content-rating":{"content-descriptors":[],"contentInteractiveElement":[],"rating-system":"ESRB","url":"https:\/\/cdn-a.sonyentertainmentnetwork.com\/grc\/images\/ratings\/hd\/esrb\/e.png"},"content-type":"1","default-sku-id":"","dob-required":false,"file-size":{"unit":"","value":null},"game-content-type":"PSN Game","genres":["Racing","Simulation"],"is-igc-upsell":false,"is-multiplayer-upsell":false,"kamaji-relationship":"extras","legal-text":"","long-description":"Experience Gran Turismo™ HD Concept, the first installment of the world renowned Gran Turismo franchise on the PLAYSTATION®3 system. Developed by Polyphony Digital, Gran Turismo HD Concept delivers an unparalleled racing experience in full HD 1080p* resolution with next-generation graphics and physics. Race ten cars from worldwide manufacturers, including the Gran Turismo debut of Ferrari. Now available as a FREE download for a limited time only, exclusively on the PLAYSTATION®Store.<br>\r\n<br>\r\n•\tAll-New Eiger Nordwand Circuit: The challenging alpine track features breathtaking views of the Swiss Alps. <br>\r\n•\tCompete in Time Trial Mode: Beat target lap times to unlock cars, including the Infiniti G35 Coupe, Lotus Elise 111R, Ferrari 599, and more. <br>\r\n•\tAuthentic Driving Experience: Each car features realistic characteristics with precise handling and performance.<br>\r\n•\tNew Drift Trial Mode: Speed takes a back seat to style, as you try and master the art of drifting to achieve ultimate control of your cars. <br>\r\n•\tPLAYSTATION®Network Functionality: Upload times, save replays, and view the Top 10 rankings for each car and mode. <br>\r\n•\tForce Feedback Compatible: Now fully compatible with Logitech®'s Driving Force™, Driving Force™ Pro, and Driving Force™ EX steering wheels. <br>\r\n<br>\r\n<b>Terms of Use<\/b><br>\r\nUse of “Gran Turismo™ HD Concept” (the “Software”) is subject to the PLAYSTATION®Network Terms of Service\/User Agreement. If you do not wish to accept all these terms, do not use this item. The Software download service is offered on a limited time basis. An advance notice of service termination is given on PlayStation® Store. The ranking service for the Software may be discontinued or suspended as necessary.  <br>\r\n<br>\r\nProduced under license of Ferrari Spa.<br>\r\nFERRARI, the PRANCING HORSE device, all associated logos and distinctive designs are trademarks of Ferrari Spa.<br>\r\nThe body designs of the Ferrari cars are protected as Ferrari property under design, trademark and trade dress regulations. <br>\r\n<br>\r\n© Sony Computer Entertainment Inc. All manufacturers, cars, names, brands and associated imagery featured in this game are trademarks and\/or copyrighted materials of their respective owners. All rights reserved. Any depiction or recreation of real world locations, entities, businesses, or organizations is not intended to be or imply any sponsorship or endorsement of this game by such party or parties. \"PlayStation\", \"PLAYSTATION\", \"PS\" Family logo and \"PDI logo\" are registered trademarks and Gran Turismo is a trademark of Sony Computer Entertainment Inc.<br> \r\n<br>\r\nFull HD 1080p requires an HDMI cable and a 1080p native display with an HDMI input supporting HDCP. This game supports displays ranging from standard definition to 1080p displays.  ","macross-brain-context":"game","media-list":{"preview":[],"promo":{"images":[],"videos":[]},"screenshots":[]},"name":"Gran Turismo™ HD Concept v1.2","nsx-confirm-message":"","parent":null,"platforms":["PS3"],"primary-classification":"DOWNLOADABLE_GAME","provider-name":"Sony Interactive Entertainment","ps-camera-compatibility":"incompatible","ps-move-compatibility":"incompatible","ps-vr-compatibility":"incompatible","release-date":"","secondary-classification":"GAME","star-rating":{"score":4.25,"total":4},"subtitle-language-codes":[],"tertiary-classification":"NA","thumbnail-url-base":"https:\/\/store.playstation.com\/store\/api\/chihiro\/00_09_000\/container\/US\/en\/999\/UP9000-NPUA80019_00-GTHDCONCEPT00300\/1530212539000\/image","top-category":"downloadable_game","voice-language-codes":[]},"id":"UP9000-NPUA80019_00-GTHDCONCEPT00300","relationships":{"children":{"data":[]},"legacy-skus":{"data":[]}},"type":"game"}