{"id":11822,"name":"Beach Life","slug":"beach-life","url":"https:\/\/www.igdb.com\/games\/beach-life","created_at":1440790877198,"updated_at":1540669225506,"summary":"Beach Life (known as Spring Break in North America) is a business strategy video game for Windows developed by Deep Red Games. The game was published by Eidos Interactive and released on September 6, 2002. In the game, players assume the role of a manager for an island holiday resort. As vacationers enjoy their stay at the resort, players must build, employ, and finance the right lodging, entertainment, and shopping establishments to please the clients and their individual needs.\n\n\nGAMEPLAY:\nBeach Life is a business simulation game in the same vein as Theme Park and Rollercoaster Tycoon. In the game, the player manages an Ibiza-style holiday resort, complete with themed clubs, bars, and surf shops. Through learning what their guests want from their stay, different kinds of attractions and food and drink establishments can be built to satisfy their needs and make more money. Staff can be hired to help facilitate this, such as cleaners, mechanics, and security guards.\n\nGameplay options themselves come in two forms: the Scenario mode and the Sandbox mode. In Scenario mode, the player works their way through island after island, completing a number of set objectives in each. Their progress on a resort can be hampered by hazards such as shark attacks and thunderstorms, all while they build attractions and cater to the needs of the guests. Once they have beaten a level in Scenario mode, they can unlock it in Sandbox mode. Sandbox mode is essentially a \"free-play\" mode, where there are no objectives, unlimited time and more building options.\n\n\nAUDIO:\nThe game's soundtrack consists of twelve licensed tracks from genres ranging from chillout to dance music, and changes tone throughout the day. For example, calming music tends to play during the daytime, while more lively dance and trance music comes on at night to fit the nightclub atmosphere. The music can be changed in-game via a music player located in the bottom right of the screen. Additionally, users can add music from their own collection to the game by copying music files into the game's soundtrack folder.\n\n\nDEVELOPMENT:\nBeach Life was developed by Deep Red Games, a studio which had developed the critically well-received Monopoly Tycoon soon before the release of Beach Life. After attending a press presentation on the game, PC Gamer's editor-in-chief Rob Smith was impressed with Beach Life‍‍ '​‍s isometric graphics and compared them to Commandos 2: Men of Courage. The game was initially slated for a Spring 2002 release but was not released until September 2002.\n\nRECEPTION:\nCritically, the game was not extremely well received, with reviewers rarely giving over 70%. This was mainly due to a perceived unoriginality in the core gameplay mechanics, which do strikingly resemble most other business management sims. The original idea of resort management is often dismissed as being gimmicky.\n\nHowever, the game is not without a wide fanbase, who appreciate the kooky sense of humor that the game has and its youthful, energetic spin on business management compared to most other games of the same genre.","popularity":2.666666666666667,"aggregated_rating":60,"aggregated_rating_count":1,"total_rating":60,"total_rating_count":1,"games":[44242,79134,98753,25311,18623,31515,29173,33603,76397,36553],"tags":[28,33,268435469,268435471,536871249,536871624,536872760,536872761,536872762,536872763,536872764,536872765,536872766,536872767,536872768,1073741827],"developers":[6341],"publishers":[3994],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[337,712,1848,1849,1850,1851,1852,1853,1854,1855,1856],"themes":[28,33],"genres":[13,15],"first_release_date":1031270400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1031270400000,"human":"2002-Sep-06","y":2002,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/opiqgsz0jafpkr69c5qd.jpg","cloudinary_id":"opiqgsz0jafpkr69c5qd","width":512,"height":384},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bmbjsghky2qqeflf0vfh.jpg","cloudinary_id":"bmbjsghky2qqeflf0vfh","width":800,"height":603},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/epwilcreuarkhzhhx0kg.jpg","cloudinary_id":"epwilcreuarkhzhhx0kg","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rvpevropfxwflrcetdlp.jpg","cloudinary_id":"rvpevropfxwflrcetdlp","width":600,"height":450},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/arvgelc2sxawjbc8z3an.jpg","cloudinary_id":"arvgelc2sxawjbc8z3an","width":1024,"height":768}],"videos":[{"name":"Gameplay video","video_id":"t66OphnY8yI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/riiidbg0dlju0gi8wece.jpg","cloudinary_id":"riiidbg0dlju0gi8wece","width":214,"height":302}}