{"id":51822,"name":"Hard West Collector's Edition","slug":"hard-west-collectors-edition","url":"https:\/\/www.igdb.com\/games\/hard-west-collectors-edition","created_at":1500676154642,"updated_at":1515493975498,"summary":"Hard West is a turn-based tactical game developed by CreativeForge Games and published by Gambitious Digital Entertainment. It was released digitally on November 18, 2015 for Microsoft Windows, OS X and Linux. \n \nHard West takes place in a heavily fictionalized version of the American Old West following standards of the Western genre but with the addition of supernatural elements, taking inspirations from XCOM: Enemy Unknown.[1] Themes typical of the Western genre, such as bank robberies, lynching and the gold rush are commonplace in the game's world but also metaphysical beings such as Death and the Devil directly influence the lives of the local population. Creatures such as demons, ghosts and undead gunslingers are present in the game's vision of the old west. \n \nThe Collector’s Edition of Hard West comes with a comprehensive Digital Artbook, Original Digital Comic Book, and Full Original Digital Soundtrack which was mastered and composed by Marcin Przybylowicz (The Witcher 3: Wild Hunt). \n \nWelcome to the Wild West like you’ve never seen it before. When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunt down all those who wronged him. Follow Warren on his descent into the darkest recesses of the human soul, and try to survive in a world full of hard choices and even harder consequences. Because in this world, death is a constant presence and the black pacts which you make with forces beyond human comprehension will forever haunt all those around you. \nFight and survive through 8 unique story-based scenarios, and try your hand at more than40 individually designed turn-based combat missions. Journey deeper into the world of Hard West and meet a colorful cast of playable characters whose fates are intimately intertwined with yours. Together you will need to make divisive choices to uncover the ultimate plans of the ancient powers at play, as you unravel a deep narrative storyline featuring multiple endings depending on the choices you make during the game. \n \n  A Unique “Weird” West World: Explore a world where Western legends meet demons, arcane rituals and satanic cults and where the dead can walk the Earth again. For a price. \n   \nCompelling Turn-based Combat: Control 1-4 squad members in thrilling turn-based combat encounters and master a range of powerful western-inspired special abilities, from feats of gunslinging to survivability against all odds, to take out your opponents in a series of original tactical maps with unique story-based objectives. \n   \nCollect and Combine Special Abilities: Obtain new special abilities by collecting and equipping unique cards which are earned throughout the game by completing main- and optional objectives, exploration , bartering, treasure hunting and more. These cards can be combined to create even more powerful combos, and provide additional options in combat. \n   \nChoice and Fate: Experience a deep story where decisions made during and between combat scenarios will resonate through future events and change the ultimate fates of a divisive group of colourful characters. \n   \nLuck of the Draw: Use a combat system that goes far beyond pure probability by featuring luck as a unique guardian of engaging and challenging combat. \n   \nDynamic Cover: Change the flow of combat thanks to an extensive cover system which allows for the creation of effective cover from objects in the environment, making flanking and maneuvering during battles a truly powerful tactic. \n   \nShadow Spotting: Exploit the Blazing western sun to Locate out of sight enemies by the shadows that they cast, along with the sounds they make. \n   \nRicochets: Utilize Metal objects to allow master gunslingers to shoot beyond the line of sight for increased tactical combat options, and diversified planning. \n   \n40 Historically Inspired Weapons: Equip and employ an eclectic collection of deadly shotguns, rifles, pistols and sniper rifles, all based upon real outlandish prototypes, designs and ideas from the era.","storyline":"Welcome to the Wild Hard West like you’ve never seen it before. When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunts down all those whom wronged him. Follow Warren on his descent into the darkest recesses of the human soul, and try to survive in a world full of hard choices and even harder consequences. Because in this world, death is a constant presence and the black pacts which you make with forces beyond human comprehension will forever haunt all those around you. \n \nFight and survive through 8 unique story-based scenarios, and try your hand at more than 40 individually designed turn-based combat missions. Journey deeper into the world of Hard West and meet a colorful cast of playable Characters whose fates are intimately intertwined with yours. Together you will need to make divisive choices to uncover the ultimate plans of the ancient powers at play, as you unravel a deep narrative storyline featuring multiple endings depending on the choices you make during the game.","popularity":2.666666666666667,"version_parent":7675,"version_title":"Hard West Collector's Edition","games":[25311,27092,26145,25646,23345,28182,80916,37419,19319,47823],"tags":[1,19,22,268435468,268435471,268435472,268435480,268435487,268435488,536870921,536871327,536874694,1073741827],"developers":[3225],"publishers":[6549],"game_engines":[13],"category":0,"player_perspectives":[3],"keywords":[9,415,3782],"themes":[1,19,22],"genres":[12,15,16,24,31,32],"first_release_date":1447804800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1447804800000,"region":8,"human":"2015-Nov-18","y":2015,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fkapphepguy8jrpgcyvg.jpg","cloudinary_id":"fkapphepguy8jrpgcyvg","width":600,"height":316},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fpmhmpxjygpmfoqfgqga.jpg","cloudinary_id":"fpmhmpxjygpmfoqfgqga","width":600,"height":316},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vqund4gn4o5pnr26n7wq.jpg","cloudinary_id":"vqund4gn4o5pnr26n7wq","width":600,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b2tkfqimh8urgmytq40c.jpg","cloudinary_id":"b2tkfqimh8urgmytq40c","width":600,"height":338},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/theioeqkmwqoo0ypidxx.jpg","cloudinary_id":"theioeqkmwqoo0ypidxx","width":600,"height":338}],"videos":[{"name":"Gameplay video","video_id":"_DoDGHtsg-Q"},{"name":"Gameplay video","video_id":"RcoYNn8gHkI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e7zkmgvhxmjeovn8glbn.jpg","cloudinary_id":"e7zkmgvhxmjeovn8glbn","width":178,"height":237},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/307670\/Hard_West"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Hard_West"},{"category":2,"url":"https:\/\/hardwest.gamepedia.com\/Hard_West_Wiki"}]}