{"id":56822,"name":"8 DOORS","slug":"8-doors","url":"https:\/\/www.igdb.com\/games\/8-doors","created_at":1504459566787,"updated_at":1516367094458,"summary":"‘8 Doors’ is a multi-ending RPG with high degree of freedom. \nUsers have to solve puzzles, accomplish various Main and Sub Quests and deliberately apply accompanying npc at battles, enjoying different types of plays. Through the game, the game play gets more and more interesting as you find numerous Easter Eggs. Also, every moment you play the game, the attractive artwork designed to fascinate you into the amazing story will capture your attention.","storyline":"The main stage of ‘8 Doors’ is the afterlife, the opposite world to the reality where we reside. \nThere exists a place called `IERO: the ghost hotel’ located somewhere in the Afterlife. This is the sacred place where the souls after death can spend their last day comfortably before the final judgment of the kind of that world ‘Yama’. It does not matter who they were before the death. \n \n‘Unsolved mystery; you must find out the truth’ \nA mysterious incident has occurred; at the town where ‘Lily’ lives, a living man died and at the same time a dead man came back to life. Her father as well became the victim of this incident so Lily decides to solve this mysterious death and bring her father back to life. In order to meet the king of Afterlife ‘Yama’ ruling the souls, Lily goes through a dangerous ceremony for a voluntary trip to the Afterlife even though many people opposed to it. ‘Yama’ requests ‘Lily’ to become a Reaper to assist the best Reaper ‘Sul’ in the Afterlife to fix this confusion in return to bring her father back to life ….","popularity":1.333333333333333,"games":[27266,72412,55289,59516,236,27725,36792,25222,25646,25311],"tags":[268435465,268435468,268435487],"category":0,"genres":[9,12,31],"videos":[{"name":"Trailer","video_id":"ewvEe52WC_Q"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hv2cpchcrfpfvucertxf.jpg","cloudinary_id":"hv2cpchcrfpfvucertxf","width":2048,"height":1447}}