{"id":86822,"name":"Gummy Drop! – A Match 3 Game","slug":"gummy-drop-a-match-3-game","url":"https:\/\/www.igdb.com\/games\/gummy-drop-a-match-3-game","created_at":1518604645117,"updated_at":1520020313875,"summary":"Over 40 million people are already playing the ultimate puzzle matching game with thousands of unique & challenging levels!\n\nLooking for an addictively sweet match 3 game? Gummy Drop! is the MOST exciting puzzle adventure on mobile today! Dash through the puzzles alone or challenge friends to see who can get the highest score. Match three or more gummies of the same color and earn unique boosts with special matching combinations. Collect quest pieces to help local heroes around the world rebuild famous landmarks. But match carefully – it’s not so easy when you have limited moves or have to race against the clock! Use your skills at solving puzzle games to help you beat levels and explore colorful cities around the globe. No more popping bubbles, blasting blocks, crushing candies, or matching jewels. Squish the gummies and enjoy this fun and free puzzle game. LET’S GO GUMMY! ®\n\n“Gummy Drop succeeds not only by being clever and entertaining, but by offering a tremendous amount of free fun.” – Gamezebo\n\n“… the thing that sets Gummy Drop! apart from other games in its category includes the unique story approach, which makes use of the world map, and a subset of challenges that include unlocking bonus objects and items through successful play.” – AppGamer\n\n“It’s engaging, attractive, and fun to play.” – Pixelkin\n\nUnique Boosts & Features\n• Tired of the same cookie cutter puzzle games? Gummy Drop! features unique game boards, quests and more\n• Crush levels and blast gummies with special bonuses like Shovel, Lightening, Earthquake and more\n• Huge rewards & bonuses! Score in-game items just for playing\n\nSpecial Events & Bonus Boards\n• Solve Daily Events & collect resources and rewards\n• Play seasonal and limited-time puzzles to collect special passport stamps\n• STAY TUNED More levels, power-ups, features, gameplay and new surprises are on the way!\n\nTravel the World\n• Travel to any city, anytime! Earn travel vouchers to unlock the city of your choice \n• Explore the world and travel to exotic locales. From Sydney to Tokyo, New York to Paris, Dubai to Kathmandu, cities on every continent are yours to explore.\n• Collect colorful photo stamps for your passport when you solve challenging match 3 puzzles \n\n10,000+ levels\n• Challenge yourself with over 10,000 exciting levels across dozens of exotic cities – MORE levels than any other match 3 game!\n• Solve side levels in quests to help local heroes complete their tasks\n• Manage resources, and build ports to move resources between cities to help build landmarks and finish quests \n\nOne of the juiciest puzzle games for free, Gummy Drop! is completely free to play but some optional in-game items will require payment.\n\n*REVIEWS*\n\nBetter than Candy Crush (5 STARS)\nLove the way the game travels around the world.\n\nFinally a Straight Up Game Experience (5 STARS)\nThis is an amazing game that is what it says - FREE. You can keep playing a challenging de-stressor without any bait and switch. Love It!!!!!!!!\n\nFun game (5 STARS)\nThis game starts easily and increases in difficulty as you get better. Fun to watch the cities grow as you add details.\n\nCan’t get enough of Gummy Drop! ? Visit our Headquarters, like us on Facebook of follow us on Twitter for sweet musings, matching tips, gummy stories, and tasty giveaways!\n\nGummy Drop! Headquarters: http:\/\/bigfi.sh\/GummyHQ\nFacebook: Search Gummy Drop \nTwitter: @GummyDrop \n\n*Note for updates - having trouble seeing your progress after an update? Try connecting with Facebook again and that should do the trick!*","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[19222,41348,10225,27266,97254,95538,95525,92204,92096,91172],"tags":[268435465,268435489],"category":0,"genres":[9,33],"first_release_date":1410134400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1410134400000,"region":8,"human":"2014-Sep-08","y":2014,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/elh0xyp7p3x3z7skkxom.jpg","cloudinary_id":"elh0xyp7p3x3z7skkxom","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c1xeqjgswoerobqpfjau.jpg","cloudinary_id":"c1xeqjgswoerobqpfjau","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qfw9t0b4hi21mubgkhqm.jpg","cloudinary_id":"qfw9t0b4hi21mubgkhqm","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rfipmpyclnhivkdgcvwj.jpg","cloudinary_id":"rfipmpyclnhivkdgcvwj","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vaa3ls30vkocqlkoojii.jpg","cloudinary_id":"vaa3ls30vkocqlkoojii","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/q99yiry6r8gbbflxxbbx.jpg","cloudinary_id":"q99yiry6r8gbbflxxbbx","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fn7jxeecx74x3pisohwh.jpg","cloudinary_id":"fn7jxeecx74x3pisohwh","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kq7dnw5zgvzphbw71l6c.jpg","cloudinary_id":"kq7dnw5zgvzphbw71l6c","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l9boz1ldv8sa965vbo2i.jpg","cloudinary_id":"l9boz1ldv8sa965vbo2i","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fulg8gb8ltbmcota7m5v.jpg","cloudinary_id":"fulg8gb8ltbmcota7m5v","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bxijqucancokrreawnqa.jpg","cloudinary_id":"bxijqucancokrreawnqa","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/gummy-drop-a-match-3-game\/id828578246?mt=8&uo=4"}]}