{"id":11761,"name":"Carnivores","slug":"carnivores","url":"https:\/\/www.igdb.com\/games\/carnivores","created_at":1440288533296,"updated_at":1523203676074,"summary":"Carnivores is a first person shooting video game produced by Action Forms and released by WizardWorks Software in 1998. It is the first video game in the Carnivores series.\n\nGAMEPLAY:\nThe player takes the role of a DinoHunt customer. At the start of a new game, the player must register a new hunter or continue with a saved hunter. The point of the game is hunting dinosaurs to get trophies and accumulate score. Each dinosaur represents a set number of points. A novice hunter starts with zero points, when his points increase he'll be able to hunt new dinosaurs on additional terrains with more powerful weapons. If the player is killed by a dinosaur, all points accumulated on that specific hunt are forfeited. The player must be picked up by DinoHunt to keep the points he earned.\n\nA hunter will become Advanced after earning 100 points, and Expert with 300. To begin a hunt, the player must choose the location, the weapon, the dinosaur and some hunting accessories which help the player but will deduct the score during that hunt. Each location is unique, with varying difficulties and terrain. The new hunter will be given three areas, with two more added for the Advanced hunter and a final area for the Expert hunter, for a total of six locations. Level locations include jungles, and deserts accompanied by pyramids and an ancient temple.\n\nNext, the player must choose a dinosaur to hunt. A new hunter will be given the choice of four dinosaurs: Parasaurolophus, Stegosaurus, Pachycephalosaurus and Allosaurus. An Advanced hunter gains the ability to hunt the Triceratops and the Velociraptor. Only an Expert hunter can hunt the Tyrannosaurus rex. Harmless creatures such as Moschops, Gallimimus and Dimorphodon are present in each level. They are worth zero points and can be killed with a single shot. The player must also choose a weapon, which can be set for kill or tranquilize for additional points. A beginning hunter can only use a shotgun or a crossbow. A sniper rifle is unlocked upon becoming an Advanced hunter. First time hunters can use the Observation Mode to familiarize themselves with dinosaur behavior and different terrain.","storyline":"Carnivores is set in the year 2190. During a routine space exploration mission, a science vessel known as the FMM UV discovered a planet with a climate suitable to sustain human life. The new planet was code-named FMM UV-32. During the initial scouting expedition, the planet was declared inhospitable for colonization because of its unstable terrain and large population of dinosaurs and other prehistoric reptiles. News articles about the planet led to an Earth corporation purchasing the rights to the planet and creating DinoHunt Corporation. The company allowed for paying customers to hunt dinosaurs on their planet.","collection":1574,"rating":78.3659462906855,"popularity":2.333333333333333,"total_rating":78.3659462906855,"total_rating_count":5,"rating_count":5,"games":[36950,68287,55038,17130,19249,34823,23852,25838,13200,90099],"tags":[1,18,22,268435461,268435469,268435470,536870976,536870999,536871365,536871377,536871882,536872031,536872033,536872060,536872078,536872282,536872448,536872586,536872708,536872983,536874538,536875358,536875483,536875643,536876262,536876706,536877501,1073741825],"developers":[5070],"publishers":[215],"game_engines":[189],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[64,87,453,465,970,1119,1121,1148,1166,1370,1536,1674,1796,2071,3626,4446,4571,4731,5350,5794,6589],"themes":[1,18,22],"genres":[5,13,14],"first_release_date":912384000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":912384000000,"human":"1998-Nov-30","y":1998,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xjkvbvoacq92hj2f5zpt.jpg","cloudinary_id":"xjkvbvoacq92hj2f5zpt","width":480,"height":320},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d5oo7jy6xjgzh98liv5g.jpg","cloudinary_id":"d5oo7jy6xjgzh98liv5g","width":600,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mtdguve4ypkz6ewk0uve.jpg","cloudinary_id":"mtdguve4ypkz6ewk0uve","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cd2pvi0wmxpm58i5hvhf.jpg","cloudinary_id":"cd2pvi0wmxpm58i5hvhf","width":480,"height":320},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/boqpdalog4revvhsdqit.jpg","cloudinary_id":"boqpdalog4revvhsdqit","width":480,"height":300}],"videos":[{"name":"Gameplay video","video_id":"EB01bu_vpEI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bcbnv2szltafbeh0ubgr.jpg","cloudinary_id":"bcbnv2szltafbeh0ubgr","width":300,"height":362},"esrb":{"rating":5}}