{"id":12761,"name":"Pools of Darkness","slug":"pools-of-darkness","url":"https:\/\/www.igdb.com\/games\/pools-of-darkness","created_at":1442650411478,"updated_at":1517270863646,"summary":"For ten years your glorious band has fought Evil wherever it has threatened the Realms. Lord Bane has suffered many defeats at your hands and new peace washes over the land. Now your path comes full circle - back to the thriving city of Phlan.\n\nAs your ship arrives, you see the towers of Phlan, where before only ruins stood. The slums and decay have given way to new growth. Boats bob in the harbor under the watchful protection of Sokal Keep. In large measure this prosperity and success was born of your defeat of Tyranthraxus so many years ago.\n\nAs the sail is furled, and the crew prepares to dock, you wonder \"Where could adventure be found among such peace ...","storyline":"The party's objective is to defeat Bane's lieutenants Thorne (an ancient red dragon), Kalistes (a Tanar'ri Marilith), and Tanetal (a Tanar'ri Glabrezu) and acquire the items they possess. The ultimate goal is to reach Bane's Land and face off against Bane's last and greatest lieutenant, Gothmenes (a Tanar'ri Balor). \n \nAll of the lieutenants are found in other dimensions, which can be reached using portals known as Pools of Darkness. Traveling through the pools can cause many types of items the characters are holding to be permanently destroyed and lost. The party may opt to leave these items in a vault to save them. Naturally, any items from the dimensions will suffer this same fate when traveling back to the realms. Some items that will survive include the Vorpal Long Sword, magic rings, and composite bows. \n \nThere are also many side quests the party can do along the way, which can help the party in gaining experience and items, especially early on. There are a lot of invisible areas on the overworld the party can enter, which can be found if the player looks around the open fields for any such places. This is true of all the overworlds. \n \nThe mandatory quests involve: \n \n  Clearing the Steading near Dragonhorn's Gap, which opens the way to the Dragon's Aerie. \n  Clearing the Dragon's Aerie, which opens the way to Thorne's Cave via a Pool of Darkness. \n  Clearing Thorne's Cave, which will give the party the Horn of Doom. \n  Clearing the drow caves and Kalistes' Temple under Zhentil Keep, which opens the way to Kalistes' Land via a Pool of Darkness. \n  Clearing Kalistes' Parlor, which will give the party the Crystal Ring. \n  Clearing the red tower of Marcus, which opens the way to Moander's body via a Pool of Darkness. \n  Clearing the heart of Moander where Tanetal resides, which will give the party the Talisman of Bane. \n  Clearing Arcam's Cave under Mulmaster, which opens the way to Bane's Land via a Pool of Darkness. \n  Finally, clearing Bane's Land and defeating Gothmenes (a Tanar'ri Balor), who battles Elminster. \n \nThere are also side quests in several places, and famous people in the realm too. For example, Elminster was always there to maintain the dimensional portal for the party should they arrive at any Pool of Darkness. The lost princess Alusair Nacacia will ask the party to help her to fight Rakshasas in Myth Drannor. Lastly, after finishing the final quest, the party had the option to either end their journey or go through one more dungeon of enemies and traps, known as \"Dave's Challenge\".","collection":1837,"franchise":43,"franchises":[43,731],"popularity":1.666666666666667,"games":[26766,23198,12113,18822,36534,36926,11214,14474,47823,18398],"tags":[17,34,268435468,268435487,536870984,536871138,536871139,536871208,536871237,536871244,536871259,536871260,536871409,536871446,536871504,536871938,536871939,536872647,536872835,536872978,536873364,536875160,536875196,536875356,536875380,536875455,536875735,536875738,536875803,536876301,536877554,536878358,536886005,1073741825,1073741826],"developers":[528],"publishers":[528],"game_engines":[165],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[72,226,227,296,325,332,347,348,497,534,592,1026,1027,1735,1923,2066,2452,4248,4284,4444,4468,4543,4823,4826,4891,5389,6642,7446,15093],"themes":[17,34],"genres":[12,31],"first_release_date":725760000000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":7,"platform":13,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mitzdeho0t1ph7vbnglv.jpg","cloudinary_id":"mitzdeho0t1ph7vbnglv","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d9byusmemmcnepm65ezr.jpg","cloudinary_id":"d9byusmemmcnepm65ezr","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ahvccvfpbqwnkkxtpedy.jpg","cloudinary_id":"ahvccvfpbqwnkkxtpedy","width":320,"height":200}],"videos":[{"name":"Gameplay video","video_id":"Y8Y7v6mlkBw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k03wye0gysy3utbvrexr.jpg","cloudinary_id":"k03wye0gysy3utbvrexr","width":640,"height":988},"esrb":{"rating":5},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Pools_of_Darkness"}]}