{"id":12861,"name":"T2: The Arcade Game","slug":"t2-the-arcade-game","url":"https:\/\/www.igdb.com\/games\/t2-the-arcade-game","created_at":1442774687643,"updated_at":1500596480473,"summary":"As the title states, this is the home conversion of the arcade rail-shooter based on the film Terminator 2: Judgement Day. Up to two players shoot through future and present levels as robotic killers reprogrammed to serve the human resistance. \n \nBoth players wield a machine gun with infinite ammo that lowers its firing rate (overheats) as it is continuously fired. A secondary weapon (missile launchers in the future, shotguns in the present) has limited ammo but deals heavy damage. Powerups inside the game world include secondary weapon ammo and coolant for the machine guns, and are shot to be collected. \n \nT2: The Arcade Game features seven levels based on specific scenes or general concepts in the film. The first four levels act as a prelude, as the player guns down waves of metal Terminators across a post-apocalyptic Battlefield, a besieged Human Hideout, and through the security checkpoints of the enemy supercomputer SkyNet. After destroying the computer, players travel back in time to protect John and Sarah Connor, while also destroying every scrap of SkyNet research at the headquarters of its manufacturer. From there, players must fend off the indestructible T-1000 until the final showdown in the Steel Mill. \n \nAssets from the movie are used when possible, such as voice clips from Arnold Schwarzenegger, and close-up digital stills of Robert Patrick for the final battle against the T-1000. The Genesis and SNES versions also support lightguns (the Menacer and Super Scope, respectively).","franchise":248,"franchises":[248],"popularity":1.333333333333333,"games":[28029,68287,36950,76722,76246,19341,306,64204,17522,10039],"tags":[1,18,268435461,268435489,1073741828],"developers":[566],"publishers":[566],"category":0,"player_perspectives":[4],"game_modes":[1,2],"themes":[1,18],"genres":[5,33],"first_release_date":694137600000,"platforms":[52,16],"release_dates":[{"category":2,"platform":52,"date":694137600000,"human":"1991","y":1991,"m":12},{"category":2,"platform":16,"date":757296000000,"human":"1993","y":1993,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zoqecwaqokg19c3qeo7w.jpg","cloudinary_id":"zoqecwaqokg19c3qeo7w","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/liyusdwuyjdpv3cgorkv.jpg","cloudinary_id":"liyusdwuyjdpv3cgorkv","width":326,"height":451}}