{"id":2161,"name":"Playboy: The Mansion","slug":"playboy-the-mansion","url":"https:\/\/www.igdb.com\/games\/playboy-the-mansion","created_at":1372073738790,"updated_at":1527936896777,"summary":"Play as Hugh Hefner and build the Playboy publishing empire while throwing parties, hanging out with celebrities, and, of course, inviting beautiful models into your mansion. Playboy: The Mansion is a social strategy game that calls on players to build a virtual empire of wealth, celebrity, and freedom from puritanical repression and intolerance. This is accomplished by developing a fully functioning Playboy mansion, to attract and accommodate influential celebrities and beautiful young models who are willing to strike the right poses. Players who can build a suitably entertaining and well-equipped mansion, while adhering to \"the Playboy philosophy,\" are rewarded with \"the Playboy lifestyle,\" surrounded by powerful trendsetters, influential pop idols, and sexually liberated young women. In short, the game invites players to take the role of a virtual Hugh Hefner. \n \nAs Hef, players will be responsible for keeping the Playboy brand relevant to its ever-evolving audience. One good way to do this is by attracting celebrity friends to the mansion, and making sure they have a good time when they visit. With enough money, players can build new facilities -- like swimming pools, movie theaters, or tennis courts -- which may have special appeal to particular celebrities. It's also a good idea to introduce these V.I.P. guests to Playmates who share their interests. The game's main interface should be familiar to Sims 2 players; characters are directed through their 3D domestic environments with mouse clicks, and clicked objects offer pop-up menus of available interactions. \n \nCoaxing powerful celebrity friends to appear in an issue of Playboy magazine can boost circulation, bringing in more income for future developments. As Hef, players can determine the content of each issue, choosing the articles, essays, cover shots, and centerfolds. They'll also have an opportunity to direct the photo shoots, choosing the location on the mansion grounds, the model, and the wardrobe selection -- all of which feature a \"topless\" option. The game includes a structured campaign that follows Hefner's real-life rise to international celebrity through a series of individual scenarios that focus on building the fame, circulation, and clout it took to develop the Playboy brand into what it is today. Players design their own challenges in the \"Empire\" mode, where they can set their own goals and victory conditions.","collection":3509,"rating":49.9576798605925,"popularity":2,"aggregated_rating":55,"aggregated_rating_count":3,"total_rating":52.47883993029625,"total_rating_count":9,"rating_count":6,"games":[22423,22422,19785,19847,11679,22486,22421,22469,19808,22425],"tags":[28,42,268435469,268435471,536871255,536871270,536871938,536872060,536872626,536872873,536874694,536875054,536875281,536875326,536875338,536875364,536875436,536875556,536875802,536876642,536877386,536877802,536877913,536878324,536878531,536880294,536880295,536880353,536883035,536884207,1073741826],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[343,358,1026,1148,1714,1961,3782,4142,4369,4414,4426,4452,4524,4644,4890,5730,6474,6890,7001,7412,7619,9382,9383,9441,12123,13295],"themes":[28,42],"genres":[13,15],"first_release_date":1106611200000,"platforms":[6,11,8],"release_dates":[{"category":0,"platform":8,"date":1106611200000,"human":"2005-Jan-25","y":2005,"m":1},{"category":0,"platform":11,"date":1106611200000,"human":"2005-Jan-25","y":2005,"m":1},{"category":0,"platform":6,"date":1106611200000,"human":"2005-Jan-25","y":2005,"m":1}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n3epzmvun8jfrkmbh5du.jpg","cloudinary_id":"n3epzmvun8jfrkmbh5du","width":256,"height":330},"esrb":{"synopsis":"","rating":6}}