{"id":27661,"name":"Nanospace","slug":"nanospace","url":"https:\/\/www.igdb.com\/games\/nanospace","created_at":1488791993464,"updated_at":1521603333597,"summary":"Level  \nThe game is a 3D platformer with elements of strategy in real time. Each level of the game is a closed location with riddles, \"monsters\", bonuses and inventory, which is used to finish the levels. The player's goal - to bring party members alive.  \nInstead of a single character in the game, you use three characters, each of which has a unique set of abilities.  \n  \nCharacters  \nPlayer control's three characters at once, at any time, by switching between micro-aliens and using the features of each to solve the current problems. Characters have the index of endurance and they need food. You need to monitor and maintain an optimal values.  \n  \n-Tracker - Flying nano-mite, the most fast moving. Search and Research. Warning of the danger. Take a sample for the presence of the necessary elements, sets a marker if any are found.  \n-Harvester - Production of mineral and organic substances as well as the movement of the extracted minerals. Harvester sees the mark left by the Tracker, digs in these places, extracts the loot and moves to the Core. The Core is used as a vendor, stock material collected in the course of the game), the group need to carry a Core and monitor it's safety .  \n-Sentinel - Hunting and protecting group. The synthesis of combat and warfare agent.  \n  \nGame process  \nSegregation of duties requires a player to think over the tactics, because nano-mites, despite the unique abilities, represent a real force only if they work together. It's only possible to finish any level with a combination of abilities of each of the nano-mite.  \nThus, the gameplay NANOSPACE is a balanced combination of arcade and 3D platform adventure game, requiring not only the reaction speed, but also the ability to think logically.  \n\"Custom\" gravity controller allows characters to crawl on the steep walls and climb plants, it will expand the tactical abilities of the Player","storyline":"Мeteorite with spores of biomechanical creatures (nano-mites) fell to the Earth. After 27 million of years the one survivor Core activated . Inside the Core grow and develop three beings. Nano-mites have a unique set of skills and live in symbiosis, they have ability to generate a variety of substances (combine and separate chemical elements), they will survive and resist the biota of the Earth, which changed over millions of years of evolution, as well they will perform some missions to prepare a base for invasion of insektorat swarm.","popularity":2.666666666666667,"games":[25311,23175,51485,26848,59516,19289,55289,1070,37022,27239],"tags":[1,268435464,268435471,268435487,536873405,1073741826],"developers":[12268],"publishers":[12268],"game_engines":[439],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[2493],"themes":[1],"genres":[8,15,31],"first_release_date":1546214400000,"pulse_count":1,"platforms":[6,14],"release_dates":[{"category":2,"platform":6,"date":1546214400000,"human":"2018","y":2018,"m":12},{"category":2,"platform":14,"date":1546214400000,"human":"2018","y":2018,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tsa1q2lfluflvjxtk0q0.jpg","cloudinary_id":"tsa1q2lfluflvjxtk0q0","width":620,"height":349},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/efrzbxxtfckzpnkm2k8a.jpg","cloudinary_id":"efrzbxxtfckzpnkm2k8a","width":620,"height":349},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ype1vi5ryh3pug0i1yqb.jpg","cloudinary_id":"ype1vi5ryh3pug0i1yqb","width":620,"height":349},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ylpahiuvkbny8wzmcqeo.jpg","cloudinary_id":"ylpahiuvkbny8wzmcqeo","width":620,"height":349}],"videos":[{"name":"Trailer","video_id":"nBKqecN-mRU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hj3rryq6gk8qrj25vs6q.jpg","cloudinary_id":"hj3rryq6gk8qrj25vs6q","width":200,"height":200}}