{"id":50561,"name":"Meitantei Conan: Kigantou Hihou Densetsu","slug":"meitantei-conan-kigantou-hihou-densetsu","url":"https:\/\/www.igdb.com\/games\/meitantei-conan-kigantou-hihou-densetsu","created_at":1500049589557,"updated_at":1516576574858,"summary":"Kigantou Hihou Densetsu (Eng. \"The Legend of Treasure on a Strange Rock Island\") is a top-down adventure game from Meitantei Conan series featuring Edogawa Conan (real name is Kudou Shin'ichi) as a protagonist on a case to solve the mystery on the Kigantou island. However, Conan is not the only character you can control in the game, beside him you can control Shin'ichi's girlfriend Ran, her father, the renowned detective thanks to Conan, Kogoro, Ran's high-school girlfriend, Sonoko, and Conan's classmates Mitsuhiko, Ayumi and Genta. Based on the character you control, certain areas may be accessible or inaccessible, and certain dialogues and dispositions from other characters may vary. \n \nThe story starts with Togawa sisters, Satomi and Miki, receiving a golden statue. They lost their parents at an early age, never knowing what actually happened to them. One day, a letter came from a wealthy person living on an island somewhere in the western Japan Sea. Upon receiving this letter, they realized the golden statue belongs to the place from which the letter was sent. If this is a family heirloom, could the person who sent the letter be someone related to them? Can they know what happened to Satomi and Miki's parents? As Conan and the others opened the Togawa sisters' request, they decided to help uncover the mystery behind their lineage and golden statue and set off on a trip to the solitary island in question where ships travel to only twice a week. As they arrive on the island of strange shape, the notice the residents of an island village appear a bit weird, and there seem to be history behind the wealthy island family. And to top it all, the murder in front of the wealthy looking western-style estate occurred just in front on them and the murderer ran away from the scene of the crime. It's Conan's task to solve all the mysteries and catch the killer, for by his own words, the truth is always only one.","collection":3038,"popularity":1.333333333333333,"games":[72412,59516,55289,13189,36792,25222,36044,55803,41895,25311],"tags":[268435468,268435487,536871939,536872581],"category":0,"keywords":[1027,1669],"genres":[12,31],"first_release_date":957139200000,"platforms":[22],"release_dates":[{"category":0,"platform":22,"date":957139200000,"region":8,"human":"2000-May-01","y":2000,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hqxibapmqjrlfymy6iuc.jpg","cloudinary_id":"hqxibapmqjrlfymy6iuc","width":255,"height":320}}