{"id":89561,"name":"Soulsmith","slug":"soulsmith","url":"https:\/\/www.igdb.com\/games\/soulsmith","created_at":1519838845704,"updated_at":1519939843048,"summary":"Soulsmith is a strategy card game where fearless warriors led by mighty heroes battle on the arena for honor, glory, and loot. From building your deck to playing heroes or warriors to a specific lane, every decision you make will require strategic planning and forecasting your opponent's moves. Destroy your enemies with powerful magic, crush foes with overwhelming brute force or outsmart the opponent with your own unique strategy, it's all up to you! In Soulsmith, there is no such thing as rare cards with enormously high stats. Every single castle, hero, warrior, recipe, item, fort or monster may be good or bad depending on your strategy and the situation on the arena. \n \nCreate a mighty deck and conquer the Riviere of Worlds in thrilling PvE encounters or show who's the boss in PvP games. Both modes will grant you with tons of fun and new cards.","storyline":"The Dark War between the Sleeping Gods and the Fallens ended hundreds of years ago. The new era of peace and prosperity has come to all realms of the Riviere of Worlds. But since recently, peace has become just an illusion. \n \nThe most alarming events occur in Midworld. The ritual that supposed to summon servant demons for Emperor Kratis ended up with destruction and demonic invasion led by Archdemon Valaar. Shaky peace treaty stopped the war for a while, but didn't remove the Edge - a giant rift that passes through the whole realm. \n \nMysterious force gives you the ability to command the army of great heroes and warriors. Will you use this power for establishing peace or just for personal gain?","popularity":1,"games":[16468,13196,26268,26163,47823,8196,26848,28465,19289,27209],"tags":[17,268435472,268435488,536871158,536871394,1073741827],"developers":[14933],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[246,482],"themes":[17],"genres":[16,32],"status":5,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nzpmabfiiyvx1opxvqjk.jpg","cloudinary_id":"nzpmabfiiyvx1opxvqjk","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/trswtr5gzgqkwssaah9v.jpg","cloudinary_id":"trswtr5gzgqkwssaah9v","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/marhyg6btvumjrktdgo0.jpg","cloudinary_id":"marhyg6btvumjrktdgo0","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lhpouv8xne6cugdqyz3j.jpg","cloudinary_id":"lhpouv8xne6cugdqyz3j","width":1600,"height":900}],"videos":[{"name":"Trailer","video_id":"sHE6BNoE41c"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t8bzwo48b0mkkcdza9qf.jpg","cloudinary_id":"t8bzwo48b0mkkcdza9qf","width":1200,"height":675}}