{"id":22217,"name":"Close Your","slug":"close-your","url":"https:\/\/www.igdb.com\/games\/close-your","created_at":1470239855953,"updated_at":1470245881661,"summary":"Close Your is a first person interactive short story where you live an entire life, from birth to death, and make decisions big and small that shape the outcome of that life. The catch is that each scene only lasts as long as you can keep your eyes open. The game uses your webcam to track your eyes in real life, so every time you blink, you skip forward: could be five seconds or five years. Life literally flashes before your eyes as you try desperately to hold onto each fleeting moment.","storyline":"As you look up, you see the oncoming car. It's too late. You close your eyes to brace for impact and time seems to stop. When you open them again, you are standing in front of Death himself…\nAfter signing away your life, Death sends you back to earth for one last visit. You now blink through your entire life, from the most mundane moments to the most vital. You learn to walk, struggle through school, face the monotony of work, meet the person you’ll spend the rest of your life with, and even raise a child of your own. \nSince blinking is an inevitable physical process, each of these vignettes is imbued with inherent tension. You may close your eyes on your first kiss, and open them at your wedding, or close your eyes on a fight with your mother, only to open them at her funeral. \nClose Your’s narrative branches by tracking how you behave in each scene, rather than presenting you with obvious moral choices. When sitting at the office do you do your work on the computer, or do you listen to an amusing co-worker’s joke? The game clocks these behaviors and the story adapts dynamically to reflect your unique disposition and values, your strengths as well as your flaws.","hypes":1,"popularity":1.333333333333333,"tags":[1073741825],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[283,308,1649,2425],"themes":[31],"genres":[32],"pulse_count":2,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/reae2gx0sajmf8jfl7nk.jpg","cloudinary_id":"reae2gx0sajmf8jfl7nk","width":680,"height":440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gmgmxd1psbmqvpdqkidr.jpg","cloudinary_id":"gmgmxd1psbmqvpdqkidr","width":680,"height":440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uyrz28wlp8uig37zfziv.jpg","cloudinary_id":"uyrz28wlp8uig37zfziv","width":680,"height":440}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/equiekgliwd94slpmlli.jpg","cloudinary_id":"equiekgliwd94slpmlli","width":680,"height":737},"websites":[{"category":1,"url":"https:\/\/www.kickstarter.com\/projects\/146338032\/close-your-life-one-blink-at-a-time"}]}