{"id":23017,"name":"World in Conflict: Complete Edition","slug":"world-in-conflict-complete-edition","url":"https:\/\/www.igdb.com\/games\/world-in-conflict-complete-edition","created_at":1472037481610,"updated_at":1528459740596,"summary":"World in Conflict focuses on real-time tactics (RTT) gameplay, in a similar manner to Ground Control, a game also developed by Massive Entertainment, in which players deploy units onto a battlefield and must carefully make use of them to achieve victory, making use of support assets to further assist them. World in Conflict contains three factions: the United States, Soviet Union, and NATO. While players may only play as US and NATO forces during the single-player campaign, all three factions can be used in multiplayer games. \n \nDuring a game, players are given a pre-determined amount of reinforcement points, with which to purchase units with varying costs. Once the player deploys the units they purchase, they must wait 20 seconds for them to be airdropped to the field. If a unit is destroyed, the points are refunded to the player in order to allow them to bring in more units. During the single-player campaign, most missions vary what units the player can recruit, while some missions will offer the opportunity to recruit free units, though these cannot be replaced if destroyed. Each unit has strengths and weaknesses, such as mobile anti-air guns being most effective against enemy helicopters, and repair tanks being most effective at keeping vehicles and armor repaired. Each unit possesses a defensive ability, such as deploying smokescreens, while some units possess an offensive ability, such as marking targets for bombardment or using grenade launchers on enemy infantry. Once a unit's special ability(ies) has been spent, players must wait for them to recharge before they can be used again. \n \nIn addition to controlling units, players may also call in tactical aid by spending tactical aid points. Points are primarily earned from destroying enemy units in battle. Tactical Aids allow the player to call in anything, from airstrikes on enemy positions, the deployment of paratroopers, to launching carpet bombing raids and tactical nuclear strikes. Tactical aids can allow up to three deployments, after which the player must wait until the support has recharged. In the single-player campaign, players are restricted by what tactical aid they can use, which can change during a mission. \n \nThe game interface for World in Conflict has no framing in the game. A list of units occupies the bottom center, whereas the top right hand corner contains the expandable reinforcement procurement list. The mini map is in the bottom left hand corner, while the bottom right hand corner contains the special abilities buttons (including unit formation). Players can also use a messaging system that is designed to allow conversation between individuals regardless of whether they are on the same server or playing the same game. World in Conflict features a fully rotational 360 degree camera.","collection":220,"popularity":1.333333333333333,"version_parent":941,"version_title":"Complete Edition","games":[2015,79392,55029,28794,53189,76397,79134,44102,9760,9856],"tags":[268435467,268435471,1073741827],"developers":[537],"publishers":[7041,24],"game_engines":[192],"category":3,"player_perspectives":[3],"game_modes":[1,2],"genres":[11,15],"first_release_date":1236816000000,"pulse_count":2,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1236816000000,"human":"2009-Mar-12","y":2009,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xtg665lgpakosbgjgqhh.jpg","cloudinary_id":"xtg665lgpakosbgjgqhh","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kc8cyf3n4i9jqm2ocplb.jpg","cloudinary_id":"kc8cyf3n4i9jqm2ocplb","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvjzbai442trhxpwnktu.jpg","cloudinary_id":"yvjzbai442trhxpwnktu","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bkqsfx6h1pxms88srbr6.jpg","cloudinary_id":"bkqsfx6h1pxms88srbr6","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pkweobtwnkwcbuy26iee.jpg","cloudinary_id":"pkweobtwnkwcbuy26iee","width":1024,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wwrjitasp22akimlr7zb.jpg","cloudinary_id":"wwrjitasp22akimlr7zb","width":1600,"height":1200},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/World_in_Conflict"},{"category":1,"url":"http:\/\/www.worldinconflict.com"}],"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}