{"id":38717,"name":"Rush Rally 2","slug":"rush-rally-2","url":"https:\/\/www.igdb.com\/games\/rush-rally-2","created_at":1497983370391,"updated_at":1526289949109,"summary":"Race the most authentic rally simulation on your mobile at an astounding 60fps. Console quality racing on your mobile! \n \n-- This app has NO in-app purchases and NO adverts ensure you are connected and online with google play when you first play it -- \n \nRACE IN ALL CONDITIONS OVER LOADS OF TRACKS! \nRace at night or day in rain or snow! Rally through 8 Countries, over 72 unique stages each with different surface types including snow, gravel, tarmac and dirt. \n \nWORLD RALLY CHAMPIONSHIP RACING! \nAuthentic Rally Championship and Rallycross game modes. Compete in a full championship on A-B stages or go metal-to-metal with other cars in Rallycross. \n \nCUSTOMISE YOUR RIDE! \nA garage full of cars waiting to be driven and tuned. The best car dynamics model to date on a mobile platform from over 10 years experience on games such as MotoGP, Formula1, Split-Second, Sonic and Sega All Stars Racing and many more! \n \nCOMPETE WITH FRIENDS, MULTIPLAYER AND OFFLINE! \nConnect to Facebook or Googleplay, race against your friends ghosts at any time you like! Even race against the best players ghosts across the world! \n \nEXPERIENCE THE THRILL OF OUR SKILL GAME MODES! \nFeel the rush by taking on a selection of our mini games, race through roadworks, dodge missiles and even pull trailers. \n \nOPTIMISED FOR TOUCH! \nA control system designed specifically for touch devices mean racing becomes more fun and consistent, with the ability to scale, move and swap buttons to suit your needs. \n \nTILT SUPPORT! \nDon't like touch, you can still use tilt or a controller! \n \nCONTROLLER SUPPORTED \nFull controller support for those who want to push their skills that little bit further! \n- Awaiting arrival of problematic controllers so I can fix this, will keep you posted! - \n \nANDROID TV SUPPORTED \nFull Android TV support, including NVIDIA Shield TV capable of maximum graphics at 60fps","rating":44.86527,"popularity":1.333333333333333,"total_rating":44.86527,"total_rating_count":0,"rating_count":0,"games":[55192,40470,23314,28856,18699,83217,82502,80729,80382,80309],"tags":[268435466,536875069],"category":0,"keywords":[4157],"genres":[10],"videos":[{"name":"Trailer","video_id":"p9AOIMWiyaI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oyptppmrfuvot8er3kmd.jpg","cloudinary_id":"oyptppmrfuvot8er3kmd","width":1024,"height":1024},"esrb":{"rating":3},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=brownmonster.app.game.rushrally2&hl=en&gl=us"}]}