{"id":41717,"name":"Fray in Magical Adventure","slug":"fray-in-magical-adventure","url":"https:\/\/www.igdb.com\/games\/fray-in-magical-adventure","created_at":1498829384821,"updated_at":1515830665251,"summary":"Fray in Magical Adventure, also known as just Fray (フレイ) and Fray-Xak Epilogue (Gai-den),[1] is a 1990 spin-off \"gaiden\" (sidestory) game in a role-playing video game series Xak developed and published by the Japanese software developer MicroCabin. Even though it is directly connected to the more serious Xak storyline, Fray has a less serious tone and light-hearted comedic approach to telling the story. It was originally released for the MSX2 and was later ported to several different systems, among them MSX turbo R, PC-9801, PC Engine (as Fray CD), and Game Gear. \nFray is a simple action RPG. The game proceeds by the player's character Fray fighting through a preset overhead view map shooting opposing monsters, jumping over obstacles, and locating powerups and Gold, the game's currency, along the way. At the end of each stage the player will fight a boss and enter a town or safe haven where the player can purchase new equipment, hit points and the option to save their progress. Fray advances in power through the items that she can equip such as different rods and shields. Battles are in real-time as Fray walks around on automatic vertically scrolling game map as well as the monster characters. She has an attack and defense rating, and can switch between different projectile weapon styles as well as use special attacks and healing items","collection":4369,"popularity":1.333333333333333,"games":[36926,12632,26766,47823,25300,36950,59516,36534,27209,55752],"tags":[1,34,268435461,268435468,268435487,536870990,536871208,536871446,536871937,536871938,536871939,536875243,536875472],"category":0,"keywords":[78,296,534,1025,1026,1027,4331,4560],"themes":[1,34],"genres":[5,12,31],"first_release_date":633830400000,"platforms":[27],"release_dates":[{"category":0,"platform":27,"date":633830400000,"region":8,"human":"1990-Feb-01","y":1990,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ftvovb6hxn8pfgk1q1xb.jpg","cloudinary_id":"ftvovb6hxn8pfgk1q1xb","width":473,"height":640}}