{"id":7417,"name":"Swordsman","slug":"swordsman","url":"https:\/\/www.igdb.com\/games\/swordsman","created_at":1403076841573,"updated_at":1500450735180,"summary":"Dynamic Kung-Fu Experience\nSwordsman presents real-time martial arts fights and offers fun action features such as throwing techniques, counter moves and dodging to create a dynamic Kung-Fu experience. Fight on land, leap across rooftops, sprint on water and best your opponents in thrilling duels!\n\nUnique Guild-Based Gameplay\nTake part in exciting and distinct group-based endgame activities, by creating or joining a guild. Work together to establish guild bases, solve murder mysteries and crimes, protect notable figures, and much more! Don’t just fight alongside your friends; make a real impact on the world around you!\n\nDeep Character Customization\nThe character creation process offers a wide variety of appearance features to create a truly unique look. Earn distinct fashion items to set your character apart from other players. Bring your warrior to life and create the martial arts hero you’ve always envisioned!\n\nTen Dynamic Character Classes\nAs a member of one of the ten class-defining martial art schools, you master legendary fighting skills to engage in fierce real-time combat with members of rival schools and other opposing threats. Perfect any of the three highly customizable skill-sets per class to make your fighting style truly unique!\n\nA Heavenly New MMO Engine – Angelica III\nAngelica III is an in-house developed MMO engine that makes use of the latest technologies to display high quality graphics, with the optimization to run on a wide variety of hardware. The engine sports a day and night cycle, weather changes, realistic armour reflections, state-of-the-art water effects and destructible objects.\n\nAn Immersive Jianghu Experience\nSwordsman offers a vast array of content for solo, group and guild play. Explore a massive game world, delve into its many instances, craft superior weapons and take part in the versatile guild system. Test your skills in the arena or compete against others in daily PvP events!","storyline":"Based on the original story, yet adapted and used in a MMORPG game, the story of Swordsman Online is intriguing and magnificent. \n\nThe player's character is a martial art trainee who lived in a small maritime village. After his home village was destroyed and his family slaughtered by an ambitious faction, he set out on a journey to seek the true conspiracy behind the crime, and a chance for revenge. With the help of various characters from the original novel, the player solved many mysteries, overcame many difficulties, and finally upheld the justice. \n\nYeah, it sounds like just another story of revenge, but belive me, it is one of the most prominent literature work in contemporary China.","franchise":443,"franchises":[443],"hypes":1,"popularity":10.33333333333333,"games":[76253,103303,49414,25636,35737,51213,99118,103337,89828,78632],"tags":[268435468,268435481,536870973,1073741826],"developers":[917],"publishers":[917],"game_engines":[30],"category":0,"player_perspectives":[2],"game_modes":[5],"keywords":[61],"genres":[12,25],"first_release_date":1453939200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1453939200000,"human":"2016-Jan-28","y":2016,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/djpwxcgdxo3dmygf6vlu.jpg","cloudinary_id":"djpwxcgdxo3dmygf6vlu","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xsfnuifdmgrijfdnx41p.jpg","cloudinary_id":"xsfnuifdmgrijfdnx41p","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/irj1jslcsqteserhtk84.jpg","cloudinary_id":"irj1jslcsqteserhtk84","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/arhkabk6ohysyofkyugy.jpg","cloudinary_id":"arhkabk6ohysyofkyugy","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aagyf8kfgdcavbl9v02y.jpg","cloudinary_id":"aagyf8kfgdcavbl9v02y","width":1280,"height":720}],"videos":[{"name":"Trailer","video_id":"DYYcuF-QcWE"},{"name":"Gameplay video","video_id":"IojFps2NYk4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/unkvvbfvwvchkekahmz2.jpg","cloudinary_id":"unkvvbfvwvchkekahmz2","width":470,"height":320},"websites":[{"category":1,"url":"http:\/\/games.arcgames.com\/en\/prod\/swordsman"}]}