{"id":88817,"name":"Blackjack 21: Blackjackist","slug":"blackjack-21-blackjackist","url":"https:\/\/www.igdb.com\/games\/blackjack-21-blackjackist","created_at":1519330628496,"updated_at":1523426853743,"summary":"Play The Best Blackjack 21 free game with millions of players from all over the world!\nBlackjack is an exciting game that any player is sure to enjoy. Place a bet, get more points than the dealer and win chips. Feel the risk as you dive into a casino atmosphere and catch fortune by the tail.\nPlay now to improve your skills, gain experience, make new friends and become the best Blackjack player ever!\nGame features:\n• FREE CHIPS – Play the game every day to get free chips!\n• PLAY WITH FRIENDS – Get free bonuses when you invite your friends to the game through email or Facebook.\n• GET REWARDS – Up the stakes, win games against the dealer, take risks to get to 21 and unlock achievements.\n• QUESTS - Complete daily quests to get free chips!\n• YOUR OWN PROFILE PAGE – Track your progress and status in the game! Get experience and lvl-up! See how many Blackjack Tournaments you've won and Achievements you've completed. Get unique Properties and display them on your profile! View other players profiles to see how you compare! \n• CHAT WITH OTHER PLAYERS – Have even more fun at the casino tables with our easy to use in-game instant messenger and chat with other Blackjack players!\n• FAIR HAND DEALING GUARANTEED – Our Certified Random Number Generator (RNG) brings you the best and fairest Blackjack experience.\n• LEARN TO PLAY – Are you new to Blackjack but always wanted to try it? \nOur simple to follow tutorial mode will help you take the first steps. Learn everything you need to know about Blackjack, winning combinations and the rules of the game quickly.\n• SMOOTH INTERFACE – A simple and attractive interface which gives you the ability to bet, stand or hit with just one tap.\n• 3D GRAPHICS – An absolutely free blackjack game with stunningly realistic 3D graphics.\n• NO REGISTRATION – Get straight into the action. Use guest mode to play our free casino app without registration.\n• SINGLE ACCOUNT – Start playing free Blackjack on your smartphone then continue playing on tablet without losing your progress. Use your single account to play any of our other casino games in one app!\n* Want more than Blackjack? *\nTry our other games for an unforgettable 3D experience: \n• TEXAS HOLD’EM POKER – The most popular casino game among professional gamblers! Test your skills in amazing poker tournaments!\n• ROULETTE – Featuring stunning 3D graphics and three varieties of table: French, American, and European. \n• OMAHA POKER - A more dynamic version of poker with 5 cards in a hand. Have more fun with amazing combinations!\nLike us on facebook!\nhttps:\/\/www.facebook.com\/kamagames\nFollow us on Twitter!\nhttps:\/\/twitter.com\/KamaCasino\nThis game is only available to people of legal age. The game offers no possibility of winning money or anything of value. Success in playing this game does not imply your success in a similar real-money casino game.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[95679,91038,91010,90981,90964,89131,89098,88867,88781,87870],"tags":[536871523,536874083],"category":0,"keywords":[611,3171],"first_release_date":1422489600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1422489600000,"region":8,"human":"2015-Jan-29","y":2015,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h0ikprgk5ojilyzbzotw.jpg","cloudinary_id":"h0ikprgk5ojilyzbzotw","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n0uwil5hpkjbfefgqxmy.jpg","cloudinary_id":"n0uwil5hpkjbfefgqxmy","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kvhhafek5rr9nkkoomys.jpg","cloudinary_id":"kvhhafek5rr9nkkoomys","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qodwbcxudedol3o5jdsk.jpg","cloudinary_id":"qodwbcxudedol3o5jdsk","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pftxf4j4tkh6ev5qbn98.jpg","cloudinary_id":"pftxf4j4tkh6ev5qbn98","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/blackjack-21-blackjackist\/id959038492?mt=8&uo=4"}]}