{"id":15343,"name":"Plutos","slug":"plutos","url":"https:\/\/www.igdb.com\/games\/plutos","created_at":1450012379052,"updated_at":1513028806498,"summary":"Plutos is a long lost unreleased prototype developed by Tynesoft for the Atari 7800, and appears to be a loose port of the ST\/Amiga game of the same name. The existence of Plutos has been known for some time, as a physical prototype has been in hands of a collector for years, but this prototype was known to be unstable and crash frequently. The source code for Plutos was discovered in 2008 and several 7800 enthusiasts were able to get it compiled and running properly on stock 7800 hardware. \n \nPlutos is a vertically oriented space shooter that features gameplay similar to Raiden. The game features six different levels, each with its own unique theme and boss. Only three of these levels are unique graphically--the other three are just color palette changes. Plutos offers one player as well as two player simultaneous modes, selectable with the left difficulty switch. Plutos also has features a unique weapons power-up system. There are three different types of weapons, each of which can be upgraded up to four times, as well as an invincibility power-up. The three different weapons are: Dual machine guns, spread gun, and energy gun. \n \nA partially compiled version of Plutos was discovered by Curt Vendel, and thanks to the efforts 7800 enthusiasts Robert DeCrescenzo, Mitchell Orman, and Eckhard Stolberg, made playable on 7800 hardware. It's a shame that Plutos was not released as it was obviously very close to completion and would have been a boost to the 7800 library.","popularity":1.333333333333333,"games":[28029,68287,36950,76722,76246,19341,306,64204,17522,10039],"tags":[1,18,268435461,268435489,1073741827],"developers":[11701],"publishers":[11247],"category":0,"player_perspectives":[3],"game_modes":[1,2],"themes":[1,18],"genres":[5,33],"first_release_date":567907200000,"platforms":[63,16],"release_dates":[{"category":2,"platform":16,"date":567907200000,"region":2,"human":"1987","y":1987,"m":12},{"category":2,"platform":63,"date":567907200000,"region":2,"human":"1987","y":1987,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s4lnfdlwomgqwpsvmhlx.jpg","cloudinary_id":"s4lnfdlwomgqwpsvmhlx","width":1000,"height":1022}}