{"id":23343,"name":"Fortress of Narzod","slug":"fortress-of-narzod","url":"https:\/\/www.igdb.com\/games\/fortress-of-narzod","created_at":1472866282313,"updated_at":1517271028456,"summary":"The player controls a hovercraft on its ascent up a mountain range with the goal of reaching the fortress at its summit. Each screen is part of a roadway, which is defended by three waves of guardians. These waves of guardians consist first of the Doomgrabbers, then the Tarantulas and finally the Ghouls. Each wave makes its descent down the roadway and towards the player, which all of one wave needs to be destroyed before the next wave begins its descent. Contact with enemies or the Spikers which are randomly released from the Doomgrabbers will result in the loss of a life. \n \nThe player's own fire has the ability to ricochet off the walls of the roadway. This not only has the benefit of creating angles, which the player may destroy the enemies without them being able to return fire, but can also be a disadvantage due to the ability for the shot to return and destroy the player's ship. \n \nAfter three waves, the player is allowed to move up the screen and to the next roadway. Each roadway has the same enemies, although in increasing numbers. With the second roadway comes the addition of the Warbirds, who fly over the entire mountain and are able to fire at the player in the third roadway. \n \nOnce three roadways have been","popularity":1.333333333333333,"games":[37088,47823,16468,51485,36950,1221,26848,23175,59516,28029],"tags":[1,17,268435461,268435487,268435489,536873246,536880437,1073741826],"developers":[9539],"publishers":[9539],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[2334,9525],"themes":[1,17],"genres":[5,31,33],"first_release_date":410140800000,"platforms":[70],"release_dates":[{"category":2,"platform":70,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/srzatcrjteumfkeokddj.jpg","cloudinary_id":"srzatcrjteumfkeokddj","width":800,"height":1020}}