{"id":24943,"name":"Modern Zombie","slug":"modern-zombie","url":"https:\/\/www.igdb.com\/games\/modern-zombie","created_at":1476371757904,"updated_at":1476371988427,"summary":"The game is a horror-survival MMO, based on players enduring the hardships of a post-apocalyptic, zombie-infested world… By collaborating with other players and by finding\/looting weapons and items the players increase their chances of survival. The game boasts one of the best character customisation systems seen in any game (AAA or indie) and incorporates survival elements like hunger and thirst, which gradually grow over time. Supplies such as food and water can be found to battle the hunger and thirst. If the player fails to properly quench their hunger and thirst, the player's character will eventually die thus, continuing the cycle of life and death in the game. Unlike other similar projects there is no plan to add player vs player (PvP) combat.","storyline":"Modern Zombie is a new, exciting, horror-survival game available to download on windows PC. The game is based on players enduring the hardships of a post-apocalyptic, zombie-infested world… By collaborating with other players and by finding\/looting weapons and items the players increase their chances of survival. The game incorporates survival elements like hunger and thirst, which gradually grow over time. Supplies such as food and water can be found to battle the hunger and thirst. If the player fails to properly quench their hunger and thirst, the player's character will eventually die thus, continuing the cycle of life and death in the game. Unlike other similar projects there is no plan to add player vs player (PvP) combat.\nThe game is currently in a stable release but still in early development with many features yet to come and current features to be further developed. Upcoming features include drivable vehicles, Looting & crafting, global-inventory and more.\n\nFind out if you can survive by visiting: www.ModernZombie.net","popularity":1.333333333333333,"games":[68142,968,6188,27266,76229,18877,26192,59516,29525,28029],"tags":[19,268435461,536870917,536873651,1073741825],"game_engines":[13],"category":0,"player_perspectives":[1],"game_modes":[5],"keywords":[5,2739],"themes":[19],"genres":[5],"first_release_date":1475971200000,"status":4,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1475971200000,"region":8,"human":"2016-Oct-09","y":2016,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fcggw5tbkudd6jdjpitq.jpg","cloudinary_id":"fcggw5tbkudd6jdjpitq","width":1919,"height":1077},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fsj5zrao4vkntjmwpbm7.jpg","cloudinary_id":"fsj5zrao4vkntjmwpbm7","width":1919,"height":1079},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dprysmog0uurlhrb14si.jpg","cloudinary_id":"dprysmog0uurlhrb14si","width":1919,"height":1079}],"videos":[{"name":"Trailer","video_id":"ZBfEPMzUcNI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/palmoz6dw0r6camyhweb.jpg","cloudinary_id":"palmoz6dw0r6camyhweb","width":1919,"height":1079},"esrb":{"rating":1},"websites":[{"category":1,"url":"http:\/\/modernzombie.net"},{"category":5,"url":"http:\/\/Twitter.com\/modernzombieuk"},{"category":4,"url":"http:\/\/facebook.com\/modernzombieuk"}]}