{"id":47043,"name":"Widelands","slug":"widelands","url":"https:\/\/www.igdb.com\/games\/widelands","created_at":1499712210290,"updated_at":1516617885762,"summary":"Widelands is a free, open source real-time strategy game with singleplayer campaigns and a multiplayer mode. The game was inspired by Settlers II™ (© Bluebyte) but has significantly more variety and depth to it. Still, it is easy to get started through playable tutorials. \n \nIn Widelands, you are the regent of a small clan. You start out with nothing but your headquarters, where all your resources are stored. \n \nIn the course of the game, you will build an ever growing settlement. Every member of your clan will do his or her part to produce more resources - wood, food, iron, gold and more - to further this growth. The economic network is complex and different in the three tribes (Barbarians, Imperials, and Atlanteans). \n \nAs you are not alone in the world, you will meet other clans sooner or later. Some of them may be friendly and you may eventually trade with them. However, if you want to rule the world, you will have to train soldiers and fight. \n \nWidelands offers a unique style of play. For example, a system of roads plays a central role in your economy: all the goods that are harvested and processed by the tribe must be transported from one building to the next. This is done by carriers, and those carriers always walk along the roads. It is your job to lay out the roads as efficiently as possible. \n \nAnother refreshing aspect of the game is the way you command your clan. There is no need to tell every single one of your subjects what to do - that would be impossible, because there can be thousands of them! Instead, all you need to do is order them to build a building somewhere, and the builders will come. Similarly, whenever you want to attack an enemy, just place an order to attack one of their barracks, and your soldiers will march to fight. You're really a ruler: You delegate in times of war and in times of peace! \n \nWidelands offers single-player mode with different campaigns; the campaigns all tell stories of tribes and their struggle in the Widelands universe! However, settling really starts when you unite with friends over the Internet or LAN to build up new empires together - or to crush each other in the dusts of war. Widelands also offers an Artificial Intelligence to challenge you. \n \nIn the end, Widelands will be extensible, so that you can create your own tribe with their own set of buildings, create new worlds to play in, and even create new types of worlds (who says you can't build a settlement on the moon?).","popularity":1.333333333333333,"games":[39257,29173,55689,55590,9789,33603,8773,36962,55888,55029],"tags":[268435467,268435469,268435471,536871208,536871906,536872383],"category":0,"keywords":[296,994,1471],"genres":[11,13,15],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eiezv18enqohgxcixrt8.jpg","cloudinary_id":"eiezv18enqohgxcixrt8","width":1280,"height":735},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hbd57ygcw2rcusvzrcvn.jpg","cloudinary_id":"hbd57ygcw2rcusvzrcvn","width":1278,"height":742},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r34ktjlfhtsgw0mogmvf.jpg","cloudinary_id":"r34ktjlfhtsgw0mogmvf","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jv1vv3bixsvsztpwiktj.jpg","cloudinary_id":"jv1vv3bixsvsztpwiktj","width":1280,"height":666}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hrbjloyo8z5r2dh0nhuc.jpg","cloudinary_id":"hrbjloyo8z5r2dh0nhuc","width":600,"height":370}}