{"id":54543,"name":"Stargate Network","slug":"stargate-network","url":"https:\/\/www.igdb.com\/games\/stargate-network","created_at":1501884235847,"updated_at":1501936008316,"summary":"Stargate Network is an online game based on the simulation and exploration of many worlds from the Stargate universe, reproduced with a great realism and an attention to details. You will find the planets and spaceships of the series Stargate SG-1, Stargate Atlantis and later on Stargate Universe, reproduced with the highest possible fidelity. \n \nThe primary means of transport will of course be the Stargate. Special attention was given to its operation. The connection works deferred: it means that once an address is dialed and validated, the chevrons of the arrival gate are activated in order before the Gate opens. \n \nOn most planets you will find a DHD to compose an address. But in the SGC you can access dozens of programs, viewable in full-screen mode, that allow to view and controll precisely the activation process softwares! \n \nOnce the event horizon entered, the player finds himself in a sequence of desintegration, followed by a trip along a beautiful vortex. \n \nIn this game, you can play a character created by you and evolve in the Stargate universe depending on your choices. It is an open world game in which you can explore freely, or carry out missions if you are on active service to your faction. \nYour character will be defined by different characteristics : \n \n- Embodied race, it can grant you various physical, mental or technological bonuses. \n- The faction you belong to, that will influence your type of gameplay. \n- The class corresponding to your area of expertise. \n- A grade that can vary depending on your faction, and define your access and hierarchy within your homebase. \n- A team to carry out missions in cooperative mode. \n \nDepending on your race and your strengh, you will evolve differently from the others: the technologies are different, and weaponry too. Indeed, weapons will also be useful! You're not alone to travel the galaxy, and not everyone is lovely and friendly... \n \nAttention to detail and gameplay possibilities have been increased for the most important places of the franchise. Therefor the SGC is at the heart of our focus. \n \nThe Stargate Center is faithfully recreated, with the use of official blueprints of the series we have access to, as well as many pictures taken by fans in studios. Most of the objects, like computing equipment and enclosures have been identified on Internet to play the best. Hardcore fans of Stargate will be amazed by the amount of detail to the last bolt! \n \nIf you are lucky enough to find a Zero Point Module, you can unlock the 8th chevron and discover the amazing lost city of the Ancients, dormant beneath the ocean. However, this place will not be without danger. To find energy to maintain in the defenses of the city will soon become your main goal when it comes to protect the city against the many enemies who covet Atlantis...","franchise":562,"franchises":[562],"popularity":4,"games":[25311,37419,34919,90099,72813,17130,105269,25300,31712,55123],"tags":[1,18,38,268435469,268435480,268435488,536871037,1073741825],"developers":[13232],"publishers":[13232],"game_engines":[439],"category":0,"player_perspectives":[1],"game_modes":[5],"keywords":[125],"themes":[1,18,38],"genres":[13,24,32],"status":2,"platforms":[6,14,3],"release_dates":[{"category":7,"platform":3,"region":8,"human":"TBD"},{"category":7,"platform":14,"region":8,"human":"TBD"},{"category":7,"platform":6,"region":8,"human":"TBD"}],"alternative_names":[{"name":"SGN","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rvpv8ea1ehi4gbfomiwb.jpg","cloudinary_id":"rvpv8ea1ehi4gbfomiwb","width":800,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cgkwfinugxfqkhid1rla.jpg","cloudinary_id":"cgkwfinugxfqkhid1rla","width":800,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gucpznmw3w9ozu4yc1cu.jpg","cloudinary_id":"gucpznmw3w9ozu4yc1cu","width":800,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gyc1vszcctjid3yqs3jf.jpg","cloudinary_id":"gyc1vszcctjid3yqs3jf","width":800,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bkm42s1vr3kgqpslcjph.jpg","cloudinary_id":"bkm42s1vr3kgqpslcjph","width":800,"height":400}],"videos":[{"name":"Gameplay video","video_id":"ew7V3wUmc9o"},{"name":"Teaser","video_id":"ODrvf3TjTdM"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vswbl0vkvabjdboj9uyi.jpg","cloudinary_id":"vswbl0vkvabjdboj9uyi","width":1920,"height":1080},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/user\/SGNetworkOfficial"},{"category":5,"url":"https:\/\/twitter.com\/SGNetwork1"},{"category":4,"url":"https:\/\/www.facebook.com\/stargate.network.SGN"},{"category":1,"url":"https:\/\/www.stargate-network.net"}]}