{"id":87643,"name":"Snake Simulator","slug":"snake-simulator","url":"https:\/\/www.igdb.com\/games\/snake-simulator","created_at":1518817537887,"updated_at":1523428401345,"summary":"Enter a tropical rainforest and live the life of a poisonous Snake! Explore a lush jungle filled with ferocious animals and insects of all shapes and sizes. Raise a family, hunt down food, and battle for your life against fierce predators like tigers, crocodiles, and gorillas!\n\nDownload the Snake Simulator today while it's 50% OFF for a very limited time!\n\nGame Features\n+ REALISTIC SIMULATOR - You'll need to maintain your health, hunger, thirst and energy if you're going to survive in the hostile jungle!\n\n+ EPIC BATTLES - Use your razor sharp fangs, swift speed, and hypnotic stare to hunt down tasty critters and fight dangerous rainforest animals like the silverback gorilla!\n\n+ LEVEL UP YOUR SNAKE - Gain experience by defeating and devouring enemies and level up your snakes to increase their health, attack damage, and even unlock new abilities like Venom Shot!\n\n+ DEADLY ATTACKS - Spit poisonous venom on your foes that will damage them over time or use your hypnotic stare to mind-control enemies into doing your bidding!\n\n+ START A SNAKE FAMILY - Find a mate to bond with and raise your very own family of snakes! Hatch your eggs and watch your baby snakes grow in size and strength as they help you battle your enemies!\n\n+ REPTILE SURVIVAL GUIDE - Look to your handy survival guide for information on enemy wildlife, a map of the jungle, snake customizations, and much more!\n\n+ HUGE 3D ENVIRONMENT - Your snake is free to slither through a massive open-world environment that is more the double the size of the previous simulators and generated dynamically so that every hunt is unique!\n\n+ NEW TOUCH-BASED CONTROLS - Brand new intuitive controls let you navigate your animal like never before! Pinch to zoom and play from your snake's perspective or get a bird's eye view of the action!\n\n+ 24 UNIQUE JUNGLE SPECIES - Behold the largest collection of animals ever put into a single simulator! Hunt down rats, parrots, bats, elephants, hippopotamus, warthogs, crocodiles, gorillas, deer, tarantulas, tigers, jaguars and many more jungle animals!\n\n+ HD GRAPHICS - Stunning High Definition graphics will transport you to a lush jungle ecosystem and surround you with the crisp colors of nature's beauty! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!\n\n+ OPTIONAL BLOOD EFFECTS - Looking for more realistic action? If you are of age or have your parents permission, turn on the blood effects for some added combat ferocity!\n\n+ GLUTEN-FREE PROMISE - With all of our games you will always get the full game with no ads or additional purchases!\n\nDownload the Snake Simulator to wield the powerful poison and razor sharp fangs of a venomous snake!\n\nIf you liked living as a Snake then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies as a beautiful Bald Eagle, or check out the Cheetah Simulator and pounce on your prey in the wild savanna!\n\nFollow us on Facebook for more awesome animal games and simulators!\nfacebook.com\/glutenfreegames \n\nFollow us on Twitter too! We love hearing feedback and suggestions!\ntwitter.com\/glutenfreegames","rating":70,"popularity":1,"total_rating":70,"total_rating_count":0,"rating_count":0,"games":[43130,28277,41895,74378,25311,26145,44242,22425,28465,37419],"tags":[268435469,268435487],"category":0,"genres":[13,31],"first_release_date":1414972800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1414972800000,"region":8,"human":"2014-Nov-03","y":2014,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mfdygyyfrtswvbs5pmuz.jpg","cloudinary_id":"mfdygyyfrtswvbs5pmuz","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ucqrxmtqhrisreujcqyh.jpg","cloudinary_id":"ucqrxmtqhrisreujcqyh","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gjcsn85xpfuhckuc90tl.jpg","cloudinary_id":"gjcsn85xpfuhckuc90tl","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wckru5hydo5izaa2hckb.jpg","cloudinary_id":"wckru5hydo5izaa2hckb","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/utnxxdkujsgsor4sq7bb.jpg","cloudinary_id":"utnxxdkujsgsor4sq7bb","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/blzdjpvr4ojkjuun94pv.jpg","cloudinary_id":"blzdjpvr4ojkjuun94pv","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rzc41zbqoe6fs6yzuh86.jpg","cloudinary_id":"rzc41zbqoe6fs6yzuh86","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wn9nfcwss39jf72fkv73.jpg","cloudinary_id":"wn9nfcwss39jf72fkv73","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hlgirdfilfnf89yl26ck.jpg","cloudinary_id":"hlgirdfilfnf89yl26ck","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wwcucvw54wqqyot6najn.jpg","cloudinary_id":"wwcucvw54wqqyot6najn","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/waei2ttxrspypwcjmzwv.jpg","cloudinary_id":"waei2ttxrspypwcjmzwv","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/snake-simulator\/id915074326?mt=8&uo=4"}]}