{"id":18696,"name":"Ridge Racer","slug":"ridge-racer--1","url":"https:\/\/www.igdb.com\/games\/ridge-racer--1","created_at":1460165581841,"updated_at":1545173484225,"summary":"Ridge Racer (リッジレーサー Rijji Rēsā) is a 1993 racing video game developed and published by Namco. It was initially released on the Namco System 22 arcade system board, and was later ported to the PlayStation console in 1994. It is the first title in the long-running Ridge Racer series of games released for arcades and home consoles. The game's objective is to finish in first place in a series of races. Ridge Racer was among the first racing games to utilise polygon graphics to its full potential. The PlayStation version supports the use of Namco's NeGcon controller.\nThe first home version of Ridge Racer was released in Japan in 1994 as a launch title for the PlayStation; the versions for North America and Europe were released in 1995. The game was re-released in Japan for the PlayStation The Best range on 12 July 1997, and for the Greatest Hits and Platinum ranges in North America and PAL regions respectively the same year. The game played a major role in establishing the new system and in giving it an early edge over its nearest competitor, the Sega Saturn, and was considered a rival to Sega's Daytona USA.\nAfter release, Ridge Racer received a highly positive reception. Reviewers praised the graphics, audio, drifting mechanics, and arcade-like gameplay, although some reviewers were critical of the lack of strong artificial intelligence and multiplayer mode. The arcade version was followed by a sequel, Ridge Racer 2, in 1994, whereas the PlayStation sequel, Ridge Racer Revolution, was released on 3 December 1995 in Japan, and in 1996 in North America and PAL regions. The game's soundtrack was remixed and released on the Namco Game Sound Express Vol. 11 album.","storyline":"In the PlayStation version, the player can play a mini-game of Galaxian as the game loads. If the player wins before the game loads, eight additional cars become available to drive in the game. The twelve cars are varied in their specifications, with some featuring a high top speed, others excelling at acceleration or turning, and others being more balanced. Certain cars are named after other Namco games such as Solvalou, Mappy, Bosconian, Nebulasray, and Xevious. Once the game has loaded, all the CD is needed for afterwards is to play six instrumental music tracks. The player can replace the disc at any time during gameplay, although the game does not update to reflect the switch; regardless of what disc is inserted, there will always be six tracks to choose from, corresponding the starting points of the six tracks on the game disc.\nAfter launching the game, the player can choose a course, transmission (automatic or six-speed manual), car and song. During the race, the player can observe the racetrack from the first-person perspective (or from the third-person perspective for the PlayStation version). Namco's NeGcon controller can be used to play the game. Being an arcade racer, collisions do no damage to the car, and merely slow the player down. There is also a time limit, which ends the game if it counts down to zero. Checkpoints are present throughout the track that give the player additional time when passed through.\nThe game features only a single race track, although it consists of four race configurations of varying difficulty; Novice, Intermediate, Advanced and Time Trial (in the latter two, the track is extended). The player races against eleven other cars except in Time Trial, where there is only one opponent. The higher the difficulty level, the faster the cars run, with Time Trial mode featuring the fastest cars. Each race consists of three laps (two on the beginner course). In the PlayStation version, after the player wins every race, \"extra\" races become available, which are raced on a reversed version of the course, and the player encounters an additional opponent in Time Trial mode; the 13th Racing \"Devil\" car, the fastest car in the game. Upon winning this race, the car is unlocked for the player to drive. In the arcade version, after finishing the game, the winning player's score is saved in action-replay highlights.\nThe PlayStation version also features hidden \"mirror\" version of the tracks. The track becomes a \"mirror image\" of itself; left turns become right turns and vice-versa, and the surroundings switch sides of the road.","collection":2133,"franchise":795,"franchises":[795],"rating":70.04950688839669,"popularity":2.333333333333333,"aggregated_rating":82,"aggregated_rating_count":1,"total_rating":76.02475344419835,"total_rating_count":7,"rating_count":6,"games":[103018,109292,27378,90688,107196,107215,81548,104983,55192,584],"tags":[268435466,1073741825,1073741826],"developers":[263],"publishers":[263],"category":0,"player_perspectives":[1,2],"game_modes":[1,2,4],"genres":[10],"first_release_date":754617600000,"platforms":[52,7],"release_dates":[{"category":0,"platform":52,"date":754617600000,"region":5,"human":"1993-Nov-30","y":1993,"m":11},{"category":0,"platform":52,"date":757382400000,"region":2,"human":"1994-Jan-01","y":1994,"m":1},{"category":0,"platform":52,"date":767318400000,"region":1,"human":"1994-Apr-26","y":1994,"m":4},{"category":0,"platform":7,"date":786412800000,"region":5,"human":"1994-Dec-03","y":1994,"m":12},{"category":0,"platform":7,"date":810604800000,"region":2,"human":"1995-Sep-09","y":1995,"m":9},{"category":0,"platform":7,"date":812332800000,"region":1,"human":"1995-Sep-29","y":1995,"m":9}],"alternative_names":[{"name":"リッジレーサー","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dzznzmcwvz8zmwhnxxfv.jpg","cloudinary_id":"dzznzmcwvz8zmwhnxxfv","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f3mmrrkdscv2ouzfglrw.jpg","cloudinary_id":"f3mmrrkdscv2ouzfglrw","width":320,"height":240}],"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uehqnc3qf0daockhguwl.jpg","cloudinary_id":"uehqnc3qf0daockhguwl","width":4000,"height":2500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j0hbgjv3jx1csrizhgb8.jpg","cloudinary_id":"j0hbgjv3jx1csrizhgb8","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ioagjwobcpgjkc3ivnob.jpg","cloudinary_id":"ioagjwobcpgjkc3ivnob","width":4000,"height":2827}],"videos":[{"name":"Gameplay video","video_id":"ktXROLeRch4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uzyopat54yp8jl4q9s2j.jpg","cloudinary_id":"uzyopat54yp8jl4q9s2j","width":600,"height":600},"esrb":{"rating":1},"pegi":{"rating":1},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Ridge_Racer_(video_game)"}]}