{"id":2396,"name":"WW2 Air Force Commander","slug":"ww2-air-force-commander","url":"https:\/\/www.igdb.com\/games\/ww2-air-force-commander","created_at":1372877684788,"updated_at":1516160673214,"summary":"Take command of the airforce in this exciting and challenging simulation of air warfare in the Second World War! As commander, you'll have complete control over your side's entire air force, and must plan how to use them to best effect. Decide where to locate each unit, and set up appropriate missions for each one. You'll need to set up defensive patrols to secure the safety of your key sites as well as offensive missions to take out the enemy's strike capability!\n\nThe Battle of Britain early, in World War II was the first large-scale air war. Continental Europe had fallen to the Nazi Blitzkrieg attacks, and Britain alone remained free and fighting. Without the years of preparation the Germans had, the Royal Air Force had many fewer planes than the Luftwaffe; the outlook was bleak. But with heroic bravery and careful planning, the Spitfires and Hurricanes managed to stave off German bombers for long enough for Britain to survive, and America to join in the fight against tyranny.\n\nNow you can recreate this and many other scenarios. The Battle of Britain showed just how important it is to be master of the skies- are you up to the job?\n\nAir Force Commander: World War Two Edition, is the second game in the Air Force Commander series, and follows the success of the first game, set in the Middle East.","popularity":1.333333333333333,"games":[18623,44242,43115,22399,22470,29173,27783,26145,22425,21642],"tags":[22,39,268435469,536870931,536871188,536872060,536873753,1073741827],"publishers":[575],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[19,276,1148,2841],"themes":[22,39],"genres":[13],"first_release_date":757296000000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":757296000000,"human":"1993","y":1993,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lu9dwdqb1sjm5dnfebyu.jpg","cloudinary_id":"lu9dwdqb1sjm5dnfebyu","width":643,"height":919}}