{"id":39996,"name":"Vapor Trail","slug":"vapor-trail","url":"https:\/\/www.igdb.com\/games\/vapor-trail","created_at":1498466686898,"updated_at":1515731100520,"summary":"The game features 2 players controlling the jet fighters simultaneously for battle across numerous levels. There are 3 types of jets varying from different classes of speeds and firepower. The Silph is the midrange plane with the most balance. While the Valkyrie carries the most firepower, and the Seylen jet is capable of flying at the highest mach speed. Weapon upgrades are available throughout the game, ranging from homing missiles, ring guns, flame throwers and many more. Each jet may also activate the shield manually in times of trouble. \nWeapons \n \nPlayers have a choice between four different standard pick-up weapons: Vulcan – the player's default weapon which fires straight forward, but can flare out to destroy larger groups of enemies depending on the jet selected. Bombs – a straight firing, explosive weapon that retains the same firing pattern for all jets, but increases in launch count (number of times it can be fired at once) when upgraded. Defender – an explosive cluster-shot weapon that encircles the player's jet and remains the same when upgraded, but increases in count much like the Bombs. Missiles – homing missiles that fire from multiple directions of the jet. Similar to the Vulcan, the Missiles fire in different directions depending on the jet that is used. \n \nEvery jet is equipped with a roll device that allows them to kamikaze safely into other jets. The roll must be re-charged after every use. Players also have the choice to pick up the S-Unit, a weapon attachment that empowers the jet's firing no matter what weapon is picked-up previously and every jet's S-Unit attack differs from the others. Once the S-Unit is equipped, the player cannot use their previous weapons unless the S-Unit is detonated. Detonating the S-Unit does not harm the player, but it does harm the enemy as the unit will detonate in a large and powerful explosion.","collection":4016,"popularity":1.333333333333333,"games":[68287,36950,27314,64204,28029,10209,26766,25300,11253,71455],"tags":[18,268435461,536871078,536871213,536871882,536872733,536873753,536874398,536874745,536875871,536875879,536876120,536880481,536883347],"category":0,"keywords":[166,301,970,1821,2841,3486,3833,4959,4967,5208,9569,12435],"themes":[18],"genres":[5],"first_release_date":602294400000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":602294400000,"region":8,"human":"1989-Feb-01","y":1989,"m":2}],"alternative_names":[{"name":"Kuhga: Operation Code Vapor Trail","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bedfjmrzhv25tky2xgcc.jpg","cloudinary_id":"bedfjmrzhv25tky2xgcc","width":850,"height":1101},"esrb":{"rating":1}}