{"id":4296,"name":"Immercenary","slug":"immercenary","url":"https:\/\/www.igdb.com\/games\/immercenary","created_at":1390762111405,"updated_at":1515668783622,"summary":"In the future, mankind has been enslaved in a virtual reality simulation known as Perfect. This simulation is controlled by an entity known as Perfect1 and it has to be destroyed in order to shut down the system. You are Immercenary Number Five, and it's your job to do it. \n \nFrom a secret lab you log into the simulation which sends you to a place in Perfect known as the Garden. Every entity in the game has a certain rank that determines its offensive and defensive capabilities. You start at 255, the lowest rank, and must rise in ranks to defeat Perfect1, who holds rank number 1. To do so, you destroy higher-ranked Rithms, as the other entities in the game are called. To pass beyond certain ranks, unique Rithms high in the Perfect hierarchy have to be destroyed. \n \nDifferent weapons and power-ups can be collected and spent offensive and defensive energy can be recharged at energy spires. In the center of the Garden is a place called DOAsys, which functions as a neutral zone and healing center. There you can talk to other Rithms and ask for hints about combating special Rithms and where to find special items. These dialogue sequences take the form of live action clips of actors in elaborate costumes playing the Rithms. \n \nWhen the player logs out of the simulation or is violently forced out, he returns to the lab where one may load and save a game and access detailed statistics on the trips to Perfect.","popularity":1.333333333333333,"games":[27314,36950,26766,25300,68287,11156,7350,1877,28029,7329],"tags":[1,18,268435461,536871015,536871213,536871365,536871882,536871938,536872371,536874398,536874745,536875151,536875197,536875242,536875426,536875934,536876575,536876663,536879174,536880226,536882359,1073741825],"category":0,"player_perspectives":[1],"keywords":[103,301,453,970,1026,1459,3486,3833,4239,4285,4330,4514,5022,5663,5751,8262,9314,11447],"themes":[1,18],"genres":[5],"first_release_date":820368000000,"platforms":[50],"release_dates":[{"category":2,"platform":50,"date":820368000000,"human":"1995","y":1995,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wst1q06plazq1eqrzrpx.jpg","cloudinary_id":"wst1q06plazq1eqrzrpx","width":1556,"height":3014},"esrb":{"rating":5}}