{"id":88096,"name":"Adventure Time Game Wizard - Draw Your Own Adventure Time Games","slug":"adventure-time-game-wizard-draw-your-own-adventure-time-games","url":"https:\/\/www.igdb.com\/games\/adventure-time-game-wizard-draw-your-own-adventure-time-games","created_at":1519228615937,"updated_at":1523240631996,"summary":"\"Truly innovative and potentially infinite, Adventure Time Game Wizard is an essential purchase for younger players interested in making games, and doubly-so for for fans of the show” - Pocket Gamer\n\n\"maybe ten, fifteen, twenty years from now, the next great game is going to be made by someone who downloaded this and had this spark a dream of making games.\" - TouchArcade\n\nGame Wizard gives you the power to make and play Adventure Time games!\n \nA MASSIVE NEW ADVENTURE!\nFinn and Jake face an all-new villain: Doodle Wizard! Battle his sketchy army across a huge open world including the Grasslands, Candy Kingdom, Ice Kingdom, Dungeons, and more. Play for hours in Adventure Mode, or make your own adventures!\n\nDRAW YOUR OWN GAMES!\nUse the Doodle Wizard’s secret glyph language to design custom video games. Fill your games with traps, loot, portals, enemies, and so much more! \n\nTWO WAYS TO CREATE!\nYou can draw your games on paper and scan them in, or make mathematical levels directly in the app! Instantly turn your level design into a playable game! **Rear-facing camera required for scanning**\n\nSO MANY HEROES!\nGame Wizard has tons of peeps to play with. Design games with Finn, Jake, BMO, Ice King, Flame Princess, Marceline and Fionna & Cake! That’s some real A-list talent.\n\nSHARE IN THE ARCADE!\nCheck out the Arcade to share your games, and play tons of games made by other players! Follow your favorite creators so you’ll never miss a new game.\n\nORIGINAL CHARACTER VOICES!\nGame Wizard features original voiceover from Finn, Jake, Ice King, Princess Bubblegum, and special guest “Weird Al” Yankovic as the Doodle Wizard. \n\nDraw your own Adventure Time games in GAME WIZARD! Wizards rule!\n\n\n*****\n\nThis game is available in the following languages: Arabic, Chinese, English, French, Italian, Japanese, Korean, Portuguese, Russian, Spanish, Turkish\n\nIf you're having any problems with this app, feel free to contact us at advanced.platforms@turner.com. Tell us about the issues you're running into as well as what device and OS version you're using. \n\n*****\n\nIMPORTANT CONSIDERATIONS: \nThis app may contain ads that feature other products, services, shows or offers from Cartoon Network and our partners.\n\nPRIVACY INFORMATION: \nYour privacy is important to us at Cartoon Network, a division of Turner Broadcasting System, Inc. This game collects and uses information as described in Cartoon Network’s Privacy Policy linked below. This information may be used, for example, to respond to user requests; enable users to take advantage of certain features and services; personalize content; serve advertising; perform network communications; manage and improve our products and services; and perform other internal operations of Cartoon Network web sites or online services. Our privacy practices are guided by data privacy laws in the United States. For users residing in the EU or other countries outside the U.S., please note that this app may use persistent identifiers for game management purposes. By downloading this application, you accept our Privacy Policy and End User License Agreement, and you give permission for such uses for all users of your device. The Privacy Policy and End User License Agreement are in addition to any terms, conditions or policies imposed by your wireless carrier and Apple, Inc. Cartoon Network and its affiliates are not responsible for any collection, use, or disclosure of your personal information by Apple or your wireless carrier. \n\nTerms of Use: http:\/\/www.cartoonnetwork.com\/legal\/termsofuse.html \nPrivacy Policy: http:\/\/www.cartoonnetwork.com\/legal\/privacy\/mobile.html","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[14605,51485,43130,17469,23175,28277,27266,63734,72412,63718],"tags":[268435487,268435489],"category":0,"genres":[31,33],"first_release_date":1421625600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1421625600000,"region":8,"human":"2015-Jan-19","y":2015,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hrn816lg1jmx0odo6fvf.jpg","cloudinary_id":"hrn816lg1jmx0odo6fvf","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ukixjyznjr6bbf7oxa4a.jpg","cloudinary_id":"ukixjyznjr6bbf7oxa4a","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ul370zuzxqapvizsczrc.jpg","cloudinary_id":"ul370zuzxqapvizsczrc","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wlnru650eusg66ccvlmv.jpg","cloudinary_id":"wlnru650eusg66ccvlmv","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bmcaazanls14qzf9vaj0.jpg","cloudinary_id":"bmcaazanls14qzf9vaj0","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oy7iupgn99nfwy9rmpwb.jpg","cloudinary_id":"oy7iupgn99nfwy9rmpwb","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ywjcbsugblemdks9djjx.jpg","cloudinary_id":"ywjcbsugblemdks9djjx","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iat7qojssig1dyhhxd0g.jpg","cloudinary_id":"iat7qojssig1dyhhxd0g","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kuozmqy52dymed6r1xue.jpg","cloudinary_id":"kuozmqy52dymed6r1xue","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/prd7le2zppq0x9gieig3.jpg","cloudinary_id":"prd7le2zppq0x9gieig3","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o1scthvnwmlvx1gb9zlf.jpg","cloudinary_id":"o1scthvnwmlvx1gb9zlf","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/adventure-time-game-wizard-draw-your-own-adventure\/id934484238?mt=8&uo=4"}]}