{"id":13649,"name":"Everyone's a Wally","slug":"everyones-a-wally","url":"https:\/\/www.igdb.com\/games\/everyones-a-wally","created_at":1445069638487,"updated_at":1500208898761,"summary":"Everyone's a Wally was the first arcade adventure game to feature multiple playable characters - a revolutionary feature at the time. Players began in control of Wally (a builder and handyman), but could switch to Wilma (his wife), and their friends Tom (a punk mechanic), Dick (a plumber) and Harry (a hippie electrician) - these last three names drawn from the placeholder phrase Tom, Dick and Harry. Herbert (their baby son) also appeared in the game as a mobile hazard NPC. The player cannot freely change character; the player begins in control of Wally and in order to switch must be on the same screen as the desired character. Those not being controlled by the player wander randomly around the map controlled by extremely simple AI - another feature that at the time had never been seen before. Lives and health (called \"endurance\") were tracked independently for each character, but the game ended if any character died. \n \nThe aim of the game is to complete a day's worth of work for each character; each character has a job to do stereotypical of their skill - for instance, Wally has to build a wall, Wilma has to take back three books to the library, etc. Completing the job awards the character with a letter, which spells out a password to open a safe holding everyone's wages. The eventual password is \"BREAK\" - knowing this does not spoil the game since most of the letters can be seen before jobs are complete; the game requires them to be actually collected before allowing the safe to open.","collection":1769,"popularity":1.333333333333333,"games":[25646,36608,19222,34919,41348,40524,2969,23175,10225,16468],"tags":[1,268435465,1073741828],"developers":[11770],"publishers":[11770],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[1],"genres":[9],"first_release_date":504835200000,"platforms":[15,26,25],"release_dates":[{"category":2,"platform":26,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12},{"category":2,"platform":15,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12},{"category":2,"platform":25,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12}],"alternative_names":[{"name":"The Life of Wally"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u8fjj0erycka2dumw1os.jpg","cloudinary_id":"u8fjj0erycka2dumw1os","width":1000,"height":1391}}