{"id":23249,"name":"Chemicus","slug":"chemicus","url":"https:\/\/www.igdb.com\/games\/chemicus","created_at":1472548798647,"updated_at":1476108184830,"summary":"Journey to the other side of reality, to a virtual city shrouded in secrecy. Welcome to Chemicus, a land where scientific knowledge from the beginning of time is protected and wields sacred powers. You play as an accidental intruder transported to Chemicus by an ancient amulet. Your unintended presence has threatened the tranquility of this virtual city, and it's up to you--if you dare--to restore harmony before it's too late.\n\nIn Chemicus: Journey to the Other Side players gain knowledge and use their intelligence to solve challenging riddles and unlock the city's darkest secrets. Take up the quest for ancient science truths and discover powerful tools; explore science facts and gather essential resources; experiment with chemical elements and discover the ultimate power. Chemicus awaits your return with stunning 3-D movies, riveting animation, more than 2,000 3-D images, exotic landscapes, and mysterious interiors.","storyline":"A man by the name of Richard accidentally discovers the portal into an unknown city called Chemicus. Richard chooses to enter the city, but when he enters he is captured by strange men wearing white hoods. After being captured he is locked up in a prison, where he is being held. Richard is accused of trespassing in Chemicus, and of attempting to steal \"transmission molecules\" in order to damage the city's energy source. The story is played through the eyes of one of Richard's friends, who enters Chemicus in a bid to help Richard escape captivity.","popularity":1.333333333333333,"games":[13189,25222,70396,15911,19297,236,41895,27725,22425,55803],"tags":[34,268435458,536871818,536871939,536873081,1073741825],"developers":[4826],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[906,1027,2169],"themes":[34],"genres":[2],"first_release_date":1009756800000,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":1009756800000,"region":1,"human":"2001","y":2001,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c7ah528czqb2m75mv2op.jpg","cloudinary_id":"c7ah528czqb2m75mv2op","width":800,"height":600}],"videos":[{"name":"Gameplay video","video_id":"jmhNBQow004"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cwma3jlz7yipuxaz0uft.jpg","cloudinary_id":"cwma3jlz7yipuxaz0uft","width":2479,"height":3087},"websites":[{"category":1,"url":"http:\/\/www.braingame-shop.de\/epages\/62390116.sf\/de_DE\/?ObjectPath=\/Shops\/62390116\/Products\/4020636105944"}]}