{"id":24949,"name":"Pokémon Uranium","slug":"pokemon-uranium","url":"https:\/\/www.igdb.com\/games\/pokemon-uranium","created_at":1476394686960,"updated_at":1517271063361,"summary":"Pokemon Uranium takes place in the tropical Tandor region, home to over a hundred new and unique species of Pokemon. The Tandor region is known for its gym challenge: to qualify, trainers must collect 8 gym badges from around the region in order to compete in the prestigous Tandor Regional Tournament. Trainers that win the Tournament get a huge prize as well as world wide renown. \n \nYou, a 13-year-old kid from Moki Town, did not set out to become a Pokemon Master. After your mother Lucille died ten years ago in an accident at a nuclear power plant, your father Kellyn, the top Pokemon Ranger in the Tandor Ranger Union, left you with your elderly aunt and departed to travel the region. But now that you are grown up, your aunt can no longer support you. Out of a home, you did what most kids your age do and took up Pokémon training as a means to make a living. \n \nProfessor Bamb'o, regional expert on Pokémon elements, has been looking for a trainer assistant to travel the region and gather specimens of the varied wildlife. You step up to the challenge, along with your rival, a younger boy named Theo. After taking a test and receiving your starter Pokémon, you head towards your first gym challenge in Nowtoch city, and take your first steps exploring the Tandor region. \n \nThings aren't as sunny as they first seem, though. Just when the accident ten years ago had been all but forgotten, new mysteries emerge. A new power plant is built over the site of the old one. Your father begins acting strangely, journeying to the far reaches of the region and questioning whether your mother is really deceased. Sinister Pokemon, corrupted by nuclear radiation, threaten innocent people. In the midst ofthe turmoil, it seems that an impending disaster is looming over Tandor... You may be in for more than you expected.","rating":80.1082835416667,"popularity":1.333333333333333,"total_rating":80.1082835416667,"total_rating_count":4,"rating_count":4,"games":[36792,25311,26163,37088,47823,16468,26766,1221,23719,25300],"tags":[17,18,268435468,268435487,536871321,536872059,1073741827],"developers":[11280],"publishers":[11280],"game_engines":[334],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[409,1147],"themes":[17,18],"genres":[12,31],"first_release_date":1470441600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1470441600000,"region":8,"human":"2016-Aug-06","y":2016,"m":8}],"videos":[{"name":"Trailer","video_id":"q8NxPo4S4To"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aghcsuy52tgtypdexhdp.jpg","cloudinary_id":"aghcsuy52tgtypdexhdp","width":512,"height":384},"websites":[{"category":1,"url":"http:\/\/uranium.amibu.net"},{"category":2,"url":"http:\/\/pokemon-uranium.wikia.com\/wiki\/Main_Page"}]}