{"id":2649,"name":"Starforge","slug":"starforge","url":"https:\/\/www.igdb.com\/games\/starforge","created_at":1374359051128,"updated_at":1517270795953,"summary":"StarForge is a game about gathering resources, building bases, crafting anything you want, and surviving on an alien planet. Earth's star is dying and humanity transferred as much technology and resources as possible and left on a one way mission to populate another planet. \r\n\r\nStarForge was inspired by Halo, Warcraft 3, Borderlands, Terraria, and Minecraft. It borrows elements from the RTS, FPS, RPG, Voxel Builder, Tower Defense, and Physics Sandbox genres. We are building a dark and serious universe and want the player to live out their own unique story on the procedural planet.","storyline":"Earth - Why We Left\r\n\r\n\r\nDuring the years 2073-2253 Humanity enjoyed relative peace on earth and most funds were diverted to deep space exploration and small bases were setup on the Moon and Mars. However a new problem soon emerged. A large increase in earthquakes started to occur, not just on Earth, but on the Moon and Mars as well. As it was soon to be discovered, a rogue black hole had entered into a large decaying orbit with the Sun. The estimates shown that in less than a thousand years, the gravitational tidal forces would become too great for any planet in the solar system to be livable.\r\n\r\nTo deal with this harsh reality, the nations of Earth created the New Space Initiative. All telescopes available scanned the skies for new worlds while archives of ones currently known were scanned below.\r\n\r\nA planet was found and deemed habitable. It came to be known as Atlas, due to our hopes that one day it would carry the Earth on its shoulders. Also at this time, scientists discovered how to make objects travel at almost the speed of light. However, even with the relativistic effects of near light-speed travel and medical advances in longevity, the planet was still too far away for any human to reach in one lifetime.\r\n\r\nSo, for the next 1000 years, Earth sent resources to this new planet in hopes of one day sending humans there. Every corporation on Earth was required to send massive amounts of equipment and weaponry. They were contained in huge freighters on a one way mission. With the frieghters, the sum total of human knowledge was also included on various data disks so nothing would be forgotten. To help prepare the planet for habitation, robots were also sent to seed the land with common trees, grasses, food, and shrubs.\r\n\r\nIt was soon determined, via the superlunimal communicators carried by the freighters, that many of the advance supplies which had been sent were disappearing. Details were sparse on what was occuring, but it appeared that they were being taken by creatures that were acting in a seemingly intelligent way; and these were the ones that arrived to begin with, many were lost on the way there due to unknown reasons. Despite this fact, supplies continued to be sent; too much had already been invested to turn back.\r\n\r\nIt was the dawn of the new millennium. There was a somber tone in the streets of every city on every corner of the Earth. Everyone was under the shadow of death on top of the quaking earth. It would have been better to be maimed and thrown in the depths of the seas then live through these times.\r\n\r\nFortuitously, it then came: The invention of warp drive, allowing man to travel into the depths of space within an instant.\r\n\r\nIn the year 3085, you have already left Earth, choosen through a lottery system to be part of Humanity's new home. With you aboard the Lifeships, countless others travel in their cryopods, sleeping with the dream that they will be able to wake up and have a second chance. You have been choosen as one of the advance scouts that will prepare the way for the others.\r\n\r\nAfter being sent ahead of the massive Lifeships, contact with them was soon lost and to make matters worse, most of the advance scouts were hit by unexpected atmospheric turbulance on the way in, scattering everyone and everything and wrecking most of what you carried.\r\n\r\nAfter first planet fall on Atlas, your only goal now is to survive the new planet and ensure humanity's survival. Whatever it takes, you must now face the unknown alone...","hypes":3,"rating":10.1775779095944,"popularity":6.666666666666667,"total_rating":10.1775779095944,"total_rating_count":3,"rating_count":3,"games":[19249,37016,36950,68287,25311,55038,25300,19301,17130,18290],"tags":[1,18,21,41,268435461,268435469,268435487,268435488,536870972,536870983,536871251,536871365,536871507,536871882,536872060,536872406,536873405,536875060,536875169,536875299,536875807,536875869,536876268,536876282,536879076,536882110,1073741825,1073741827],"developers":[1248],"category":0,"player_perspectives":[1,3],"game_modes":[1,2],"keywords":[60,71,339,453,595,970,1148,1494,2493,4148,4257,4387,4895,4957,5356,5370,8164,11198],"themes":[1,18,21,41],"genres":[5,13,31,32],"first_release_date":1410998400000,"status":4,"platforms":[6,14],"release_dates":[{"category":0,"platform":14,"date":1410998400000,"region":8,"human":"2014-Sep-18","y":2014,"m":9},{"category":0,"platform":6,"date":1410998400000,"region":8,"human":"2014-Sep-18","y":2014,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bahgsg0fgyjxkvd5mw1b.jpg","cloudinary_id":"bahgsg0fgyjxkvd5mw1b","width":1024,"height":576},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zxnn4vew4ngl9xh2xk4o.jpg","cloudinary_id":"zxnn4vew4ngl9xh2xk4o","width":1820,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uzkheiwscghqrkoywnlw.jpg","cloudinary_id":"uzkheiwscghqrkoywnlw","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cc9rt496taeg1ix3azke.jpg","cloudinary_id":"cc9rt496taeg1ix3azke","width":600,"height":300},"websites":[{"category":1,"url":"http:\/\/www.starforge.com\/"}]}