{"id":30149,"name":"Angelica Weaver: Catch Me When You Can - Collector's Edition","slug":"angelica-weaver-catch-me-when-you-can-collectors-edition","url":"https:\/\/www.igdb.com\/games\/angelica-weaver-catch-me-when-you-can-collectors-edition","created_at":1495385940166,"updated_at":1523271157000,"summary":"Building on the successes of their award-winning Midnight Mysteries adventure series, MumboJumbo has created an all-new adventure franchise. Boasting interactive backgrounds, story-driven puzzles, an animated main character, voice acting and a rich narrative filled with twists and turns, Angelica Weaver: Catch Me When You Can is action-packed and sure to be another hit!\n\n\nAngelica Weaver, a detective on Chicago’s Special Task Force, must use her renowned deductive skills to stop a present day killer. The only way for her to get ahead of this killer is to first identify a murderer who escaped justice over a hundred years ago. Angelica has the ability to connect with the dead. Through supersensory visions she is able to jump back and forth between crime scenes on the streets of historic London and present-day Chicago where the victims reveal to her their final moments. Work with Angelica as she puzzles her way through the past and uses her insights to stop the pattern in the future in this hidden object puzzle adventure.\n\n\nAngelica actively participates as you explore detailed environments and sift through hidden-object scenes for clues. Using Angelica’s journal and a highly developed hint system, close the case in the present and in the past, by piecing together game-changing information for an unexpected twist.\n\n\nAngelica Weaver’s intriguing story is complemented with stunning visuals and sound effects that captivate and surprise. This compelling adventure, full of challenges and dozens of unique puzzles, delivers yet another thrilling experience from MumboJumbo.\n\n\nBe the detective! Angelica Weaver and the city of Chicago enlist your help. \n\n\nKey Features:\n\nA gripping storyline providing many hours of in-depth game play\nOver one hundred and fifty realistically rendered scenes\nUnique story-driven puzzles\nCaptivating, life-like main character with voice-over\nCollector’s Edition includes a bonus chapter and unlockable unlimited hidden-object play mode, plus additional content (available on most platforms): concept art, screensavers and wallpapers","rating":60,"popularity":1.333333333333333,"total_rating":60,"total_rating_count":0,"rating_count":0,"games":[14605,17469,75586,25130,43130,23175,28277,63734,29646,27266],"tags":[268435487],"publishers":[3118],"category":0,"game_modes":[1],"genres":[31],"first_release_date":1357516800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1357516800000,"region":8,"human":"2013-Jan-07","y":2013,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mht1u6fnhrmbtmsaerlm.jpg","cloudinary_id":"mht1u6fnhrmbtmsaerlm","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hqfpmq8elmr5h0vtjifn.jpg","cloudinary_id":"hqfpmq8elmr5h0vtjifn","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sipfwbf8as7f2uqkpyby.jpg","cloudinary_id":"sipfwbf8as7f2uqkpyby","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gajvltokreyz5oqehmc7.jpg","cloudinary_id":"gajvltokreyz5oqehmc7","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k6eqzwusbaliz6qwlpks.jpg","cloudinary_id":"k6eqzwusbaliz6qwlpks","width":1920,"height":1080}],"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/218700"}],"external":{"steam":"218700"}}