{"id":42849,"name":"TOCA Race Driver 3 Challenge","slug":"toca-race-driver-3-challenge","url":"https:\/\/www.igdb.com\/games\/toca-race-driver-3-challenge","created_at":1499081863665,"updated_at":1500580244929,"summary":"TOCA Race Driver 3 (also known as DTM Race Driver 3 in mainland Europe, V8 Supercars 3 in Australia, and TOCA Race Driver 3 Challenge in the PlayStation Portable version) is the third title of TOCA racing video game series, developed and published by Codemasters, and released in 2006. The game features several fully licensed championships, including the DTM series and V8 Supercar championship. This is the last in the series to have TOCA in its title as following on from this TOCA was dropped in favour of just Race Driver (e.g. Race Driver GRID). \n \nIt includes 120 Championships and 35 Types of Racing through the Championship in World Tour, Pro Career, and Free Race. Also it has Bonus Championships in different disciplines. They take place largely in the UK and Germany, though many more tracks are unlocked by winning cups in Pro Career, or by setting a lap time record on a course within Pro Career mode. Open wheel, GT, Oval racing, Rallying and Off-road racing were all featured, and can be raced in either a detailed Pro Career mode or an open-ended World Tour. \n \nOnline play allows 12 and 8 players on Xbox and PlayStation 2, respectively. Currently, it is the only racing simulator for PlayStation 2 with an online racing mode. It received good reviews, frequently being compared favorably to Gran Turismo 4 and Forza Motorsport, in the aspects of cars on track, collision and wear damage. Custom tuning of suspension components for handling and gear ratios, and including braking ratio front to rear. A more through tuning setup for a race car was allowable more so then in a driving simulator like Gran Turismo 4, since TOCA Race Driver 3 was a racing simulator. \n \nThe game features many real-life competitions, including British GT, DTM, IRL and V8 Supercars, as well as a Vintage series, other GT series, and Rally. The Formula Williams FW27 is the featured car of the Formula 1 series in the game.","popularity":1.333333333333333,"games":[23314,18699,95640,95127,93853,91243,89117,88998,88522,87741],"tags":[268435466,268435470],"category":0,"genres":[10,14]}