{"id":5149,"name":"Novus AEterno","slug":"novus-aeterno","url":"https:\/\/www.igdb.com\/games\/novus-aeterno","created_at":1391880648647,"updated_at":1482894983220,"summary":"Start with a home planet that you can never lose. Expand your control outward across an unlimited universe of galaxies. It’s a sandbox in space where you can build your empire– and influence over other players. Do it anyway you wish: through diplomatic channels, intelligence, military might or economic power. Thousands and thousands of players at one time on one seamless map.\r\n\r\nThe game never stops; even when you are offline. There is always a way to rebuild and recover, and there are always potential new allies and foes ready to engage you on a truly galactic scale. The strategic choices you make today will affect your tactical efforts next week, next month, and even next year!\r\n\r\nEverything in Novus AEterno is completely up to the players who inhabit the universe.There are no pre-set missions and there are no pre-determined linear scripts that every player must progress through. Story arcs in the future will be based on the Lore and will occur galaxy-wide for every player to deal with at the same time, regardless of how long they have been playing. What you learn from the revelations of the story arc, and how you choose to respond to these new developments will determine how your galaxy and the larger universal map progresses.\r\n\r\nControl the galaxy by constructing a huge, near limitless variety of player-designed ships. Your ships have directional armor, weapons, varying speeds and can even be knocked around from explosions. Design your fleet tailored to the way you want to play.\r\n\r\nShip Customization lets you develop the perfect ship for the objectives at hand. Select your Ship Hull, then add weapons, shields, armor, engines and any specialty modules that you’ve researched. The tradeoffs and choices allow special task fleets to be fitted for specific operations or more generalized combat readiness. Will it be long-ranged maneuverable sniper fleets or fast and short-range brawlers…or something else? You decide!","storyline":"The story line in Novus Aeterno is not partitioned, to be completed by players individually; the whole story runs for everyone at the same pace. Miniature story arcs will be available which the player can start and finish at their own pace. The major story arcs however will happen for all players at the same time across the entire universe.\r\n\r\nWhatever destroyed the old empires is still out there and being aware of this threat will greatly assist the player. Information and rewards gained from missions will help players solidify their hold on their territories. Participation in these events is not mandatory but not participating in them could lead to severe consequences. Story arcs and events will be expanded and added on a regular basis which will help round out the experience between PvP and universal events.","hypes":8,"popularity":1.333333333333333,"games":[25311,8773,36594,9760,55029,22399,37059,12982,2015,28029],"tags":[18,39,1,268435471,268435467,536870936,536871438,536871733,1073741826],"developers":[2279],"publishers":[2279],"category":0,"player_perspectives":[2],"game_modes":[1,2,5],"keywords":[24,526,821],"themes":[1,18,39],"genres":[11,15],"status":5,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tgghn22djqyy8npjj7yf.jpg","cloudinary_id":"tgghn22djqyy8npjj7yf","width":1733,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yojwlrxetkuq0s0hzttm.jpg","cloudinary_id":"yojwlrxetkuq0s0hzttm","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vrnim3cht0afhlx1rz1r.jpg","cloudinary_id":"vrnim3cht0afhlx1rz1r","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o383vo6kimzsysaknntz.jpg","cloudinary_id":"o383vo6kimzsysaknntz","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dcnpq6nfyr9zgnhnewgu.jpg","cloudinary_id":"dcnpq6nfyr9zgnhnewgu","width":1907,"height":1081}],"videos":[{"name":"Trailer","video_id":"D31wTs7U0WA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uff5xdbfv4pdn9hegedc.jpg","cloudinary_id":"uff5xdbfv4pdn9hegedc","width":2149,"height":971},"websites":[{"category":1,"url":"http:\/\/novusaeterno.com\/"}]}