{"id":86949,"name":"Bingo Blitz - Bingo Games","slug":"bingo-blitz-bingo-games","url":"https:\/\/www.igdb.com\/games\/bingo-blitz-bingo-games","created_at":1518615032551,"updated_at":1523427170927,"summary":"Bingo Blitz Around the World! Get your dauber and Bingo Cards ready and experience endless excitement with one of the best free bingo games around! Join Blitzy and Moxie, your energetic online bingo assistants and travel the globe winning incredible bingo tournaments and spinning Vegas slots \n\nFeel the rush and get your daily bonus with Bingo Blitz! Play your best bingo cards, compete in tournaments, play in different cities all over the world & win free bonuses everywhere you go! Enter our sensational seasonal rooms and join special events or quests to collect a HUGE assortment of shadow cards from different corners of the world every time you call BINGO!\n\nAn Elite Bingo Experience\nFind your lucky numbers and claim your BIG BINGO BONUS! Discover new free bingo and slot games. Yes, ladies and gentlemen, you heard right, bingo slots games! Challenge yourself in playing multiple bingo cards dabbing on treasure chests and mystery chests to unlock lucky rewards & have fun playing bingo! \n\nTravel the world on a Vegas SLOTS & BINGO ADVENTURE and play in the hottest cities! Make your way from London to Tokyo and all the way over to Atlantic City. Daub your way through while playing multiple cards and unlocking new cities! Win HUGE REWARDS and collect XP points while reaching new levels and climbing the leaderboards. Use your Power-Ups and boosts to collect BIG WINS and level up.\n\nFree Bingo Game for True Bingo Lovers \nJoin our Vegas BINGO HOLIDAY FUN and invite your friends to play! Find the biggest jackpot bingo has to offer and gain Playtika rewards along the way. Play to see if you are the lucky winner of the day at our online bingo game tournaments. Play social bingo with friends to become a champion and send them our bingo blitz free gifts. Want more? Play slots online in one of the most dazzling apps!\n\nLearn the bingo Vegas lingo and never put your dauber down again! Enter our bingo palace and feel like royalty! Collect all of the shadow cards to receive your Blitzy Badges and feel like you’re in bingo heaven. Join tournaments online in one of the best bingo multiplayer apps – Download Bingo Blitz today!\nWhat are you waiting for? Join the largest bingo community around and start collecting your huge jackpots today!\nWe would love to hear from you! You can reach us at http:\/\/Bingoblitz.support.buffalo-studios.com. BINGO Blitz contains optional in-app purchases. This product is intended for use by those 21 or older for amusement purposes only. Practice or success at social casino gaming does not imply future success at real money gambling.\nThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.\n\nEnjoy a game of Bingo – You’ve earned it!","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[88868,87591,87264,23867,14047,101953,101565,101095,100955,100938],"tags":[536871523,536872273],"category":0,"keywords":[611,1361],"first_release_date":1344470400000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1344470400000,"region":8,"human":"2012-Aug-09","y":2012,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xgeniyl5tql6i05ppibc.jpg","cloudinary_id":"xgeniyl5tql6i05ppibc","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wsldvzl62umavaoumk03.jpg","cloudinary_id":"wsldvzl62umavaoumk03","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/elqpnolzgcqtexnbbxrj.jpg","cloudinary_id":"elqpnolzgcqtexnbbxrj","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pzcxzkofay0ii0jcpxjb.jpg","cloudinary_id":"pzcxzkofay0ii0jcpxjb","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mzelaj2mukxyvl1fkjx3.jpg","cloudinary_id":"mzelaj2mukxyvl1fkjx3","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lcxs5fjylt4d3xdd8aw9.jpg","cloudinary_id":"lcxs5fjylt4d3xdd8aw9","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ozccswt6szbelnbi8cre.jpg","cloudinary_id":"ozccswt6szbelnbi8cre","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ruztaplx1s9jbavvmier.jpg","cloudinary_id":"ruztaplx1s9jbavvmier","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hwglqkimbvktxx3hu3nm.jpg","cloudinary_id":"hwglqkimbvktxx3hu3nm","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wyuv0ecvaduwepnny9hh.jpg","cloudinary_id":"wyuv0ecvaduwepnny9hh","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/agnkxv4wowxnsbd0jpo2.jpg","cloudinary_id":"agnkxv4wowxnsbd0jpo2","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/bingo-blitz-bingo-games\/id529996768?mt=8&uo=4"}]}