{"id":13451,"name":"Builderland: The Story of Melba","slug":"builderland-the-story-of-melba","url":"https:\/\/www.igdb.com\/games\/builderland-the-story-of-melba","created_at":1444682219785,"updated_at":1500201136916,"summary":"The story of this game is quite simple, presented during the intro as a series of short scenes without words. Melba is an easy-going guitar player who is having a picnic with his girlfriend; suddenly, an ultra-strong, evil-looking character appears and kidnaps the poor girl, sailing away on his ship. The brave Melba swims after the ship, and finds a bottle with a map inside. Knowing now the way to the evil kidnapper's lair, Melba embarks on a journey without further hesitation! \n \nThe premise, the map with the \"stages\", and the side-scrolling view indicate a platform-type action game; in reality, however, Builderland is a puzzle game, somewhat similar to the famous Lemmings. As in Lemmings, the player has no control over the protagonist himself (except on a few occasions, when \"boss\" enemies must be defeated by throwing certain objects at them). Instead, the player must manipulate the environment in order to build a path for Melba, deal with the enemies, etc. Melba is for the most part entirely helpless and simply walks forward automatically. Various items such as boxes, weapons, platforms, etc., must be collected and placed properly in order to save the hero from premature death.","popularity":1.333333333333333,"games":[19222,41348,10225,27266,97254,95538,95525,92204,92096,91172],"tags":[268435465,268435489,1073741828],"publishers":[3698],"category":0,"player_perspectives":[4],"game_modes":[1],"genres":[9,33],"first_release_date":694137600000,"platforms":[63,16],"release_dates":[{"category":2,"platform":16,"date":694137600000,"human":"1991","y":1991,"m":12},{"category":2,"platform":63,"date":694137600000,"human":"1991","y":1991,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u99zgj6fd1eggs8c92vk.jpg","cloudinary_id":"u99zgj6fd1eggs8c92vk","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qquofp9kmtbgh7v5ljnd.jpg","cloudinary_id":"qquofp9kmtbgh7v5ljnd","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/er9emeygsiaqyas8pwxj.jpg","cloudinary_id":"er9emeygsiaqyas8pwxj","width":447,"height":582}}