{"id":51551,"name":"Smash Mobs","slug":"smash-mobs","url":"https:\/\/www.igdb.com\/games\/smash-mobs","created_at":1500631557995,"updated_at":1506723657234,"summary":"Smash Mobs is an action packed defense strategy game where your primary concern is to expand your cities, all while protecting them from the monsters.Smash Mobs takes place in the world of Elysium, and you will need to try and restore Smash Mobs to its outstanding, former glory. \n \nStory \n \nThere are 3 races in this region. The Dwarves, Elves, and Dragons have lived in peace and harmony for many years. But recently, more and more monsters have started to come to this land. The worst thing here is that the commandants and their troops have been captured one by one. There’s nothing we can do at this point other than fight back. \n \nGameplay \n \nAs you play the game, you will get to take the role of the remaining commandants and their armies. The great thing here is that you will be able to control a variety of commandants. You have dragons, for example, which can harness the power of wind, stone, lighting, crystals, and fire depending on their species. \nOn the other hand, you have elves, which have stellar battle skills and agility. Dwarves are really good defenders as well, and they will be able to help you build up your defense. \nAs you start to play the game, you will enter the battlefield, and the idea here is to focus on eliminating your enemies as fast as possible. A good combination of commandants and troops will be what you want to focus on if you want to reach success. \nEach battlefield will have multiple waves. You can either continue to the next wave or stop once you completed a wave. While doing more and more waves is better for you since you get more loot, you also put your commandants in danger. \nOn top of that, Smash Mobs has multiple missions. These are rewarded with medals, and you can also get some gold too. The game will even bring you specific ranks that you can unlock as you progress. \n \nFeatures \n \n•\tSmash Mode where you can battle a multitude of monsters and unlimited stages. \n•\tTraining mode where you can practice before you go on the battlefield. \n•\tMultiple sound effects \n•\tA large variety of commandants for each species. \n•\tIn the near future, Smash Mobs is set to bring in an area expansion, a town system, and a complete reward system! \n \nGraphics \n \nGraphically, Smash Mobslooks great, and it provides you with a constant state of immersion. The experience is a very fun and delightful one, so you are bound to enjoy what the game has to offer. Then there’s the fact that the gameplay is extremely interesting and nothing short of enticing. \n \nFinding the right balance between nurturing your commandants and knowing when to leave the battlefield is a crucial thing here. If you can do that and carefully level up and train your commandants, you will get to reach success extremely fast in the world of Smash Mobs!","storyline":"The Dragons, Elves, and Dwarves. For hundreds of years, these three races coexisted peacefully in Elysium, until darkness fell over the land. \nOne by one, monsters appeared on the outskirts of villages, then as if a dam had burst, they began to spring forth in waves, capturing commandants and their forces as they went out to try and stop the invasion. \nIn order to strengthen their forces, the Dragons, Elves, and Dwarves have banded together to form the Allied Garrison, and it is up to you to lead the charge moving forward. You must do all you can to rescue, rebuild, and hopefully, restore Elysium to its former glory.","collection":2827,"hypes":1,"popularity":1.333333333333333,"games":[33603,36962,55888,65827,16468,32283,13196,75065,75813,18623],"tags":[17,268435471,268435480,268435488,268435489,1073741826],"developers":[13161],"category":0,"player_perspectives":[2],"game_modes":[1],"themes":[17],"genres":[15,24,32,33],"first_release_date":1504742400000,"status":3,"platforms":[34],"release_dates":[{"category":0,"platform":34,"date":1504742400000,"region":8,"human":"2017-Sep-07","y":2017,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g19he3ffekmeoclqsa2p.jpg","cloudinary_id":"g19he3ffekmeoclqsa2p","width":1024,"height":576},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m2mi9noj6eaxjr3ac2a8.jpg","cloudinary_id":"m2mi9noj6eaxjr3ac2a8","width":1334,"height":750},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wqpfvnacgftphzwew3tw.jpg","cloudinary_id":"wqpfvnacgftphzwew3tw","width":1024,"height":576},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qxqoqmmzyymfl2edlq6j.jpg","cloudinary_id":"qxqoqmmzyymfl2edlq6j","width":1334,"height":750},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lhyaalixnhck1m7megwb.jpg","cloudinary_id":"lhyaalixnhck1m7megwb","width":1334,"height":750}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jcxxzxc3gxwawdcw5bcs.jpg","cloudinary_id":"jcxxzxc3gxwawdcw5bcs","width":1024,"height":576},"pegi":{"rating":2},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.wishary.dragon"},{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCmyILvN93BpNqwhs0xHV6qw"},{"category":4,"url":"https:\/\/www.facebook.com\/smashmobs"},{"category":1,"url":"http:\/\/www.smashmobs.com"}],"multiplayer_modes":[{"platform":34,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}