{"id":13363,"name":"Heroes Chronicles: The World Tree","slug":"heroes-chronicles-the-world-tree","url":"https:\/\/www.igdb.com\/games\/heroes-chronicles-the-world-tree","created_at":1444612570362,"updated_at":1540834917733,"summary":"The World Tree is the fifth part of Heroes Chronicles, following Clash of the Dragons and preceding The Fiery Moon. \nAs a Barbarian, Tarnum defends the World Tree in northeastern Antagarich from evil Barbarians and Necromancers led by the demigod Vorr. This was available as a free download for those who purchased two Heroes Chronicles games.","storyline":"In The World Tree, Tarnum hears a voice in his dreams telling him to \"Save the World Tree!\" He travels hundreds of miles northeast to an ancient cave and joins the remnants of a barbarian tribe apparently meant to protect it. Recently, necromancers have invaded the cavern, so Tarnum assumes that the Ancestors send him here to stop the necromancers from destroying the World Tree. He learns from five shamans in the area that the World Tree brings life to all things. However, he still doesn't know where or what it is. Deeper in the caverns, Tarnum finds a barbarian tribe which is working with the necromancers. They claim to follow Vorr, one of the three Ancestors who has turned into a barbarian war god. \n \nTarnum enters a lush cavern, believing that the World Tree must be nearby. Tarnum thinks that if he can convince the barbarians not to follow Vorr, Vorr will weaken. The mortal leader of the barbarian Followers of Vorr, King Targor, models his rule after Tarnum the Barbarian Tyrant, so Tarnum sends Grumba, an ogre who is his second-in-command, to search for the Pendant of Total Recall. This will allow Targor to see the experiences Tarnum has been forced to undergo over all the centuries following his tyrannical rule, and will hopefully end Targor's madness. \n \nAn elven druid named Nilidon who comes to aid Tarnum tells him that the tunnel system Tarnum has been in is in fact the World Tree, also known as the Roots of Life. Tarnum finds the Pendant of Total Recall, letting Targor see the error in his ways. Targor turns his army against Vorr and dies fighting him. Vorr gives up on destroying the World Tree, and the remaining barbarians kill the remaining necromancers. Tarnum learns that the World Tree will recover in time as he makes his way out of the Roots of Life to search for Vorr.","collection":194,"franchise":458,"franchises":[458],"rating":40.38572555078061,"popularity":1.666666666666667,"total_rating":40.38572555078061,"total_rating_count":4,"rating_count":4,"games":[7615,28182,32510,932,26940,77597,9472,32851,26391,54775],"tags":[17,268435471,268435472,536871208,536871969,536873311,536874694,1073741827],"developers":[97],"publishers":[99],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[296,1057,2399,3782],"themes":[17],"genres":[15,16],"first_release_date":970012800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":970012800000,"region":8,"human":"2000-Sep-27","y":2000,"m":9}],"alternative_names":[{"name":"Heroes Chronicles 5: The World Tree"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aqrrlde6vqcgu3ecyxuy.jpg","cloudinary_id":"aqrrlde6vqcgu3ecyxuy","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fzxq7aaduen0whkkfpae.jpg","cloudinary_id":"fzxq7aaduen0whkkfpae","width":800,"height":600}],"videos":[{"name":"Gameplay video","video_id":"hDKl8L5jlnE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kpokm8ag2hkaxufad2lj.jpg","cloudinary_id":"kpokm8ag2hkaxufad2lj","width":443,"height":558},"esrb":{"rating":3},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Heroes_Chronicles"},{"category":2,"url":"http:\/\/mightandmagic.wikia.com\/wiki\/Heroes_Chronicles:_The_World_Tree"}]}