{"id":15863,"name":"Crimson Skies","slug":"crimson-skies","url":"https:\/\/www.igdb.com\/games\/crimson-skies","created_at":1452464603404,"updated_at":1546843516314,"summary":"The series is set within an alternate history of the 1930s invented by Weisman and McCoy. Within this divergent timeline, the United States has collapsed, and air travel has become the most popular mode of transportation in North America; as a result, air pirates thrive in the world of Crimson Skies. In describing the concept of Crimson Skies, Jordan Weisman stated he wanted to \"take the idea of 16th century Caribbean piracy and translate into a 1930s American setting.\"[","storyline":"In 1937, Nathan Zachary and the Fortune Hunters were recovering from the foul betrayal of Lucas Miles in the skies over Cuba by hunting for the lost treasure of Sir Francis Drake. Locating Drake's Gold, the Fortune Hunters find evidence of British interest in Hawaii, and are set upon by the Medusas. While victorious, the Fortune Hunters are curious as to the reason for the British presence. Seizing a British Balmoral leads them to a secret British base, which they promptly destroy. Fighting off a counterattacks from HMS Barracuda, the Fortune Hunters are able to make repairs to the Pandora using the British facilities and recovered Drake's Gold, despite last-minute interference from the Royal Air Force. \n \nRejoicing in their newfound wealth, the Fortune Hunters cancel their party when they receive a distress call from an old friend - Ilsa Fassenbiender, daughter of Doctor Wilhelm Fassenbiender, radios the Fortune Hunters with news that her father has been kidnapped by the Soviet secret police, while she herself is kept prisoner by Boeing Aviation in Pacifica. The Fortune Hunters launched an assault on the CCCP zeppelin Workers' Voyage to retrieve the doctor, which resulted in Nathan Zachary once again encountering his old flame, the Black Swan. Successful in their flying rescue, the Fortune Hunters attempt to repeat their success with a lightning raid on the Boeing plant, hoping to both rescue Ilsa and steal the prototype Hughes Bloodhawk, Blue Streak. Again successful, the Fortune Hunters are forced to strike agains the USSR once again - this time attacking a petrol tanker off the coast of Pacifica to refuel the Pandora. Returning to Pacifica, the Fortune Hunters attack a zeppelin belonging to Blake Aviation Security in a pre-emptive strike which is an unmigitigated success. \n \nShortly after this victory, the Fortune Hunters found themselves battling a new enemy. The previously unknown pirate gang, the Black Hats, had shot down the Workers' Voyage, an act that might not have been possible had the Fortune Hunters not destroyed its escorts. Consumed with guilt, the Fortune Hunters descended upon the wreckage, driving off the Black Hats and ensuring the survival of the hospital ship sent in to rescue survivors. \n \nFlush with victory and with two of the most brilliant aircraft designers in the world in tow, the Fortune Hunters head south, for the Nation of Hollywood. Although their original intention was merely to rescue a movie starlet trapped by her contract, the Fortune Hunters followed another successful rescue with the theft of the world's largest airplane and participating in the first Johnson Cup Race, which Nathan Zachary won by a considerable margin. This victory, on Johnny Johnson's home turf, drove him to attempt a nefarious plan to destroy Zachary. When that failed, he used the delay caused by the race to send a Hughes Aviation combat zeppelin to destroy the Fortune Hunters' Pandora. While the assault resulted in the destruction of the Hughes Aviation zeppelin, the Pandora was badly damaged. Fleeing inland, the Fortune Hunters were forced to hijack the cargo zeppelin Figaro to provide the Pandora with a tow. \n \nArriving in Sky Haven, the Fortune Hunters encountered Black Swan and her group. With both sides willing to let bygones be bygones, the party went late into the night. \n \nThe next morning, however, Zachary awoke to find his crew missing, and his only ally the Black Swan, whose crew had also mysteriously disappeared. Hunting the area around Sky Haven, Zachary picked up a transmission from Sparks, the Pandora's pilot. He was aboard the Rocky Express. Zachary hastened to rescue his pilot, but the Express was attacked by Black Hats. The Express was escorted by Hellhounds from Sacred Trust Incorporated... who were expecting the Black Hats. Zachary and the Black Swan drove off both the pirates and the supposed security, disabled the Express' defences, and scooped up Sparks seconds before the Express' locomotive exploded. \n \nConvinced the Black Hats are responsible for the disappearance of their crews, Zachary and the Black Swan determine to hunt down a member of the Black Hats leadership... Ulysses Boothe. Finding Boothe, Zachary was able to shoot him down and capture him, and proposed to trade him back to the Hats in exchange for the return of the crews. Furious, but without options, Boothe agreed. Zachary dropped Boothe at the agreed-upon location, only to be told that the crews were being held inside a cargo zeppelin which had been wired with explosives. With consummate skill, Zachary was able to shoot free the zeppelin, board it, and release the crews. While the crews escaped, Black Swan herself was shot down and captured on the ground. \n \nTogether, the Fortune Hunters and the Black Swans proceeded to decimate the Black Hats' operations in Sky Haven, culminating in the utter destruction of their mountaintop base, the theft of dozens of aerial torpedoes and the rescue of the Black Swan. \n \nRealising there had to be a secret alliance between the Black Hats and Sacred Trust, Zachary was forced to approach the one man who might be able to help them... Paladin Blake. While initially distrustful, Zachary was able to convince Blake of his sincerity and recruit him to assist the Fortune Hunters in their efforts to exterminate both the Black Hats and Sacred Trust. \n \nHeading for the Sacred Trust HQ in Manhattan, Zachary contacted an old friend of his, who lead him to an Sacred Trust warehouse crammed with illegal merchandise, which was being loaded onto a German freighter. Destroying the warehouse and the freighter, Zachary was able to draw official attention to the activities of Sacred Trust. \n \nHowever, the Fortune Hunters needed more evidence. Evidence such as that known by Waldo Carney, Sacred Trust's accountant, who was trying to flee the city. When his zeppelin was attacked by Black Hats, the Fortune Hunters were able to rescue him and transport him safely to police HQ. \n \nConvinced their secrets had been revealed, Sacred Trust attempted to flee the city, loading their remaining contraband and documents onto zeppelins. However, the Fortune Hunts and Blake Aviation Security were able to disable their zeppelins, as well as the stolen Spruce Goose, and prevent Sacred Trust from removing the vital evidence. \n \nFurious at these repeated defeats, the true master behind both the Black Hats and Sacred Trust revealed himself - Lucas Miles, the man who had betrayed the Fortune Hunters in Cuba. In his mighty zeppelin Dante, Miles attempted to flee, but his zeppelin and his fighters were no match for the combined force of the Fortune Hunters and Blake Aviation Security. The Dante was shot down, and Miles was killed. \n \nVictorious once again, the Fortune Hunters accepted a substantial reward from the government of the Empire State, and decided to take a tropical break to spend it. Sea Haven is always nice this time of the year...","collection":842,"rating":84.3097068955465,"popularity":1.333333333333333,"aggregated_rating":80,"aggregated_rating_count":1,"total_rating":82.15485344777325,"total_rating_count":7,"rating_count":6,"games":[14758,2040,27316,78550,81141,83728,8422,11524,18623,55038],"tags":[1,17,22,39,268435461,268435469,536870948,536871522,536871804,536871818,536871904,536872060,536872129,536872352,536875067,536875271,536876296,536876482,536876932,536876973,536877390,536878007,536878216,536880481,1073741825,1073741826],"developers":[3062],"publishers":[128],"game_engines":[295],"category":0,"player_perspectives":[1,2],"game_modes":[1,2],"keywords":[36,610,892,906,992,1148,1217,1440,4155,4359,5384,5570,6020,6061,6478,7095,7304,9569],"themes":[1,17,22,39],"genres":[5,13],"first_release_date":969148800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":969148800000,"region":2,"human":"2000-Sep-17","y":2000,"m":9},{"category":0,"platform":6,"date":971395200000,"region":1,"human":"2000-Oct-13","y":2000,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zwkkvv6u5omuqjs8tcw3.jpg","cloudinary_id":"zwkkvv6u5omuqjs8tcw3","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/plkqkzpqmbeoznwnfn6s.jpg","cloudinary_id":"plkqkzpqmbeoznwnfn6s","width":1024,"height":768}],"videos":[{"name":"Trailer","video_id":"dtSMoGF7aS8"},{"name":"Game intro","video_id":"i23KRvtWLx8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wici9he9jyvmlfha9yyf.jpg","cloudinary_id":"wici9he9jyvmlfha9yyf","width":321,"height":375},"esrb":{"rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Realistic looking violence","rating":3},"websites":[{"category":2,"url":"http:\/\/crimsonskies.wikia.com\/wiki\/Crimson_Skies"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Crimson_Skies_%28video_game%29"}]}