{"id":18563,"name":"Parsec","slug":"parsec","url":"https:\/\/www.igdb.com\/games\/parsec","created_at":1459448477812,"updated_at":1517270911430,"summary":"Parsec is a computer game for the Texas Instruments TI-99\/4A. Perhaps the best-remembered of all TI-99\/4A games, it is a side-scrolling shooter, programmed in 1982 by Jim Dramis (who also programmed the popular TI-99\/4A games Car Wars and Munch Man) and Paul Urbanus. \n \nThe player in Parsec pilots a spaceship through sixteen differently-colored levels of play which scroll horizontally over the screen. The objective is to avoid being shot by an enemy ship, colliding with any flying object and\/or the ground, and destroy all enemy ships without overheating one's laser cannon. \n \nThree waves of fighters attack, alternating with three waves of cruisers. Enemy ships enter the screen one at a time. A ship flying off the left edge of the screen wraps around to the right side and attacks again. A new fighter can appear with others still on the screen, whereas a new cruiser will not come until the previous one is destroyed. The fighters pose only the threat of collision, while the cruisers fire on the player's ship. The fighter types are named Swoopers, LTFs (Light Triangular Fighters), and Saucers. The cruisers are called Urbites, Dramites, and Bynites. Each level ends with an asteroid belt, in which an array of asteroids advance on the ship and must be avoided or shot. At the end of each asteroid belt, any remaining asteroids are cleared away and the color of the ground is changed, then a new wave of Swoopers begins. Starting with level 4, the Swoopers are preceded by a random number of Killer Satellites, which come without the usual computer warning. \n \nThe Urbites and Dramites appear to be named after the developers of the game, while the Bynites were apparently named after Don Bynum (the manager of TI's Personal Computer Division) or possibly named after the fact that they have invisibility (by night). In fact, Paul Urbanus signed Internet posts as late as 2005 as \"urbite\".","popularity":1.333333333333333,"games":[68287,36950,27314,64204,28029,10209,26766,25300,11253,71455],"tags":[18,268435461,268435489,536871078,536871113,536871859,536871882,536876028,536876862,536876869,536877742,536880210,1073741828],"developers":[9484],"publishers":[9484],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[166,201,947,970,5116,5950,5957,6830,9298],"themes":[18],"genres":[5,33],"first_release_date":410140800000,"platforms":[129],"release_dates":[{"category":2,"platform":129,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ap4ltb42lektozl2kwkp.jpg","cloudinary_id":"ap4ltb42lektozl2kwkp","width":1000,"height":1425}}