{"id":763,"name":"Heroes of Newerth","slug":"heroes-of-newerth","url":"https:\/\/www.igdb.com\/games\/heroes-of-newerth","created_at":1317749041000,"updated_at":1533272393683,"summary":"Heroes of Newerth builds upon the DotA formula and takes it to the next level by delivering cutting edge graphics, fast-paced gameplay, meticulous statistical tracking, and server-client networking that feeds gamers' competitive appetites around the world. \n \nHeroes of Newerth puts two teams of players against each other: the Legion and the Hellbourne. \n \nBoth teams are based at opposite sides of a map. The standard map is split into three continuous 'lanes' (Two in one of the lesser-played maps), running from one base to the other. Defensive towers are positioned evenly through each lane, until the lanes terminate at a team's base. \n \nBases are strongly defended with extra defensive towers, and buildings from which units spawn. These units, termed 'creeps' are spawned every thirty seconds, and run along their lane until they meet opposition - which they then attack. Victory is achieved when one of the teams manages to push into the base of the opposing team, and destroys their primary structure; the Hellbourne's 'Sacrificial Shrine', or the Legion's 'Tree of Life'. \n \nAt any point after fifteen minutes has expired a team can choose to concede defeat - this loses them the game and requires a unanimous team vote to pass or a 'four of five' vote after the thirty minute mark.","storyline":"Jeraziah watched the piles of burning bodies. His soldiers. Men and women, humans and beasts. Killed defending each other, their beliefs, their homes. Their king.  \n  \nMartyrs droned their prayers next to the fires, which crackled and sizzled as the corpses were consumed. A shamanic ape with blood matted in his fur sang words of sorrow for the fallen, and though Jeraziah did not understand the language he knew exactly what the words meant.  \n  \nThe priests did this work for the souls of the dead, helping them into whatever afterlife waited for them. Not long ago Jeraziah would have joined in the ceremony. Now he simply watched the bodies burn to make sure they wouldn’t have to be killed again.  \n  \nHe recognized faces within the flames. Friends he had shared a meal with the previous night before leading the dawn raid. They grimaced as the fire touched them. Jeraziah knew it was the heat pulling the dead flesh and muscles taut, but he still fought the urge to reach into the pyres and drag them free. A shred of life might still remain within them, a dim light that could be held in his cupped hands, nursed back to brightness, and returned to an anguished family.  \n  \nThe faces reddened, blistered, and blackened. The king did not look away. Only when the flesh was gone and empty skulls stared back at him did he turn to the other fires, set apart from the dead Legion warriors. The daemon bodies gave off a foul, acrid smoke and burned stubbornly. Most of the creatures were born in fire and required attention from the Pyromancers to succumb to the flames.  \n  \n“Whatever it takes,” Jeraziah had told them. “Nothing left but ash. Then douse it with blessed water and bury everything.”  \n  \nThe Hellbourne piles were smaller than the Legion. This gave no indication of the true toll, since the daemons had a habit of eating their dead even in the chaos of battle, but Jeraziah knew he had lost too many. He also knew it could have been much worse.  \n  \nThe raid had been successful. It was one of several initiatives brought forth by the Paragons, whose presence had immediately shifted the tide of war. They had also shifted alliances within the Legion itself—the Sacred Order found their presence blasphemous, and some of the king’s War Council found their cold, detached consultations and casualty estimates offensive—but Jeraziah could not dwell on that now.  \n  \nThe Paragons were working.  \n  \nThat was all that mattered.  \n  \nThe URSA Corps had been muzzled by the stunning power of the Argentian sorcerers. Temporarily, perhaps, but the king cherished every moment while the self-righteous URSA licked their wounds and tried to cobble together something to counter the ancient, elemental magic of the Paragons. And as much as Jeraziah welcomed that sorcery, the knowledge of Newerth they carried was perhaps more valuable.  \n  \nThe Paragons knew the land as it once had been, the secrets it held, and they gathered every new disturbance to Newerth, from the smallest leaf settling at the bottom of the Rulian Marsh to a monument toppling in a valley of the Sang-La Mountains. The crystals within their bodies communed with the massive rock faces of the Iron Mountains glittering with silica, the grains of sand and dust blowing across the Great Waste, the tiny fragments drawn up through roots into the flora of Caldavar, Death’s Cradle, Fúathmoor, even the enigmatic Luminary.  \n  \nFor the Paragons, the corruption of Newerth was like a bloodstain soaking through a white shroud. They knew where it was, at all times, and where it could be thwarted. And for Jeraziah, this information was better than any Scout reconnaissance or bestial divination.  \n  \nThe Emerald and Bloodstone Paragons had shown Jeraziah the ancient, hidden way through the Ardu foothills to the west of the Blight Fields. Thought to be unscalable, the foothills had served as a natural barrier to Hell’s Keep and the endless corruption seeping out of the Scar. While this kept the daemons from flooding across Newerth en masse, it also made it impossible for Jeraziah to wage a proper siege without looping north into the Iron Mountains or south into the Great Waste. Either option would lead to untold losses through attrition before the actual battle even began.  \n  \nIn the aftermath of this small raid, a probing foray into Hellbourne territory, Jeraziah allowed himself to hope there was another way. He left the smoldering fires and found the two Paragons watching the sun rise over the eastern mountains. They were lightly wounded yet did not bleed, and did not need the food or wine that man craved after a near brush with death.  \n  \n“You would not tell me before,” the king said. “What of now? How did we not know of this path through the Ardu? My patrols have been over every crevice of these rocks.”  \n  \n“Over, yes,” the Lapis Lazuli sorcerer said. “Not through? Or in?”  \n  \nThe Emerald sorceress nodded once. “The path is not available to those who have not taken it.”  \n  \nJeraziah ground his teeth. The Paragons’ inclination for cryptic statements and answering questions with questions was exhausting at best, often infuriating. But he held his tongue and gathered his patience. Before he could try again, the veteran Legionnaire Cutter stepped out of the drifting smoke and stood at attention.  \n  \n“We have prisoners, sir.”  \n  \nJeraziah’s stomach clenched, though his face remained impassive. He hoped for imps or some other soulless minion. Something that would not require a choice.  \n  \n“What sort?” he said.  \n  \n“Bloodthirsty, sir,” Cutter said, “twenty or so. Led by a half-dozen Acolytes.”  \n  \nJeraziah cursed, a brief eruption that would have made the priests gasp, had they been within earshot. The Bloodthirsty were humans who followed the path of Dampeer, subsisting only on human blood until their bodies began to crave it, require it. Acolytes were possibly worse. They sold their souls in return for an apprenticeship with a Hellbourne master, seeking power and position in the lifeless world the daemons hungered for. No matter what they had done, though, they were all still human. It was Jeraziah’s royal policy to shackle any such prisoners and ship them back to Arasunia for exorcism, purification, and introduction back into civilized society.  \n  \nCutter made sure his king was done blaspheming, then said, “We’re clearing out some provision wagons to take them home.” He turned to oversee the task.  \n  \n“Execute them,” Jeraziah said.  \n  \nCutter stopped. “Sir?”  \n  \n“Line them up and execute them.” Jeraziah stared at the ground as he spoke. “All but one. Find the youngest among them, the least corrupted, and chop his hands off. Then send him back to his new masters and comrades. Let them see what happens when they forsake their fellow man.”  \n  \nCutter hesitated. “My king, are you—”  \n  \n“It was their choice. I am merely responding accordingly.”  \n  \n“Sir,” Cutter said, and walked away. His king was changing. Necessary, Cutter knew, but the thought of losing every shred of the boy he’d guarded since before the wee lad could sit upright threatened to break his heart. The Legionnaire packed that notion away for another time, when dwelling on such things wouldn’t get him or someone else killed. He thumbed the edge of his axe. It would need sharpening before the king’s work began.","collection":5207,"franchise":1086,"franchises":[1086],"rating":65.2588943969542,"popularity":2,"aggregated_rating":71,"aggregated_rating_count":1,"total_rating":68.1294471984771,"total_rating_count":9,"rating_count":8,"games":[23941,2963,1879,1942,3025,125,1026,472,3126,59],"tags":[1,17,22,268435467,268435468,268435471,536870973,536871008,536871041,536871060,536871063,536871139,536871208,536871213,536871244,536871301,536871409,536871470,536871474,536871506,536871610,536871728,536871812,536871904,536872010,536872093,536872117,536872159,536872232,536872245,536872334,536872563,536872628,536872898,536872914,536872978,536873023,536873066,536873327,536873364,536873383,536873671,536873822,536873890,536874094,536874225,536874343,536874398,536874706,536874743,536874830,536875052,536875056,536875078,536875083,536875130,536875144,536875147,536875196,536875198,536875199,536875204,536875214,536875215,536875232,536875244,536875259,536875262,536875265,536875300,536875303,536875304,536875306,536875311,536875312,536875316,536875319,536875329,536875331,536875337,536875356,536875372,536875421,536875452,536875455,536875457,536875488,536875517,536875536,536875595,536875606,536875609,536875645,536875671,536875744,536875798,536875897,536875905,536875918,536876010,536876019,536876036,536876058,536876171,536876214,536876232,536876237,536876273,536876277,536876281,536876285,536876286,536876352,536876356,536876376,536876415,536876490,536876512,536876537,536876556,536876572,536876632,536876662,536876706,536876730,536876767,536876816,536876848,536876856,536876876,536876899,536876948,536876964,536876986,536877064,536877207,536877209,536877211,536877408,536877453,536877531,536877579,536877642,536877762,536877767,536877771,536877880,536878201,536878215,536878240,536878253,536878322,536878359,536878368,536878391,536878417,536878513,536878516,536879154,536879998,536880029,536880184,536880428,536880442,536880452,536880467,536880470,536880579,536880694,536880746,536880755,536881357,536882131,536882927,536883373,536883590,536883950,536884915,536885594,536885672,536887672,1073741827],"developers":[688,12591],"publishers":[688,12591],"game_engines":[458],"category":0,"player_perspectives":[3],"game_modes":[2,3,5],"keywords":[61,96,129,148,151,227,296,301,332,389,497,558,562,594,698,816,900,992,1098,1181,1205,1247,1320,1333,1422,1651,1716,1986,2002,2066,2111,2154,2415,2452,2471,2759,2910,2978,3182,3313,3431,3486,3794,3831,3918,4140,4144,4166,4171,4218,4232,4235,4284,4286,4287,4292,4302,4303,4320,4332,4347,4350,4353,4388,4391,4392,4394,4399,4400,4404,4407,4417,4419,4425,4444,4460,4509,4540,4543,4545,4576,4605,4624,4683,4694,4697,4733,4759,4832,4886,4985,4993,5006,5098,5107,5124,5146,5259,5302,5320,5325,5361,5365,5369,5373,5374,5440,5444,5464,5503,5578,5600,5625,5644,5660,5720,5750,5794,5818,5855,5904,5936,5944,5964,5987,6036,6052,6074,6152,6295,6297,6299,6496,6541,6619,6667,6730,6850,6855,6859,6968,7289,7303,7328,7341,7410,7447,7456,7479,7505,7601,7604,8242,9086,9117,9272,9516,9530,9540,9555,9558,9667,9782,9834,9843,10445,11219,12015,12461,12678,13038,14003,14682,14760,16760],"themes":[1,17,22],"genres":[11,12,15],"first_release_date":1273622400000,"platforms":[6,14,3],"release_dates":[{"category":0,"platform":6,"date":1273622400000,"human":"2010-May-12","y":2010,"m":5},{"category":0,"platform":14,"date":1273622400000,"human":"2010-May-12","y":2010,"m":5},{"category":0,"platform":3,"date":1273622400000,"human":"2010-May-12","y":2010,"m":5}],"alternative_names":[{"name":"HoN","comment":"Other"},{"name":"Chi Bi,\nRed Cliff","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/esj7hfwlt1m8wwhv1f86.jpg","cloudinary_id":"esj7hfwlt1m8wwhv1f86","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qga4hul4z8ovld8vzpsy.jpg","cloudinary_id":"qga4hul4z8ovld8vzpsy","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k2grfylhbjn8x7tct695.jpg","cloudinary_id":"k2grfylhbjn8x7tct695","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aijlhciqrybtxnj9ao1k.jpg","cloudinary_id":"aijlhciqrybtxnj9ao1k","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oooft2vjvtf7pmb4bjps.jpg","cloudinary_id":"oooft2vjvtf7pmb4bjps","width":1680,"height":1050}],"videos":[{"name":"Trailer","video_id":"8YHOqZOIfgc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v5u2rrpevd2hjmd7tdll.jpg","cloudinary_id":"v5u2rrpevd2hjmd7tdll","width":368,"height":517},"websites":[{"category":5,"url":"https:\/\/twitter.com\/heroesofnewerth"},{"category":9,"url":"https:\/\/www.youtube.com\/user\/S2Games\/videos"},{"category":6,"url":"https:\/\/www.twitch.tv\/directory\/game\/Heroes%20of%20Newerth"},{"category":4,"url":"https:\/\/www.facebook.com\/heroesofnewerth"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Heroes_of_Newerth"},{"category":1,"url":"http:\/\/www.heroesofnewerth.com\/"}]}