{"id":88063,"name":"Maze Walk VR - Virtual Reality Game Puzzle Apps","slug":"maze-walk-vr-virtual-reality-game-puzzle-apps","url":"https:\/\/www.igdb.com\/games\/maze-walk-vr-virtual-reality-game-puzzle-apps","created_at":1519228260136,"updated_at":1522769895731,"summary":"Think you have the skills to solve a maze? What about a Virtual Reality version?\n\nMazeWalkVR takes maze solving to a whole new level by utilizing a unique movement and selection method using the accelerometer and gyroscope on your mobile device (iPad, iPod, or iPhone). You can physically walk in both the real and the in the virtual world simultaneously (or if you prefer just jiggle your hands, bend your knees, or run on the spot to mimic walking movement).\n \nA MazeWalkVR features challenging physics-based gameplay and is fun for any age.\n\nNOTES\n1) Over 750k downloads (and associated times to beat!)\n2) We appreciate your feedback and are listening to every one of your comments. We try to push new maze levels every few weeks, and each update will include improvements, bug fixes and new Easter Eggs. \n3) Special thanks to DanceDog1234. Input like yours helps us improve the experience for all, and we will always listen and improve as often and as quickly as we can.\n\nOBJECTIVES\n1) Use your cunning and your memory to make your way to the Tower. Unsure where it is? Just jump in place (or give your phone a sudden big jiggle) and you’ll be able to see over the maze walls. \n2) Race to the finish in the quickest time...You may even hit the leader board!\n3) Find hidden Easter eggs\n\nIN-GAME PLAY\n1) Works with\/without a VR headset \n2) For a more immersive experience, we recommend loading your phone into a VR headset \/ Glasses \/ Goggles and trick your mind that you are really there! Use the ToggleVR button to switch between full-screen & cardboard \/ stereoscopic \/ VR modes. \n4) Also works with Google Cardboard triggers and 3rd party VR headsets that don't... i.e. should work with any VR headset. If not, let us know!\n5) Select buttons by staring at them for a moment, or use the trigger on your Google Cardboard device.\n6) Use tokens to play levels. We give you 3 for free. Acquire more by finding the hidden Tokens in each level or purchasing in the Shop.\n\nEASTER EGGS\nThey are there if you can find them. Lots more coming!\n\nUPGRADES \nAdditional levels can be unlocked by finding hidden coins or in-app purchase.\n\nHELP & SUPPORT\nCheck out http:\/\/www.mypad3d.com\/mazewalkvr for help, tutorials, tips & more!\nHave ideas for maps, themes, Eggs, etc... email maze@MYPAD3D.com\n\nIMPORTANT NOTES FOR ADULTS & PARENTS\nThis application may require internet connectivity and subsequent data transfer charges may apply.\nThis game may include: \n- The option to make in-app purchases. The bill payer should always be consulted beforehand.\nThis game will not include:\n- Anything that is not suitable for children of any age. We like kids of all ages!\n\nABOUT MYPAD3D\nMYPAD3D develops Interactive Virtual Reality solutions that provide businesses and consumers with experiences to help guide more informed decisions while having fun. MYPAD3D works with numerous industries and uses proprietary technology to produce high-end photo realistic interactive solutions that are delivered through the channels that consumers need; including mobile, online, downloadable and VR headsets. MYPAD3D solutions enrich the customer experience, expedite sales, and make businesses more profitable. Headquartered in Seattle, MyPad3D can operate throughout the world. For more information, please visit MYPAD3D.com or email MoreInfo@MyPad3D.com. \nFollow-us on Twitter @MyPad3D or Facebook & we'll regularly let you know where some of the coins are! \n\nABOUT Virtual Reality\nWhether you have a Google Cardboard \/ GoogleVR, Oculus, VIVE, Homido, or any other Virtual Reality or Augmented Reality headset, our solutions will be of interest. Please note that these solutions don’t currently work on Meta or Microsoft HaloLens.\n\nExploration in virtual reality is available using Google Cardboard on iPhone. Google Cardboard only works with iPhone 5S and later, running iOS 8 or later.\n\nAdditional MYPAD3D Virtual Reality solutions can be found at www.mypad3d.com and on the App store by searching for MYPAD3D.","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[19222,41348,10225,27266,91177,90837,90671,90051,89132,88889],"tags":[268435465,536872030],"category":0,"keywords":[1118],"genres":[9],"first_release_date":1470960000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1470960000000,"region":8,"human":"2016-Aug-12","y":2016,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ohwsgelwtg0hed7mrega.jpg","cloudinary_id":"ohwsgelwtg0hed7mrega","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v93yslsvimyidxfeau7j.jpg","cloudinary_id":"v93yslsvimyidxfeau7j","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jbleije8ugodgwrk7y4c.jpg","cloudinary_id":"jbleije8ugodgwrk7y4c","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hvaojbdcfb1zb6bzamfj.jpg","cloudinary_id":"hvaojbdcfb1zb6bzamfj","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ybdyl5klttr8n1gpnswi.jpg","cloudinary_id":"ybdyl5klttr8n1gpnswi","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cxwz1hxdklonnpne7igq.jpg","cloudinary_id":"cxwz1hxdklonnpne7igq","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eqzsiqidjcho8owm0oxn.jpg","cloudinary_id":"eqzsiqidjcho8owm0oxn","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qkxm4ltuc01csiwx0rp6.jpg","cloudinary_id":"qkxm4ltuc01csiwx0rp6","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zfu2wjlcmhjsthx6dwjh.jpg","cloudinary_id":"zfu2wjlcmhjsthx6dwjh","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ii7ymijhgt47hdc7288m.jpg","cloudinary_id":"ii7ymijhgt47hdc7288m","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yuhh60xfueipsydbfs6d.jpg","cloudinary_id":"yuhh60xfueipsydbfs6d","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/maze-walk-vr-virtual-reality-game-puzzle-apps\/id1138117315?mt=8&uo=4"}]}