{"id":10853,"name":"Storm Master","slug":"storm-master","url":"https:\/\/www.igdb.com\/games\/storm-master","created_at":1433079062864,"updated_at":1515628119500,"summary":"Storm Master is a 1991 video game for the Amiga, Atari ST and PC, produced by the now-defunct French developer Silmarils, which placed the player as the head of government for a fictional semi-medieval country. \n \nSimilarly to most of the games produced by Silmarils, Storm Master took place on a European-fantasy world. Gameplay revolved around the governance and management of the country of Eolia in an ongoing war against its neighbour, Shaarkania, with the ultimate goal of sacking (and, by inference, destroying) all enemy cities.[1][2] \n \nThe game was notable for a blend of turn-based strategy interspersed with live-action battles. This took the form of aerial battles against enemy air fleets or air defences and required the player to launch ballistic missiles against enemy ships or batteries. Other real-time elements of the game involved the player conducting a religious ceremony with the goal of increasing the natural wind energy of the nation. This element of gameplay was further enhanced by requiring the player to dispatch government ministers around the country to develop or industrialise various aspects of the state. The game was further noted by Amiga Action as having an innovative 'advance through time' feature, allowing the player some control over the rate at which time passed in the game.","popularity":1.333333333333333,"games":[29173,55590,18623,44242,9199,55689,33603,11419,23345,36962],"tags":[268435469,268435471,536872060,536874694],"developers":[1196],"publishers":[1196],"category":0,"game_modes":[1],"keywords":[1148,3782],"genres":[13,15],"first_release_date":725760000000,"platforms":[63,13,16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":7,"platform":63,"human":"TBD"},{"category":7,"platform":13,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ko14boaryiqoqjv6xifn.jpg","cloudinary_id":"ko14boaryiqoqjv6xifn","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ljpkta68f4kyvzc0nnpi.jpg","cloudinary_id":"ljpkta68f4kyvzc0nnpi","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wyygzodgopgfztnhj8l1.jpg","cloudinary_id":"wyygzodgopgfztnhj8l1","width":640,"height":809}}