{"id":11153,"name":"Commando Raid","slug":"commando-raid","url":"https:\/\/www.igdb.com\/games\/commando-raid","created_at":1434435004111,"updated_at":1517270820632,"summary":"You are in defense of your buildings which have come under attack by android commando raiders. Without warning they appear, intent on capturing your buildings and destroying your gun emplacement. \n \nFirst the troop carrying helicopters fly in dropping android paratroopers to test your defenses. Soon the sky is filled with fluttering helicopters and wave after wave of android paratroopers. They must be destroyed! Each paratrooper allowed to land on a building destroys a portion of that building. If three paratroopers land on a building. It will be totally destroyed and must be considered under commando control. \n \nWorse still, the androids can now tunnel towards your gun emplacement. Each paratrooper who lands on that building expands the tunnel. If they are not stopped, they will plant an explosive charge under the gun. \n \nIn the midst of the battle, an aircraft may appear. It will drop a devastating bomb which can destroy all buildings and the gun emplacement. You must shoot it down or at least shoot the bomb it drops. If you miss, its back to basic training!","popularity":1.333333333333333,"games":[28029,76246,19341,10039,76229,32902,68287,68142,17446,36594],"tags":[1,39,268435461,536871525,1073741828],"developers":[9520],"publishers":[9520],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[613],"themes":[1,39],"genres":[5],"first_release_date":410140800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u9ek9niifbecljtxusqt.jpg","cloudinary_id":"u9ek9niifbecljtxusqt","width":640,"height":420}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zpxrtq7cbxalfsk2lixq.jpg","cloudinary_id":"zpxrtq7cbxalfsk2lixq","width":800,"height":1072}}