{"id":12053,"name":"Dark Side","slug":"dark-side","url":"https:\/\/www.igdb.com\/games\/dark-side","created_at":1441126414449,"updated_at":1543818177714,"summary":"The game is set on the alien moon Tricuspid orbiting the planet Evath. Terrorists (the Ketars, the villains of the first game Driller) hijacked the moon's facilities and built Zephyr One, an immense beam weapon on the moon's dark side with the purpose of destroying Evath. The player is a government agent, sent secretly to the moon's surface with the mission of deactivating the weapon before it becomes fully charged. This is accomplished by destroying a power network in the form of ECD (Energy Collection Device) columns, dotted around the moon and connected with power lines all the way to the beam weapon. \nAn ECD (Energy Collection Device) column. To destroy the ECD, the player needs to shoot the top part of the column. \n \nTo complete the mission, the player has at his disposal an arsenal of beam weapons mounted on a jetpack equipped pressure suit. The aim is to destroy all ECDs in a specific order and avoid capture and death by the traps left by the terrorists. ECDs are connected to power lines and can only be destroyed when all preceding ECDs have been deactivated, otherwise they will instantly regenerate. The player has limited amount of time available to complete the game, based on the energy accumulated in Zephyr One. When the weapon is fully charged, the beam is fired destroying Evath and the game ends. As the player destroys ECDs, the charge accumulation rate is reduced, allowing more time for the player to complete the mission. \n \nThe game's environment is displayed in first person view with the player seeing the world through the suit's helmet. A targeting crosshair displayed in the helmet's HUD allowing the player to fire the suit's weapon at specific locations. The player can move in all directions by walking or activating the jetpack. The suit is powered by an energy source that gets depleted with every movement and it is allocated between \"shields\" and \"fuel\". When the shields charge is depleted, the player is vulnerable to enemy fire and simply bumping into walls can end the game. Fuel is vital for horizontal and vertical movement and the game ends as soon as its depleted. There are a number of \"recharge\" points (in the form of columns) hidden in the game where the player can replenish the suit's energy supply. There are also a number of energy conversion devices that allow transforming shield energy to fuel and vice versa.","collection":2868,"popularity":1.333333333333333,"games":[55038,33726,36950,25222,24426,20342,105269,68287,62151,18011],"tags":[1,18,268435461,268435465,268435487,536871162,536871882,536871939,536873787,1073741825],"developers":[13417],"publishers":[5062,13416],"game_engines":[269],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[250,970,1027,2875],"themes":[1,18],"genres":[5,9,31],"first_release_date":599529600000,"platforms":[63,13,16,15,26,25],"release_dates":[{"category":2,"platform":26,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12},{"category":2,"platform":13,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12},{"category":2,"platform":15,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12},{"category":2,"platform":63,"date":631065600000,"region":1,"human":"1989","y":1989,"m":12},{"category":2,"platform":25,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12},{"category":2,"platform":16,"date":631065600000,"region":1,"human":"1989","y":1989,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vtuzdfjctokkapqx1c4u.jpg","cloudinary_id":"vtuzdfjctokkapqx1c4u","width":1440,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nuwymgwlyw3h5861vetl.jpg","cloudinary_id":"nuwymgwlyw3h5861vetl","width":640,"height":779},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Dark_Side_(video_game)"}]}