{"id":18653,"name":"A Place for the Unwilling","slug":"a-place-for-the-unwilling","url":"https:\/\/www.igdb.com\/games\/a-place-for-the-unwilling","created_at":1459931218349,"updated_at":1518951251806,"summary":"“A Place for the Unwilling” is a narrative adventure game where the city is the actual protagonist. No puzzles or “game over” screens, just you, the city and the dozens of stories which are taking place in there. Days pass and the fate of the city is yet to be decided.","storyline":"I do exist.\n\nThere are others like me which are nothing but streets of empty buildings decorated with monuments and street lights, but that’s not my case. I have a body, but also a brain and a heart. I can feel people moving inside of me, I can hear hundreds of conversations taking place in my streets right now and even see beings from other realities. \n\nThese are the shadows, you may call them people. They’re all different, but at the same time they look alike to my eyes. Sometimes, if I pay attention I can hear them whispering their names to each other, and once I hear them, I no longer see a blurry shadow, but an unique person with dreams and nightmares. \n\nThese are the streets that shape me. Twisted paths where filth and plagues await in every corner. Some of the shadows live surrounded by luxury while others struggle to survive. Both God and Devil were born in my veins, and they never left. \n\nI have been feeling ill lately. There’s something inside of me that does not belong here. I don’t know how it entered or why, but it may be wise to fear it, the dark lurks even in the brightest places and nobody is safe. \n\nThe following days will play a very important role in the life of the shadows. The pieces are already on the board and the game is about to start. Now, pick your move stranger, knowing that once it has begun neither of us will be able to stop it. There is only one thing that we can be sure of, it will be an interesting journey. \n\nWho knows? Maybe even I can die.","hypes":3,"popularity":1.333333333333333,"games":[43130,14605,23175,27266,28277,17469,63734,72412,59516,55289],"tags":[268435487,536871338,536872351],"developers":[9514],"publishers":[9491],"category":0,"game_modes":[1],"keywords":[426,1439],"genres":[31],"pulse_count":1,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/voc5ey7vp7isfozgh88v.jpg","cloudinary_id":"voc5ey7vp7isfozgh88v","width":1921,"height":1081},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uj5bhcyldknkud0px3a7.jpg","cloudinary_id":"uj5bhcyldknkud0px3a7","width":1023,"height":550},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yrtfkkjufpngx4zurqnz.jpg","cloudinary_id":"yrtfkkjufpngx4zurqnz","width":1024,"height":578}],"videos":[{"name":"Trailer","video_id":"zT9qpwP7z1Y"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mwjdnvf40fuzb2cb3gyv.jpg","cloudinary_id":"mwjdnvf40fuzb2cb3gyv","width":200,"height":194},"websites":[{"category":1,"url":"http:\/\/www.alpixelgames.com\/a-place-for-the-unwilling\/"}]}