{"id":23053,"name":"Valhalla","slug":"valhalla","url":"https:\/\/www.igdb.com\/games\/valhalla","created_at":1472039867726,"updated_at":1517271081283,"summary":"Valhalla was a ZX Spectrum and Commodore 64 adventure game published in 1983 by Legend. \n \n \nValhalla is mostly text-based with some graphics showing the location and the characters there. It was set mainly in Asgard and Midgard, though when your character died you would reappear in Hell (Niflheim under another name) and be able to walk out. \n \nWithin its limits, the text parser would understand multi-part sentences, so long as they were written using the words it understood, which (unlike in many other games) were helpfully listed in the manual. \n \nThe aim was to collect six mythical objects, for which you needed the help of other characters, who were taken from Norse mythology and would wander around randomly. The six objects were Ofnir (key), Drapnir (ring), Skornir (shield), Skalir (sword), Felstrong (axe) and Grimnir (helmet). These objects were needed to access otherwise unreachable parts of the game, however carrying any of them would sap your strength. \n \nTo help with the quest, your character had an alignment (between good and evil) that would change depending on which other characters you helped. Thus, the more you helped good characters, the more other good characters would help you. Characters include gods, goddesses, dwarves, dragons, wolves, a snake and a raven. \n \nWithin the game world, characters would move about and interact independently without any action required from you. If you do nothing, the game will 'play' itself, with the characters moving about whilst you decide what to do. \n \nTyping in a swear word would generate the message \"Mary is not amused...\" and a dwarf[1] would dash onto the screen to punch the player. Mary could be found in El Vinos but killing her achieved little as she would return within a minute. \n \nThe game engine had a limit of eight objects that could be left in any one location, whether on the ground, in a chest, or in a cupboard. If the player dropped an object when the limit had been reached, a character called Klepto appeared to \"Steal\" the item, removing it from the game.","popularity":1.666666666666667,"aggregated_rating":80,"aggregated_rating_count":1,"total_rating":80,"total_rating_count":1,"games":[236,36792,26163,23719,1221,37088,47823,26848,19289,18398],"tags":[17,268435487,536871279,1073741828,1073741829],"publishers":[11520],"category":0,"player_perspectives":[4,5],"game_modes":[1],"keywords":[367],"themes":[17],"genres":[31],"first_release_date":441676800000,"platforms":[15,26],"release_dates":[{"category":2,"platform":15,"date":473299200000,"region":1,"human":"1984","y":1984,"m":12},{"category":2,"platform":26,"date":441676800000,"region":1,"human":"1983","y":1983,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/azronm1ybyjtso8pgupn.jpg","cloudinary_id":"azronm1ybyjtso8pgupn","width":1000,"height":1466}}