{"id":39553,"name":"Fight Fever","slug":"fight-fever","url":"https:\/\/www.igdb.com\/games\/fight-fever","created_at":1498132383940,"updated_at":1516611702833,"summary":"The game plays similarly to other 2D versus fighting games, especially both SNK's Fatal Fury 2 and Art of Fighting. In fact, it shapes itself after Fatal Fury 2 while it uses Art of Fighting's game engine. There are 8 characters to select from and two boss characters (the first boss character is only playable in two player mode). The object of the game is to win two matches out of three. Each character has a set of moves in addition to two basic punches and kicks. Each character also has a super move called a \"Danger Move\", which are similar to the Desperation Moves from Fatal Fury 2. Players also have the ability to taunt others, but unlike games such as Art of Fighting, this has no effect and would actually leave the player open to attacks. \n \nThere are two bonus games that reward the player with points dependent on how successful the player is. The first game is a brick-breaking game that requires rapid pressing of the A button. The second bonus game requires the player to break boards held up by trainers popping out of the left and right sides. Both bonus games were also in Capcom's 1987 arcade game, Street Fighter, as well as one of them also in Midway's 1992 arcade game, Mortal Kombat and the ones in Art of Fighting.","popularity":1.666666666666667,"games":[41828,74173,23113,22418,56987,65832,46780,19333,67730,10039],"tags":[268435460,536870973,536871019,536871213,536874398,536875075,536875099,536875486,536876734],"category":0,"keywords":[61,107,301,3486,4163,4187,4574,5822],"genres":[4],"first_release_date":759715200000,"pulse_count":1,"platforms":[52,79],"release_dates":[{"category":0,"platform":79,"date":759715200000,"region":2,"human":"1994-Jan-28","y":1994,"m":1},{"category":0,"platform":79,"date":759715200000,"region":5,"human":"1994-Jan-28","y":1994,"m":1},{"category":0,"platform":52,"date":775353600000,"region":8,"human":"1994-Jul-28","y":1994,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ljyl9h8mkfdwg2slahgd.jpg","cloudinary_id":"ljyl9h8mkfdwg2slahgd","width":304,"height":224}}