{"id":49253,"name":"CT Special Forces 3: Navy Ops","slug":"ct-special-forces-3-navy-ops","url":"https:\/\/www.igdb.com\/games\/ct-special-forces-3-navy-ops","created_at":1500019366333,"updated_at":1515810216509,"summary":"Game Boy Advance brings CT SPECIAL FORCES 3: NAVY OPS to fans of vertical action combat game play. A special military unit called the Special Intervention Forces has but a single mission- to do away with all terrorist organizations and other menacing threats. The latest threat has to do with the fact that the enemy has in their possession a biochemical weapon that alters human DNA. They have used this chemical to strengthen hostility and athletic genes to produce an original species of insurgent. The Counter Terrorist Special Intervention Forces are the only ones who possess the strength and skill to crush this new adversary. Each player is responsible for controlling his or her member of the CT Special Forces, as each mission becomes increasingly difficult. In the latest threat of terrorism, the need for underwater soldiers has become a necessity. With scuba diving skills, the player can explore several underwater regions. Combat takes place in both the water and on land, so the game presents the player with a number of vehicle and weaponry options. Each skill is the most sophisticated available and designed to seek out and destroy the enemy. The game takes the player through 20 levels that test, challenge and drive the Special Forces towards victory. Fans of combat action games with a patriotic tone must try this intense game.","collection":4834,"popularity":1.666666666666667,"games":[28751,18088,14758,64311,77956,76253,103312,56353,77412,8422],"tags":[1,536870913,536871078,536875171,536876252],"category":0,"keywords":[1,166,4259,5340],"themes":[1],"first_release_date":1107216000000,"platforms":[24],"release_dates":[{"category":0,"platform":24,"date":1107216000000,"region":8,"human":"2005-Feb-01","y":2005,"m":2}],"alternative_names":[{"name":"CT Special Forces 3: BioTerror","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jkyzd4f2qace5peyfcag.jpg","cloudinary_id":"jkyzd4f2qace5peyfcag","width":379,"height":491},"pegi":{"rating":3}}