{"id":54653,"name":"Command Ops: Battles from the Bulge","slug":"command-ops-battles-from-the-bulge","url":"https:\/\/www.igdb.com\/games\/command-ops-battles-from-the-bulge","created_at":1502741876062,"updated_at":1516729423682,"summary":"Acclaimed developer Panther Games brings us to the bitter cold of Western Europe during the Winter of 1944 with Command Ops: Battles from the Bulge. Although the Battle of the Bulge is ground that has been visited by wargamers before, it has never been done with this level of fidelity and historical accuracy. The most advanced and realistic model of command decision-making implemented to date in a commercial wargame, combined with thorough historical research on the battlefields and forces involved in this campaign sets Command Ops: Battles from the Bulge apart from the competition. \n \nSet during the hard fighting of the Battle of the Bulge, Command Ops lets gamers assess, plan, order and react at the operational level just like a real Corps, Division and Brigade commander. Hundreds of hours of gameplay await armchair generals who will be challenged to fight their way across 27 scenarios that stretch from the initial German surprise offensive to the powerful Allied counter-attack. \n \nCommand Ops: Battles from the Bulge also sports some of the most advanced and impressive AI ever devised in an operational-level wargame! It is your choice whether to manage every detail of your army, or have the friendly AI manage the war on a lower level while you plan the larger scale maneuvers designed to make short work of your enemy. Just as a historical commander, you can choose where you need to step in and when you need to stand back and let your subordinates do their jobs. \n \nThe enemy AI will use its skill to launch well-timed and coordinated strikes as it probes your lines for weakness while realistically reacting to your movements! In addition, for the enthusiastic mod community awaiting Command Ops, powerful tools like MapMaker and ScenMaker allow for the creation of maps and scenarios further adding to already near limitless replayability.","popularity":1.333333333333333,"aggregated_rating":84,"aggregated_rating_count":1,"total_rating":84,"total_rating_count":1,"games":[22399,55029,12982,2015,6985,36594,640,30229,8773,9760],"tags":[22,39,268435467,268435471,536870931,536872383,536875137,1073741827],"developers":[7125],"publishers":[476],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[19,1471,4225],"themes":[22,39],"genres":[11,15],"first_release_date":1274832000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1274832000000,"region":8,"human":"2010-May-26","y":2010,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g08bkbpwvwljmtmm1x9q.jpg","cloudinary_id":"g08bkbpwvwljmtmm1x9q","width":800,"height":1145}}