{"id":75553,"name":"Heroes Arena","slug":"heroes-arena","url":"https:\/\/www.igdb.com\/games\/heroes-arena","created_at":1510167475407,"updated_at":1516590747442,"summary":"Lag Free Global 5v5 mobile game. Fast, Fair and Fun! Fight for Glory! HEROES ARENA is the newest and best global multiplayer online battle arena game designed specifically for mobile, focused on fair eSports, fun and lag-free! Enjoy massive PVP action with 1v1, 3v3, 5v5 and other multiplayer battle modes for you to join in as players battle to climb rankings to earn glory and awesome prizes! Choose your favorite hero, team up and communicate with your friends for epic partnerships, battle across beautifully rendered maps through hordes of minions, monsters and guardian turrets to destroy the enemy’s generator and obtain victory! Download and join HEROES ARENA, Fair eSports! \n \nGame Features \n \n1. FAST AND FAIR ESPORT: \n- Lightning quick matchmaking with low queue times and fair gameplay with the emphasis on fast-paced fun. \n- Never pay to win, it’s all about Play to Win! \n \n2. CLASSIC MOBA DESIGNED FOR MOBILE: \n- Classic MOBA experience with global multiplayer gameplay with players in your region automatically joining your team. \n- Simple controls and user interface gets more moba battle action on your screen yet gives you full control of your hero. \n- Advanced controls such as preset before battles your Fast Buy equipment, Leader Abilities, Runes and more to give your hero an even more competitive advantage against the other team. \n- No need to return to base to purchase equipment, buy it on the fly right in the middle of combat and surprise your enemy with increased power! \n- Fast and quick auto-translated communication preset notices lets your team collaborate and strategize without needing to pause battles to type! \n- Auto-recorded and saved battles lets you focus first on fighting and then reviewing and sharing your epic wins with others across your favorite streaming channels. \n \n3. ALL NEW HEROES, ALL NEW ACTION: \n- Heroes Arena launches with 20 gorgeously designed unique heroes with epic special ability and ultimate ability animations. \n- Five Hero Special Abilities including a Hero Ultimate as well as three Leader Abilities. \n- Play across six distinct hero classes such as Assassin, Mage, Marksman, Support, Tank and Warrior! \n- Check out the multiple skins too to give your hero a unique look and edge against the competition. \n- Monthly releases of new heroes and skins will be coming. \n \n4. 24\/7 CUSTOMER SUPPORT: \n- Got a problem? We’ve got your back! Reach out to our customer support team anytime by sending us a message in-game. You can also reach us via email at vip@ucool.com \n- Got a suggestion or feedback? We’d love to hear it! Send your comments to us via email at vip@ucool.com \n \nNOTICE: Heroes Arena is a completely free-to-play game, however there are some game items that can also be purchased for real money. If you don’t want to use this feature, please disable in-app purchases in your device’s settings. Also under our Terms of Service and Privacy Policy, you must be at least 13 years of age to play or download Heroes Arena.","popularity":1.666666666666667,"games":[2015,36594,39257,55029,12982,22399,16125,76731,9760,33603],"tags":[268435467,268435471,268435480,268435489,536871060],"category":0,"keywords":[148],"genres":[11,15,24,33],"first_release_date":1477785600000,"platforms":[34,39],"release_dates":[{"category":0,"platform":39,"date":1491955200000,"human":"2017-Apr-12","y":2017,"m":4},{"category":0,"platform":34,"date":1477785600000,"human":"2016-Oct-30","y":2016,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qwpjgmzkasnv9iqxqkus.jpg","cloudinary_id":"qwpjgmzkasnv9iqxqkus","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ctgpb13ic6fxv9dc82on.jpg","cloudinary_id":"ctgpb13ic6fxv9dc82on","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/psnznw71nwohhj3powqm.jpg","cloudinary_id":"psnznw71nwohhj3powqm","width":1600,"height":900}],"videos":[{"name":"Trailer","video_id":"5Zx19Z2yV1A"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d4mhmq7lul4mqogqqckp.jpg","cloudinary_id":"d4mhmq7lul4mqogqqckp","width":1280,"height":720},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.ucool.heroesarena&hl=pt_BR"},{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/heroes-arena\/id1140783536?mt=8"}]}