{"id":96153,"name":"Spider-Man: Collector's Edition","slug":"spider-man-collectors-edition","url":"https:\/\/www.igdb.com\/games\/spider-man-collectors-edition","created_at":1522919660128,"updated_at":1538473555763,"summary":"Starring One of the world's most iconic Super heroes, Marvel's spider-man features the acrobatic abilities, Improvisation and web-slinging that the wall-crawler is famous for, while also Introducing elements never-before-seen in a spider-man game. From traversing with Park our and unique environmental interactions, to new combat and blockbuster action, it's spider-man unlike any you've played before. \n \nSony interactive entertainment, insomniac games, and Marvel have teamed up to create a brand-new and authentic spider-man adventure. This isn't the spider-man you've met or ever seen before. This is an experienced peter parker who's more masterful at fighting big crime in new York city. At the same time, he's struggling to balance his chaotic personal life and career while the fate of millions of new yorkers rest upon his shoulders. \n \nCollector’s Edition Includes: \nFull Game. \nCustom Steelbook. \nWhite Spider Sticker. \nMini Artbook – Contains unique, early-look concepts and unreleased artwork \nCollector’s Edition Marvel’s Spider-Man Statue by Gentle Giant. \nMarvel’s Spider-Man: The City that Never Sleeps - consists of three-post launch story chapters featuring new characters and missions. Users will receive DLC by March 2019. \nIf pre-ordered before September 7, 2017, receive all Pre-Order Bonus Content.","popularity":7,"version_parent":19565,"version_title":"Collector's Edition","category":0,"first_release_date":1536278400000,"platforms":[48],"release_dates":[{"category":0,"platform":48,"date":1536278400000,"human":"2018-Sep-07","y":2018,"m":9}],"alternative_names":[{"name":"Spider-Man Collectors Edition"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/di1raub20zeigikqboiv.jpg","cloudinary_id":"di1raub20zeigikqboiv","width":3900,"height":2100}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/scsnqbulliupwvqe9kyr.jpg","cloudinary_id":"scsnqbulliupwvqe9kyr","width":1866,"height":1865}}