{"id":19625,"name":"Samurai Champloo: Sidetracked","slug":"samurai-champloo-sidetracked","url":"https:\/\/www.igdb.com\/games\/samurai-champloo-sidetracked","created_at":1466156090044,"updated_at":1500544088061,"summary":"Samurai Champloo steps out of the hack-and-slash action genre and offers a new way to swing a finely-honed samurai blade. Set in Japan with hip hop feel from the hit TV series by the same name, this title allows gamers to breathe life to a \"lost episode\" as one of three playable characters - Mugen, a reckless samurai with break-dancing fighting style, calculated Jin who abides by the decorum of Bushido, and a mysterious new character exclusive to the video game. Stranded in northern land of Ezo (current day Hokkaido) in search of the samurai who smells of sunflowers, the player must face foreign mercenaries, master swordsmen, diabolical assassins, mythical beasts, and gangster monkeys. The core of the game's unique combat system lies in the innovative integration of music and linked attacks. The players can choose an array of combos based on the different hip hop grooves that they can swap at will. Music tracks become collectible, opening an extensive assortment of linked attacks that can be implemented tactically during combat.","popularity":1.333333333333333,"aggregated_rating":62.5,"aggregated_rating_count":2,"total_rating":62.5,"total_rating_count":2,"games":[19959,71455,36608,36663,34919,134,40524,23175,16468,1070],"tags":[1,268435481],"category":0,"game_modes":[1,2],"themes":[1],"genres":[25],"first_release_date":1140652800000,"platforms":[8],"release_dates":[{"category":0,"platform":8,"date":1140652800000,"region":5,"human":"2006-Feb-23","y":2006,"m":2},{"category":0,"platform":8,"date":1144713600000,"region":2,"human":"2006-Apr-11","y":2006,"m":4}],"alternative_names":[{"name":"サムライチャンプルー","comment":"Japanese title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fig6f9yyuaoyqhrbzrsm.jpg","cloudinary_id":"fig6f9yyuaoyqhrbzrsm","width":697,"height":1000}}