{"id":2778,"name":"Tak and the Power of Juju","slug":"tak-and-the-power-of-juju","url":"https:\/\/www.igdb.com\/games\/tak-and-the-power-of-juju","created_at":1374907272574,"updated_at":1543369476276,"summary":"An ancient prophecy foretells that the Moon Juju, the kind protector of the Pupanunu people, would be weakened by the evil Tlaloc, an embittered Pupanunu shaman, so he could turn the Pupanunu people into sheep as revenge for not being made high shaman in favor of another shaman, Jibolba. The prophecy also mentions a great and mighty warrior who would restore the Moon Juju, defeat Tlaloc, and bring peace to the Pupanunu people. \n \nHaving escaped Tlaloc's spell, Jibolba believes his apprentice Lok to be the warrior of the prophecy and prepares to send him off; however, it appears that Lok has been turned into a sheep. Jibolba sends his younger apprentice, Tak (voiced by Jason Marsden), to find magical plants and change him back, though it turns out not to be Lok. Jibolba tells Tak to obtain the Spirit Rattle, which allows the wielder to communicate with powerful Juju spirits to assist him, while he finds Lok. \n \nTak returns with the Rattle to find that Lok has been trampled to death by a herd of sheep. Jibolba has Tak collect 100 magic Yorbels and Lok's spirit from the spirit world, allowing him to successfully resurrect Lok. An unfortunate side-effect of the resurrection, however, is a severe case of diarrhea. Tak obtains the Moon Stones instead while Lok recovers, restoring the Moon Juju to full strength. \n \nThe Moon Juju reveals that the warrior of the prophecy is not Lok, but Tak, as he has already fulfilled almost everything the prophecy predicted. Using his arsenal of Juju spells, Tak defeats Tlaloc and turns him into a sheep, finally fulfilling the prophecy.","collection":535,"popularity":1.333333333333333,"aggregated_rating":74,"aggregated_rating_count":3,"total_rating":74,"total_rating_count":3,"games":[80916,37777,25076,47823,28309,75234,55092,25300,24426,103054],"tags":[1,27,268435464,268435487,536871138,536871262,536871306,536871549,536871604,536871682,536871945,536874098,536874542,536875100,536875144,536875232,536875257,536875598,536876085,536879154,536879756,536883754,536884027,536885428,536886335,536886336,536886337,1073741826],"developers":[1309],"publishers":[197],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[226,350,394,637,692,770,1033,3186,3630,4188,4232,4320,4345,4686,5173,8242,8844,12842,13115,14516,15423,15424,15425],"themes":[1,27],"genres":[8,31],"first_release_date":1066176000000,"platforms":[24,21,8],"release_dates":[{"category":0,"platform":21,"date":1066176000000,"human":"2003-Oct-15","y":2003,"m":10},{"category":0,"platform":8,"date":1066176000000,"human":"2003-Oct-15","y":2003,"m":10},{"category":0,"platform":24,"date":1066176000000,"human":"2003-Oct-15","y":2003,"m":10}],"alternative_names":[{"name":"Tak and the Power of Juju"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n5imyqg0uxo0qzvtxu9k.jpg","cloudinary_id":"n5imyqg0uxo0qzvtxu9k","width":250,"height":320},"esrb":{"synopsis":"","rating":3}}