{"id":37778,"name":"Tsuyoshi Shikkari Shinasai Taisen Puzzle-dama","slug":"tsuyoshi-shikkari-shinasai-taisen-puzzle-dama","url":"https:\/\/www.igdb.com\/games\/tsuyoshi-shikkari-shinasai-taisen-puzzle-dama","created_at":1497877409968,"updated_at":1516664322101,"summary":"Tsuyoshi Shikkari Shinasai: Taisen Puzzle-dama (ツヨシしっかりしなさい 対戦ぱずるだま Tsuyoshi Shikkari Shinasai: Taisen Pazurudama?) is a Taisen Puzzle-Dama video game based on the manga Tsuyoshi Shikkari Shinasai. It was developed and published by Konami, and was released exclusively in Japan in 1994, for the Super Famicom. \n \nIt features the cast of the manga and anime Tsuyoshi Shikkari Shinasai (usually localized as \"Hang in There, Tsuyoshi\") and Konami's own spin on Puyo Puyo: Taisen Puzzle-Dama (\"Battle Puzzle Ball\"). The goal of the game is to compete with a series of characters from Tsuyoshi Shikkari Shinasai depending on who the player selected. \n \nPlay involves stacking duos of faces of various colors. If the player completes a set of three faces - they don't have to be lined up, but they do need to be adjacent - the faces disappear. If they are next to a \"trapped\" face it is transformed into a normal face block. Ideally, the player completes a three-strong stack of identical-colored trapped faces and frees them in groups of three, which will then lead to a chain as those three vanish and free more trapped faces. \n \nThe game was the first home console version of Konami's Taisen Puzzle-Dama series and the second game overall. The first version was the Arcade game Taisen Puzzle-Dama released earlier the same year. Future Taisen Puzzle-Dama games would also similarly feature anime license tie-ins, as well as characters from Konami's other properties.","collection":3939,"popularity":1,"games":[25222,60044,8197,14047,26223,70861,22481,69329,27266,39646],"tags":[268435465,536870990,536873787,536875053,536875379],"category":0,"keywords":[78,2875,4141,4467],"genres":[9],"first_release_date":785116800000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":785116800000,"region":5,"human":"1994-Nov-18","y":1994,"m":11},{"category":0,"platform":19,"date":787708800000,"region":8,"human":"1994-Dec-18","y":1994,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b0f4qcospgj7me2zupcx.jpg","cloudinary_id":"b0f4qcospgj7me2zupcx","width":339,"height":609}}