{"id":41278,"name":"Dead Zone","slug":"dead-zone","url":"https:\/\/www.igdb.com\/games\/dead-zone","created_at":1498814915747,"updated_at":1516742892357,"summary":"In the space calendar 0385, the Earth suffers from overpopulation and humans started to build space colonies. Kirk, the protagonist of Dead Zone, works for the Earth federation's space development office. He is a brilliant engineer in space physics and he is working for Sirius third planet colony. He also got engaged with his beloved girlfriend Marry, but they had to postpone their wedding. Five months later, Kirk, accompanied with his robot Carry, decides to meet Marry at last, and prepare the ceremony. But when he arrives at the space station, everything is quiet. Then a beam of light hits him. He wakes up sometimes later, inside a sort of underground graveyard, pieces of dismantled robots surrounding him. \n \nThe player proceeds through the game by choosing from a selection of text menu commands. Like any traditional digital comic\/text adventure games, a large view shows the surroundings. The bottom of the screen proposes simple action commands, like see, take or push; however, the game is entirely in Japanese (although it uses katakana exclusively). One of the original features of the game is to use real sampled sound in some places, which is very unusual for the time.","popularity":1.333333333333333,"games":[33269,11490,24426,55038,20342,62151,27192,56033,56911,36950],"tags":[18,268435464,268435487,536871487,536871882,536871939,536872961],"category":0,"keywords":[575,970,1027,2049],"themes":[18],"genres":[8,31],"first_release_date":532742400000,"platforms":[51,15,58],"release_dates":[{"category":0,"platform":15,"date":567907200000,"region":1,"human":"1987-Dec-31","y":1987,"m":12},{"category":0,"platform":51,"date":532742400000,"region":5,"human":"1986-Nov-19","y":1986,"m":11},{"category":0,"platform":58,"date":535420800000,"region":8,"human":"1986-Dec-20","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/llqnhhut9hxzqhdkoejs.jpg","cloudinary_id":"llqnhhut9hxzqhdkoejs","width":920,"height":945}}