{"id":12760,"name":"Secret of the Silver Blades","slug":"secret-of-the-silver-blades","url":"https:\/\/www.igdb.com\/games\/secret-of-the-silver-blades","created_at":1442650316368,"updated_at":1540241438882,"summary":"Secret of The Silver Blades is another brilliant Forgotten Realms RPG game from Strategic Simulations. Your primary goal is to locate the source of the mysterious hordes of monsters terrorizing the local people. Many seek to impede your efforts, such as deadly red dragons. There are also other forces who will aid you. The well of knowledge will give you many clues. Some of those clues will lead you to the dark and monster infested depths while others will reveal the true evil plans. Don't worry about your reward, along your path, you will recover a vast sum of gold and helpful items.","storyline":"375 years ago, twin brothers Oswulf and Eldamar built a castle in a large valley in the Dragonspine Mountains and the town of Verdigris was founded below the castle. The town prospered under the guidance of the brothers. Oswulf was a paladin and Eldamar was a mage. As Eldamar became older, his obsession for immortality grew and he began studying how to become a lich. Oswulf tried to stop his brother, but failed. Eldamar became a lich known as the Dreadlord. \n \nA horrified Oswulf could not bear to kill his own brother. He sought the help of a band of adventurers known as the Silver Blades to help contain the Dreadlord. The Dreadlord was certain that these adventurers were called upon to slay him and he began gathering armies of evil creatures to aid him. The town was overrun by monsters and the inhabitants abandoned it. With the help of the Silver Blades, they succeeded in driving the monsters out of the town and back to the castle. Oswulf was still determined not to kill his own brother, however. The Silver Blades set out to research a spell and when cast, it encased the entire valley in a glacier. Everything inside became frozen, but was still alive. Oswulf sacrificed himself so his spirit could guard the castle. \n \nA few of the Dreadlord's followers were beyond the glacier's effects and began attempts to get through the ice, but failed. 15 years ago, they formed a group known as the Black Circle and succeeded in breaking the spell. The glacier began to melt. As the ice melted, many miners noticed the old mines of Verdigris were once again accessible and founded the town of New Verdigris. The mines contained vast amounts of gems. As the miners descended to the lower levels, monsters that had been frozen for over 300 years began to emerge and once again took over the mines. \n \nIn desperation, the miners took all their gems to the Well of Knowledge, which is said to grant wishes and provide information for those who dropped treasure into it. The party was then summoned to the town of New Verdigris by the Well of Knowledge at the wish of the townspeople. They need the party to protect them from the monsters and so begins the story of the Secret of the Silver Blades.","collection":1837,"franchise":43,"franchises":[43,731],"popularity":1.333333333333333,"games":[1593,9179,26765,22387,14394,12113,20395,28309,12761,14474],"tags":[17,22,268435468,268435487,536870984,536871059,536871063,536871138,536871139,536871208,536871259,536871260,536871504,536871648,536871938,536871939,536872647,536872835,536872978,536873364,536874994,536875075,536875160,536875161,536875265,536875356,536875361,536875380,536875455,536875735,536875738,536875803,536876301,536877554,536877568,536877593,536877595,536878072,536878358,536878494,536879070,536884867,536886005,1073741825,1073741826],"developers":[528],"publishers":[528],"game_engines":[165],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[72,147,151,226,227,296,347,348,592,736,1026,1027,1735,1923,2066,2452,4082,4163,4248,4249,4353,4444,4449,4468,4543,4823,4826,4891,5389,6642,6656,6681,6683,7160,7446,7582,8158,13955,15093],"themes":[17,22],"genres":[12,31],"first_release_date":694137600000,"platforms":[13,16,15],"release_dates":[{"category":2,"platform":16,"date":694137600000,"human":"1991","y":1991,"m":12},{"category":7,"platform":15,"human":"TBD"},{"category":7,"platform":13,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pwr8cyuikfsut2znmwt8.jpg","cloudinary_id":"pwr8cyuikfsut2znmwt8","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/koioglckbx32u0qz9noe.jpg","cloudinary_id":"koioglckbx32u0qz9noe","width":320,"height":200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h05ln76ne0ncidtmfjfl.jpg","cloudinary_id":"h05ln76ne0ncidtmfjfl","width":640,"height":400}],"videos":[{"name":"Gameplay video","video_id":"4TYQx_HYFa4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wgdcvuxvzkoes5l2jigv.jpg","cloudinary_id":"wgdcvuxvzkoes5l2jigv","width":640,"height":965},"esrb":{"rating":5},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Secret_of_the_Silver_Blades"}]}