{"id":23160,"name":"Star Fire","slug":"star-fire","url":"https:\/\/www.igdb.com\/games\/star-fire","created_at":1472071788968,"updated_at":1517270833144,"summary":"Star Fire is an early color game programmed by David Rolfe with graphics designed by Ted Michon and Susan Ogg. It was released by Exidy in 1979. Star Fire is a first-person space shooter where your mission is to seek out and destroy enemy spacecraft while avoiding incoming missiles. \n \nIf a number of elements of Star Fire seem similar to Star Wars, your eyes are not deceiving you. Star Fire was originally designed as a Star Wars game, with the eventual hope that either a license would be purchased or that they would change enough of the elements to avoid any legal entanglements. Originally, the authors had hoped that Midway would pick up the game for distribution, but they passed and instead Exidy purchased the game and released it. \n \nStar Fire was the first game to come in an environmental cabinet, designed by Michael Cooper-Hart. Even more importantly from a historical perspective, Star Fire was the first game to keep a high score list where the player could enter his or her initials. Prior games had tracked the concept of a high score, but Star Fire was the first to let you personalize the high score entry and display a top ten list with your initials next to your high score. \n \nAn update to Star Fire, simply called \"Star Fire II\", was intended to go into the last run of Star Fire units. It features a more refined high score display and easier high score input.","popularity":1.333333333333333,"games":[68287,28029,36950,64204,142,27314,71455,25300,27523,11253],"tags":[1,18,268435461,268435489,536871882,536871937,536873064,1073741825],"developers":[2523],"publishers":[2523],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[970,1025,2152],"themes":[1,18],"genres":[5,33],"first_release_date":315446400000,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":315446400000,"region":2,"human":"1979","y":1979,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/myseuevgbpm2bf0nxvjn.jpg","cloudinary_id":"myseuevgbpm2bf0nxvjn","width":1000,"height":1328}}