{"id":27560,"name":"CTU: Marine Sharpshooter","slug":"ctu-marine-sharpshooter","url":"https:\/\/www.igdb.com\/games\/ctu-marine-sharpshooter","created_at":1488545124520,"updated_at":1513073093589,"summary":"Marine Sharpshooter's gameplay involves both sniping and close quarters combat. The game's environment varies from the caves and small villages of Afghanistan, to snowy cliffs and rooftops of Chechnya, to sandy beaches and jungles of Pacific island. Interaction between player and environment is minimal. \n \nThe game features simulations of the real sniper rifles used by the US Marine Corps snipers, as well as other real weapons, such as assault rifles, pistols, and sniper rifles. There is even the occasional RPG used by the enemy. \n \nThe game features sniping, with the ability to use the sniper rifle's scope to zoom in on far away targets, as well as close quarters combat using a pistol with an optional silencer or using a knife. Several points in the game require the player to stay in one spot engaging hostiles that emerge from various doorways and windows. At other times, the player can explore the map freely.","storyline":"Marine Sharpshooter's story details the adventures of Lieutenant Smith and Sergeant Cooper, a Marine scout sniper, team as they chase down some warlords in Afghanistan and follow the trail of lost nuclear materials. The player assumes the role of the sniper, as you take on an army of terrorists and mercenaries in order to prevent nuclear holocaust.","collection":1406,"franchise":972,"franchises":[972],"popularity":1.666666666666667,"games":[83728,76747,105049,90099,10964,103301,23852,9760,103210,10039],"tags":[1,23,39,268435461,536873126,536873210,536874355,536874356,536875358,536875804,536876262,536878104,536884483,1073741825],"developers":[6551],"publishers":[2585],"game_engines":[61],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[2214,2298,3443,3444,4446,4892,5350,7192,13571],"themes":[1,23,39],"genres":[5],"first_release_date":1048118400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1048118400000,"human":"2003-Mar-20","y":2003,"m":3}],"alternative_names":[{"name":"Marine Sharpshooter"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mgn9upxzha4oqsmjgwgb.jpg","cloudinary_id":"mgn9upxzha4oqsmjgwgb","width":640,"height":908},"esrb":{"rating":6},"pegi":{"rating":4}}