{"id":2960,"name":"Fable","slug":"fable-484f2a75-7a61-4dba-9952-7e70e6bd881b","url":"https:\/\/www.igdb.com\/games\/fable-484f2a75-7a61-4dba-9952-7e70e6bd881b","created_at":1380915229395,"updated_at":1545654660152,"summary":"The adventure in which you are about to embark tells the story of how once upon a time a young boy named Quickthorpe set out a journey through the lost world of Balkhane. It is a Fable in one way, but in the 'trick of the tale', it's a strange adventure through a shattered world and a saga born out of the very sick mind of a man called Ismael.\n\nLong ago in the mists of time lived the Mecubarz. Ancient and beautiful, powerful and wise they ruled absolute. Strange beings, magical creatures and humans lived together in peace and harmony, until greed destroyed it all. Ismael, a respected man, and revered by all, sadly had a heart that was hollow and bitter. He and four others plotted to overthrow the Mecubarz.\n\nThe Mecubarz' fury at the treason of Ismael and his men was cataclysmic. They trapped the four seasons and put them into impenetrable crystals, casting them to the four corners of the shattered world where they stood still and were held in an eternal dominion of ice, mist, water, and fire. The four traitors were exiled, but Ismael disappeared.\n\nAs Quickthorpe, an inexperienced adventurer, your quest is to explore the Four Lands of the Mecubarz in search of the mystical gems that will liberate your people. Keen observation, puzzle-solving skill and quick thinking are the abilities required to undertake this exciting but unpredictable task. Interact with a universe of characters which come to life with true speech creating a world with an atmosphere so thick you can feel it. Combined stunning animations and atmospheric sound effects will ensure that Fable will take you on the journey of a lifetime!\n\nBut beware... in the world of Fable not everything is as it seems.","popularity":4.333333333333334,"aggregated_rating":90,"aggregated_rating_count":0,"total_rating":90,"total_rating_count":0,"games":[24426,28309,55038,55092,22387,54775,80916,28168,47823,18398],"tags":[1,17,27,268435465,268435468,268435487,536871208,536871262,536871938,536871939,536873384,536873787,536875151,536876241,536877520,536879106],"developers":[1378],"publishers":[273,1145],"category":0,"time_to_beat":{"hastly":29400},"keywords":[296,350,1026,1027,2472,2875,4239,5329,6608,8194],"themes":[1,17,27],"genres":[9,12,31],"first_release_date":851990400000,"pulse_count":2,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":851990400000,"human":"1996","y":1996,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ywatrovzomclpxctbgcm.jpg","cloudinary_id":"ywatrovzomclpxctbgcm","width":480,"height":270}],"videos":[{"name":"Gameplay video","video_id":"eAJiCERMxfI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tkuwhu30hllkfxgbmwoi.jpg","cloudinary_id":"tkuwhu30hllkfxgbmwoi","width":640,"height":777}}