{"id":5660,"name":"B-17 Bomber","slug":"b-17-bomber","url":"https:\/\/www.igdb.com\/games\/b-17-bomber","created_at":1396149080089,"updated_at":1534909449712,"summary":"B-17 Bomber takes place near the end of World War II. As the pilot of a B-17, your mission is to fly across the English Channel and bomb various strategic targets. First you need to select a destination which features a lot of targets. The further the target is from your home base, the more points you can earn, but with more ground to cover there will be more enemy fighters blocking the target and more fuel will be needed. Once a destination is set, you need to stock your plane with bombs and fuel, then take off! You will now have a first person point of view from the plane and can control which of several views is active. When trying to bomb targets, you will be looking straight down from the bombay doors. When you hear a voice announce incoming enemy planes, you need to switch the view to one of the guns and defend yourself. Lastly you can have a view from the cockpit to control the plane. If your fuel runs low, or your plane takes too much damage, you can fly back to your home base for repairs and then take off again to bomb as many targets as you can!","popularity":1.666666666666667,"games":[81141,83728,27091,17446,18623,27316,9243,6985,35371,15894],"tags":[1,17,22,39,268435461,268435469,536870931,536871078,536871201,536871904,536871937,536872060,536872649,536873064,536873753,536875067,536875137,536875199,536875206,536875242,536875262,536875305,536876854,536877820,536883136,536886414],"developers":[2521],"publishers":[2521],"category":0,"game_modes":[1],"keywords":[19,166,289,992,1025,1148,1737,2152,2841,4155,4225,4287,4294,4330,4350,4393,5942,6908,12224,15502],"themes":[1,17,22,39],"genres":[5,13],"first_release_date":410140800000,"platforms":[67],"release_dates":[{"category":2,"platform":67,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jkkfkduhwszdx10jghhx.jpg","cloudinary_id":"jkkfkduhwszdx10jghhx","width":256,"height":358}}