{"id":107016,"name":"Armed Heist","slug":"armed-heist","url":"https:\/\/www.igdb.com\/games\/armed-heist","created_at":1533953482552,"updated_at":1533953720792,"summary":"\"Armed Heist is an action-packed third person shooter game that lets gamers take part in an epic crime spree. Robbing banks and armored trucks has never been so much fun. Have you been looking for a great third person shooter game you just can't stop playing? Well you are in the right place. Welcome to the world of crime. Try to complete over 70 challenges! You have a mission in front of you - become a ruthless legendary thug and crime lord! \n \nYou only have to be smarter and more skillful than your enemies. Use different masks and weapons to achieve your goals. Make your character gain levels by unlocking and customizing a variety of weapons and gear. Start to earn tons of cash. Your journey in the life of crime has only started. \n \nThe CRIME MAP offers a huge range of dynamic hit jobs, and players are free to choose anything from small-time jewelry store robbery's, to big-league heists of major bank vaults. \n \nAs you progress the jobs become bigger, better, more challenging and more rewarding. Along with the prestige of earning more cash and climbing the ranks to become a legendary criminal, each player is equipped with a personalized weapon system that allows you to custom build the wildest modified guns you could ever imagine.\"","popularity":1,"games":[103298,103281,27209,32902,28029,103301,103020,95340,10039,19341],"tags":[1,268435461,536871004,536873093,1073741826],"developers":[16162],"publishers":[16162],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[92,2181],"themes":[1],"genres":[5],"first_release_date":1534377600000,"platforms":[34,39],"release_dates":[{"category":2,"platform":34,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12},{"category":0,"platform":39,"date":1534377600000,"region":8,"human":"2018-Aug-16","y":2018,"m":8}],"videos":[{"name":"Trailer","video_id":"QI3aVPi4wYc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ge4mljyqh3na2wty3wx3.jpg","cloudinary_id":"ge4mljyqh3na2wty3wx3","width":246,"height":246},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/ca\/app\/armed-heist\/id1163705851?platform=ipad"},{"category":10,"url":"https:\/\/itunes.apple.com\/ca\/app\/armed-heist\/id1163705851?platform=iphone"}]}