{"id":55216,"name":"Epic Loon","slug":"epic-loon","url":"https:\/\/www.igdb.com\/games\/epic-loon","created_at":1504176709999,"updated_at":1530944531883,"summary":"Dive into the bizarre world of Epic Loon, a quirky physics platformer for up to 4 players playable in couch co-op or battle mode. \n \nAn offbeat tribute to sci-fi classic movies, players lead a group of aliens to take over Joe’s TV after they are rudely awakened from their home, an old-school cleaning VHS-tape. \n \nFeatures : \n- A retro couch party game experience \n- A tribute to the beloved movies of the 80-90’s : Godzilla, Nosferatu, Jurrasic Park, Alien… You’ll play in parodies of famous movies of the 80-90’s, in scenes that it’s possible to recognize if you’re a movie fan. \n- A user friendly gameplay, simple to learn but with a real challenge for every type of players thanks to the different games mode : Story, Speedrun, Hardcore and Battle \n- More than 350 levels to master \n- An original soundtrack composed by the famous Rococo core band, Pryapisme","storyline":"My name is Joey Ernie 'Chips' Douglas, but my friends just call me Joe. I am what you might call a cinephile. I know the classics like the backs of my hands, I'm the real deal VHS expert: science fiction, fantasy, comedy, thriller and horror, nothing gets past me. I've got the biggest... VHS collection in all of Wyoming. I'm pretty proud of that fact. I record every program running on the cable night and day, to the point where my grandma calls me \"\"The Cable Guy\"\". All was well in my life until that night in August 1994. It was a Thursday I think. I was finishing for the third time that afternoon the excellent \"\"Space Vampires Versus Zombie Dinosaurs in Color\"\", and I noted all the best quotes in my journal, when my VCR, a dependable and sturdy JVCC BP-5000, began messing up out of the blue. The image off and on, disgusting sound, and glitches all around. I knew I had to act on it, and fast. \n \nI knew of only one person that could help me at this time of night: Mr Wing, the old sketchy chinese owner of the local corner hardware store. This is precisely the time that my problems really began. \n \nHe saw the panic and fear in my eye, and ended up selling me a VCR cleaning cassette. It wasn't easy, and it required that I guarantee that i follow a few rules of usage before. What a strange object it was, the VCR cleaner. Complete with a huge thick user's manual in a strange language I didn't understand: some sort of Dutch or something. Inside, it contained a list of crucial precautions to follow, such as: never expose the VHS to sunlight, don't get it wet, never insert it into the VCR after midnight. I had the impression that I had bought a Mogwai. What bullshit. This geezer must have been starting to get senile.. \n \nBut I should have listened, I should have heeded his warnings. Because now, I'm in deep shit. Since I inserted this cursed VHS in my JVCC, it would seem as if a group of stupid aliens took control of it. I have a hard time believing, a hard time convincing myself i've not gone completely crazy... I don't know where this cleaning cassette came from, and there's no way to contact the old chinese guy, he seems to have disappeared. \nI'm scared to talk to anyone about this. The police? They don't know anything. My grandma? She's faint of heart. The FBI? I have too many illegal recordings at home... \n \nIn the meantime until I find a solution, I'm condemned to spend my days with them. Luckily they don't seem too malicious... pretty annoying, but certainly not evil. They spend their time ruining my favorite movies. I've thought about it, and the only hope left is finding THE VHS that will reduce them to nothing. A monster movie, a disaster movie, anything dangerous. I have no choice.","hypes":2,"popularity":1.666666666666667,"games":[23852,10039,25311,18285,29032,103339,28070,105269,103341,28113],"tags":[1,18,27,40,268435464,268435488,268435489,536871936,536872546,536872600,536874929,536874931,536874932,536874933,536874935,1073741828],"developers":[13379],"publishers":[15602],"game_engines":[404],"category":0,"player_perspectives":[4],"game_modes":[1,2,3],"keywords":[1024,1634,1688,4017,4019,4020,4021,4023],"themes":[1,18,27,40],"genres":[8,32,33],"first_release_date":1531440000000,"pulse_count":6,"platforms":[6,48,49,130],"release_dates":[{"category":0,"platform":48,"date":1531440000000,"human":"2018-Jul-13","y":2018,"m":7},{"category":0,"platform":49,"date":1531440000000,"human":"2018-Jul-13","y":2018,"m":7},{"category":0,"platform":130,"date":1531440000000,"human":"2018-Jul-13","y":2018,"m":7},{"category":0,"platform":6,"date":1531440000000,"human":"2018-Jul-13","y":2018,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nakuk35qzjhoqvcecz6j.jpg","cloudinary_id":"nakuk35qzjhoqvcecz6j","width":1402,"height":832},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j7cd7p7nqqnzfqndkiqn.jpg","cloudinary_id":"j7cd7p7nqqnzfqndkiqn","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cms5bgc9s5uo1wruzgmh.jpg","cloudinary_id":"cms5bgc9s5uo1wruzgmh","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/le3xssgjjjfieuxhciz1.jpg","cloudinary_id":"le3xssgjjjfieuxhciz1","width":1826,"height":1026},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tjua1srz4enyvgmxjrje.jpg","cloudinary_id":"tjua1srz4enyvgmxjrje","width":1920,"height":1080}],"videos":[{"name":"Launch Trailer","video_id":"0dtakG4t-x8"},{"name":"Game intro","video_id":"zW4-IPeS2jk"},{"name":"Teaser","video_id":"6rpakFHOmRw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hqxmmieytmjgwe20fjcx.jpg","cloudinary_id":"hqxmmieytmjgwe20fjcx","width":2100,"height":2970},"esrb":{"rating":6},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/762190"},{"category":1,"url":"http:\/\/epicloon.com"},{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCvzqFzCWFVA6r-SzN8KtzXw"},{"category":5,"url":"https:\/\/twitter.com\/MacralesStudio"},{"category":4,"url":"https:\/\/www.facebook.com\/MacralesStudio"}],"external":{"steam":"762190"}}