{"id":7516,"name":"Titanic: Adventure out of Time","slug":"titanic-adventure-out-of-time","url":"https:\/\/www.igdb.com\/games\/titanic-adventure-out-of-time","created_at":1405782478160,"updated_at":1532025827985,"summary":"Titanic: Adventure Out of Time is a computer game developed by Cyberflix. It was published in the United States and Europe by GTE Entertainment and Europress respectively, and released on November 12, 1996. The game is a point-and-click adventure game which sees the player traveling around a virtual representation of the RMS Titanic.\nTitanic: Adventure Out of Time comes in three versions: a PC, Macintosh, or hybrid version that works on both the Windows and Mac. Version 1.0 of the game is an upgrade of the game from GTE Entertainment to just Cyberflix and is a stability upgrade first released in 1997. It comes in either a threefold CD jacket or a jewel case version. The French and German version of the game comes in two paper sleeves. The Mac and Windows versions were released first, produced by Cyberflix and distributed by GTE Entertainment in 1996. Hybrid versions of the game, which are compatible with both the Mac and Windows operating systems, were distributed and produced by Cyberflix after GTE Entertainment went out of business in 1997. Later versions were distributed by Hammerhead Entertainment, who took over production after Cyberflix also went out of business in 1998. The game is available in seven languages: English, French, German, Dutch, Russian, Polish and Korean.\nCharacters in Titanic: Adventure Out of Time were rendered by way of photographs of actors given limited animation in sync with dialogue. The producers of this game used this same style of rendering for a previous adventure entitled Dust: A Tale of the Wired West.","storyline":"The game begins in April 1942 with the main character (whose name is Frank Carlson) being caught in an air raid during the London Blitz of World War II and being sent back in time to 1912 with an opportunity to change history. In 1912, he was a British secret agent on the RMS Titanic, who must retrieve a priceless copy of the Rubáiyát of Omar Khayyám and now has a second chance to complete his mission. The open-ended gameplay allows the player to either follow the storyline by solving puzzles or simply explore the rooms of the ship.\nThe player's first mission is to locate and retrieve the The Rubáiyát, which is revealed to have been stolen earlier in the year and is now suspected of being in the possession of Zeitel, a German Oberst (Colonel) who is traveling on the Titanic in the manner of inspecting embassies in the United States and Central America. Traveling with the Colonel is his young protegé, Willi Von Haderlitz. It is revealed that the Colonel has made a deal with an art dealer from London named Sasha Barbicon to exchange The Rubáiyát for an apparently unimportant painting, in which there are hidden war plans stolen from the British government. They each act through an intermediary go-between, a Serbian stowaway named Vlad Demonic. In addition to The Rubáiyát and the painting, the player learns that Willi is a spy for the Russians and has a notebook with names of top Bolshevik leaders. The notebook must be handed over to the Ochrana so that Communist rebels will be executed, preventing a threat to the Czar. Barbicon is also in possession of a stolen diamond necklace that will finance a Serbian military group called the Black Hand.\nDuring his mission, the agent also becomes involved in several subplots which do not pertain to the central mission or, for that matter, the winning conditions of the game. One important subplot begins by meeting the ship’s 'gossip hound', in the form of a wealthy middle-aged spinster named Daisy Cashmore, who hands the player a note to meet with Andrew Conkling, the owner of Conkling Steel. Conkling tells the player to retrieve a business document that had been stolen by Shailagh Hacker, an Irish maid who had worked at his house in London. Other plots include meeting and helping the Lambeths, a wealthy couple whose marriage has deteriorated, as well as meeting with other passengers including Leyland Trask, a psychic from Boston; Reverend Edgar Troutt, a religious preacher from Sunapee, New Hampshire who is returning from an African mission in Nyasaland; and Max Seidelmann, an American freelance businessman from Philadelphia, who provides a back story and insight of varying value. Assisting the player from time to time is fellow agent Penny Pringle.\nThe number of objects the player retrieves before escaping the ship affects the final cut scene and how history is played out. If the player manages to retrieve all four objects, history is altered with World War I, the Russian Revolution, and World War II never occurring — without The Rubáiyát and\/or the diamonds, the Black Hand is not financed and their plan to assassinate Archduke Franz Ferdinand of Austria (which would have sparked World War I) fails. The painting Barbicon was going to trade in to Zeitel was actually painted by Adolf Hitler, and its fame after it is recovered from the sinking causes Hitler to become a famous artist, averting World War II (the war plans hidden in it are actually useless, and so whether or not they are found is irrelevant to history). The notebook with the names of the Bolsheviks makes its way to the Czar, and the Russian Revolution never occurs. With the world knowing peace and prosperity, the character retires after a successful career to a world of peace. Depending on which items the player fails to collect, history will change, but certain wars or revolutions will still occur: alternative endings exist where Germany conquers Russia and the United Kingdom, or the Soviet Union conquers Europe, to name two.","franchise":576,"franchises":[576],"rating":70,"popularity":1.333333333333333,"total_rating":70,"total_rating_count":2,"rating_count":2,"games":[19319,21599,184,9730,35371,3035,27316,8968,9655,11270],"tags":[17,20,22,31,268435458,268435469,268435471,268435487,536871082,536871109,536871169,536871183,536871889,536871939,536872124,536872131,536872211,536872225,536872328,536872435,536872647,536875067,536875089,536875125,536875199,536875242,536875262,536875275,536875325,536875330,536875426,536875503,536875504,536875508,536875510,536875511,536875525,536875565,536875572,536875639,536875745,536875764,536875808,536875880,536875900,536876031,536876083,536876084,536876128,536876287,536876381,536876974,536877551,536877907,536878582,536879185,1073741825],"developers":[5822],"publishers":[5823,5824],"category":0,"time_to_beat":{"normally":42420},"player_perspectives":[1],"game_modes":[1],"keywords":[170,197,257,271,977,1027,1212,1219,1299,1313,1416,1523,1735,4155,4177,4213,4287,4330,4350,4363,4413,4418,4514,4591,4592,4596,4598,4599,4613,4653,4660,4727,4833,4852,4896,4968,4988,5119,5171,5172,5216,5375,5469,6062,6639,6995,7670,8273],"themes":[17,20,22,31],"genres":[2,13,15,31],"first_release_date":836179200000,"pulse_count":2,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":836179200000,"region":2,"human":"1996-Jul-01","y":1996,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bf9z6blsbnruvhghsud8.jpg","cloudinary_id":"bf9z6blsbnruvhghsud8","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t7gjzpshogkq4mxkydov.jpg","cloudinary_id":"t7gjzpshogkq4mxkydov","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zzjroepwdmosqvyeszpg.jpg","cloudinary_id":"zzjroepwdmosqvyeszpg","width":640,"height":480}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gecfqq6jh8o793iiltd2.jpg","cloudinary_id":"gecfqq6jh8o793iiltd2","width":1132,"height":1432},"esrb":{"rating":5},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/785480"},{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/Titanic_adventure_out_of_time"}],"external":{"steam":"785480"}}