{"id":86716,"name":"Christmas Bubble Shooter","slug":"christmas-bubble-shooter","url":"https:\/\/www.igdb.com\/games\/christmas-bubble-shooter","created_at":1518601409051,"updated_at":1518705517801,"summary":"Here comes a time on Christmas Day when you've ripped open every present, eaten all the food and just want to laze around on the sofa. But instead of becoming a bunch of zombies in front of the TV, why not round up the kids to play this Christmas game for some festive fun ?\n\nThis Christmas game for kids are perfect for a school party or a family to have fun altogether. Naughty or nice, everyone loves a good party christmas game— especially at Christmas. They’re a great way to break the ice with this Classic Bubble Shooter christmas game and encourage guests to start mingling.\n\nLove Christmas games? Then get ready to rescue Snowman  trapped inside the bubbles and make them reach safely back to Santa.If you are on the hunt for a  best Christmas Bubble Shooter game online that’s going to get you in the spirit of the festive season, then this christmas game is going to be well worth a look.\nChristmas is coming! And Santa is preparing his sleigh. Snowman  are responsible for packing presents. \n\nEverything is almost ready... But where are Snowman ??  Oh no!!1 they are larking again, trapped inside colorful bubble. And now Santa needs your help to pop all the bubbles and find Snowman..So are you ready to take dive into an amazing adventure to save them and take a chance of being a hero once again.\n \nAdjust your winning strategies in each game! The more bubbles you remove in one shot, the more points you score, and the closer you get to be the master of Christmas Bubbles.\n\nGet into  holiday spirit  with  this classic Christmas game! Christmas Bubbles.This game is extremely addictive, probably the most played among one of the christmas games. \n\nChristmas Day will give you the most powerful, festive and fun christmas you’ve ever experienced.\nAll the bubbles have captured Snowman, so their chance of freedom falls into the player's hands. By blasting, popping and matching your way through over 100 levels you’ll free the Snowman in this high quality Bubble Shooter game. \n\nThis christmas game lets you a chance to become a hero and rescue all the Snowman. There are up to more than hundreds of  levels and each with unique obstacles. It revolves around match-3 elements and allows you take aim, and shoot the balls to blast the other balls and struggle to save the babies and return them to their Worried Santa. \n\nThe levels get harder in our Christmas game  as you go on, but don’t worry as you will gain new skills and rewards that give you extra-explosive bubble-popping power. The quicker you release them, the more points you will score.\n\nChristmas is coming again. So good to have fun playing these christmas games.Your favorite Bubble game in a special christmas edition is ready to take you for a holiday! \n\nCome on! You will love the exciting shooting and playful music in our brand  new Christmas game theme! \nDownload  Christmas Bubbles game for free today!\n\n==== Christmas Bubbles Features ====\n \n1. Challenging Levels\n2. Watch video ads to get extra moves\n3. Earn exciting boosters\n4. Rescue the cute animals by popping the bubbles\n5. Elegant graphics and cool animations.\n\nPlease Rate and review Christmas Bubbles game and help us bring out more free games you enjoy.\n\nYour support will be our greatest motivation!\n\nEnjoy playing Christmas Bubbles.","rating":40,"popularity":1,"total_rating":40,"total_rating_count":0,"rating_count":0,"games":[19222,41348,10225,27266,97254,95538,95525,92204,92096,91172],"tags":[268435465,268435489],"category":0,"genres":[9,33],"first_release_date":1513900800000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1513900800000,"region":8,"human":"2017-Dec-22","y":2017,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ti86ydzuykd0fampnmdx.jpg","cloudinary_id":"ti86ydzuykd0fampnmdx","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pmuc8dve5waojdldsjlm.jpg","cloudinary_id":"pmuc8dve5waojdldsjlm","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/whypfsl282xmmmwtdy3c.jpg","cloudinary_id":"whypfsl282xmmmwtdy3c","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pgrlyuvxlogzym3wupj2.jpg","cloudinary_id":"pgrlyuvxlogzym3wupj2","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pdpcdstofiozhcg9odx1.jpg","cloudinary_id":"pdpcdstofiozhcg9odx1","width":512,"height":512}}