{"id":101031,"name":"Doom II RPG","slug":"doom-ii-rpg","url":"https:\/\/www.igdb.com\/games\/doom-ii-rpg","created_at":1525783678577,"updated_at":1525787761400,"summary":"Doom II RPG is a first-person shooter role-playing video game, the sequel to Doom RPG. It was released for mobile phones on November 23, 2009 and for iPhones on February 8, 2010. Versions for BlackBerry OS and Windows Mobile are also available. It uses the Wolfenstein RPG engine and was developed by id partners Fountainhead Entertainment via the merger id Mobile. The iPhone version of Doom II RPG contains a digital comic book.","storyline":"Doom II RPG is the sequel to Doom RPG, set one year after the first game (there is one reference Dr. Guerard in a file dated 2144 (1 year before the incident), the comic dates the events at 2146, and the Doom RPG website dates things between 2144-2145). While there's not much known about the monster invasion in UAC bases on Mars, another monster invasion happened on Earth's moon. A team of soldiers accompanied by a scientist have ventured to the UAC bases on the Moon to investigate. (According to the included digital comic present in the iPhone version of the game, the Scientist was not a planned member of the expedition; rather, his ship was commandeered by the Marines in order to quickly reach the Moon. This is not confirmed within the plot of the game itself, though.) \n \nAt the beginning the group splits up and the player is on his\/her own. The player is briefed by a UAC employee named Caldex, who informs the team about the invasion and provides tips on how to proceed. Immediately noticed are conflicts between a UAC computer designated SAL and another unknown entity, designated VIOS. SAL (whose name is a play on HAL 9000 from the movie 2001: A Space Odyssey) is an AI developed by the UAC to assist in day-to-day operations within UAC research facilities. VIOS (whose name stands for Virtual Icon of Sin) is a malevolent entity from Hell who is invading the UAC's computer networks. VIOS' motives are unclear, but SAL warns you not to trust it or assist it in any way. \n \nConflicts with VIOS appear frequently in the game (beginning with Map 2, and also occurring in maps 4, 5, and 7). At each encounter, VIOS will request the player to make a decision - MALLOC or DELETE. MALLOC will allocate \"resources\" to VIOS, thereby assisting it; DELETE will delete these \"resources\", angering VIOS and requiring the player to do combat with VIOS. Whether the player chooses to assist VIOS or not determines whether (and how often) the player needs to fight VIOS. By choosing MALLOC, you avoid an immediate battle with VIOS; however, VIOS will become stronger when confronted at the end of the game, a confrontation which is unavoidable. (Although the game never explains exactly what the \"resources\" are, it is believed that they are human souls that VIOS can feed off of. Choosing MALLOC to avoid conflict in the short term will therefore cause the end-game battle to be more difficult. \n \nAfter the player traverses the first three maps comprising the moon base (periodically encountering Caldex, one of the unused player characters, or other NPCs), s\/he will briefly need to pass through a cavern in Hell, where s\/he encounters the Pinkynator, a creature that spawns Pinkies. After defeating the Pinkinator, a portal is revealed which transports the player to a UAC base on Earth. \n \nUpon reaching the UAC base on Earth (comprised of Maps 4 through 6), s\/he quickly finds out that the UAC base on Earth is overrun by demons as well. The player is also introduced to a Dr. Zanax, a scientist who seems to be attempting to help facilitate the invasion of demons. The player fights his\/her way through the base, and encounters another teleporter guarded by a Spider Mastermind. After defeating the Spider Mastermind, Dr. Zanax forcibly teleports the player to Hell. \n \nHell comprises Maps 7 through 9. The player battles through the caverns and lava pits of Hell, briefly encountering one of the other player characters (whose identity changes depending on the player's current choice of character) who gives the player the BFG. The player continues to battle through Hell where s\/he encounters the Cyberdemon (in Map 8) and finds out VIOS is the brain of another Icon of Sin. VIOS is finally confronted in Map 9. After the VIOS is defeated the game ends with an ominous sign off, letting the player know the fight is not over. The fate of the remaining player characters, Caldex, and Dr. Zanax is not explicitly made clear.","collection":129,"franchise":798,"franchises":[798],"popularity":1,"games":[25311,28029,68287,25300,29525,76229,36950,68142,101029,27314],"tags":[1,18,19,268435461,268435468,268435480,536871886,536872075,536872420,536873142,536873741,536874858,536878229,536887866,536888012,536888013,1073741825],"developers":[15460],"publishers":[3187],"game_engines":[569],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[974,1163,1508,2230,2829,3946,7317,16954,17100,17101],"themes":[1,18,19],"genres":[5,12,24],"first_release_date":1258934400000,"platforms":[39,73,55],"release_dates":[{"category":0,"platform":73,"date":1260489600000,"region":8,"human":"2009-Dec-11","y":2009,"m":12},{"category":0,"platform":39,"date":1265587200000,"region":8,"human":"2010-Feb-08","y":2010,"m":2},{"category":0,"platform":55,"date":1258934400000,"region":8,"human":"2009-Nov-23","y":2009,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dait8oqisbhljt4aghmo.jpg","cloudinary_id":"dait8oqisbhljt4aghmo","width":480,"height":320}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/q1ggm0oghagobmpsvdxo.jpg","cloudinary_id":"q1ggm0oghagobmpsvdxo","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/doom-ii-rpg\/id354051766?mt=8"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Doom_II_RPG"},{"category":2,"url":"http:\/\/doom.wikia.com\/wiki\/Doom_II_RPG"}]}