{"id":19831,"name":"Duplicate kol","slug":"duplicate-kol","url":"https:\/\/www.igdb.com\/games\/duplicate-kol","created_at":1467242114335,"updated_at":1538853253066,"summary":"\"Kologeon is a dark mystic action adventure set in a procedurally generated handcrafted realm tormented by demons and spirits.\n\nYou are an immortal soul that can traverse dimensions outside of physical bodies, fighting for centuries as you establish permanent monuments to mark your journey.\n\nKologeon builds around the ideas of an unfolding experience, freedom of exploration, and self-discovery where quests and guides are not present letting you craft your own journey.\n\nWith procedural generation we aim to create un-repetitive experiences where death is still a setback but won't mean that you'll have to memorize levels and replay the same thing over again. However this isn't a roguelike. Your actions and progress stay permanent.\n\n\n- Explore and interact with a world built on top of itself, coexisting with another.\n\n- Uncover the story through a gloomy dark atmosphere, interaction with spirits, and events you witness or cause. Every place and - feature of the game is carefully crafted with a consideration of the bigger story. We want to create something deep that you could really lose yourself inside of.\n\n- Fly, roll, and rip through demons with a fast satisfying mobility based combat involving astral projection, giant spiritual weapons, time disruption, possession and manipulation of souls. Forge weapons from your enemies and manifest their abilities.\n\n- Enemies are able to dodge, parry, and tear you to pieces as the game is easy to pick up but difficult to master.\"","popularity":1.666666666666667,"games":[37419,29032,81249,80916,31712,47823,28070,106987,101608,25311],"tags":[1,17,268435487,268435488,536872006],"developers":[10228],"publishers":[10228],"game_engines":[79],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[1094],"themes":[1,17],"genres":[31,32],"first_release_date":1546214400000,"pulse_count":1,"platforms":[6,14,3],"release_dates":[{"category":2,"platform":3,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12},{"category":2,"platform":14,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12},{"category":2,"platform":6,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12}],"videos":[{"name":"Trailer","video_id":"cleK6Sv2lfw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bypuvzrxkcrttkdpc0jt.jpg","cloudinary_id":"bypuvzrxkcrttkdpc0jt","width":1050,"height":516},"websites":[{"category":1,"url":"https:\/\/chillcrow.com\/"},{"category":4,"url":"https:\/\/www.facebook.com\/Kologeon\/"}]}