{"id":41531,"name":"AMOK!","slug":"amok--1","url":"https:\/\/www.igdb.com\/games\/amok--1","created_at":1498819567754,"updated_at":1500272528342,"summary":"With the power turned off, insert the AMOK! game cartridge into your Odyssey 2 system with the label forward. Push the cartridge down into place and push the power switch on. \n \nYou will see the AMOK! title screen with a scrolling message. You will be using the right controller. Press the action button to start. \n \nAt the beginning of each level you will see the game status. The S 000000 is your score, the L 01 is the current level and the R 03 is your remaining lives. After a short pause, the game screen will appear. \n \nYou control the green character with the joystick. To fire, hold the Action button and point the stick in the direction you want to fire. You can fire up, down, left, right and diagonally. \n \nThe object is to get to the end of the maze while destroying the berzerk robots. The robots will pursue you and shoot back. After a short time, the indestructible Smileybot will appear and stop at nothing to get you. He can go through walls and your shots will have no effect on him. You can only try to outrun him and get to an exit. \n \nYou will lose a life if shot by a robot, colliding with a robot or colliding with the Smileybot. Touching a wall is lethal. \n \nThe enemy robots will always try to follow you. You can use this to your advantage by leading robots to walk into walls and self-destruct. \n \nShooting a robot scores 10 points. You do not receive any points for robots that are destroyed by walking into the walls. \n \nYou receive 100 points for leaving a maze with all robots destroyed. \n \nUnlike most Odyssey 2 games, this game gives you 3 lives. Losing all three lives ends the game and you must press the RESET button. You are awarded a bonus life if you can score 1,000 points. \n \nThere are 12 mazes in all. Each time you clear a maze, the game will increase a little in difficulty.","popularity":1.333333333333333,"category":0,"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zfw1zmbtqx00aydltbbj.jpg","cloudinary_id":"zfw1zmbtqx00aydltbbj","width":815,"height":1199}}