{"id":53731,"name":"The Elder Scrolls IV: Oblivion 5th Anniversary Edition","slug":"the-elder-scrolls-iv-oblivion-5th-anniversary-edition","url":"https:\/\/www.igdb.com\/games\/the-elder-scrolls-iv-oblivion-5th-anniversary-edition","created_at":1501612704136,"updated_at":1524504029742,"summary":"The Elder Scrolls IV: Oblivion 5th Anniversary Edition is a celebration of the fourth release in the classic Elder Scrolls Role-playing Game (RPG) series. \n \nDesigned as a comprehensive entry point into the Elder Scrolls IV: Oblivion gameplay experience for new players prior to the release of the next major release in the franchise, The Elder Scrolls V: Skyrim, The Elder Scrolls IV: Oblivion 5th Anniversary Edition contains all of the major content releases in the Oblivion series, including the base Oblivion game and its two expansion packs: The Elder Scrolls IV: Knights of the Nine and The Elder Scrolls IV: Shivering Isles. The Elder Scrolls IV: Oblivion 5th Anniversary Edition presents one of the best RPGs of all time like never before. Step inside the most richly detailed and vibrant gameworld ever created. With a powerful combination of freeform gameplay and unprecedented graphics, you can unravel the main quest at your own pace or explore the vast world and find your own challenges. Also included in the 5th Anniversary Edition are The Elder Scrolls IV: Oblivion Knights of the Nine and The Elder Scrolls IV: Oblivion Shivering Isles expansion packs, adding new and unique quests and content to the already massive world of Oblivion, the original \"making of\" DVD, map, the Skyrim trailer. See why critics called Oblivion the Best Game of 2006.","collection":6,"popularity":1,"version_parent":59,"version_title":"5th Anniversary Edition","games":[37088,47823,26163,24048,16468,59516,1221,25300,55289,19457],"tags":[1,17,22,33,38,268435468,268435487],"category":0,"themes":[1,17,22,33,38],"genres":[12,31],"first_release_date":1328659200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1328659200000,"region":8,"human":"2012-Feb-08","y":2012,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xuvlck2oqv1ho93duanv.jpg","cloudinary_id":"xuvlck2oqv1ho93duanv","width":1070,"height":1500}}