{"id":68531,"name":"Crime Car Driving Simulator","slug":"crime-car-driving-simulator","url":"https:\/\/www.igdb.com\/games\/crime-car-driving-simulator","created_at":1506451811899,"updated_at":1506455609656,"summary":"Take control of some amazing cars (speed car, SUV and 4x4) in a huge environment ready to explore, with a big city, forests, canyons, hills and mountains : more than 16 km² of area and 30 km of roads ! \nJoin a gang and help them to rob banks and to shake off the police. \nDrive in a whole city with realistic and intense traffic. \nComplete tons of unique missions to become a professional driver and to become rich ! \n \n!! City Driver - Speed and Offroad Car contains 20 free levels !! \n \nMake your choice between city cars, offroad cars, and speed cars. \nCome and explore this huge island environment filled with lots of points of interest to discover. \n \nThe city is very big with real traffic cars, buildings, houses, bridges and traffic lights. \nDrive around and see the sights like rivers and lakes, an ancient Japanese temple, airport with other aircrafts and planes, secluded houses and farms, ruins, a camping place, and more... \nThe road system are also very dense, from highways and 2x2 lanes, to very small road of montains, with hill climb. \n \nExplore the map to find one of 20 spots to launch a mission, or you can drive and do whatever you want freely. \nThe minimap help you to know where are the missions spots.","popularity":1.666666666666667,"games":[34919,19341,25311,54999,28465,37419,44242,36608,55715,33603],"tags":[1,268435469,536872695,536875014],"category":0,"keywords":[1783,4102],"themes":[1],"genres":[13],"first_release_date":1504224000000,"platforms":[34,39],"release_dates":[{"category":0,"platform":34,"date":1504224000000,"human":"2017-Sep-01","y":2017,"m":9},{"category":0,"platform":39,"date":1505347200000,"human":"2017-Sep-14","y":2017,"m":9}],"videos":[{"name":"Trailer","video_id":"7NWrjhonIEQ"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/usyvzi2lpyaavoiy7hha.jpg","cloudinary_id":"usyvzi2lpyaavoiy7hha","width":256,"height":256},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.pickle.CityDriver"},{"category":10,"url":"https:\/\/itunes.apple.com\/app\/id1279270351"}]}