{"id":2994,"name":"Invizimals","slug":"invizimals","url":"https:\/\/www.igdb.com\/games\/invizimals","created_at":1381580572984,"updated_at":1534377605735,"summary":"Invizimals is a PlayStation Portable augmented reality video game developed by Novarama, and published by Sony Computer Entertainment Europe. It is a collectible creature game, and is bundled with the PSP's camera attachment on launch.","collection":553,"popularity":2.666666666666667,"games":[27092,24426,56033,26223,35994,28309,80916,26553,20342,36198],"tags":[1,35,268435460,268435465,268435471,268435487,536871010,536871208,536871363,536871938,536872509,536873787,536873810,536874694,536875638,536876102,536876212,536883374,536883865,536885773,536888348,536893028,536893029,1073741827],"developers":[1399],"publishers":[45],"category":0,"player_perspectives":[3],"game_modes":[1,2,3],"keywords":[98,296,451,1026,1597,2875,2898,3782,4726,5190,5300,12462,12953,14861,17436,22116,22117],"themes":[1,35],"genres":[4,9,15,31],"first_release_date":1258070400000,"platforms":[38],"release_dates":[{"category":0,"platform":38,"date":1258070400000,"human":"2009-Nov-13","y":2009,"m":11}],"videos":[{"name":"Teaser","video_id":"ihtW18U5NyY"},{"name":"Trailer","video_id":"idlKMuEZd00"},{"name":"Gameplay video","video_id":"A8hmV20Ojzg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t8ilq7qkzh6n7d3ytcut.jpg","cloudinary_id":"t8ilq7qkzh6n7d3ytcut","width":256,"height":439},"esrb":{"synopsis":"The premise behind this adventure game is that small invisible creatures exist in color-spectrum wavelengths that can be detected, interacted with by using—the Sony PSP camera. Thus players capture invisible creatures called \"invizimals\" to use them in battles against other invizimals in tournament-style matches.  Capturing  invizimals means shooting them with fireballs, luring them into the PSP camera, surrounding them with flames;  Fighting  means that the little fantasy creatures use elemental (fire, wind, ice, etc.) and physical attacks to defeat their animated opponents. Invizimals can \"claw-slash,\" spit fire, shoot spikes, or use toxic flatulence to inflict damage. One creature (Flameclaw) stabs itself with its stinger if it loses a match; another creature (Skysaur) shoots projectiles from its rear end; and the Bongorilla invizimal picks its nose and wipes its boogers on the ground. The game contains live-action cutscenes in which real actors sometimes push and shove each other; the scenes are often dramatic and may include frequent references to kidnapping, or discussions about \"weaponizing\" the invizimals.","rating":4},"websites":[{"category":1,"url":"http:\/\/invizimals.eu.playstation.com\/‎"}]}