{"id":25205,"name":"Floatlands","slug":"floatlands","url":"https:\/\/www.igdb.com\/games\/floatlands","created_at":1477318270752,"updated_at":1538035852768,"summary":"Floatlands is a lowpoly survival-exploration fps game in singleplayer mode with multiplayer to be added later on. Game is currently in early development with set goals.           \n                    \n           \n* PROCEDURALLY GENERATED WORLD - You will play a robot as the main protagonist of Floatlands, going up against other robots. Game world will consist of several biomes: jungle, desert, sea and snow. These worlds will be unique all the time because they will be randomly generated. Islands and natural elements will have certain similarities, but altogether the world will be unique every time.           \n           \nhttps:\/\/i1.wp.com\/floatlands.net\/wp-content\/uploads\/2017\/04\/scorched-sunset-lowpoly-floatlands.png           \n               \n           \n* QUESTING, POINTS OF INTEREST - There will be random events\/quests (defending, collecting, exploring) across the world for you to complete. Quests, missions will also be randomly generated in order to bring the unpredictability aspect to the game.           \n           \nhttps:\/\/i0.wp.com\/floatlands.net\/wp-content\/uploads\/2016\/06\/quest-character-lowpoly-floatlands-2.png           \n           \n                    \n* PLAYING STYLES - You can choose different play styles when playing in the world of Floatlands. You can be an explorer or you can be an aggressive player that wants to eliminate threats of well being.           \n                    \n                    \n* RESOURCE GATHERING - Important part will be the resource gathering aspect. Some basics: Shooting down robot enemies will provide you scrap metal; by chopping trees you will gain wood; sheep is a source for wool; you will also find resources in caves. Certain materials need to be processed and smelted in order to be used for building structures. \n \n* CUSTOM BUILD MODE - With gathered resources you’ll be able to build and upgrade your own custom base\/shelter and defend from enemies. At this moment there are 50 different build parts you can use to build your base. There are also 3 tiers – wood (starting tier), stone and fortified stone (highest tier for now). Build mode mixed with random generated terrain provides a multitude of options (basic shacks, castles…), so it will be interesting in this regard. \n \n* ELECTRIC SYSTEM - One other major feature in game is electricity which will provide you with different options in the game - repairing your robot, powering up the lights and your defense system (turrets). We are in the process of making various props that will need a source of energy. Generators will be that source and with cables you'll have the option to connect devices yourself.  You will have to fill generators with fuel to get them to work. \n \nhttps:\/\/i1.wp.com\/floatlands.net\/wp-content\/uploads\/2017\/05\/electricity_connection_lowpoly_floatlands.png","storyline":"Your character is the last non-corrupted and reworked robot that was used for ordinary chores and to help human progress. Robots were used in various professions, from fireman assistants to gardeners and babysitters.                 \n                 \nSomeone decided to benefit from all this and corrupted (hacked) the robots. It came to a Kvall-Hebert war, which fractured the world to a multitude of islands (Floatlands).                  \n                 \nKvall-Hebert war was a war between two brothers who started manufacturing house accessories and machines - from generators, lights to advanced robots. Because of their competitiveness they directed their army of robots against eachother, hacked and corrupted them. The war almost wiped out humanity, so it's a possibility that you'll find some humans in the game, besides animals.                  \n                 \nYou are the last robot that seeks purpose in this world, trying to survive, explore and find the secrets of what really happened in the past.","hypes":10,"popularity":5,"games":[31712,26145,37777,37419,26298,28277,61616,26658,36334,80916],"tags":[21,268435460,268435487,268435488,536870984,536871251,536873669,1073741825],"developers":[11385],"game_engines":[13],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[72,339,2757],"themes":[21],"genres":[4,31,32],"first_release_date":1538265600000,"status":6,"pulse_count":1,"platforms":[6],"release_dates":[{"category":5,"platform":6,"date":1538265600000,"region":8,"human":"2018-Q3","y":2018,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qwuoasplencqhzcmeu2z.jpg","cloudinary_id":"qwuoasplencqhzcmeu2z","width":1629,"height":839},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kgictmmtwxqty6fpm2zj.jpg","cloudinary_id":"kgictmmtwxqty6fpm2zj","width":1632,"height":711},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hba6d3kfp2zehisfy7lq.jpg","cloudinary_id":"hba6d3kfp2zehisfy7lq","width":1679,"height":780},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mfkxfjojniqrpfypbq0m.jpg","cloudinary_id":"mfkxfjojniqrpfypbq0m","width":1393,"height":616}],"videos":[{"name":"Gameplay video","video_id":"nLbukAPiLoA"},{"name":"Teaser","video_id":"hyojPG2LCu4"},{"name":"Teaser","video_id":"8VYRFeMcBpA"},{"name":"Teaser","video_id":"JcaqXg5zugI"},{"name":"Teaser","video_id":"g3he1qA77Nw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ouaxx1g0bmqrfg6lcfyo.jpg","cloudinary_id":"ouaxx1g0bmqrfg6lcfyo","width":2999,"height":4241},"pegi":{"rating":3},"websites":[{"category":14,"url":"https:\/\/www.reddit.com\/r\/Floatlands"},{"category":8,"url":"https:\/\/www.instagram.com\/floatlands"},{"category":6,"url":"https:\/\/www.twitch.tv\/floatlands"},{"category":4,"url":"https:\/\/www.facebook.com\/Floatlands"},{"category":3,"url":"https:\/\/floatlands.gamepedia.com\/Floatlands_Wiki"},{"category":9,"url":"https:\/\/www.youtube.com\/c\/floatlands"},{"category":5,"url":"https:\/\/twitter.com\/Floatlands"},{"category":1,"url":"http:\/\/www.floatlands.net"}]}