{"id":2605,"name":"BattleBlock Theater","slug":"battleblock-theater","url":"https:\/\/www.igdb.com\/games\/battleblock-theater","created_at":1373992591837,"updated_at":1548353271130,"summary":"In BattleBlock Theater, players control a prisoner as they are forced to play through games devised by Hatty Hattington. Controls are simple, with the game largely consisting of running, jumping and punching. Levels are made up of various types of blocks, such as collapsing blocks, sticky walls, bouncy volcanic rocks and deadly spikes, and also feature hazards such as water and deadly creatures. \nThe main mode in the game is Adventure Mode, which can be played solo or co-operatively with a second player. During co-operative play, players are able to work together to overcome obstacles, which includes throwing them across gaps, using their heads as platforms and helping each other up ledges, although there is just as much opportunity to sabotage your partner. Adventure mode consists of various worlds each with a set of levels. In order to progress to the next world, players need to collect gems which can also be used to unlock new customiseable parts. Players can also collect balls of yarn which they can use to bribe cat guards and unlock new weapons, such as frisbees and vacuum cleaners. Collecting all gems and the yarn will get you an A++ in the level and two extra gems. Arena mode is a competitive mode for up to four players, which can be played free-for-all or in teams. There are several match types including: \nSoul: Steal enemy soul and run away. Capture and hold the enemy's souls to gain points. Kill a soul-carrier to release their souls to roam the level. \nMuckle: Beat and kill the enemy team to earn your team points. \nChallenge: Score the best time on a given level. \nKing Of The Hill: Stand on the crown blocks to gain your team points. \nColor The World: Color more blocks than the other team. \nGrab The Gold: Grab more gold from the golden whale than the other team and deposit it in the flying safe to score points for your team \nBall Game: Get the ball in the basket. \nHorse: Ride the opposing team's horse to your stables to gain points for your team. \nAlong with a Time Attack mode, the game also features a Level Editor, which allows players to create their own stages for any game type. These levels can be assembled into a playlist, consisting of various Adventure and Arena levels, and uploaded to the community for others to download. There is also additional content unlocked for players who also own Castle Crashers and Alien Hominid HD.[3][4]","storyline":"Almost all of the game's cut-scenes are done in a stick puppet style. The game begins with the narrator (played by Will Stamper) telling the adventures of the hundreds of friends aboard the S.S. Friendship, as well as Hatty Hattington, who is known as \"best friend to one and all\". After encountering a heavy storm, the S.S. Friendship becomes shipwrecked on a mysterious, seemingly abandoned island, and the crew itself vanishes. Upon waking up from the wreck, the player character seeks shelter from the storm in a dilapidated theater. Soon afterwards, the player discovers technologically advanced, highly-evolved cats restraining a captive Hatty as he is being fitted with an ominously glowing top hat. The hat appears to change him, and he alerts the cats to the player's presence, attacking them and rendering them unconscious. \nUpon coming to, it is revealed that the entire crew of the S.S. Friendship is being held prisoner by the cats, with Hatty as their apparent new leader. The player is then released from their cell and forced into deadly games by the feline wardens. The cats, who force their prisoners into deadly theater performances, watch with amusement as the player fights for their survival. As the player completes challenges, they find gems which are spend on unlocking fellow crew members to play as in these theater performances. Appearing to be possessed by the hat's unknown powers, Hatty begins working for the cats and against the player. \nAs the player progresses, the narrator reveals more about the theater. Hundreds of years before the player shipwrecked on the island, Purrham Furbottom, a theatrical aficionado, sought to build the world's greatest theater. The opening night saw the most jaw-dropping feats and thrills the likes of which were never seen before, making the theater an overnight success. However, Furbottom did not allow intermissions in the theater, and after an untold amount of time watching the show, he died after \"pooping himself to death on the way to the bathroom.\" Since then, his top hat has been passed down to various others, who were each revered by the cats as their leader, and who each met with grim fates of their own. The hat, the narrator theorizes, is haunted by the grief and sorrow of each of its past wearers, and Hatty is its current victim, having sunk into a depression while being surrounded by the many gems the player has accrued, without doing anything to help the state of the theater. \nEventually, the cats grow tired of Hatty's inaction, and begin rioting, striking, and more, while the player's challenges grow increasingly difficult. As the theater deteriorates further, the narrator provides encouragement to the player, and continues to shed light on the cats' mental state, which grows more unstable as time progresses. The narrator also instructs the player to enter The Vault, which houses Hatty and all the gems the player has spent, before the cats kill Hatty and the rest of the crew, starting the madness over again. \nAfter completing the final set of challenges inside the Vault, the player breaks into Hatty's throne room. Hatty doesn't budge, so the player carries him out of the crumbling theater as the crew of the S.S. Friendship orchestrates a mass breakout. Everyone manages to make it back to the boat amidst the chaos, escaping the island and the cats that reside there. As the player celebrates with hot cocoa, he tries to cheer up Hatty, who the narrator implies has sunk into a catatonic state from prolonged exposure to the hat. The narrator sings a sad song as the credits roll, before quickly recovering and singing a more happy, upbeat song, rocking the boat and flinging Hatty into the sea, where he sinks to the bottom. The hat lands on his head and begins glowing green as opposed to its usual red, and shoots a beam skyward, where it sends the boat flying and continues into space, where it vaporizes a bear that appeared during the narrator's upbeat song. The narrator claims to understand what just happened, but does not explain, sending the game back to the title screen.","rating":82.7963886362288,"popularity":2.333333333333333,"aggregated_rating":89.2857142857143,"aggregated_rating_count":8,"total_rating":86.04105146097154,"total_rating_count":62,"rating_count":54,"games":[56033,7344,26855,3222,20329,55173,16992,23733,36198,18869],"tags":[1,27,268435464,268435465,268435487,268435488,536871029,536871296,536871298,536871299,536871945,536872070,536872205,536872307,536872406,536872423,536872462,536872690,536872898,536872961,536873787,536874916,536875046,536875047,536875062,536875066,536875073,536875151,536875184,536875187,536875256,536875257,536875298,536875356,536875439,536875593,536875610,536875689,536875691,536875783,536875794,536875802,536875901,536875910,536875937,536876105,536876132,536876180,536876217,536876228,536876239,536876291,536876475,536876545,536876570,536876687,536876855,536878061,536878215,536878314,536878315,536879799,536880159,536881831,536882034,536882064,536882120,536882694,536883101,1073741828],"developers":[1228],"publishers":[1010,1228],"category":0,"player_perspectives":[4],"game_modes":[1,2,3],"keywords":[117,384,386,387,1033,1158,1293,1395,1494,1511,1550,1778,1986,2049,2875,4004,4134,4135,4150,4154,4161,4239,4272,4275,4344,4345,4386,4444,4527,4681,4698,4777,4779,4871,4882,4890,4989,4998,5025,5193,5220,5268,5305,5316,5327,5379,5563,5633,5658,5775,5943,7149,7303,7402,7403,8887,9247,10919,11122,11152,11208,11782,12189],"themes":[1,27],"genres":[8,9,31,32],"first_release_date":1364947200000,"platforms":[6,92,36,14,3],"release_dates":[{"category":0,"platform":92,"date":1400112000000,"region":8,"human":"2014-May-15","y":2014,"m":5},{"category":0,"platform":3,"date":1400112000000,"region":8,"human":"2014-May-15","y":2014,"m":5},{"category":0,"platform":14,"date":1434585600000,"region":8,"human":"2015-Jun-18","y":2015,"m":6},{"category":0,"platform":6,"date":1400112000000,"region":8,"human":"2014-May-15","y":2014,"m":5},{"category":0,"platform":36,"date":1364947200000,"region":8,"human":"2013-Apr-03","y":2013,"m":4}],"alternative_names":[{"name":"The Behemoth's Game 3","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d60y2bfxrfrxbxiyeyxj.jpg","cloudinary_id":"d60y2bfxrfrxbxiyeyxj","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/edtzw5ddlu78xut1bxip.jpg","cloudinary_id":"edtzw5ddlu78xut1bxip","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cin95yxe1odusrimpgc8.jpg","cloudinary_id":"cin95yxe1odusrimpgc8","width":1000,"height":562},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/javfeue3fqfzvztextxd.jpg","cloudinary_id":"javfeue3fqfzvztextxd","width":1000,"height":562},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c1glrjlu56dcek6baxut.jpg","cloudinary_id":"c1glrjlu56dcek6baxut","width":450,"height":260}],"videos":[{"name":"Trailer","video_id":"EufrdjmsKBg"},{"name":"Gameplay video","video_id":"CU9u3nE0lw8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a7odgsarqz3vkvx8d5g7.jpg","cloudinary_id":"a7odgsarqz3vkvx8d5g7","width":250,"height":342},"esrb":{"synopsis":"","rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Sexual images and\/or sexual innuendo - Mild bad language","rating":3},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/BattleBlock_Theater"},{"category":2,"url":"http:\/\/battleblocktheater.wikia.com\/wiki\/BattleBlock_Theater_Wiki"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/238460"},{"category":1,"url":"http:\/\/www.battleblocktheater.com"}],"external":{"steam":"238460"},"multiplayer_modes":[{"platform":12,"offlinecoop":true,"onlinecoop":true,"lancoop":false,"campaigncoop":true,"splitscreenonline":false,"splitscreen":false,"dropin":false,"offlinecoopmax":4,"onlinecoopmax":2,"onlinemax":0,"offlinemax":0}]}