{"id":30805,"name":"Rana Rama","slug":"rana-rama","url":"https:\/\/www.igdb.com\/games\/rana-rama","created_at":1495563746222,"updated_at":1517270992254,"summary":"Mervyn the sorcerer's apprentice is trapped in an evil dungeon after escaping from an invasion of warlocks. \nLife wouldn't be so bad if he hadn't inadvertently changed himself into a frog, whilst concocting a potion to improve his looks. Help Mervyn seek out the evil warlocks and destroy their mis-shapen guardian hordes. \nBlast their looming weapon generators and defeat the warlocks themselves in ritual magic combat... and if you have enough strength after all that - who knows, you might succeed in turning him back into a human Mervyn - el Wimpo or Rambo? Only if he gets the right potion!! \nThe aim of the game is to start on the top level of the dungeon and defeat each warlock that you encounter. Each warlock is guarded by groups of evil creatures - You earn extra points for destroying these creatures, but they do not affect the main course of the game. Some of the rooms in the dungeon contain tomb-like weapon generators which create vicious weapons such as spinning knives. Destruction of the weapons earns you nothing but you can shoot the generators for extra points. \nSome rooms also have mysterious symbols embedded in the floor. The symbols are called Floor Glyphs and are of four different types. One type is used to weave magic spells, another may be fired to destroy some or all your enemies in the room. The other two types are used to reveal a plan of the current level of the dungeon or to transport you to a new level. When you defeat a warlock you should strive to capture the magic runes which he releases because you may then use them to conjure spells to make yourself stronger in attack and less vulnerable in defence. When you have cleared the top level of the dungeon you will be strong enough to proceed downwards to tackle the more aggressive warlocks and their guardian creatures which lurk below.","popularity":1.333333333333333,"games":[25222,47823,19289,26223,25646,27314,236,37094,29525,37088],"tags":[1,17,268435461,268435465,268435487,536871138,536871208,536871939,536873787,536877579,1073741827],"developers":[8107],"publishers":[3715],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[226,296,1027,2875,6667],"themes":[1,17],"genres":[5,9,31],"first_release_date":567907200000,"platforms":[63,15,26,25],"release_dates":[{"category":2,"platform":26,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":15,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":63,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":25,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rxhwugufhr35cn9k3lie.jpg","cloudinary_id":"rxhwugufhr35cn9k3lie","width":1000,"height":1288}}