{"id":5,"name":"Baldur's Gate","slug":"baldur-s-gate","url":"https:\/\/www.igdb.com\/games\/baldur-s-gate","created_at":1297562972000,"updated_at":1548760183329,"summary":"Baldur's Gate is a fantasy role-playing video game developed by BioWare and published in 1998 by Interplay Entertainment. It is the first game in the Baldur's Gate series and takes place in the Forgotten Realms, a high fantasy campaign setting, using a modified version of the Advanced Dungeons & Dragons (AD&D) 2nd edition rules. It was the first game to use the Infinity Engine for its graphics, with Interplay using the engine for other Forgotten Realms-licensed games, including the Icewind Dale series, as well as other licensed D&D campaign worlds such as Planescape: Torment. The game's story focuses on players controlling a protagonist of their own creation who finds themselves travelling across the Sword Coast alongside a party of companions, to unravel the mystery surrounding a sudden iron crisis affecting the region and attempting to discover the culprits behind it, all while uncovering dark secrets about their origins and dealing with attempts on their life.","storyline":"Candlekeep is an ancient fortress situated on the rural Sword Coast. Recently, inexplicable events have been plaguing this quiet place, which has long become a large library where men of wisdom and knowledge can study in peace. Unknown mercenaries try to enter the walls of Candlekeep, interested in a seemingly ordinary and unimportant young person - an orphan who was taken in by the mage Gorion and treated by him as his own child. One night, Gorion decides to leave Candlekeep and take his adopted child to a safe place. However, as they leave the fortress, they are ambushed by a group of assassins. The orphan manages to escape, but Gorion dies in battle. \n \nThe gates of Candlekeep are locked, because its inhabitants are afraid to attract to themselves the wrath of the mysterious attackers. Only Imoen, another child who was brought up by Gorion and has been like a sister to the protagonist, is willing to share the uncertain future. The two have nothing, no place to call their home, only a wide hostile world in front of them. A long and perilous journey begins there. \n \nBaldur's Gate is a role-playing game that uses the rule set of Advanced Dungeons & Dragons (AD&D). Set in the universe of Forgotten Realms, the game is the first part of the saga that lets the player explore various towns, wilderness areas and dungeons, undertake many side quests, and find companions for the long journey. The player creates the hero(ine) by selecting his or her class, choosing between fighter, thief, mage, priest, ranger, and druid (including sub-classes, dual- and multi-class characters); alignment (Good-Evil and Lawful-Chaotic axis), and weapon proficiencies. The 2nd edition AD&D rules are applied in the game during combat, character leveling, class restrictions, etc. \n \nUp to six player-controlled characters can participate in combat. Battles occur in the same environment as exploration, and flow in real time, though the player is able to pause combat at any time to issue precise commands to any of the characters. Once the game is unpaused, the characters repeat the last action selected by the player until it is changed or becomes impossible to execute. Characters can freely move during battles; party formation and positioning in combat play a significant role.","collection":7,"franchise":43,"franchises":[43],"rating":89.0938654318017,"popularity":6.333333333333333,"total_rating":89.0938654318017,"total_rating_count":142,"rating_count":142,"games":[103303,99118,54775,103282,36929,111651,81249,106987,25877,19698],"tags":[17,268435468,536871307,536872926,536874921,536881062,1073741827],"developers":[2,222],"publishers":[12,5],"game_engines":[28],"category":0,"player_perspectives":[3],"game_modes":[1,3],"keywords":[395,2014,4009,10150],"themes":[17],"genres":[12],"expansions":[81],"first_release_date":914198400000,"pulse_count":8,"platforms":[6,39,3],"release_dates":[{"category":0,"platform":39,"date":1354233600000,"region":8,"human":"2012-Nov-30","y":2012,"m":11},{"category":0,"platform":6,"date":914198400000,"region":2,"human":"1998-Dec-21","y":1998,"m":12},{"category":0,"platform":3,"date":1444780800000,"region":8,"human":"2015-Oct-14","y":2015,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kovmsqezzyde0mnacncx.jpg","cloudinary_id":"kovmsqezzyde0mnacncx","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/inlndqpsep41avgxl8re.jpg","cloudinary_id":"inlndqpsep41avgxl8re","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g1luboq2uilkirzjmjix.jpg","cloudinary_id":"g1luboq2uilkirzjmjix","width":710,"height":533},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pnlcmjbgsgcroc7eckp0.jpg","cloudinary_id":"pnlcmjbgsgcroc7eckp0","width":640,"height":480}],"videos":[{"name":"Trailer","video_id":"oCBTRIsAhGE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pvcxrnssrbmzipz5h3wq.jpg","cloudinary_id":"pvcxrnssrbmzipz5h3wq","width":1536,"height":2128},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/baldurs-gate\/id515114051?mt=8&uo=4"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Baldur%27s_Gate"}]}