{"id":86905,"name":"Wildlife Simulator: Bear","slug":"wildlife-simulator-bear","url":"https:\/\/www.igdb.com\/games\/wildlife-simulator-bear","created_at":1518611627575,"updated_at":1518710598689,"summary":"Live the life of a Grizzly Bear! Survive as a young bear in a forest filled with dangerous carnivores and rushing rapids overflowing with tasty fish! Hunt animals, start a family, and battle for your life against deadly predators like wolves, hawks, and snakes!\n\nDownload the Wildlife Simulator: Bear today while it's 50% OFF for a very limited time!\n\nGame Features\n+ REALISTIC SIMULATOR - You'll need to maintain your health, hunger, thirst, and energy if you're going to survive in the wilderness!\n+ EPIC BATTLES - Use your powerful bite and sharp claws to fight ferocious animals and catch wild fish!\n+ START A FAMILY - Find a mate to bond with and raise your very own bear family to help you hunt! Watch your bear cubs grow in size and assist you in combat!\n+ LEVEL UP YOUR BEAR - Gain experience by defeating other animals and level up your bears to increase their health, attack damage, and even unlock new attacks!\n+ WILDERNESS SURVIVAL GUIDE - Look to your handy survival guide for information on enemy animals, a map of the world, bear customizations, and much more!\n+ HUGE 3D ENVIRONMENT - Your bear is free to explore a massive open world forest! Find a comfy cave to settle down in, climb hills, and sit atop rushing rapids to catch a tasty meal!\n+ HD GRAPHICS - Stunning High Definition graphics will dazzle your display with beautiful views of a gigantic lush forest! New graphics quality options let you customize the game to look amazing and perform great on any device!\n+ OPTIONAL BLOOD EFFECTS - Looking for more realistic action? If you are of age or have your parents permission, turn on the blood effects for some added combat ferocity!\n+ GLUTEN-FREE PROMISE - With all of our games you will always get the full game with no ads or additional purchases!\n\nDownload the Wildlife Simulator: Bear and live the thrilling life of a grizzly in the forest! Hunt, grow, and battle your way to the top of the food chain!\n\nIf you liked living as a Bear then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies or check out the World of Dragons: Dragon Simulator and raid castles and battle mythical bosses!\n\nFollow us on Facebook for more awesome animal simulation games!\nfacebook.com\/glutenfreegames\n\nFollow us on Twitter too! We love hearing feedback and suggestions!\ntwitter.com\/glutenfreegames","popularity":1,"games":[43130,28277,41895,74378,25311,26145,44242,22425,28465,37419],"tags":[268435469,268435487],"category":0,"genres":[13,31],"first_release_date":1413072000000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1413072000000,"region":8,"human":"2014-Oct-12","y":2014,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hwlh4dg41jscogoqsndr.jpg","cloudinary_id":"hwlh4dg41jscogoqsndr","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mxnbxzhtoxvhbtt4fhqu.jpg","cloudinary_id":"mxnbxzhtoxvhbtt4fhqu","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fqmz0k40xn959ygomuky.jpg","cloudinary_id":"fqmz0k40xn959ygomuky","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uuxmp7ypvijrev6aomyb.jpg","cloudinary_id":"uuxmp7ypvijrev6aomyb","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r8crdtiawf3oi8lrdsvk.jpg","cloudinary_id":"r8crdtiawf3oi8lrdsvk","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zvsorrdhopgydqpc1yqn.jpg","cloudinary_id":"zvsorrdhopgydqpc1yqn","width":512,"height":512}}