{"id":89305,"name":"The Survivor: Rusty Forest","slug":"the-survivor-rusty-forest","url":"https:\/\/www.igdb.com\/games\/the-survivor-rusty-forest","created_at":1519585552866,"updated_at":1523240635690,"summary":"Welcome to the world of \"The Survivor\", hit by unknown virus which has wiped out most of the world's population. You are one of the few that have survived and now you must to fight for your life against what is left of the indigenous population now infected with the disease. In best traditions of survival and horror games, players in \"The Survivor\" must explore the open world to gather raw materials to build their own weapons, tools, fortifications, shelters, etc. against the dangers of the zombies, infected wildlife and the world itself.\n\nThe only aim in \"The Survivor\" is to survive. To do this you will need to overcome struggles such as hunger, thirst, cold and radiation.\n► Craft weapons and tools. Chop down trees in the forest to build a camp, or start a fire to keep warm.\n► Don't starve! Kill animals for meat. Scavenge food to keep yourself from starving.\n► Build a small shelter or a large fortress. Lay traps and defences to keep a safe perimeter.\n► Explore and build during the day. Defend your base at night.\n\nKey features:\n► Random world generation - 1 sq. km chunk of post soviet state randomized with abandoned villages, military bases, deep forests, roads, rivers, lakes, wilderness locations, and more...\n► Day and night - Realistic dynamic day and night cycle with sun and moon phases.\n► Create and destroy - The world structures and items can be destroyed or scrapped for resources. Re-purpose collected materials to build custom structures and fortification by hand, placing building pieces into the world in real time.\n► Inventory - Carry all of the items that you will need to survive in the intuitive inventory system developed to answer the needs of crafting and character customization.\n► Item crafting and degradation - In the apocalyptic world of \"The Survivor\", resources are sparse and every useful bit should be utilized. With a continually growing list of recipes, gather resources such as wood, stone and rust metal to create weapons and tools. As your tools wear out over time, use your crafting skills to repair them. Items or equipment can be improved, turned into something else or fixed using the new crafting mechanisms.\n► Animals - Head out into the wilderness to hunt animals once the abandoned buildings are already plundered.\n► Stealth system - Sneak past zombies and animals who can see, hear and smell you.\n► Environmental temperature - Build\/find shelter or campfire. Cold nights or long days will make a difference.\nIn coming updates these features will be expanded upon with even more depth and a wider variety of choices to survive the increasing dangers of the world.\n\nFeatures in various stages of development, which will be added as the project progresses:\n– More buildings\n– More crafting\n– Expanded AI\n– Drivable vehicles\n– More animals & plants\n– Weather effects\nAll features and plans listed here are subject to change, we may add or remove features as seen fit during development process.\n\nOfficial page on Facebook: https:\/\/www.facebook.com\/tsrfo","rating":70,"popularity":1,"total_rating":70,"total_rating_count":0,"rating_count":0,"games":[23175,37022,55289,42080,59516,44191,12579,25646,25311,1221],"tags":[1,268435487],"category":0,"themes":[1],"genres":[31],"first_release_date":1413936000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1413936000000,"region":8,"human":"2014-Oct-22","y":2014,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wv3uj6yoownritzzfmbr.jpg","cloudinary_id":"wv3uj6yoownritzzfmbr","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y4eewclggq65ngiooqz7.jpg","cloudinary_id":"y4eewclggq65ngiooqz7","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aswgo2e1ny4jltnx4hay.jpg","cloudinary_id":"aswgo2e1ny4jltnx4hay","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dnjgjemrpaitnxf1dgjn.jpg","cloudinary_id":"dnjgjemrpaitnxf1dgjn","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p9iiiixwt2cpylj0rmfm.jpg","cloudinary_id":"p9iiiixwt2cpylj0rmfm","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s7yy7tgkkfnb6os01bfk.jpg","cloudinary_id":"s7yy7tgkkfnb6os01bfk","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/me4opbr26uwzfxbmqc7d.jpg","cloudinary_id":"me4opbr26uwzfxbmqc7d","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uaekofs6ybd0om9irfvw.jpg","cloudinary_id":"uaekofs6ybd0om9irfvw","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/joo2i9ghlvnuz5optfab.jpg","cloudinary_id":"joo2i9ghlvnuz5optfab","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/feefcg6yblnmzrurwsfe.jpg","cloudinary_id":"feefcg6yblnmzrurwsfe","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/z6rvkiw7plhxesehjof8.jpg","cloudinary_id":"z6rvkiw7plhxesehjof8","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/the-survivor-rusty-forest\/id919395844?mt=8&uo=4"}]}