{"id":11032,"name":"Two Worlds II: Pirates of the Flying Fortress","slug":"two-worlds-ii-pirates-of-the-flying-fortress","url":"https:\/\/www.igdb.com\/games\/two-worlds-ii-pirates-of-the-flying-fortress","created_at":1433802514668,"updated_at":1547991244251,"summary":"Plots within plots and schemes within schemes devolve the crew of the Wandering Wrath into mistrust and outright mutiny, and all the while the lives of the islands' innocents hang perilously in the balance. The ship's notorious captain is a man so cruel and vile, he is said to have been born without a soul. Yet it is often true in the murky underbelly of the harsh seas, that things aren't always what they seem. Captain Ed Teal recruits the hero of the story for a personal errand, one such errand that's allegedly unconnected with treasure, but rather to reconnect him with his lost love; a secluded and hermitical maiden by the name of Maren who is said to inhabit the islands. Uninvited eyes are always watching where there is fame and fortune to be had. The Wandering Wrath's second and third in command, Cutter and Nicky Nails, have agenda's of their own. Trust is the rarest of all currencies, and none will be found by those unwilling to shed a little of his own… or a few buckets of blood. \n \nPirates of the Flying Fortress introduces more than a sufficient amount of new gameplay elements. In addition to an archipelago filled with new vegetation in which players can traverse whether by foot, on horseback, sailing their own boat or even by swimming, there is also all-new races and bosses who lurk in the depths of the unexplored islands. Brilliantly flavored with stunning new cut-scenes, the 12+ hours of main quests await the player, permeated with twists and surprises at every decision. Dozens of new weapons including the crossbow, permanent potions and new armor accessories to increase the hero’s stats, effective horse armor, as well as fresh fighting techniques will provide the perfect means to get an all-new experience in the world of Antaloor. Thrilling in-game video sequences, created with new animation techniques and new weather effects like rain and storms; even seasoned \"Two Worlds\" veterans will get their money's worth! In \"Pirates of the Flying Fortress\" the archipelago world is debuted in a more realistic and compelling presentation than ever before, thanks to attacking plants, the realistic fauna and new atmospheric particle effects . The same applies to the story, which is pushed forward with cinematic animations, elaborately staged cut-scenes and amazingly scripted dialogs. And finally, the four additional multiplayer adventure maps grant players with cooperative long-term entertainment.","collection":1245,"popularity":1.333333333333333,"aggregated_rating":82,"aggregated_rating_count":2,"total_rating":82,"total_rating_count":2,"game":7223,"games":[103282,54775,55038,36929,103303,106987,81249,26879,28010,101608],"tags":[1,17,268435468,536870916,536871938,1073741826],"developers":[7409],"publishers":[1189],"category":1,"player_perspectives":[2],"game_modes":[1,2],"keywords":[4,1026],"themes":[1,17],"genres":[12],"first_release_date":1316476800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1316476800000,"region":8,"human":"2011-Sep-20","y":2011,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qmp4kewwlp1euxoxrqiq.jpg","cloudinary_id":"qmp4kewwlp1euxoxrqiq","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kzyhix8jtwmh8cr0exq8.jpg","cloudinary_id":"kzyhix8jtwmh8cr0exq8","width":620,"height":388},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xtgh8jyqle3pxfajpr2t.jpg","cloudinary_id":"xtgh8jyqle3pxfajpr2t","width":500,"height":281},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/elpcsddodwgewcqvvtnc.jpg","cloudinary_id":"elpcsddodwgewcqvvtnc","width":650,"height":367}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dsu29qigag29uaaqjen7.jpg","cloudinary_id":"dsu29qigag29uaaqjen7","width":878,"height":958},"esrb":{"rating":5},"pegi":{"rating":4},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/200440\/Two_Worlds_II__Pirates_of_the_Flying_Fortress"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Two_Worlds_II"},{"category":2,"url":"https:\/\/twoworlds.wikia.com\/wiki\/Two_Worlds_II:_Pirates_of_the_Flying_Fortress"},{"category":1,"url":"http:\/\/potff.twoworlds2.com\/en\/index.html"}]}