{"id":112432,"name":"Screencheat: Unplugged","slug":"screencheat-unplugged","url":"https:\/\/www.igdb.com\/games\/screencheat-unplugged","created_at":1542778319915,"updated_at":1542785698309,"summary":"Screencheat: Unplugged is the enhanced remaster of the indie splitscreen multiplayer classic where everyone is invisible, so you have to \"screencheat\"! Screencheat: Unplugged features a myriad of improvements over the original release, as well as alterations tailored just for the Nintendo Switch™, including: a graphical overhaul with more vibrant and clear visuals designed with the portable screen in mind, new and remixed maps, remastered weapons, an updated UI, full support for single Joy-Con™, dual Joy-Con™, and Nintendo Switch Pro Controller inputs, and an entirely new soundtrack introducing a fresh and mischievous medley of energetic tracks to enjoy. Remember when looking at your friends’ screen in Goldeneye was frowned upon? Well those days are gone and in Screencheat, we encourage it! Screencheat is a chaotic split-screen multiplayer shooter that forces players to rethink the way they approach conventional multiplayer games. In the Screencheat arena, fast reaction times aren’t enough to keep you alive. When everyone is invisible, players will have to master the art of taking a not-so sneaky look at their opponent’s screens and working out where they are based on uniquely coloured areas of the map and distinctive landmarks. Screencheat pays homage to iconic competitive first-person shooters such as Goldeneye, Perfect Dark and Halo, by blending the elements everyone loves about those games and shaking it up with its own unique take on the genre. When everyone’s used to playing by the rules, can you adapt to unconventional gaming quick enough to get the upper hand?","popularity":1,"version_parent":8816,"version_title":"Unplugged","games":[103298,103281,95340,32902,103020,28029,103301,306,24491,19341],"tags":[1,40,268435461,1073741825],"developers":[5217],"publishers":[5217],"category":0,"player_perspectives":[1],"game_modes":[4],"themes":[1,40],"genres":[5],"first_release_date":1543449600000,"platforms":[130],"release_dates":[{"category":0,"platform":130,"date":1543449600000,"region":8,"human":"2018-Nov-29","y":2018,"m":11}],"videos":[{"name":"Trailer","video_id":"bDc-AcBeLAE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1hp3.jpg","cloudinary_id":"co1hp3","width":1000,"height":1000},"esrb":{"rating":4},"websites":[{"category":1,"url":"https:\/\/samuraipunk.com\/screencheat-unplugged"}]}