{"id":17332,"name":"Subject 9","slug":"subject-9","url":"https:\/\/www.igdb.com\/games\/subject-9","created_at":1454928306062,"updated_at":1517270694988,"summary":"Subject 9 is a unique game that challenges players to fight to survive, using the environment to help aid the cause, and elemental powers to lay waste to anyone who stands in the way. Set in the future, the game is about a human weapon, Subject 9; is granted super human powers by a corrupted company that's attempting to contain him as he escapes for freedom. \n\nThis isn't your traditional shooter because it mixes unique offensive and defense mechanics integrated into the game resulting in a smooth, fast paced adrenaline pumping action and fluid gameplay. The game is closely considered as an isometric tactical shooter packed with fun mechanics and fast action.","storyline":"Year 2092. VexTech Corp. contributes to a large sum of the world's advances in neuro, bio, and mechanical augmentations. Administrated by corruption, the companies advances took over a majority of the world's technological affairs, abusing resources to try and thrive and maintain a better life after the war that left a large portion of the northern hemisphere to ruins. The lack of earth's resources led to a revolution against largely owned controlling companies of the world; VexTech was a primal target. \n\nThe company acted fast upon the revolting citizens of the north and began a mass production of brainwashed soldiers to fight for them. However, administrators believed it was a primitive way to deal with the matters at hand, having thousands of soldiers could easily be replaced by a few dozen and so a new experimentation had begun. The company's advances in human augmentations had led to something sinister. \n\nA dozen men, memories wiped clean and biologically weaponized, were granted fabricated abilities from the company. The ability to control the world's elements and defy the laws of nature was just the beginning of something terrible. VexTech was not playing with fire, they opened Pandora's Box; they had developed world class killing machines; The Subjects... \n\nSubject #09 was soon to become one of VexTech's largest rebound as he began to gather fragments of his memory; he began to think for himself. He was about to change the future of the world...","popularity":1.333333333333333,"games":[68287,64204,27314,25300,36950,28029,10039,25311,142,76229],"tags":[1,18,268435461,268435488,536871122,536871882,536871917,536871937,1073741826],"developers":[8639],"publishers":[8639],"game_engines":[13],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[210,970,1005,1025],"themes":[1,18],"genres":[5,32],"first_release_date":1376611200000,"platforms":[6,14],"release_dates":[{"category":0,"platform":14,"date":1376611200000,"region":2,"human":"2013-Aug-16","y":2013,"m":8},{"category":0,"platform":6,"date":1376611200000,"region":2,"human":"2013-Aug-16","y":2013,"m":8},{"category":0,"platform":6,"date":1376611200000,"region":8,"human":"2013-Aug-16","y":2013,"m":8},{"category":0,"platform":14,"date":1376611200000,"region":8,"human":"2013-Aug-16","y":2013,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zl61eg4ruofx8wutty8w.jpg","cloudinary_id":"zl61eg4ruofx8wutty8w","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zga96csyevkcj8yzhqcb.jpg","cloudinary_id":"zga96csyevkcj8yzhqcb","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ezebqppng8ab72pttbta.jpg","cloudinary_id":"ezebqppng8ab72pttbta","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zwyako5dzpopefhweyxk.jpg","cloudinary_id":"zwyako5dzpopefhweyxk","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n9tsvghblijowwuz61qw.jpg","cloudinary_id":"n9tsvghblijowwuz61qw","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"A5SZJklVDq4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kesjbvo9mggrdpyxubg6.jpg","cloudinary_id":"kesjbvo9mggrdpyxubg6","width":960,"height":1320}}