{"id":18632,"name":"CarnEvil","slug":"carnevil","url":"https:\/\/www.igdb.com\/games\/carnevil","created_at":1459795584375,"updated_at":1546110981972,"summary":"CarnEvil is a rail shooter arcade game using a light gun. It was released by Midway Games on October 31, 1998. CarnEvil is noted for its graphic content and strong lifelike violence, peppered with heavy amounts of black humor. CarnEvil is a portmanteau of \"The Carnival of Evil\" and was inspired by the 1962 movie Carnival of Souls. It is the most successful light gun style game produced by Midway Games, although to date it has never received a home-console release or re-release","storyline":"The game is set in the fictional town of Greely Valley, Iowa. An urban legend claims that if a golden token is inserted into the jester's mouth on top of the tombstone of Ludwig von Tökkentäkker, a ringmaster buried in the cemetery, a haunted amusement park will rise from the earth.\nThe game begins with group of kids taking a spooky hayride tour through the Greely Valley cemetery, courtesy of the local \"ghost expert\" Spooky Sam. The unnamed protagonist leaves the tour and approaches Tökkentäkker's tombstone to find a golden coin sitting in its slot. The protagonist inserts the coin into the jester's mouth, resulting in the legendary undead carnival rising from the ground. Trapped inside, he takes a shotgun from the shooting gallery and uses it to fight off hordes of undead monsters and other creatures in order to escape. After fighting through the Haunted House, Rickety Town, and the Freak Show, he enters the Big Top to face Tökkentäkker directly aboard his airship.\nSoon after killing Tökkentäkker, his airship is destroyed and the protagonist falls from it. In the morning, he and the only other survivor, Betty, wake up in front of the tombstone, where the coin falls back into its slot. The protagonist then takes the token and inserts it again into the mouth of the jester, much to Betty's horror.","popularity":1.333333333333333,"games":[19686,7291,26658,13189,36646,68287,78770,25646,18011,29525],"tags":[19,268435461,268435489,536870918,536871937,536871942,536872032,536872390,536872696,536875358,536875418,536875526,536875556,536876221,536878400,1073741825],"developers":[327],"publishers":[327],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[6,1025,1030,1120,1478,1784,4446,4506,4614,4644,5309,7488],"themes":[19],"genres":[5,33],"first_release_date":909792000000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":909792000000,"human":"1998-Oct-31","y":1998,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t8yckakfttpf6f1s7jyd.jpg","cloudinary_id":"t8yckakfttpf6f1s7jyd","width":798,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g91qnmf2htwah8ekia7d.jpg","cloudinary_id":"g91qnmf2htwah8ekia7d","width":1620,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tmfectabh4kot7mnf6es.jpg","cloudinary_id":"tmfectabh4kot7mnf6es","width":256,"height":332}}