{"id":1932,"name":"Goblins 3","slug":"goblins-3","url":"https:\/\/www.igdb.com\/games\/goblins-3","created_at":1361094115237,"updated_at":1517270598988,"summary":"It is said that there is a mysterious labyrinth harboring great secrets that might fulfill the wishes of those who discover them. Two countries respectively ruled by Queen Xina and King Bodd have been competing over the right to explore the labyrinth. However, strange events started happening one after the other: the guardian of the labyrinth died, his daughter disappeared, and King Bodd apparently fell under some sort of a curse. A goblin reporter named Blount get caught in the midst of these events as he attempts to interview the queen and the king. As if that weren't enough, Blount also gets bitten by a werewolf and falls in love, and must find a way to deal with both predicaments. \n \nGoblins Quest is the third entry in the Gobliiins series. Like its predecessors, it is a puzzle adventure game with the emphasis on solving complex tasks confined to smaller areas rather than on exploration. Most levels occupy more than one screen and allow limited navigation between different areas. As the reduction of the title to a single \"i\" implies, this installment only features one controllable goblin. However, at various points of the game Blount will require assistance from other player-controlled characters such as Chump the parrot, Ooya the magician, and Fulbert the snake. In addition, Blount's own spontaneous transformation into a werewolf may affect the solution of some puzzles. The hero will also undergo a few other mutations and drastically change his size during the course of the game.","collection":359,"popularity":1.333333333333333,"games":[25222,19289,26223,60,236,47823,37088,7621,27266,26848],"tags":[17,22,27,268435465,268435487,536871063,536871208,536871262,536871939,536873787,1073741828],"developers":[938],"publishers":[938,24],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[151,296,350,1027,2875],"themes":[17,22,27],"genres":[9,31],"first_release_date":757296000000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":757296000000,"human":"1993","y":1993,"m":12},{"category":2,"platform":13,"date":757296000000,"human":"1993","y":1993,"m":12}],"alternative_names":[{"name":"Goblins Quest 3","comment":"U.S. Title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fuvk18udjbh5tilzsblq.jpg","cloudinary_id":"fuvk18udjbh5tilzsblq","width":320,"height":200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fb7edtefqi2z5ujgyclv.jpg","cloudinary_id":"fb7edtefqi2z5ujgyclv","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yuym70gbiamm17saprvk.jpg","cloudinary_id":"yuym70gbiamm17saprvk","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y8wiec4xycca3gvklvff.jpg","cloudinary_id":"y8wiec4xycca3gvklvff","width":640,"height":786}}