{"id":41532,"name":"Alpine Skiing","slug":"alpine-skiing","url":"https:\/\/www.igdb.com\/games\/alpine-skiing","created_at":1498819570731,"updated_at":1500272519682,"summary":"Dress warm. \n \nPress 1 on the alpha-numeric keyboard. \n \nThree different skiing competitions will be displayed alternately at the bottom of the screen. \n \nTo select an event, pull the joy stick of either hand control towards you when the name of the event is on the screen. \n \nA computerized official will signal the start. \n \nPull the joy stick toward you to head straight down the slopes. When you've had some practice, press the action button to get 30% greater downhill speed. \n \nPush the joy stick left to traverse left. Push the joy stick right to traverse right. Your traversing speed is one-half of your normal downhill speed. \n \nPush the joy stick away from you to come to a swirling christie stop. \n \nThere are 55 gates in each event - the minimum allowed in the Olympic Slalom and Giant Slalom competitions. The computer can generate more than 65,000 different courses for each of the three events. You can ski over 195,000 different runs! \n \nBoth players will ski matching courses for each event - even if one player should get a late start. \n \nIf a skier hits a gate, time is lost getting back off the snow. \n \nIf a skier goes off-course in any event, timing will be stopped and a count will be kept of the number of violations. \n \nTHE DOWNHILL \nThe winner is the skier making the run over the marked course in the shortest amount of time. If both skiers go off-course, the winner is the skier with the fewest violations. \n \nTHE SLALOM \nYou follow a twisting course defined by pairs of gates. A skier must go between every pair of gates of the same color but may do so from either side. (The colored gates will show up in different shades of gray on black and white TV.) The winner is the skier achieving the fastest aggregate time over two runs down different courses. The courses will change automatically after each run. \n \nTHE GIANT SLALOM \nThis event is longer that the Slalom and the gates are farther apart. Follow the Slalom rules for Giant Slalom competition. \n \nCombined Competitions A Combined competition represents the final result of several events. They can be similar. (Two Downhills - two Slaloms - etc.) They can be different. (A Downhill and a Slalom, etc.) A Combined Competition can also be any three races in any sequence. \n \nThe \"Triple Combined\" is the result of a Downhill, A Slalom and a Giant Slalom in any sequence. \n \nThe \"Alpine Combined\" is the result of one Downhill and one Slalom. The Downhill is run before the Slalom. \n \nTIMEKEEPING \nThe computer will clock each skier's time within 1\/10th of a second. To hold your score on the screen when you cross the finish line, push the joy stick forward to stop your skier before the word \"FINISH\" travels to the top of the screen. If both hand controls are in use, the winning time will be displayed at the center of the bottom of the screen in the winning skier's colors. This is the time to beat. It will remain there until it is replaced with a better time for the same event. If a skier goes off-course or misses a gate, the skier's current running time will be replaced by a count of the number of course violations. \n \nTo ski the same event again, pull the joy stick toward you after both skiers cross the finish line. \n \nTo change to a different event, press RESET AND THEN press 1.","popularity":1.333333333333333,"games":[46820,39665,101684,101567,101100,100907,100887,100879,100863,100832],"tags":[268435470],"category":0,"genres":[14],"first_release_date":286675200000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":286675200000,"region":8,"human":"1979-Feb-01","y":1979,"m":2}]}