{"id":9432,"name":"Age of Pirates 2: City of Abandoned Ships","slug":"age-of-pirates-2-city-of-abandoned-ships","url":"https:\/\/www.igdb.com\/games\/age-of-pirates-2-city-of-abandoned-ships","created_at":1428174072057,"updated_at":1529740551580,"summary":"Fortune and glory awaits you! In “Age of Pirates 2 – City of Abandoned Ships” you can choose to go it alone and become the most feared pirate of the seven seas. Or you can prove your loyalty to one of the four different navies: French, English, Spanish or Dutch. Sail the high seas as a swashbuckling pirate or dashing naval captain. Explore strange new countries and undiscovered civilizations, raid and plunder ships, fortified ports and cities. But beware, the dead do not sleep easy, and in the dark South American jungles myth and reality intertwine. \r\n\r\nSolve the ancient mysteries of a vanishing tribe, cross swords with the most notorious pirates ever to sail the ocean blue and make sure that none of your foes ever set foot on land again.","collection":2580,"popularity":3,"games":[22747,29348,34155,28309,27092,35994,54775,80916,22387,36198],"tags":[1,22,268435468,268435469,536870914,536870916,536871086,536871169,536871208,536871390,536871911,536871938,536872371,536876569,1073741825,1073741826],"developers":[1363],"publishers":[384],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[2,4,174,257,296,478,999,1026,1459,5657],"themes":[1,22],"genres":[12,13],"first_release_date":1243296000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1243296000000,"region":2,"human":"2009-May-26","y":2009,"m":5},{"category":0,"platform":6,"date":1244160000000,"region":1,"human":"2009-Jun-05","y":2009,"m":6}],"alternative_names":[{"name":"Корсары: Город потерянных кораблей","comment":"Russian title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cbbcs0vh9svwhgo1d8y8.jpg","cloudinary_id":"cbbcs0vh9svwhgo1d8y8","width":354,"height":500},"esrb":{"synopsis":"This is an action role-playing game in which players complete quests in a historical Caribbean setting. Players can take on the role of either pirates or naval officers who visit islands and travel across the game map. Presented from a third-person perspective, the game allows players to battle at sea or use pistols and swords to attack local militia forces and bandits. Players have the ability to attack allied ships at sea or even merchants and townspeople on land. Blood splashes from characters that get slashed\/shot and often stains the ground in large patches or pools. During the course of the game, players can visit a female prostitute in a bordello and have sex with her in an upstairs room. Though sexual acts are never depicted, the woman's passionate moaning can be heard as a censored sign is displayed on a black screen. Some profanity (e.g., 'sh*t' and 'a*s') can be heard in the dialogue.","rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\r\nIt contains: Realistic looking violence.","rating":4},"websites":[{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/Age_of_Pirates_2:_City_of_Abandoned_Ships"}]}