{"id":12312,"name":"Megamania","slug":"megamania","url":"https:\/\/www.igdb.com\/games\/megamania","created_at":1441444411944,"updated_at":1517271080926,"summary":"In Megamania, the gameplay resembles that of Space Invaders. Rather than being aliens or spaceships, however, the enemies in this game are various objects such as hamburgers, bow ties, and steam irons. The object is to shoot them down before the energy bar at the bottom of screen is depleted, all while avoiding the oncoming enemies and their own projectiles attacks. Each of the enemies fly in select patterns and as soon as they hit the bottom of the screen, they re-appear at the top until shot by the player. The player's spacecraft depicted in the game is a cross between the U.S.S. Enterprise and Klingon battlecruiser from the Star Trek universe. \nGameplay-wise and in terms of graphics, MegaMania bears a very strong resemblance to Sega's 1981 arcade title \"Astro Blaster\". Both games feature nearly identical patterns of approaching enemies with the player relying on an \"Energy\" meter. Also, the player's ship bears a remarkable similarity in both games. \n \nWhen Megamania was originally sold, anyone who scored above 45,000 points could send Activision a picture of their screen and become an official Megamaniac. They also would receive an Official Megamaniac emblem.[2] \nIf a player exceeds a score of 999,999 the game ends.","rating":55.0746749325712,"popularity":1.333333333333333,"total_rating":55.0746749325712,"total_rating_count":3,"rating_count":3,"games":[68287,36950,28029,27314,64204,25300,71455,11253,142,19448],"tags":[1,18,268435461,536871078,536871882,536872843,536875094,536875691,536875870,536876108,536876354,536876718,536877738,1073741826],"developers":[66],"publishers":[66],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[166,970,1931,4182,4779,4958,5196,5442,5806,6826],"themes":[1,18],"genres":[5],"first_release_date":410140800000,"platforms":[66,59],"release_dates":[{"category":2,"platform":66,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12},{"category":2,"platform":59,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vpamt2aqtk9p3fuiqmhl.jpg","cloudinary_id":"vpamt2aqtk9p3fuiqmhl","width":1000,"height":1357}}