{"id":12712,"name":"P.P. Hammer and His Pneumatic Weapon","slug":"pp-hammer-and-his-pneumatic-weapon","url":"https:\/\/www.igdb.com\/games\/pp-hammer-and-his-pneumatic-weapon","created_at":1442595409400,"updated_at":1517270863204,"summary":"P. P. Hammer and his Pneumatic Weapon is a platform game with puzzle elements. It draws obvious influence from the earlier game Lode Runner. In the game, you control a character called P. P. Hammer, who is on a quest to discover and acquire all treasures from a series of more than 60 levels. These levels are divided into four graphical themes: Ancient Rome, Ancient Egypt, Medieval castles, and ice. A fifth theme, LegoLand, appears on bonus levels. Each level in the game is made up of rectangular blocks, and contains various things including treasures, enemies, locked doors, bonus items and traps. P. P. Hammer carries a jackhammer, which allows him to drill through a block he's standing next to. As in Lode Runner, drilling through more than one layer of blocks requires creating a triangle-shaped cavity more than one block wide, and blocks reappear after a short while. A block reappearing on top of P. P. Hammer kills him. P. P. Hammer can collect treasures and various power-up potions lying around the level. When he has collected all the treasures, the exit door opens, and going through the exit door completes the level. The player doesn't have to play from the beginning of the game every time; after completing each level a level password is displayed, allowing the player to continue from that point at a later time.","popularity":1.333333333333333,"games":[55752,6732,10039,37094,25222,25646,19174,19289,9174,12572],"tags":[1,268435464,268435465,536871506,536872211,536872961,536873327,536873787,536875056,536875229,536875699,536875880,536876120,536876384,536878439,536882166,536882459,1073741828],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[594,1299,2049,2415,2875,4144,4317,4787,4968,5208,5472,7527,11254,11547],"themes":[1],"genres":[8,9],"first_release_date":694137600000,"platforms":[16],"release_dates":[{"category":2,"platform":16,"date":694137600000,"human":"1991","y":1991,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vf2ngzl6j3qrooflxjsy.jpg","cloudinary_id":"vf2ngzl6j3qrooflxjsy","width":640,"height":763}}