{"id":26412,"name":"N.O.M.A.D.","slug":"nomad","url":"https:\/\/www.igdb.com\/games\/nomad","created_at":1481535647084,"updated_at":1517271106248,"summary":"Out in the vastness of space lies the heart of an Intergalactic Criminal Network, TALOS, a man-made asteroid slowly spinning through the void, spreading its evil through the Universe. At the head of this seemingly unstoppable force sits one man, the unspeakably vile Cyrus T. Gross. \n \nA name spoken only in whispered voices, gross is the embodiment of all that is criminal. Avoiding any attempt to curtail his ever spreading empire, he has crushed all opposition and seems invincible, ruling his depraved Zealots with a fist of iron and a heart of ice. \n \nThough no law-enforcement agency has ever managed to convict him, he is surely responsible for many of the nefarious dealings that occur within the civilised Universe. Truly a man without scruples, guilty of arson, murder, gun-running and photo-nucleonic destruction of all people weaker than himself. \n \nIn a last ditch attempt, the rulers of the Free Worlds have called in the Nemesis Organisation, a hardened cadre of humanoid and robotic freebooters who have assigned N.O.M.A.D 471 (Nemesis Organisation Mobile Attack Droid) to penetrate Gross's heavily armed homeworld and destroy this vile despot once and for all.","popularity":1.333333333333333,"games":[68287,28029,36950,64204,142,71455,27314,29525,27523,25300],"tags":[1,18,268435461,268435465,536871882,536871937,1073741827],"developers":[1271],"publishers":[1271],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[970,1025],"themes":[1,18],"genres":[5,9],"first_release_date":536371200000,"platforms":[15,26,25],"release_dates":[{"category":2,"platform":25,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":26,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fpk7fs79gdrtnh6w5ysb.jpg","cloudinary_id":"fpk7fs79gdrtnh6w5ysb","width":1000,"height":1418}}