{"id":39612,"name":"Blood Bros.","slug":"blood-bros","url":"https:\/\/www.igdb.com\/games\/blood-bros","created_at":1498133176620,"updated_at":1516657443769,"summary":"Blood Bros. is a 1990 arcade game developed and published by TAD Corporation in Japan and Europe, while it was later published in North America by Fabtek. It is a spiritual sequel to Cabal, with almost identical mechanics. A bootleg of this game is known as West Story. \n \nIn 'Blood Bros., two blood brothers, a cowboy and an Indian, team-up to hunt down \"the most wanted outlaw in Dodge City,\" Big Bad John. The gameplay mechanics are extremely similar to TAD Corp.'s earlier machine, Cabal, however this game did not seem to appear as a trackball-controlled variant. \n \nThe player's characters are seen from behind. Some screens feature protective walls (which can get damaged and shattered by enemy fire). The players have limitless ammunition for their primary gun, but a limited number of sticks of dynamite, with which they must fend off enemy troops. An enemy gauge at the bottom of the screen depletes as foes are destroyed and certain structural features of the screen (usually the ones that collapse when destroyed, rather than simply shattering) are brought down. At the successful completion of a level by fully depleting the enemy gauge, all the remaining buildings onscreen collapse and the player progresses to the next stage, reprising the amusing \"victory dance walk\" into the horizon from Cabal. Boss fights, however, start from the beginning if a player dies. \n \nPower-ups appear from time to time, being released from objects destroyed onscreen or special characters who may run across, such as the small Indian Chief figure or warthogs. Points and weaponry can also be dispensed from the tin can, if you shoot it into the air and juggle it with subsequent shots. Some power-ups give special weapons with increased firepower, others grant extra dynamite or additional points. Two players could play this game, cooperatively, simultaneously.","popularity":1.333333333333333,"games":[68287,28029,10039,76246,19341,25076,68142,27523,32902,28751],"tags":[1,268435461,536870921,536871078,536871937,536872040,536875437],"category":0,"keywords":[9,166,1025,1128,4525],"themes":[1],"genres":[5],"first_release_date":652147200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":662601600000,"region":2,"human":"1990-Dec-31","y":1990,"m":12},{"category":0,"platform":52,"date":652147200000,"region":8,"human":"1990-Sep-01","y":1990,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ukkzuyntrjuygbirmuj0.jpg","cloudinary_id":"ukkzuyntrjuygbirmuj0","width":222,"height":167}}