{"id":46812,"name":"Marchen Maze","slug":"marchen-maze","url":"https:\/\/www.igdb.com\/games\/marchen-maze","created_at":1499700887781,"updated_at":1515782984923,"summary":"In Märchen Maze (\"Märchen\" is German for \"fairytale\"), the player takes control of a little girl named Alice who has been pulled in to a magical world by a white rabbit. It was originally released to the Arcade before being ported to the PC Engine and Sharp X68000. It would also be added to the Japanese Wii's Virtual Console in 2009. \n \nThe Arcade and Sharp X68000 versions use an isometric view while the PC Engine uses a standard overhead view. The game's platforms are all suspended over a bottomless void. Alice can shoot bubbles, technically termed \"shabon balls\", at the enemy in an effort to knock them off of the floating terrain or destroy them. Holding down the attack button will charge the bubble and make it larger, resulting in greater knockback strength or simply more damage, depending on the enemy. \n \nThe enemies are also trying to knock Alice off, too. In fact, Alice does not take damage in a conventional sense: the only way to lose a life is to fall in to the void. Alice comes equipped with several balloons which can rescue her from a fall should one occur. Alice is capable of jumping to avoid obstacles or shots from enemies, or to jump over gaps in the terrain. At the end of each stage is a boss; Alice has a 180 second time limit to get to the end and defeat the boss or else \"time over\" monsters will appear and attack her. The PC Engine version of the game lacks a time limit.","popularity":1.333333333333333,"games":[55752,21063,10039,68287,12632,26761,68279,36868,27209,37137],"tags":[268435461,268435464,536870990,536871208,536871487,536871814,536871937,536872961,536873024,536875155,536875182,536875241,536875262,536875313,536875489,536876049,536876089,536877105,536879685],"category":0,"keywords":[78,296,575,902,1025,2049,2112,4243,4270,4329,4350,4401,4577,5137,5177,6193,8773],"genres":[5,8],"first_release_date":582249600000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":582249600000,"region":8,"human":"1988-Jun-14","y":1988,"m":6}],"alternative_names":[{"name":"Märchen Maze","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rgfpbnorfrvenwrfmgli.jpg","cloudinary_id":"rgfpbnorfrvenwrfmgli","width":1000,"height":1022}}