{"id":51319,"name":"Elf Bowling","slug":"elf-bowling","url":"https:\/\/www.igdb.com\/games\/elf-bowling","created_at":1500064647338,"updated_at":1513023777414,"summary":"Elf Bowling is a computer game developed by NStorm and released in 1998. In the game the player, as Santa Claus, attempts to knock down elves who are arranged like bowling pins.[1] A later release of the game on Nintendo handheld consoles Nintendo DS and Game Boy Advance was universally panned by critics \n \n \nIn Elf Bowling, Santa Claus gets revenge on his striking elves by using them as bowling pins. \n \nDuring the game, the elves say phrases such as \"Is that all the balls you got, Santa?\" when the player misses their first spare opportunity or \"Gutter ball!\" in a silly-sounding voice when a ball is rolled into the gutter. Other potential distractions for the user are a deer that walks up along the bowling lane that can be \"hit\" with the bowling ball if the arrow is positioned to the far left, and a frog wearing a Santa hat hopping back and forth across the player's field of vision (resembling Kalvin Kroaker from Frogapult, also made by Nstorm). If one hits the frog with the bowling ball, his body is hauled away from the screen by a bird from Frogapult. A white rabbit also jumps and defecates across the bowling lane. The elves moon Santa (asking \"who's your daddy\" as they do it). Both during the game and after a game finishes, the elves do a dance, shouting \"Elf elf, baby!\" in reference to Vanilla Ice's song \"Ice Ice Baby\". The elves can also randomly move out of the way of the ball, and one elf can be decapitated by the pin sette","collection":3121,"popularity":1.333333333333333,"games":[22690,11253,56962,15851,71864,41661,32945,23782,34919,17001],"tags":[1,268435470,536871211,536871744,536872078,536875074,536875151,536875355,536875579,536875826],"category":0,"keywords":[299,832,1166,4162,4239,4443,4667,4914],"themes":[1],"genres":[14],"first_release_date":917827200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":917827200000,"region":8,"human":"1999-Feb-01","y":1999,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ij1nz6oh0vmnu2cjtfa9.jpg","cloudinary_id":"ij1nz6oh0vmnu2cjtfa9","width":662,"height":498}}