{"id":86919,"name":"Papa's Pizzeria HD","slug":"papas-pizzeria-hd","url":"https:\/\/www.igdb.com\/games\/papas-pizzeria-hd","created_at":1518612086573,"updated_at":1522034410891,"summary":"Top, bake, and serve seasonal pizzas in Papa's Pizzeria HD!\n \n-- ABOUT THE GAME --\n \nThings get messy when you're left in charge of Papa Louie's wildly popular pizza parlor! You'll be busy in the pizzeria as you unlock a wide array of toppings, crusts, and sauces for new seasonal pizzas as well as all-time classic ingredients. Top, bake, and serve pizzas in this award-winning game that's updated and remastered for tablets.\n \nEach station in the restaurant is a hands-on process, and you'll have to multi-task between all of the different stations to keep up with your pizza orders. Choose a crust, add sauce and cheese, and add a variety of delicious toppings to the pizza. Slide the pizza into the oven and wait until it's baked just right. Head to the Cutting Station to cut the pizza into perfect slices, and serve the finished pie to your hungry customers!\n \n-- GAME FEATURES --\n \nPapa Louie's delicious pizzas are now available for delivery! Hire a delivery person to answer the phone when a customer calls with an order for delivery. When the pizza is ready, they'll bring the pizza right to the customer's house!\n \nCelebrate the seasons with new holiday pizza flavors! As the seasons change in Tastyville, your customers will order their pizzas with new seasonal ingredients. You'll unlock new crusts, sauces, and toppings for each holiday of the year, and your customers will love trying new flavors for a festive meal!\n \nCustomers will occasionally bring you unique Special Recipes, which you can serve as the Daily Special in the pizza shop! Each Special also has a bonus you can earn for serving a prime example of that recipe. When you serve enough Specials to master that recipe, you'll also earn a special prize!\n \nPlay as Roy or his sister Joy -- or create your own custom character to run the pizzeria! You can also show off your holiday spirit with a massive variety of holiday outfits and clothing for your workers. Choose unique color combinations for each item of clothing, and create your own style with millions of combinations!\n \nMissing your favorite customer? Why not send them some coupons with the help of your friendly mailman, Vincent! Customers love a good deal, and will promptly arrive to order another pizza. Coupons are great for completing quests for Stickers and for strategically leveling up customers!\n \nThe customizable lobby is back, with new themes of furniture and decorations for each holiday of the year! Decorate the restaurant with holiday decorations and your customers won't mind waiting even longer for their food.\n \nPlay Foodini's famous Mini-Games to earn new furniture for your lobby and new clothing for your workers. You can also visit the Shop after each workday to find an extensive wardrobe of clothing, tons of furniture for your lobby, and a variety of helpful upgrades for the restaurant which you can buy with your hard-earned tips.\n \nPapa's collection of Stickers return, which you can earn by completing a wide variety of tasks and achievements as you play. Each customer has a set of three favorite Stickers: Earn all three and you'll be rewarded with a brand-new outfit to give to that customer!\n \n-- MORE FEATURES --\n \nHands-on Pizza shop in the Papa Louie universe\nUpdated and remastered for tablets\nMulti-task between topping, baking, and cutting\n12 separate holidays to unlock, each with more ingredients\nEarn and Master 40 unique Special Recipes\n90 colorful Stickers to earn for completing tasks\nCustom chefs and delivery drivers!\nTons of furniture and clothing to decorate your shop and workers\nPurchase shop upgrades with your earned tips\n109 customers to serve with unique orders\nUse Stickers to unlock new outfits for your customers\nOver 95 ingredients to unlock\n7 exciting Mini-Games to play after each workday","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[33603,36962,55888,65827,32283,55308,18623,74388,28244,29173],"tags":[268435469,268435471],"category":0,"genres":[13,15],"first_release_date":1502064000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1502064000000,"region":8,"human":"2017-Aug-07","y":2017,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oirzogitf9haoe6zt0f2.jpg","cloudinary_id":"oirzogitf9haoe6zt0f2","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tuix3rsspbb6tgjd41fk.jpg","cloudinary_id":"tuix3rsspbb6tgjd41fk","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wqlusrsrqqinllxcai5u.jpg","cloudinary_id":"wqlusrsrqqinllxcai5u","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cbdxcnpv90say8dpy1rr.jpg","cloudinary_id":"cbdxcnpv90say8dpy1rr","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cwvgm9t82kn0a4ddjyzb.jpg","cloudinary_id":"cwvgm9t82kn0a4ddjyzb","width":552,"height":414}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l0kpexcgxbb5zgqks298.jpg","cloudinary_id":"l0kpexcgxbb5zgqks298","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/papas-pizzeria-hd\/id1246312700?mt=8&uo=4"}]}