{"id":109259,"name":"Nighthawks","slug":"nighthawks","url":"https:\/\/www.igdb.com\/games\/nighthawks","created_at":1536409287165,"updated_at":1536409302286,"summary":"\"Nighthawks is the brand new urban fantasy RPG from Wadjet Eye Games (The Blackwell Legacy, Unavowed, Technobabylon) and writer\/designer Richard Cobbett (Sunless Sea\/Sunless Skies, The Long Journey Home).\" \n \n\"Nighthawks is a mix of story-driven RPG and undead life-simulation, where every decision you make is another move in your chess game against the world. Invest your time into learning new skills or honing your fighting style as you uncover the city's mysteries and venture deep into its darkest secrets. Gather fellow outcasts to your side, binding them with favours and choosing when to cash in. Manage your eternal thirst, legitimately, or balancing the risks of being caught stalking unwary victims and working the black markets.\"","storyline":"\"Three months ago, you died. And in that moment you were reborn as something new. A monster. A predator. Not a creature of the night, but one of its masters. \n \nUnfortunately, things aren't simple as they used to be. Vampires have finally been exposed, and though your existence is tolerated, your new nature is not. You came to the City hoping for a new start, but found only suspicion and starvation. Now you stare at the ceiling of your cheap hotel room as a penniless outcast, suckling on rats and destined to wither away. \n \nBut every new era brings new opportunities, and in the political chaos of a world gone mad, even an outcast may rise. An outcast can change everything. \n \nThis is the story of how you rose.\"","popularity":1.666666666666667,"tags":[1073741829,1073741828],"developers":[2763],"publishers":[2763],"category":0,"player_perspectives":[4,5],"game_modes":[1],"keywords":[283,2425,3001,3208],"themes":[17],"genres":[12,13,32],"pulse_count":2,"platforms":[6,14],"release_dates":[{"category":7,"platform":14,"region":8,"human":"TBD"},{"category":7,"platform":6,"region":8,"human":"TBD"}],"videos":[{"name":"Gameplay video","video_id":"zjJDjYj1BiE"}],"websites":[{"category":1,"url":"http:\/\/www.nighthawks-game.com"}]}