{"id":12059,"name":"Driller","slug":"driller","url":"https:\/\/www.igdb.com\/games\/driller","created_at":1441128269036,"updated_at":1515726925540,"summary":"In the far future, the human race has abandoned Earth for the reaches of outer space, having ruined the planet in the relentless quest for resources and in endless conflict. In a desperate search to find a new home, they found Evath, a life-sustaining planet with two moons, Mitral and Tricuspid. They sent a ship, named \"Exodus\" to colonize this new planet with explorers, embryos and supplies. Generations passed, and the colony on Evath was formed. Without the rule of law, the oldest members of the Exodus' crew, the Elders, were forced to take control, form an army and bring the rule of law to Evath. \n \nLesleigh Skerrit aspired to work for the Driller Federation. His grandfather had been a member of the Federation, but he was falsely accused of murder and banished as a Ketar. Only later did the evidence contesting his guilt surface, but it was too late - the law did not allow someone banished as a Ketar to return to Evath. Lesleigh was not bitter and did not seek retribution. He wanted to study law to prevent this kind of mistake happening again. \n \nCalled in by his superior, Montigue Yarbro, he is offered a lifetime opportunity - to complete his training and gain a promotion to Elite within the Driller Federation in one fell swoop. His experience on Mitral bore him well - he was to go to Mitral and attempt to avert the coming catastrophe. Mitral, having been abandoned in its unstable state by the Ketars, was going to explode within four hours, and the explosion would take Evath with it. Skerrit's mission was to use the excavation probe \"Last Hope\" to place eighteen drilling rigs around Mitral to allow the gas to dissipate harmlessly into space and prevent this disaster. Things are not so simple though, with the security systems activated prior to the Ketars' departure.","collection":2868,"popularity":1.333333333333333,"games":[36950,25311,68287,27314,25300,19301,28029,64204,76731,142],"tags":[1,18,268435461,268435471,268435487,268435489,536871113,536871162,536871882,536874694,1073741825],"developers":[5062],"publishers":[366,5062],"game_engines":[269],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[201,250,970,3782],"themes":[1,18],"genres":[5,15,31,33],"first_release_date":567907200000,"platforms":[63,13,16,15,26,25],"release_dates":[{"category":2,"platform":26,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":63,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12},{"category":2,"platform":25,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":13,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12},{"category":2,"platform":15,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":16,"date":599529600000,"region":1,"human":"1988","y":1988,"m":12}],"alternative_names":[{"name":"Space Station Oblivion","comment":"U.S. Title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ygocp2x8jdxct5rekxfm.jpg","cloudinary_id":"ygocp2x8jdxct5rekxfm","width":500,"height":692}}