{"id":24459,"name":"Real WarBots","slug":"real-warbots","url":"https:\/\/www.igdb.com\/games\/real-warbots","created_at":1475064102179,"updated_at":1475083464941,"summary":"New approach to RTS games! We transfer the mechanics of genre from the virtual world into the real world, on the real robots!\n\nIt is a strategy game for two or more players. Players need to collect resources, defend the base and eliminate the enemies. However, the game is not on the computer screen, but in the real world with the participation of real robots. Moreover, as there are robots, the control will be also different from the standard “clicking and dragging”.\n\nThe player must make an algorithm of robot actions from simple blocks like shoot, move, turn, and so on, plus more difficult blocks with conditions and cycles. After that, the algorithm is wirelessly sent to the robot who begins to carry out his task. If the situation changes, the player makes a new algorithm, sends it to the robot and it starts acting in a new way.\n\nBesides, the player is free to make algorithms of any difficulty. Someone will make them small, of several clicks, and will be sending new tasks to the robot all the time. Another player will spend some time before the game. He will make a big algorithm from maybe thousands of commands, in fact a simple game intelligence\n\nWhich approach is right  will show only practice and your own experience. \n\nThis type of control enables to control a large number of robots, battles between dozens of machines is not a problem, providing that you have them.\n\nBesides these are robots, and nobody is preventing players from racing with obstacles, hunting the cats, passing beer bottles or anything else that may spring into your mind! \n\nMore details on the website.","popularity":1.666666666666667,"category":0,"keywords":[575,1471,1704,2818,2819],"genres":[15],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lvnxqgza3lpnwfpshcki.jpg","cloudinary_id":"lvnxqgza3lpnwfpshcki","width":2560,"height":1713},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g5mw6gkfi635xtnn1fmi.jpg","cloudinary_id":"g5mw6gkfi635xtnn1fmi","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ku5myt9f68x1jtrtfgh5.jpg","cloudinary_id":"ku5myt9f68x1jtrtfgh5","width":1200,"height":1350},"websites":[{"category":1,"url":"http:\/\/www.realwarbots.com"},{"category":5,"url":"https:\/\/twitter.com\/RealWarBots"},{"category":4,"url":"https:\/\/www.facebook.com\/RealWarBots\/"}]}