{"id":26359,"name":"MU Online","slug":"mu-online","url":"https:\/\/www.igdb.com\/games\/mu-online","created_at":1481299653520,"updated_at":1529206032502,"summary":"MU Online, produced by Webzen Inc is a full 3D MMORPG which is one of \nthe leading online games developed in Korea. MU is a highly involved \nfantasy RPG based on the legendary Continent of MU. \nMU established a basic frame of various online games and other following \ngames and regarded as a pioneer of 3D MMORPG.","storyline":"In a millennium's time, the Land of MU has advanced and developed the empire in great bounding strides. However, as foretold in the Great Prophecy, Secromicon, the Continent of MU fell into overwhelming chaos. Great leaders who had once controlled the MU Continent now have fallen low, and the central government; due to the internal strife and warfare amongst power hungry feudal lords, have brought the kingdom asunder and thus the empire crumbled. The millennium of peace and bounty is now a mere memory and dark stains of blood now cover the land. The ravages of war have laid waste to the once beautiful land and the shedding of blood still knows no end. Even now, petty feudal lords endlessly build up their machines of war and futilely attempt to re-establish what once was. \n \nAnd it was during this time of endless blood letting that the Gates of Hell were thrown open as the blind ambitions of a foolish man had been led far astray. \n \nAntonias a foolish Lord, blinded by ambition, deceived by the evil Sorceress Lemulia, unknowingly let loose upon the world, Kundun, the Devil of Darkness, a demon difficultly confined by the Seal of Etramu. \n \n\"Now this land shall be mine again. I have banished Peace for all time… the Sun will no longer shine. This earth shall be mine, and cunning men will be my slaves and cattle.\" \n \nThe Ancient Devil Kundun awake from its long sleepless slumber now walks amongst the living defiling the land with his touch. Amidst the chaos, the stars have lost their course and the stench of fear and blood pervades throughout. Kundun released upon the land his rage and vengeance for his long confinement. Quickly, the now forsaken land of MU has become home to Kundun's minions and for 2 long years the evil of his reign befouled all that was once pure. Nightmare's Day, a passage in the Great Prophecy, had come true and was no longer merely the words of days gone by. Wise men began their studies anew and hopingly and longingly referred to the ray of light mentioned within the writings of the prophecy. Their last remaining hope lay in the power of the seal of Etramu, the very seal that maintained Kundun's imprisonment. Into 8 pieces the seal has been scattered and only when the seal is made whole shall peace return to the land once more.","collection":4444,"popularity":5.333333333333333,"games":[18337,14394,2933,7533,603,72657,26841,2025,660,1223],"tags":[1,17,22,268435460,268435468,268435471,268435472,536870990,536871019,536871063,536871138,536871139,536871148,536871208,536871213,536871422,536871812,536871945,536872245,536872308,536872647,536873066,536874083,536874398,536874694,536874706,536875106,536875126,536875196,536875304,536875307,536875337,536875372,536875455,536875464,536875525,536875586,536875588,536875738,536875791,536875798,536875799,536875819,536875847,536875889,536876036,536876232,536876286,536876528,536876706,536876730,536876986,536877207,536877422,536877628,536877819,536877850,536878299,536878525,536879998,536880136,536880803,536881106,536881122,536881123,536882815,536884021,1073741827],"developers":[7622],"publishers":[7622],"category":0,"player_perspectives":[3],"game_modes":[5],"keywords":[78,107,151,226,227,236,296,301,510,900,1033,1333,1396,1735,2154,3171,3486,3782,3794,4194,4214,4284,4392,4395,4425,4460,4543,4552,4613,4674,4676,4826,4879,4886,4887,4907,4935,4977,5124,5320,5374,5616,5794,5818,6074,6295,6510,6716,6907,6938,7387,7613,9086,9224,9891,10194,10210,10211,11903,13109],"themes":[1,17,22],"genres":[4,12,15,16],"first_release_date":1065398400000,"pulse_count":1,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1065398400000,"region":8,"human":"2003-Oct-06","y":2003,"m":10}],"videos":[{"name":"Gameplay video","video_id":"MrDcpRtYhGY"},{"name":"Teaser","video_id":"kPyh3fNv360"},{"name":"Trailer","video_id":"xogFKOBcsxg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qiq7lhj7kjl10iti1ydz.jpg","cloudinary_id":"qiq7lhj7kjl10iti1ydz","width":500,"height":500},"websites":[{"category":6,"url":"https:\/\/www.twitch.tv\/directory\/game\/Mu%20Online\/videos\/all"},{"category":5,"url":"https:\/\/twitter.com\/muonline_webzen"},{"category":4,"url":"https:\/\/www.facebook.com\/MUWEBZEN"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Mu_Online"},{"category":2,"url":"http:\/\/muonline.wikia.com\/wiki\/Main_Page"},{"category":1,"url":"http:\/\/muonline.webzen.com\/"}]}