{"id":28059,"name":"Microsoft solitaire collection","slug":"microsoft-solitaire-collection","url":"https:\/\/www.igdb.com\/games\/microsoft-solitaire-collection","created_at":1491312816033,"updated_at":1491313687051,"summary":"Check out the new look and feel of Microsoft Solitaire Collection on Windows 10! \n \nSolitaire remains the most played computer game of all time, and for good reason. Simple rules and straightforward gameplay make it easy to pick up for everyone. \n \nSolitaire has been part of Windows for more than 25 years, and the Microsoft Solitaire Collection makes it the best experience to date with five different card games in one: \n \nKlondike \nThis version is the timeless classic that many people just call \"Solitaire.\" Try to clear all the cards from the table using one or three-card draw, while using traditional scoring or the Vegas scoring system. \n \nSpider \nEight columns of cards await your attempts to clear them with the fewest moves possible. Start out playing with a single suit until you’re comfortable, and then see how you fare when using two or even all four suits in a game. \n \nFreeCell \nUse four extra cells to move cards around as you try to clear all cards from the table. More strategic than the Klondike version, FreeCell rewards players who think several moves ahead. \n \nTriPeaks \nSelect cards in a sequence, either up or down, to earn points and clear the board. How many boards can you clear before you run out of deals? \n \nPyramid \nPair two cards that add up to 13 in order to remove them from the board. Try to reach the top of the pyramid. See how many boards you can clear and how high you can score in this highly addictive card game! \n \nDaily Challenges \nPlayers receive new challenges each day. Complete enough Daily Challenges in a month to earn badges and compete with your friends. \n \nStar Club \nEven more challenges arranged in collections and packs you can unlock by earning stars. \n \nChoose Your Theme \nThe Microsoft Solitaire Collection features several beautiful themes, from the simplicity of \"Classic\" to the serenity of an Aquarium that comes to life before you while you play. You can even create custom themes from your own photos! \n \nXbox Live Integration \nSign in with your Microsoft account to earn achievements, compete with your friends on the leaderboards, and track your personal gameplay statistics. If you sign in with a Microsoft account, your progress is stored in the cloud so you can play the game on any device without missing a beat!","popularity":1.666666666666667,"category":0,"first_release_date":1356912000000,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":1356912000000,"human":"2012","y":2012,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ggngmc2wkbmoehrfyalp.jpg","cloudinary_id":"ggngmc2wkbmoehrfyalp","width":1399,"height":787},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t9yc9rcis7akovuh5ck1.jpg","cloudinary_id":"t9yc9rcis7akovuh5ck1","width":1399,"height":787},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xvtvyhfrkbocjasafqmv.jpg","cloudinary_id":"xvtvyhfrkbocjasafqmv","width":1399,"height":787},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ip4rilpyypiuc3wcnasp.jpg","cloudinary_id":"ip4rilpyypiuc3wcnasp","width":1399,"height":787},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mpqjzeucfph5obgdbbzj.jpg","cloudinary_id":"mpqjzeucfph5obgdbbzj","width":1399,"height":787}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/siguwtlhx9ptyeowrxw8.jpg","cloudinary_id":"siguwtlhx9ptyeowrxw8","width":180,"height":180},"websites":[{"category":2,"url":"https:\/\/en.wikipedia.org\/wiki\/Microsoft_Solitaire_Collection"}]}