{"id":37759,"name":"Yokoyama Mitsuteru: San Goku Shi","slug":"yokoyama-mitsuteru-san-goku-shi","url":"https:\/\/www.igdb.com\/games\/yokoyama-mitsuteru-san-goku-shi","created_at":1497877095676,"updated_at":1516723203718,"summary":"Yokoyama Mitsuteru Sangokushi is a strategy game based on the anime and manga of the same name by manga artist Yokoyama Mitsuteru. The name simply means \"Yokoyama Mitsuteru's version of Sangokushi\", Sangokushi being the Japanese name for the Chinese literary classic Romance of the Three Kingdoms. The manga and anime retell the story of the book, with the game focused on this retelling. \n \nDuring the game's development the anime adaptation was in full swing, so the game was intended to be a companion piece. This was a standard practice of Bandai at the time (Angel was a game publisher subsidiary of the toy giant), as was hiring freelance developers like TOSE to develop for them. \n \nThe game is a standard turn-based strategy war sim in the vein of Koei's much more prolific Romance of the Three Kingdoms series. The player and the AI-controlled rival kingdoms select actions that include diplomacy, combat and domestic matters such as farming and trade, with the ultimate goal being to wrest control over the rest of China from the other two kingdoms. \n \nThe game was followed up with two sequels: a standard sequel in Yokoyama Mitsuteru Sangokushi II and the board game spin-off Yokoyama Mitsuteru Sangokushi Bangi.","collection":3664,"popularity":1,"games":[18623,23345,29173,55590,6985,26391,19934,55036,9199,19376],"tags":[17,22,268435469,268435471,536871063,536872060,536874694,536875053,536875067,536876056],"category":0,"keywords":[151,1148,3782,4141,4155,5144],"themes":[17,22],"genres":[13,15],"first_release_date":709516800000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":709516800000,"region":5,"human":"1992-Jun-26","y":1992,"m":6},{"category":0,"platform":19,"date":712108800000,"region":8,"human":"1992-Jul-26","y":1992,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ud1ddzehmitebgva0sf2.jpg","cloudinary_id":"ud1ddzehmitebgva0sf2","width":500,"height":902}}