{"id":39459,"name":"Bust-A-Move Again","slug":"bust-a-move-again","url":"https:\/\/www.igdb.com\/games\/bust-a-move-again","created_at":1498128731208,"updated_at":1547682224974,"summary":"Puzzle Bobble 2 is the first sequel to \"Puzzle Bobble\". It was entitled in Europe and North America as Bust-A-Move Again on the arcade and Bust-A-Move 2 on the home consoles. Released into the arcades in 1995, PlayStation, Sega Saturn, Nintendo 64 and PC conversions followed. The game was included in Taito Legends 2, but the US arcade version was included on US PS2 version instead. The game is a spin-off from Bubble Bobble. \n \nThe game builds on the original by adding a tournament style variation on the two player game for play against the computer and by adding a branching map to the one player game, allowing the player to periodically select one of two groups of five levels to play next, leading to different game endings. Some of the contestants in the new tournament mode are based on characters from Bubble Bobble, including variations on a Monsta and a Mighta. \n \nSome versions of the game, including the PlayStation, feature time trial competitions in which a single player attempts to finish simple rounds quickly enough to beat previous time records or two players simultaneously attempt to beat the records and each other. \n \nCompletion of the single player game gives the player a code which can be entered to unlock 'Another World' for the single player game, which features subtle changes to the existing levels to increase their difficulty and changes to all backdrops to resemble levels from Bubble Bobble. The various enemies from Bubble Bobble also make an appearance in the background of the credits sequence.","collection":2375,"popularity":2,"games":[95776,80174,19222,113471,101563,87507,90766,107249,10225,88511],"tags":[268435465],"publishers":[1440],"category":0,"game_modes":[1],"genres":[9],"first_release_date":820368000000,"platforms":[52,79],"release_dates":[{"category":2,"platform":52,"date":820368000000,"human":"1995","y":1995,"m":12},{"category":0,"platform":79,"date":915148800000,"region":2,"human":"1999-Jan-01","y":1999,"m":1},{"category":0,"platform":79,"date":915148800000,"region":5,"human":"1999-Jan-01","y":1999,"m":1}],"alternative_names":[{"name":"Bust-A-Move 2: Arcade Edition","comment":"Other"},{"name":"Puzzle Bobble 2","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5xw3.jpg","cloudinary_id":"sc5xw3","width":320,"height":232},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5xw2.jpg","cloudinary_id":"sc5xw2","width":320,"height":232},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5xw1.jpg","cloudinary_id":"sc5xw1","width":320,"height":232}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hturtblkeqmw0r1gf8dd.jpg","cloudinary_id":"hturtblkeqmw0r1gf8dd","width":850,"height":1204}}