{"id":41559,"name":"Pocket Billiards","slug":"pocket-billiards","url":"https:\/\/www.igdb.com\/games\/pocket-billiards","created_at":1498824369582,"updated_at":1515643157484,"summary":"Press 1 on the alpha-numeric keyboard. \n \nYou are in the spacious, oak paneled game room of your baronial country retreat. A full size electronic pocket billiard table appears on your screen. \n \nThe computer will ask you if you wish to play Eight Ball or Rotation by displaying the names of these games alternatively at the bottom of the screen. Tell the computer which game to rack up by moving the joy stick of either hand control in any direction while the name of the game is on the screen. \n \nThe game of Eight Ball is played with two black balls. The first player to sink either one of the black balls wins. \n \nIf you choose to play Rotation, the two black balls will be replaced by two colored balls. (Lighter shadings on black and white TV.) The player sinking the most balls into the pockets wins. \n \nThe cue will always align with the white cue ball. Rotate the cue to the right by moving the joy stick to the right. Rotate the cue to the left by moving the joy stick to the left. \n \nPress the action button to hit the cue ball with the cue. \n \nThe longer you keep the action button depressed, the harder the cue will hit the ball and the farther the ball will travel. When the cue ball strikes another ball, you no longer control its momentum. \n \nThe pocketed balls will appear in order at the bottom of the screen. \n \nGAME VARIATIONS \n \nEach player may only sink balls of one color. If a player sinks another player's ball, the game is lost. The first player to sink all the balls of one color wins. \n \nPlayers sink balls of alternating colors. If a player sinks two ball of the same color in a row, the game is lost. The player who sinks the most balls of alternating colors wins. \n \nTo play again, press the RESET key on the alpha-numeric keyboard and then press 1.","popularity":1.333333333333333,"games":[21800,22690,47511,54662,15851,81281,80876,80865,80456,80412],"tags":[268435470,536872078,536875414],"category":0,"keywords":[1166,4502],"genres":[14],"first_release_date":255139200000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":255139200000,"region":8,"human":"1978-Feb-01","y":1978,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qtfcsodpjqdz5syct5gu.jpg","cloudinary_id":"qtfcsodpjqdz5syct5gu","width":965,"height":1300}}