{"id":50459,"name":"Scallywag: In the Lair of the Medusa","slug":"scallywag-in-the-lair-of-the-medusa","url":"https:\/\/www.igdb.com\/games\/scallywag-in-the-lair-of-the-medusa","created_at":1500041630119,"updated_at":1516653918775,"summary":"The Gosling valley was once a valley of peace and prosperity. In Gosling it seemed the sun always shined, your neighbors smiled, and the harvests were bountiful. Yes, life in the valley was good. Factor in the mushrooms, and well, life wasn't just good, it was great! \n \nAh yes, the mushrooms. The valley was full of them, and each one was special. There were enormous mushrooms that were used as homes, and small ones that could be brewed into liquor (including everyone's tavern favorite, ShroOOom! ale). Some mushrooms were best buttered and fried, while other mushrooms were typically dried and smoked. There were mushrooms that healed the sick, and even some that could make magic! \n \nThen the troubles began. Bizarre creatures prowled the valley, the wildlife fled, and once full larders laid bare. The citizens of Gosling smiled at each other no more, instead spending their days hiding in terror. Worse, with the blight upon the land the mushrooms that once provided so much now provided so little. Even the casks of ShroOOom! ale were almost dry! \n \nBig Will, an old farmer, sought out the source of the evil. Nestled high in the hills, he found the source: a dank and dark cave that oozed evil, a terrible open sore in the land that spewed forth nightmares. Big Will did not go in, though. He'd let someone else have all the glory. Someone, such as YOU! \n \nYou are Rapius, mighty farm laborer. The blood of the Gods do not flow in your veins. You were not prophesized about a thousand years prior by three blind crones. Yet it is you, Rapius, that will seek out and destroy the source of evil. \n \nRapius, grab your lantern and make haste! For the good of the people, the lands, and the mushrooms - especially the mushrooms! Have you seen what they're charging for a pint of ShroOOm! ale lately? Go forth, descend into the earth! Leave a tramp and come back a scallywag! All of Gosling awaits your triumph - your triumph in the lair of the Medusa! \n \nScallywag: In the Lair of the Medusa is a single-player, action orientated dungeonbash of unlimited potential. Taking the role of Rapius players fight their way through eighty levels of randomly generated dungeon exploration, braving dozens of unique subterranean dangers in a quest to cleanse the ultimate evil within the catacombs. \n \nDown in the dark players will gain gear, craft items, learn magic, eat 'shrooms, turn to stone, become invisible, get drunk, be hungover, learn to fly, speed up, muscle up, regenerate, smoke fungus, get diseased, get lost, get found, and more! Careful use of Rapius' lantern will allow players to strike from afar, or for tough encounters, sneak by silently in the dark. \n \nScallywag: In the Lair of the Medusa also comes complete with RAGe, the Random Adventure Game engine. Craft whole new adventures for Rapius, or even make entirely new games! Everything (and we mean everything) can be modded with RAGe, no programming experience necessary! \n \nDo you have what it takes to survive eighty levels of terrible beasts, cruel hazards, and some mind blowing mushrooms? Find out in Scallywag: In the Lair of the Medusa!","popularity":1,"games":[49414,25636,36608,69505,21842,12632,28080,75102,26766,18862],"tags":[268435468,536871938],"category":0,"keywords":[1026],"genres":[12],"first_release_date":1193443200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1193443200000,"region":8,"human":"2007-Oct-27","y":2007,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ny7yftbc2xwvxw39gi7n.jpg","cloudinary_id":"ny7yftbc2xwvxw39gi7n","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jfihuyhwepmrvhew2dhj.jpg","cloudinary_id":"jfihuyhwepmrvhew2dhj","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hjvuzsn7cbwuhuo0o5th.jpg","cloudinary_id":"hjvuzsn7cbwuhuo0o5th","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mjztwyrcf7vuth9tj5ko.jpg","cloudinary_id":"mjztwyrcf7vuth9tj5ko","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/exwl1hqugqhirr0flubz.jpg","cloudinary_id":"exwl1hqugqhirr0flubz","width":1024,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sqdueak8j075m79gzcls.jpg","cloudinary_id":"sqdueak8j075m79gzcls","width":300,"height":310}}