{"id":10401,"name":"Hearts of Iron III: Their Finest Hour","slug":"hearts-of-iron-iii-their-finest-hour","url":"https:\/\/www.igdb.com\/games\/hearts-of-iron-iii-their-finest-hour","created_at":1431950747480,"updated_at":1517270892227,"summary":"Hearts of Iron III: Their Finest Hour puts you back in the commander’s seat during World War II. Win the war with new units, strategies and enhanced game modes.\n\nDestroy your enemies from within with an expanded espionage system that includes new missions and covert operations. A new battle plan mode allows you to load historical plans or draw your own; all of which can be shared with allies in real-time during multiplayer.\n\nAlong with the enhanced gameplay there are two new battle scenarios and a new custom game mode that lets you jump straight into the action.\n\nFeatures:\n*New unique, elite units for each major nation's army - Ghurkhas, Rangers, Imperial guards and more\n*A deeper naval invasion system with the ability to develop specialized landing and assault crafts\n*Increased control over strategic warfare with a new lend-lease system for lending your industrial might to allies\n*Leaders are now able to gain traits and allocating them is more important than ever with a new combat tactics system\n*New game mode for single and multiplayer. Start with a clean slate and instantly produce units, research technologies and affect political alignment. Speed up the early years and jump straight into the action\n*Two new detailed battle scenarios, the Finnish Winter War and the Spanish Civil War","collection":174,"popularity":1.333333333333333,"game":741,"games":[22399,36594,640,55036,23345,17446,55029,9760,12982,2015],"tags":[22,39,268435471,268435480,536870931,536871061,536874694,536875137,536878415,1073741827,1073741829],"developers":[7466],"publishers":[517],"category":2,"player_perspectives":[3,5],"game_modes":[1,2,3],"keywords":[19,149,3782,4225,7503],"themes":[22,39],"genres":[15,24],"first_release_date":1348617600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1348617600000,"human":"2012-Sep-26","y":2012,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/axvyk0ktnmobvacgqzhv.jpg","cloudinary_id":"axvyk0ktnmobvacgqzhv","width":1611,"height":2217},"websites":[{"category":1,"url":"https:\/\/www.paradoxplaza.com\/hearts-of-iron-iii-collection?___store=gb"}]}