{"id":106101,"name":"Road To Eden","slug":"road-to-eden","url":"https:\/\/www.igdb.com\/games\/road-to-eden","created_at":1532451612599,"updated_at":1538426838970,"summary":"Road to Eden is a third-person multiplayer survival coop game, set within the post-apocalyptic ruins of a world destroyed by an alien invasion. You wake up at the side of the road with no memory and must team up with other survivors to make the long and dangerous journey to Eden.","storyline":"Road to Eden is a third-person multiplayer survival coop game, set within the post-apocalyptic ruins of a world destroyed by an alien invasion. 99% of the human population was wiped out in an instant and now humanity’s last hope is Project Eden, a base of operation where the remaining survivors are fighting back. You wake up at the side of the road with no memory and must team up with other survivors to make the long and dangerous journey to Eden. \n \nRoad to Eden is currently in early access, some of its features are still work in progress and could behave differently than expected. \n \nRoad to Eden is played on Host\/Client basis, when you start a game you essentially start a server where your friends can login and assist you with your story, so everytime you start a game you will experience a different story! \n \nThe crafting in Road to Eden is based on learning recipes by finding books or broken objects from which you learn new recipes. All recipes require a number of items to be able to be crafted, once crafted, you can find the item in your inventory as well as gain experience which is part of the character skill system. \n \nYou can build using a wide variety of blocks, from large blocks to thin walls, fortifications, traps, furniture, windows, doors, fabricators, workstations and a lot more! \nBuilding your base in Road to Eden is one of many ways to survive the weather and the dangers that lurk at night \n \nThe world of Road to Eden has a variety of randomly generated dungeons, bunkers, sewers, caves with no loading screen, fight your way through the dungeons to gain experience, loot, find rare items, and get skill points. \n \nThe world of Road to Eden is populated with multiple factions, the infected are ordinary people infected with the blue substance brought by the visitors, they are everywhere and their sole mission is to infect you and other survivors. The rebels are bandits willing to kill on sight, they create anarchy and chaos in the land, the paramilitary are mercs, well armed and well trained, they won't hesitate to kill you on sight if you interfere with their operation. And finally the visitors, we have heard stories about them, no one knows why they came and no one survived an encounter with them. \n \nWhile exploring the world of Road to Eden you will discover a multitude of locations from small villages to deep caves and crash sites, each location may hide a piece of the story. With each login, all lootable house furniture will randomly generate, making your scavenging visits different every time! \n \nThe world of Road to Eden is littered with secret areas where you can find rare loot, some areas are open, others require special items or keys, you can find these items by solving puzzles or quests \n \nAs you become part of Eden's effort against the visitors, you will receive missions ranging from clearing out infected from an area to acquiring rare items. \n \nAs you progress in Road to Eden you will encounter special random world events ranging from visitors landings sites to major paramilitary operations, it's up to you to decide if you engage, and how you engage if you decide to do so!","popularity":2.666666666666667,"games":[31712,25311,37419,25300,105269,26574,18290,55038,90099,37777],"tags":[1,18,21,33,38,268435461,268435469,268435487,268435488,536894015,1073741826],"developers":[16477],"game_engines":[439],"category":0,"player_perspectives":[2],"game_modes":[1,2,3],"keywords":[3,339,1473,17386],"themes":[1,18,21,33,38],"genres":[5,13,31,32],"first_release_date":1553990400000,"status":4,"platforms":[6],"release_dates":[{"category":3,"platform":6,"date":1553990400000,"region":8,"human":"2019-Q1","y":2019,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tqsnremly5drjxrf0uar.jpg","cloudinary_id":"tqsnremly5drjxrf0uar","width":1551,"height":903},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/usvjjwhhmqn2xbgzubgz.jpg","cloudinary_id":"usvjjwhhmqn2xbgzubgz","width":1551,"height":903},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ahetklcjqa0ufjtcrr5t.jpg","cloudinary_id":"ahetklcjqa0ufjtcrr5t","width":1551,"height":903},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jxccfyzk2aepykog367c.jpg","cloudinary_id":"jxccfyzk2aepykog367c","width":1930,"height":1114},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ibkm9zorxm4sahvmzmiy.jpg","cloudinary_id":"ibkm9zorxm4sahvmzmiy","width":1551,"height":903},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yq7qg0je9rprfzflkx8p.jpg","cloudinary_id":"yq7qg0je9rprfzflkx8p","width":1551,"height":903},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x0uy1hvatozoop6p2xuz.jpg","cloudinary_id":"x0uy1hvatozoop6p2xuz","width":1551,"height":903}],"videos":[{"name":"Trailer","video_id":"qqJY7YStigA"},{"name":"Trailer","video_id":"I6IPJUOVwNY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xmghwnx9nhy77dhf3bam.jpg","cloudinary_id":"xmghwnx9nhy77dhf3bam","width":500,"height":500},"websites":[{"category":8,"url":"https:\/\/www.instagram.com\/roadtoedengame"},{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCjNO9tZ2MczTgw42SMn46eQ"},{"category":4,"url":"https:\/\/www.facebook.com\/Roadtoedengame"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/929060"},{"category":1,"url":"http:\/\/www.roadtoedengame.com"}],"external":{"steam":"929060"},"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":true,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":true,"offlinecoopmax":1,"onlinecoopmax":4,"onlinemax":4,"offlinemax":1}]}