{"id":107301,"name":"Starflight 3","slug":"starflight-3","url":"https:\/\/www.igdb.com\/games\/starflight-3","created_at":1535531006688,"updated_at":1535531036412,"summary":"\"Starflight 3 is the next chapter in the Staflight universe. It is a sci-fi single-player, sandbox role-playing game that focuses on exploration, diplomacy, resource gathering, and combat. Players will have solar systems with tons of planets to discover and explore, mine for necessary resources, catalog new creatures, trade and use diplomacy with locals, all while saving the universe. Starflight 3 is a true free-form experience. \n \nStarflight 3 will feature new and previous alien races, uncharted solar systems to discover, and never before seen planets to explore, all within the same genre-defining gameplay mechanics of the original games. Players will assemble and train their crew and be responsible for their health at all times. Upgrade and customize your starship to make sure you can traverse all of the new star systems. Visit planets and find trade centers, mine for minerals, harvest plants, capture animals, and discover mind-bending clues scattered across the solar systems. Interact with aliens by deciphering their life, culture, and their standing in the universe. And combat, there is no avoiding it. Upgrade your ship and improve your crew because in battle, you will need to decide whether it is best to engage or retreat.\"","collection":538,"popularity":2,"tags":[1073741827,1073741826],"developers":[4624],"publishers":[4624],"category":0,"player_perspectives":[2,3],"game_modes":[1],"keywords":[3,23,24,1045,1674,23233],"themes":[18,33,41],"genres":[12,13],"first_release_date":1609372800000,"pulse_count":2,"platforms":[6],"release_dates":[{"category":6,"platform":6,"date":1609372800000,"region":8,"human":"2020-Q4","y":2020,"m":12}],"alternative_names":[{"name":"Starflight 3: Universe","comment":"Other"}],"videos":[{"name":"Teaser","video_id":"Zb4SDaIcSp4"},{"name":"Crowdfunding Announcement Trailer","video_id":"hJy-fZ-BJvY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gl4tqpptzgwiykihageu.jpg","cloudinary_id":"gl4tqpptzgwiykihageu","width":2638,"height":1484},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCz2QspKZCdxZlCJ5zsPUTzw"},{"category":5,"url":"https:\/\/twitter.com\/starflightgame"}]}