{"id":15701,"name":"Berlin 1948","slug":"berlin-1948","url":"https:\/\/www.igdb.com\/games\/berlin-1948","created_at":1451942725374,"updated_at":1513072273426,"summary":"West Berlin is held hostage by a nuclear device...\n...and you've been sent to find it. You're Sam Porter, CIA agent extraordinaire. Or at least you'd better be. An atomic bomb is set to vaporize West Berlin and time's running short. Everyone says you're the best undercover man in the agency. Now you have to prove it!\n\nDivided Berlin isn't the easiest place to run a covert operation. A Soviet blockade ravages the city, while black marketers run rampant on the Ku'damm. Foreign agents are everywhere and the citizens don't trust strangers. You'll need help!\n\nRoam the war-torn street of West Berlin, stopping in bookstores, nightclubs and the cinema to try and unravel the plot that threatens world peace. Taxi through each sector, trading cigarettes, questioning suspects, making friends and enemies, and searching for the doomsday device - and the people who planted it.\n\nViewing cinema newsreels is one way to find clues and enjoy the brilliant graphics in this dramatic adventure.\n\nTalk to citizens, trade with merchants and deal with Black Market leaders - they have the information you need!\n\nTaxi across town using an historically accurate map of 1948 Berlin. \n\nHistory's sights and sounds come alive with an audio cassette that syncs to your computer's graphic display.","popularity":1.333333333333333,"games":[25222,27314,19448,26766,25300,51978,36950,27266,19289,26223],"tags":[18,268435465,268435487,536871882,536871939,536872328,536873787,536875258],"category":0,"keywords":[970,1027,1416,2875,4346],"themes":[18],"genres":[9,31],"first_release_date":662601600000,"platforms":[16],"release_dates":[{"category":2,"platform":16,"date":662601600000,"human":"1990","y":1990,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ocl4uwemmrxnlnzdufsn.jpg","cloudinary_id":"ocl4uwemmrxnlnzdufsn","width":320,"height":200}}