{"id":40201,"name":"Ragnagard","slug":"ragnagard","url":"https:\/\/www.igdb.com\/games\/ragnagard","created_at":1498476341495,"updated_at":1516747296429,"summary":"2 Player fighting game similar to Killer Instinct graphically. Other than that is is a rather poor fighting game on a system with many greats. \n \nControls make use of all of the four buttons of the original Neo Geo arcade stick. Available moves, combat moves and combat actions are explained in a section preliminary to the game and are: punch, kick, dash and quick dash, jump, jump attack, throw, super throw, cushion throw (a throw that does nothing but invert the position of the fighters on the fighting field), counterattack, meter build up (the fighter can not move while charging the power meter: once that is done, a Super God move of gargantuan power can be released). It is possible to dash forward, and perform fight moves while on air for a time longer than normal, on account of the preterhuman nature of the battlers (the game is defined as «aerial battle action game» in the spine of Neo Geo version package). Each divinity wields a personal weapon of medieval fashion, like for instance an imposing sword, a bow, a dreadful halberd. Victory goes to who prevails in 2 out of 3 rounds (the duration of each of which is 60 seconds), and a bonus score related with time and energy left is given to them.","popularity":1.333333333333333,"games":[56987,41828,80387,47733,39542,3581,19333,61162,54913,1422],"tags":[268435460,536870973,536871019,536871208],"publishers":[13163],"category":0,"keywords":[61,107,296],"genres":[4],"first_release_date":821491200000,"platforms":[80,52,136,79],"release_dates":[{"category":0,"platform":79,"date":821491200000,"region":2,"human":"1996-Jan-13","y":1996,"m":1},{"category":0,"platform":136,"date":840758400000,"region":5,"human":"1996-Aug-23","y":1996,"m":8},{"category":0,"platform":79,"date":821491200000,"region":5,"human":"1996-Jan-13","y":1996,"m":1},{"category":0,"platform":80,"date":822614400000,"region":5,"human":"1996-Jan-26","y":1996,"m":1},{"category":0,"platform":52,"date":841017600000,"region":8,"human":"1996-Aug-26","y":1996,"m":8}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rv6mkjynzpidyewi7fg2.jpg","cloudinary_id":"rv6mkjynzpidyewi7fg2","width":504,"height":745}}