{"id":50901,"name":"Star Wars: The Force Unleashed - Ultimate Sith Edition","slug":"star-wars-the-force-unleashed-ultimate-sith-edition--1","url":"https:\/\/www.igdb.com\/games\/star-wars-the-force-unleashed-ultimate-sith-edition--1","created_at":1500057107172,"updated_at":1500462878806,"summary":"Star Wars: The Force Unleashed is a LucasArts action-adventure video game and part of the The Force Unleashed project. It was initially developed for the PlayStation 2, PlayStation 3, Wii, and Xbox 360 consoles and on the iOS, second-generation N-Gage, Nintendo DS, PlayStation Portable, and Java-equipped mobile phone handhelds.[2] \n \nThe game was released in North America on September 16, 2008, in Australia and Southeast Asia on September 17, and in Europe on September 19. LucasArts released downloadable content for the PlayStation 3 and Xbox 360 consoles.[3] An Ultimate Sith Edition of the game, containing new and all previously released expanded content, was released in November 2009,[4] which also came out on Mac OS and Microsoft Windows. \n \nThe project bridges the first two Star Wars trilogies, acting as an origin story for both the united Rebel Alliance and the Galactic Civil War depicted in the Original Trilogy. The game introduces a new protagonist, \"Starkiller\", as Darth Vader's secret apprentice, who is tasked with hunting down Jedi while killing rebels and Imperials alike in order to hide his existence from the Emperor, but soon starts to slowly redeem himself to the light side of the Force. \n \nReviews offered fairly positive response, praising The Force Unleashed for its compelling story, robust physics, impressive art and soundtrack, while some more negative reviews cited frustrating gameplay. Despite this, the game was a bestseller in the United States and Australia, with over one million copies sold its debut month. As of February 2010, the game has sold over seven million copies, and it is the fastest-selling Star Wars video game.[5] A sequel, Star Wars: The Force Unleashed II, was released in October 2010.[6]","popularity":1,"category":0}