{"id":51401,"name":"The Return of the Incredible Machine: Contraptions","slug":"the-return-of-the-incredible-machine-contraptions","url":"https:\/\/www.igdb.com\/games\/the-return-of-the-incredible-machine-contraptions","created_at":1500065507876,"updated_at":1513072029599,"summary":"Return of The Incredible Machine allows players to use unique, sometimes humorous mechanical components to construct fantastic machines that accomplish unusual tasks. Each puzzle contains a partially built machine and the extra pieces needed to complete it and accomplish the goal. The player's job is to use the pieces in the correct way to complete the machine. As players become more familiar with the various machine parts and their functions, the puzzles become more sophisticated and challenging. This third installment of the Incredible Machine series from Sierra features improved graphics and new puzzles to challenge virtual engineers of all ages. Whirring, Boinging, Thinga-Muh-Jiggy, What-Cha-Ma-Callit, Fun! So how do you build a better thinga-muh-bob? With the completely addictive, highly original devices in the Return of The Incredible Machine: Contraptions. In a category by itself, Contraptions is like nothing you've ever played before. Create off-the-wall gadgets using a combination of everyday flumadiddles, doohickeys, and gigamarees, like your basic laser-activated light switch and your typical mouse-driven treadmill. So break out your lab coat because, with its spectacular 3D graphics, Contraptions is sure to bring out the wild, white-haired inventor in you!","collection":1249,"popularity":1.333333333333333,"games":[29173,18167,25222,55036,23345,19376,55590,60044,9262,8197],"tags":[268435465,268435471,536873787,536874694,536875531,536877745,536886285],"category":0,"keywords":[2875,3782,4619,6833,15373],"genres":[9,15],"first_release_date":967766400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":967766400000,"region":8,"human":"2000-Sep-01","y":2000,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/irhwbqg9rbnbhnxgzbdv.jpg","cloudinary_id":"irhwbqg9rbnbhnxgzbdv","width":419,"height":594}}