{"id":89101,"name":"Draw a Stickman: EPIC HD","slug":"draw-a-stickman-epic-hd","url":"https:\/\/www.igdb.com\/games\/draw-a-stickman-epic-hd","created_at":1519425259794,"updated_at":1523427638319,"summary":"Pencil your way into one of the most creative drawing puzzle games ever designed: Draw a Stickman: EPIC!\n \nIn this uniquely crafted cartoon RPG, you become the artist and create your very own stick man hero! Sketch and doodle your way through the cartoon obstacles the evil stick man Zarp throws at you!\n \nAs the artist behind the adventure, start the game by drawing an original cartoon hero. Your hero also needs a friend, so sketch his buddy and give him a name! But as you watch your cartoon creations hop right off the page, your stick man hero’s friend heads straight into the dangers of the cartoon adventure book! Send your doodle dude into the book to save his cartoon friend!\n \nAs the artist, you’ll guide your sketched hero through the dangerous drawing world to save his friend. You’ll use various pencils and creativity to animate solutions to puzzles or obstacles!\n \nNeed to get past a pile of dynamite sticks? Use the flame pencil to doodle a fire and blow them up! Bees in your way? Use the cloud pencil to sketch some rain to grow a pollinated distraction! Ward off dragon enemies, draw a spider to fight attacking troll hordes, and supercharge a toaster with the lightning cloud! There is plenty to do in the world of Draw a Stickman: EPIC! Features:\n \n- Customizable stick man feature that lets you animate your own hero\n- Unlockable colors for drawing life into your character\n- Plenty of cartoon levels to play through\n- Multiple pencil types for creating and animating solutions to obstacles:\n \nA fire pencil to burn down obstacles\nA cloud pencil to create rain or lightning\nA key pencil to help you unlock doors and other objects\nAn axe pencil to help you chop down trees\nAn armor pencil gives you added protection to in-game hazards","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[49414,25636,36608,21842,28080,75102,18862,16468,19567,72412],"tags":[268435468,536872030],"category":0,"keywords":[1118],"genres":[12],"first_release_date":1351123200000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1351123200000,"region":8,"human":"2012-Oct-25","y":2012,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/belvdbsdywghggyckva1.jpg","cloudinary_id":"belvdbsdywghggyckva1","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gqrgyv3fb2zlfzdpsfzp.jpg","cloudinary_id":"gqrgyv3fb2zlfzdpsfzp","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uqzxzprznttaws3cwfn0.jpg","cloudinary_id":"uqzxzprznttaws3cwfn0","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sqpxbniqlzng2or1an4r.jpg","cloudinary_id":"sqpxbniqlzng2or1an4r","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eg93t59zzwnoq0zlbw4m.jpg","cloudinary_id":"eg93t59zzwnoq0zlbw4m","width":480,"height":360}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dkc05vxkiceazlnq4x9n.jpg","cloudinary_id":"dkc05vxkiceazlnq4x9n","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/draw-a-stickman-epic-hd\/id556867879?mt=8&uo=4"}]}