{"id":111167,"name":"Darkest Dungeon: The Shieldbreaker","slug":"darkest-dungeon-the-shieldbreaker","url":"https:\/\/www.igdb.com\/games\/darkest-dungeon-the-shieldbreaker","created_at":1540109945845,"updated_at":1540131358931,"summary":"Hailing from the distant windswept dunes of the east, the Shieldbreaker arrives in the Hamlet! Deadly as a viper, her iron will has been forged in the heat of the blazing desert sun. Though outwardly demure, her emancipation from the barren wastes came at a price so terrible, it haunts her dreams even now... \n \nFeatures: \nNew hero class: the Shieldbreaker \nDynamic, tactical skill set for the Shieldbreaker featuring all new combat mechanics including: Armor Piercing, Guard Break, and Stealth \nShieldbreaker class-specific trinkets, including a set. \n3 New Monsters - frightful illusions from the Shieldbreaker's origin, now slithering forward to infest the Estate \nNew Consumable Item - Aegis Scale, providing a last bastion of protection for when a hero truly needs it. \n \nThe Shieldbreaker is a powerful ally in the fight to reclaim the Estate and banish the evil that squats in the Darkest Dungeon. A highly-tactical hero with solid damage dealing capability, she truly excels when countering monsters with high protection and those who guard their allies. Her movement, speed, and targeted abilities make her a valuable ally for dismantling intractable monster groups. Though relatively low health, the Shieldbreaker is yet highly survivable in short bursts thanks to her Aegis shield.","popularity":1,"game":8965,"tags":[1073741828],"developers":[7912],"publishers":[7912],"category":1,"player_perspectives":[4],"game_modes":[1],"themes":[19],"genres":[31],"first_release_date":1508976000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1508976000000,"region":8,"human":"2017-Oct-26","y":2017,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1h7g.jpg","cloudinary_id":"co1h7g","width":600,"height":800},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/702540\/Darkest_Dungeon_The_Shieldbreaker"},{"category":1,"url":"https:\/\/www.darkestdungeon.com\/game-overview\/"}]}