{"id":18467,"name":"3D Pinball for Windows – Space Cadet","slug":"3d-pinball-for-windows-space-cadet","url":"https:\/\/www.igdb.com\/games\/3d-pinball-for-windows-space-cadet","created_at":1458849368708,"updated_at":1544632695890,"summary":"3D Pinball for Windows – Space Cadet is a version of that table bundled with Microsoft Windows. It was originally packaged with Microsoft Plus! 95 and later included in Windows NT 4.0, Windows Me, Windows 2000, the 32-bit editions of Windows XP and Windows XP Professional x64 Edition. Windows 98 installation CD has instructions on installing Pinball 3D on this version of Windows which are partly wrong; Microsoft later issued an updated support article. Windows XP was the last Windows client to include this game.","storyline":"The Space Cadet table features the player as a member of a space fleet that completes missions to increase rank. Players can attain 9 different ranks (listed from lowest to highest): Cadet, Ensign, Lieutenant, Captain, Lieutenant Commander, Commander, Commodore, Admiral, and Fleet Admiral. Players accept a mission by hitting \"mission targets\" which select which mission they will take, and by going up the \"launch ramp\". Each mission has a set number of things for players to do, such as hitting the \"attack bumpers\" (which are a set of four bumpers at the top of the table) eight times (this is the \"target practice\" mission). Some missions involve a number of steps which must be completed in sequence. Missions end either by being completed, or by being aborted due to running out of \"fuel\", as indicated by the lights in the passage that passes under the launch ramp. The \"fuel\" lights go out one by one at a time interval, and can be re-lit by having the ball go over them, or all at once by going up the launch ramp again. Upon completing a mission, some of the blue lights in a circle in the middle of the table turn on. When all of the lights in the blue circle turn on, the player's rank increases, and a light in the orange circle turns on.","rating":80.2451347587244,"popularity":4.666666666666666,"total_rating":80.2451347587244,"total_rating_count":21,"rating_count":21,"games":[81559,80843,80819,80741,80690,80663,80660,80554,80311,80300],"tags":[268435486,536871846,1073741825],"developers":[1139],"publishers":[128],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[934],"genres":[30],"first_release_date":820368000000,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":820368000000,"human":"1995","y":1995,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ccu2d9heg5zrx5kfqpzy.jpg","cloudinary_id":"ccu2d9heg5zrx5kfqpzy","width":500,"height":347}],"videos":[{"name":"Gameplay video","video_id":"7Zi7kCqtN1M"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gzguu5dntz8vcykdgvvl.jpg","cloudinary_id":"gzguu5dntz8vcykdgvvl","width":270,"height":187},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Full_Tilt!_Pinball"}]}