{"id":20267,"name":"NBA ShootOut 2004","slug":"nba-shootout-2004","url":"https:\/\/www.igdb.com\/games\/nba-shootout-2004","created_at":1468362193561,"updated_at":1515602470468,"summary":"NBA Shootout 2004 lets you play either a full season or exhibition matches of fully licensed NBA basketball with your favorite teams and players. Fully textured 3d players with faces of the top NBA players are mapped into the game. Listen to commentary by Ian Eagle and Bill Walton as they call the games right as you play. \n \nWhile there is no franchise mode like other more traditional sports games, there is a career mode where you create a character who tries to make his way up through the summer leagues and the NBDL. You'll be given challenges that you'll need to meet so that you can ultimately make your way to the NBA and get an actual contract to join a NBA team. Once in the NBA, you'll need to work even harder to win championships and titles so you can eventually be inducted into the NBA Hall of Fame. \n \nYou can also unlock the 50 greatest players of all time by completing challenges in exhibition games like scoring a certain number of points or using a certain person to get a number of assists. \n \nUse a USB microphone to give your teammates commands to help. Give them commands on offense or defense about where to move so you can use your teammates effectively.","collection":2246,"popularity":1,"games":[20265,20266,20264,22690,26772,45486,20262,20260,3552,3551],"tags":[268435470,536870970,536872078,536875186,536875562,536875615,536877459,536877463,536884027],"category":0,"keywords":[58,1166,4274,4650,4703,6547,6551,13115],"genres":[14],"first_release_date":1066608000000,"platforms":[7],"release_dates":[{"category":0,"platform":7,"date":1066608000000,"region":8,"human":"2003-Oct-20","y":2003,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ojmwt0skuqq5xnez0dyh.jpg","cloudinary_id":"ojmwt0skuqq5xnez0dyh","width":1425,"height":1409},"esrb":{"rating":3}}