{"id":25667,"name":"Two Tigers","slug":"two-tigers","url":"https:\/\/www.igdb.com\/games\/two-tigers","created_at":1478651663016,"updated_at":1517270546287,"summary":"Two Tigers is an arcade game created by Bally Midway and released in 1984. It is themed around World War II-era planes attempting to sink military ships, but there are no references as to which countries are involved in the conflict. \n \nTwo Tigers offers the choice of two separate modes: one or two players working together to sink large enemy ships, or a dogfight mode where two players attempt to down each other's plane. \n \nThe game was not ported to home computers or game consoles. \n \nIn the primary mode, each player steers his or her always moving plane by rotating it clockwise and counter-clockwise. Enemy planes fly horizontally across the screen; shooting them causes them to crash into the warship along the bottom. Each crash damages the ship. Mines floating in the water can be shot, damaging the ship from below. Players can damage the ship directly by dropping bombs. Only one bomb per player can be in the air at once. \n \nRepeated damage to the same location causes a leak. When enough leaks have been created (based on the level), the ship explodes. As an intermission, submarines, sharks, and swimmers occupy the open water and can be shot. After a brief respite, a new ship arrives. \n \nLives are unlimited in Two Tigers. Flying into another plane spawns a replacement once the wreckage falls offscreen. Player-controlled planes are unable to collide with the ship at the bottom. After a certain amount of time an undestroyed ship leaves—another such departure ends the game.","popularity":1.333333333333333,"games":[28029,76246,19341,32902,10039,68287,68142,28751,36794,24920],"tags":[1,268435461,268435489,1073741826],"developers":[1436],"publishers":[1436],"category":0,"player_perspectives":[2],"game_modes":[1,2],"themes":[1],"genres":[5,33],"first_release_date":473299200000,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":473299200000,"region":2,"human":"1984","y":1984,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rcbnx09x3wxep0zwzbmo.jpg","cloudinary_id":"rcbnx09x3wxep0zwzbmo","width":1000,"height":271}}