{"id":41567,"name":"Laser War","slug":"laser-war","url":"https:\/\/www.igdb.com\/games\/laser-war","created_at":1498824546537,"updated_at":1515844038552,"summary":"The players are in the Battle Control Central at the heart of the United Planets Interstellar Galactic Empire. From there, they monitor the activity of the twin solar systems of Terien and Lorien, forty-three billion light years away. Their mission is to control to protect the planets of those solar systems from the invasion fleet with the remote controlled battle cruisers. \n \nThey'll control their ships with the joystick and fire lasers with the action button. The invasion fleet will shoot the players and the planets as well. Shot planets will have their colors changed and will be conquered when their colors match the invaders ship's colors. \n \nIf the players' ship is destroyed, a new one will be launched from one of the planets with their color. If there's no planet with their color, they'll have to wait until a planet's color change to theirs. \n \nIf the players crash into planets with a color different than theirs, both the ship and the planet will be destroyed. Destroyed planets won't come back, but the central planet at each orbit is indestructible. Players can also hide their ships in their own planets, by landing on them. Planets with ships landed will blink. \n \nThe winner is the player who first destroys ten enemy ships.","popularity":1.333333333333333,"games":[68287,36950,142,27314,28029,64204,14364,26766,71455,25300],"tags":[18,268435461,268435486,536871846,536871882,536871937,536875412,536875416,536876028],"category":0,"keywords":[934,970,1025,4500,4504,5116],"themes":[18],"genres":[5,30],"first_release_date":297129600000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":297129600000,"region":8,"human":"1979-Jun-02","y":1979,"m":6}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fqx4mxr7goxtns3j4r91.jpg","cloudinary_id":"fqx4mxr7goxtns3j4r91","width":900,"height":1227}}