{"id":44767,"name":"Soukyuu Gurentai","slug":"soukyuu-gurentai","url":"https:\/\/www.igdb.com\/games\/soukyuu-gurentai","created_at":1499436148438,"updated_at":1534876477475,"summary":"After exhausting the Earth’s resources, particularly fossil fuel, innumerable trade companies team up with NASA and begin initiating space programs dedicated to finding resources outside the planet Earth. Mining facilities are established in different areas outside of Earth, particularly on large asteroids near the Moon and most especially on Mars. Various resources are found from these areas and distributed to Earth which aid in the world economy. The largest company that is established from this is the Jin-Sei (Exhausting Star) Corporation set in Japan which is worth 1 trillion in New Yen investments, founded by the Miama family. \n \nHowever, after years of space resource distribution, the separate companies started initiating attacks that would dominate other company’s resources. The strongest of these attacks started on Martian colonies established by the second largest company on Earth, Eight Luck Interstellar Development Inc., which banded with smaller companies across Earth including ones in China, England, and America. Eight Luck planned on claiming Mars for its own so as to monopolize on the outsourcing of minerals as well as developing terraformed areas. \n \nIn response to these attacks, the Jin-Sei formed a union with the JSDF (known in the future as JDF) and began working on a space fighter program organized by Defensive Section 2 of the JDF known as the Scarlet Lotus Team (SOQ for short), which utilized a unique laser technology fighting system known as NALS (Non-blind spot All range Laser System) in combat. The threat of eco-terrorism was on the rise as out-spoken ecosystem protectionism groups opposed the company's outsourcing of materials; these were used as subsequent cover-up stories to hide the company war waging between Jin-Sei and Eight Luck from public awareness. \n \nMade up of the best fighters adapted to this combat system as well as innumerable stamina strengthening tests for space travel, the SOQ are sent in to defend company territory from rival companies on Earth and space at all costs.","popularity":1.666666666666667,"games":[36977,103298,21015,103281,95340,32902,44623,103020,78770,28029],"tags":[268435461,536871756],"developers":[1296],"publishers":[1296],"category":0,"keywords":[844],"genres":[5],"first_release_date":851990400000,"platforms":[52,32,7],"release_dates":[{"category":0,"platform":32,"date":855273600000,"region":5,"human":"1997-Feb-07","y":1997,"m":2},{"category":2,"platform":52,"date":851990400000,"region":5,"human":"1996","y":1996,"m":12},{"category":0,"platform":7,"date":885686400000,"region":8,"human":"1998-Jan-25","y":1998,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/miqje2kesilpkfzpa05p.jpg","cloudinary_id":"miqje2kesilpkfzpa05p","width":480,"height":360}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xudiyq2e0gaboi5rfwhs.jpg","cloudinary_id":"xudiyq2e0gaboi5rfwhs","width":846,"height":1193},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Terra_Diver"}]}