{"id":46067,"name":"Bulls vs Lakers and the NBA Playoffs","slug":"bulls-vs-lakers-and-the-nba-playoffs","url":"https:\/\/www.igdb.com\/games\/bulls-vs-lakers-and-the-nba-playoffs","created_at":1499529963373,"updated_at":1513071935504,"summary":"Bulls vs Lakers and the NBA Playoffs is a basketball video game developed by Electronic Arts and released in 1992 exclusively for the Sega Mega Drive. The game is the sequel to Lakers versus Celtics. The game's name refers to the previous season's NBA championship series, the 1991 NBA Finals matchup between the Chicago Bulls and Los Angeles Lakers. It is the second game in the NBA Playoffs series of games. \n \nAlthough there is no SNES version for Bulls vs Lakers, the SNES (and first) version of Bulls vs. Blazers was heavily based on Bulls vs Lakers, with the later Mega Drive version introducing a few changes from this. \n \nBulls vs Lakers introduced a television broadcast-style presentation with a fictional television network, \"EASN\", the Electronic Arts Sports Network. It was the first team basketball game to feature an in-game instant replay feature. Bing Gordon, the Chief Creative Officer of Electronic Arts, was featured as the game announcer. This was also the first game to depict NBA team logos on the courts. \n \nGameplay[edit] \nThe game can be played in various ways: players could play against each other, or against the computer. Games against the computer were divided into two modes, \"Exhibition\" or \"Playoffs\". Players could pick from one of the 16 teams that competed in the 1991 NBA Playoffs. Rosters featured many top NBA stars of the time, including Michael Jordan. Games could be configured for 2, 5, 8 or 12 minute quarters. New to the series is a star underneath the player to let users easily know which player they are controlling. \n \nReception \nReview scores \nPublication\tScore \nMegaTech\t80%[1] \nMegaTech said that the game had impressive graphics and atmosphere, but that it did not play as fast as David Robinson's Supreme Court.","collection":148,"popularity":1.333333333333333,"games":[46820,39665,101684,101567,101100,100907,100887,100879,100863,100832],"tags":[268435470],"category":0,"keywords":[58,1166,4703,4837,6545,6547,6549,6550,6551,6553,6554,6558,6560,6563,6565,6566,6567,6568,6571,11945],"genres":[14],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jjc53bgk5ucvltfd6qxz.jpg","cloudinary_id":"jjc53bgk5ucvltfd6qxz","width":200,"height":286}}