{"id":50167,"name":"Wing Commander: The Kilrahi Saga","slug":"wing-commander-the-kilrahi-saga","url":"https:\/\/www.igdb.com\/games\/wing-commander-the-kilrahi-saga","created_at":1500037622620,"updated_at":1513023771060,"summary":"The Kilrathi Saga was a grand compilation of the initial Wing Commander trilogy and its four expansion packs. Dropaway cockpits, remastered audio and improved joystick options were among the list of improvements. The biggest selling point was native speed-limited support for Windows. Initial sales were low because many fans still readily had computers running DOS to play older Wing Commander games. The game received a second printing in 1998, but many fans were still hesitant to rebuy games they already owned. By the turn of the century however, a huge shift from DOS to Windows had occurred and everyone was scrambling to get a copy. Although the July 2000 edition of PC Gamer included the Kilrathi Saga version of Wing Commander I on its cover disc, auction prices on eBay soared to well over $300 for the full set. Wing Commander fans struggled to find copies until 2005 and the improvement DOS emulation. Although Kilrathi Saga has exciting extras, minor glitches and the solid performance of the original Wing Commander games in DOSBox has relieved the intense price pressure on the game. \n \n  Noteworthy Documentation: Manual, Concept Art Calendar \n  Play: The game can be played by enabling Windows 95 compatibility mode in Windows XP \n  Kilrathi Saga owners may download The Secret Missions and Special Operations","popularity":1,"games":[34919,44242,19934,18623,22470,29173,22425,25311,44076,26145],"tags":[1,268435469,536871859,536872060,536873122,536875265,536875804,536875808,536880220,536880258,536886430],"category":0,"keywords":[947,1148,2210,4353,4892,4896,9308,9346,15518],"themes":[1],"genres":[13],"first_release_date":848016000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":848016000000,"region":8,"human":"1996-Nov-15","y":1996,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/amf1oxlh21jfbdvpso8j.jpg","cloudinary_id":"amf1oxlh21jfbdvpso8j","width":2550,"height":3075}}