{"id":74867,"name":"Lords of Delusia","slug":"lords-of-delusia","url":"https:\/\/www.igdb.com\/games\/lords-of-delusia","created_at":1508740590525,"updated_at":1508744549253,"summary":"Lords of Delusia is a 2D Space RPG \/ Space Shooter. \n \nIt brings elements of a thriving market system, trading, and missions that were popularised in games like Freelancer, and combines this with the random looting, skill point and experience system that exists in many ARPGs. \n \nA rich storyline spanning 5 empires: Delsec, Vipersec, Griffon, Chimera, and Reina with their own galaxy control across 73 solar systems with 500 unique locations to discover. \n \nA combat system reminiscent of the old Arcade bullet hell shooters, combining modern visuals and audio to bring an adrenaline fueled and cinematic experience to the genre.","storyline":"PROLOGUE \nDelusia the Home System of the Delsec Empire is being invaded by the Reina Collective's forces. being overwhelmed, Delsec command decides to take the biggest risk of all, send you back in time a few months prior to the invasion to prevent the invasion from occuring. \n \nSTORY BEGINS \nafter that the main story begins with you as a new recruit under Delsec. Initially Delsec is competing with their nearest neighbor the Vipersec Dominion for stability in the region. As the two hold seperate idealogies. Delsec valuing Control, Order, Discipline, and Security, although Delsec takes it to the extreme being the closest thing to a Police state in the game. On the other hand Vipersec values Privacy, Concealment, Individuality, and is self regulated without the need for a government or police. \n \nAs the story progresses the 2 build a balance and Vipersec is no longer seen as an enemy and the player then begins the story missions of vipersec. This then leads to the inclusion of the Griffon Trade Alliance who's empire spans the highest amount of systems, which are a neutral faction and value Neutrality. The storyline spreads into Griffon space and who are in confrontation with the Chimera Federation, a band of Underdogs and Pirates. Chimera take hits on Griffon trade routes to pirate goods to sell off. Chimera hold the values of Wealth, Prosperity, and are the closest thing to a Pirate faction. Eventually the story leads into Chimera space who have a darker neighbor, the Reina Collective. Reina forces value pure chaos and domination. They are like fire. valuing strength and war. \n \nThe story ends with the Reina forces missions. Where by the end, the player must decide which ending to go for. With 5 possible endings for the 5 factions, it is up to the player to decide how the end plays out. Does Delsec gain the advantage it wanted by sending the player back in time and holding off the Reina forces? Or does Vipersec sweep in and take over through all the chaos, or does neutrality win with Griffon, or Piracy takes over with Chimera, or finally does reina take over full control of the galaxy? The player decides.","popularity":1.333333333333333,"tags":[1073741827],"developers":[13679],"game_engines":[104],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[10860,10861],"themes":[1,18,38],"genres":[12,32,33],"first_release_date":1517443200000,"status":2,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1517443200000,"region":8,"human":"2018-Feb-01","y":2018,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xftcdgsertp2mvsszi4c.jpg","cloudinary_id":"xftcdgsertp2mvsszi4c","width":2554,"height":1595},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rcaba9nlsfjwrha1mt4w.jpg","cloudinary_id":"rcaba9nlsfjwrha1mt4w","width":2554,"height":1595},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pzqv4rtvlirlcogeo2tb.jpg","cloudinary_id":"pzqv4rtvlirlcogeo2tb","width":2554,"height":1595},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aj5yoy6uuxqnylngzh99.jpg","cloudinary_id":"aj5yoy6uuxqnylngzh99","width":2554,"height":1595},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qvp6g5uny09oajdic2u2.jpg","cloudinary_id":"qvp6g5uny09oajdic2u2","width":2554,"height":1595}],"videos":[{"name":"Gameplay video","video_id":"CkO7ojIbfzU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mdxiwq9uf2asv8xxdl9b.jpg","cloudinary_id":"mdxiwq9uf2asv8xxdl9b","width":1498,"height":1780},"esrb":{"rating":5},"pegi":{"rating":3},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/user\/MrDelusive"}],"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false},{"platform":6,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}