{"id":7567,"name":"Conquests of the Longbow: The Legend of Robin Hood","slug":"conquests-of-the-longbow-the-legend-of-robin-hood","url":"https:\/\/www.igdb.com\/games\/conquests-of-the-longbow-the-legend-of-robin-hood","created_at":1407184109826,"updated_at":1515680459262,"summary":"Conquests of the Longbow is an adventure game and a follow-up to Conquests of Camelot. It uses an icon-based interface common to most contemporary Sierra adventures. Like its spiritual predecessor, it differs from most other games in the genre by reducing traditional inventory-based puzzles in favor of exploration and varied tasks dictated by the situation at hand. These include talking to characters, gathering information, making decisions, solving riddles, or participating in mini-games such as combat, archery contest, and Nine Men's Morris (with adjustable difficulty).","storyline":"The year is 1193, and the Third Crusade has just ended. Richard the Lionheart, King of England, returns to Europe from the Holy Land. On the way, he is ambushed and abducted by the soldiers of the Austrian duke Leopold. The duke demands a large ransom to be paid in exchange for the king's freedom. However, the king's brother, Prince John, is content with the situation and plotting to take the throne for himself. That is when the legendary Robin Hood, one who robs from the rich and gives to the poor, decides to raise the money needed to liberate the king, with the help of his fellow outlaws of Sherwood Forest.","collection":1020,"popularity":1.333333333333333,"games":[25222,236,19289,13189,26223,47823,27725,37088,26239,18011],"tags":[17,22,268435458,268435465,268435487,536871063,536871171,536871208,536871939,536872225,536873787,536879186,536879191,1073741826],"developers":[32],"publishers":[32],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[151,259,296,1027,1313,2875,8274,8279],"themes":[17,22],"genres":[2,9,31],"first_release_date":725760000000,"pulse_count":1,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":7,"platform":13,"human":"TBD"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bhyim08umqe4gu9rrvue.jpg","cloudinary_id":"bhyim08umqe4gu9rrvue","width":3250,"height":4000}}