{"id":7867,"name":"Heroes Chronicles: Conquest of the Underworld","slug":"heroes-chronicles-conquest-of-the-underworld","url":"https:\/\/www.igdb.com\/games\/heroes-chronicles-conquest-of-the-underworld","created_at":1413750874356,"updated_at":1517271113815,"summary":"Conquest of the Underworld is the second part of Heroes Chronicles, following Warlords of the Wasteland and preceding Heroes Chronicles: Masters of the Elements.\r\nYears after being slain in combat by Rion Gryphonheart, Tarnum aids Allison Gryphonheart, his daughter, on her quest to free her father's soul from the Underworld.","storyline":"In Conquest of the Underworld, some years after Rion Gryphonheart's death, his soul is stolen from Paradise and taken into the depths of the Underworld. The Ancestors send Tarnum to aid Queen Allison of Erathia in saving her father's soul. On the first layer of the Underworld, Tarnum searches for the Orb of Inhibition so that the Boatman will take him to the next level. Allison wishes to accompany Tarnum in battle, but Tarnum insists that she stay behind practicing.\r\n\r\nIn the second layer of the Underworld, Tarnum and his men are affected by ghosts from their past. From his nightmares, Tarnum learns that his older sister was almost killed by his Barbarian armies, but was saved by Rion Gryphonheart and later became pregnant with his child. Tarnum learns that this child is Allison, and keeps his identity hidden from his men. After facing the Necromancers in order to travel to the third layer, Tarnum learns the name of the demon who stole Rion's soul. His name is Jorm, and he lives in the lower layers of the Underworld.\r\n\r\nDeezelisk, Duke of the Bottom, is a powerful demon who once attempted to invade Erathia but was defeated in battle and blinded by Rion Gryphonheart when he tried to gain a foothold in the upper world. Tarnum seeks the Pendant of Second Sight to restore Deezelisk's sight in return for Jorm's location. During this time, Tarnum's Captain of Information, Mensor, discovers who Tarnum truly is, but he decides to keep quiet when Tarnum tells him that Allison is his niece. Tarnum kills Jorm and saves the soul of Rion Gryphonheart.\r\n\r\nDuring the battle against Jorm, Deezelisk's forces turn on Allison, and Allison is kidnapped. The demons kill Tarnum and all of his forces, but he returns due to his role as the Immortal Hero and manages to escape the battlefield. Rion's spirit forgives Tarnum, and after regrouping his scattered armies and fighting some major battles, Tarnum defeats Deezelisk and saves Allison. On the day Tarnum is to be named Allison's Protector, he quietly leaves the queen's castle. Allison never sees Tarnum again.","collection":194,"franchise":458,"franchises":[458],"rating":41.2090274347287,"popularity":1.333333333333333,"total_rating":41.2090274347287,"total_rating_count":6,"rating_count":6,"games":[932,26391,13196,76731,29173,55036,26268,18918,23345,19376],"tags":[17,268435471,268435472,536871138,536873311,536874694,536875257,1073741827],"developers":[97],"publishers":[99],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[226,2399,3782,4345],"themes":[17],"genres":[15,16],"first_release_date":970012800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":970012800000,"region":2,"human":"2000-Sep-27","y":2000,"m":9},{"category":0,"platform":6,"date":974419200000,"region":1,"human":"2000-Nov-17","y":2000,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eflqyzwqcbnktmihoq5t.jpg","cloudinary_id":"eflqyzwqcbnktmihoq5t","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ajbv0ualyo8qwbawuims.jpg","cloudinary_id":"ajbv0ualyo8qwbawuims","width":800,"height":600}],"videos":[{"name":"Game intro","video_id":"R2x9Mjl0Ehc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l384kgts98wijshckxnn.jpg","cloudinary_id":"l384kgts98wijshckxnn","width":475,"height":573},"esrb":{"rating":3},"websites":[{"category":2,"url":"http:\/\/mightandmagic.wikia.com\/wiki\/Heroes_Chronicles:_Conquest_of_the_Underworld"}]}