{"id":88867,"name":"Big Fish Casino: Slots & Games","slug":"big-fish-casino-slots-and-games","url":"https:\/\/www.igdb.com\/games\/big-fish-casino-slots-and-games","created_at":1519332854585,"updated_at":1523427028935,"summary":"Download now! New players get 100,000 FREE BONUS CHIPS in the #1 FREE to play Casino app in the world! Over 65,000 5-star reviews!\n\nBig Fish Casino gives you the chance to WIN BIG in Slots, including Crazy Money® Deluxe™ by Incredible Technologies, Inc. Play Blackjack, Texas Hold'em Poker, Roulette, and more, live with your friends. Enjoy all the thrill of Las Vegas! Sit down, relax, have a drink & some chips – on us. We've got gorgeous games and millions of friendly people to play with for FREE!\n\nMake a fortune with HUGE Jackpots, Free Daily Games, Slots Bonus Games, and more! Will you play it safe and hold your cards, or double down and get a lucky ace? Over 16 BILLION chips in Jackpots given out each day!\n\nHave an adventure like no other in our original Slot Machines! Hit Flaming 7's for multiple jackpot levels in Jackpot City! Hunt for clues to uncover a huge win in Sherlock Mysteries! Fortune awaits those brave enough to enter the Enchanted Cavern…\n\n\nTOP FEATURES: \n\n• More ways to win with CLUBS - Team up to win BIG PRIZES while playing your favorite slots games. Join an existing club or form one of your own. Participate in daily events and climb the leaderboard to win more even more chips. \n• Exciting slot machines with FREE SPINS and Bonus Games you won't find anywhere else!\n• Everybody wins together in our unique Social Scatter™ Slots Games!\n• Redeem free chips every 30 minutes!\n• Daily FREE game and bonuses could win you up to 100K FREE Chips just for logging in!\n• Play LIVE with your friends! Beat the house in Blackjack or test your skills in Poker! \n• Customize and strut your stuff with free pets, gifts, and power ups! \n\n--------------------- \n\nQuestions? Suggestions? Contact us at www.bigfishcasinosupport.com!\n\n--------------------- \n\nThis game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[95679,91038,91010,90981,90964,89131,89098,88817,88781,87870],"tags":[536871523,536874083],"category":0,"keywords":[611,3171],"first_release_date":1345075200000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1345075200000,"region":8,"human":"2012-Aug-16","y":2012,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tg0kwobkd89bk2ongqhc.jpg","cloudinary_id":"tg0kwobkd89bk2ongqhc","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kwkiy5c6q2b15duclfed.jpg","cloudinary_id":"kwkiy5c6q2b15duclfed","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pzsnxafoptxclzyyqaeg.jpg","cloudinary_id":"pzsnxafoptxclzyyqaeg","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hzelse2qjqlre782asl5.jpg","cloudinary_id":"hzelse2qjqlre782asl5","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/big-fish-casino-slots-games\/id538212549?mt=8&uo=4"}]}