{"id":16676,"name":"Sins of a Dark Age","slug":"sins-of-a-dark-age","url":"https:\/\/www.igdb.com\/games\/sins-of-a-dark-age","created_at":1453371134577,"updated_at":1516780048613,"summary":"Sins of a Dark Age is a dark fantasy spin on the MOBA genre. Explore your inventory, equip your Hero and enter a world full of decisive team battles, tide-turning quests, treasured rewards, crafted goods, and strategic trades.\n\nJoin fellow players to form a party that will ravage the enemy's army, execute their Heroes, siege their defenses and then raze their Keep to the ground. But that is the just the beginning of the adventure.\n\nChoose Your Hero: The entire roster of Heroes will always be free - no grinding! Before heading into battle customize your strategic and visual preferences by equipping Hero Gear, allocating attribute points and choosing your favorite skin.\n\nBattle the Enemy: Fight in a changing world and decimate your enemies with powerful abilities, glyphs and items. Revel in visceral combat brought to life with an immersive physics and animation system. Bodies will fly, flail, fall and flop as you wreak havoc across the battlefield.\n\nEmbark on Quests: Adapt your strategy as each adventure includes a series of tide-turning Quests. Fend off swarms of plague infected vermin, resurrect the undead, steal a Troll's treasure, or feed and raise a powerful Gryphon! Complete quests to earn unique advantages that you can use to crush your enemies!\n\nTreasure Your Rewards: Collect random loot where Artifacts are the most desired but even Trash may eventually come in handy! Gather the right materials to craft powerful Hero Gear and rare Skins! Join the community market to buy, sell and trade with other players as you seek the perfect inventory.","popularity":3,"games":[78550,55029,44102,28794,35371,18623,9856,36553,23345,30229],"tags":[1,22,268435467,268435471,268435488,536871060,536871063,536871208,536871938,536872159,536872383],"developers":[583],"publishers":[583],"category":0,"game_modes":[2,3],"keywords":[148,151,296,1026,1247,1471],"themes":[1,22],"genres":[11,15,32],"first_release_date":1428192000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1428192000000,"human":"2015-Apr-05","y":2015,"m":4}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r4vj99oger3deili7kit.jpg","cloudinary_id":"r4vj99oger3deili7kit","width":704,"height":440}}