{"id":40076,"name":"RollerGames","slug":"rollergames","url":"https:\/\/www.igdb.com\/games\/rollergames","created_at":1498469952150,"updated_at":1515644918334,"summary":"Rollergames is a coin-operated arcade game by Konami, made in 1990, and based on the television show of the same name. \n \nScore values are cut in half from the real show (and rounded up if needed), and feature only four 99-second cycles instead of 45-second cycles within four 6-minute periods. \n \nThe players control the two jetters. After referee Don Lastra blows his whistle to begin the cycle, the first lap leads the jetters to the Wall of Death (the heavily banked curve of the jetwave). They get one point for getting three steps in the between the two red lines and three points for getting above the top line. On the jet jump, they get three points for landing beyond the 12-foot marker and one point for landing in front of the line. The rest of the cycle awards one point passing or fighting off opposing blockers (who come back to haunt the jetters afterwards) and three points for lapping or fighting off the opposing jetter. The team with the most points wins. \n \nWhile it doesn't affect the score of the game (only awarding a small amount of \"power\" to the winner), there is a bonus Street Fighter II style fight that may happen to illustrate the violence and rivalry that happens on RollerGames.","popularity":1.333333333333333,"games":[71455,22690,10039,51464,11253,6685,15851,76888,7329,44076],"tags":[1,268435460,268435470,268435481,536871563,536871894,536872078,536875054,536875803,536876348,536880754],"category":0,"keywords":[651,982,1166,4142,4891,5436,9842],"themes":[1],"genres":[4,14,25],"first_release_date":633830400000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":633830400000,"region":8,"human":"1990-Feb-01","y":1990,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nufdur5wl7a5bv9qi7mq.jpg","cloudinary_id":"nufdur5wl7a5bv9qi7mq","width":850,"height":1094}}