{"id":11355,"name":"Starcraft: Ghost","slug":"starcraft-ghost","url":"https:\/\/www.igdb.com\/games\/starcraft-ghost","created_at":1437642127728,"updated_at":1469696197083,"summary":"StarCraft: Ghost is a cancelled military science fiction stealth-action video game previously under development by Blizzard Entertainment. Part of Blizzard's StarCraft series, the game was announced on September 20, 2002, and was to be developed by Nihilistic Software for the Nintendo GameCube, Xbox, and PlayStation 2 video game consoles. Several delays in development caused Blizzard to move back the release date and the game has not yet materialized. Nihilistic Software ceded development to Swingin' Ape Studios in 2004 before Blizzard bought the company, and plans for the GameCube version were cancelled in 2005.\n\nBlizzard announced in March 2006 that the game was put on \"indefinite hold\" while the company investigated seventh generation video game console possibilities. Subsequent public statements from company personnel had been contradictory about whether production was to be renewed or planned story elements worked into other products. The continued delay of Ghost had caused it to be labeled as vaporware, and it was ranked fifth in Wired News‍ '​ annual Vaporware Awards in 2005. In 2014, Blizzard president Mike Morhaime confirmed that Ghost was officially cancelled.\n\nUnlike its real-time strategy predecessor StarCraft, Ghost is a third-person shooter, and was intended to give players a closer and more personal view of the StarCraft universe. Following Nova, a Terran psychic espionage operative called a \"ghost\", the game is set four years after the conclusion of StarCraft: Brood War and covers a conspiracy about a secretive military project conducted by Nova's superiors in the imperial Terran Dominion. Very little of the game's storyline has been released; however, in November 2006 after the game's postponement, a novel was published called StarCraft Ghost: Nova, which covers the backstory of the central character.","storyline":"Ghost takes place in the fictional universe of the StarCraft series. The series is set in a distant part of the galaxy called the Koprulu Sector and begins in the year 2499. Terran exiles from Earth are governed by a totalitarian empire, the Terran Dominion, that is opposed by several smaller rebel groups. Two alien races discover humanity: the insectoid Zerg, who begin to invade planets controlled by the Terrans; and the Protoss, an enigmatic race with strong psionic power that attempt to eradicate the Zerg. Ghost takes place four years after the conclusion of StarCraft: Brood War, in which the Zerg become the dominant power in the sector and leave both the Protoss and the Dominion in ruins. The game follows the story of Nova, a young ghost agent—a human espionage operative with psychic abilities—in the employ of the Dominion.","collection":52,"franchise":589,"franchises":[589],"popularity":1.666666666666667,"games":[105269,55038,76747,36950,113114,103260,90099,19128,28029,68287],"tags":[18,268435461,268435487,536871809,536872578,536872579,1073741826],"developers":[51,182,1986],"publishers":[51],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[897,1666,1667],"themes":[18],"genres":[5,31],"status":6,"platforms":[11,21,8],"release_dates":[{"category":7,"platform":8,"human":"TBD"},{"category":7,"platform":11,"human":"TBD"},{"category":7,"platform":21,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kmksiua2s5ksmhwncvsf.jpg","cloudinary_id":"kmksiua2s5ksmhwncvsf","width":2048,"height":1536},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mafqx01dpeufnzvfoup4.jpg","cloudinary_id":"mafqx01dpeufnzvfoup4","width":2048,"height":1485},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tmb0hfjjwypvg2t79kr5.jpg","cloudinary_id":"tmb0hfjjwypvg2t79kr5","width":2560,"height":1440},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bxssx3jkcd4emp2puqow.jpg","cloudinary_id":"bxssx3jkcd4emp2puqow","width":1024,"height":728}],"videos":[{"name":"Game intro","video_id":"XVsTrLW_04U"},{"name":"Trailer","video_id":"F9myb3yZ_5E"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fxbq7rpvc6qtqkch0iaz.jpg","cloudinary_id":"fxbq7rpvc6qtqkch0iaz","width":1024,"height":498}}