{"id":13055,"name":"Seek & Destroy","slug":"seek-and-destroy","url":"https:\/\/www.igdb.com\/games\/seek-and-destroy","created_at":1443251141272,"updated_at":1500203596294,"summary":"Most of the fundamentals of this game work in a similar way to Desert Strike. You pilot a helicopter or a three-barreled tank through 14 increasingly tough multi-phase missions, each of which is preceded by a full briefing and a shopping phase. \n \nBefore each phase you can enter the shop and upgrade your weaponry, paying with golden medals gathered during previous phases. Your starting weapons are the chain gun and rockets\/tank shells. Every weapon has three upgrade levels. After that, you can decide how much ammunition for each weapon you want to load into your vehicle's weapon bays, switch between the tank and the chopper (which can only be done between phases, and some of them don't give you the choice), choose one of the three special weapons and adjust the fuel\/armor\/speed characteristics. All these preparations are surprisingly complex for a shooter like this, and a bad configuration can make the game really hard (no fuel in the middle of the desert, or a paper-thin armor are just two examples). \n \nMissions are set in the desert and jungle as well as over the sea and in snowy regions. Most often your objectives are, obviously, to seek and destroy, while performing some rescue operations and gathering as much powerups as you can. The powerups consist of ammunition, fuel, medals, and others. A scanner is installed into the vehicle to guide you, as is a mapping system and a limited shield. \n \nUnusually, the game only scrolls vertically even though you have full directional movement. When you rotate the direction the ground moves underneath you, ensuring a more realistic effect and smartly mimicking motion effects.","popularity":1.333333333333333,"games":[76246,19341,28029,32902,24920,272,68287,10039,68142,36608],"tags":[1,268435461,1073741827],"category":0,"player_perspectives":[3],"game_modes":[1,2],"themes":[1],"genres":[5],"first_release_date":757296000000,"platforms":[114,16],"release_dates":[{"category":2,"platform":114,"date":788832000000,"human":"1994","y":1994,"m":12},{"category":2,"platform":16,"date":757296000000,"human":"1993","y":1993,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xsklxtve3klnzreyjtdz.jpg","cloudinary_id":"xsklxtve3klnzreyjtdz","width":640,"height":830}}