{"id":23855,"name":"Fire Fly","slug":"fire-fly","url":"https:\/\/www.igdb.com\/games\/fire-fly","created_at":1473465048617,"updated_at":1541709471434,"summary":"TEST PILOT LOG MARCH 17, 2093: On what started to be the routine high speed test of interplanetary craft Delta 12, a power plant malfunction caused the craft to skip off the rim of a small, black hole. After experiencing level 5 turbulence I became unconscious. Upon awaking, I found myself in a time and place unknown to me; the craft having been completely destroyed. \n \nThe place I am in is inhabited by giant bug-like creatures. Through thought waves, the inhabitants explained that they are part of a culture originally insect-like but now almost entirely mechanical. As their biological body parts began to age beyond effective use they replaced them with mechanical parts. Through their will to survive they eventually crated an entire society composed of machines. \n \nDuring this gradual conversion from living matter to machinery a group of the inhabitants started programming themselves to survive even at the expense of others in the society. They became know as the Bad-Bugs. After the complete metamorphosis to computer controlled minds these bugs began attacking the good creatures. \n \nBecause of my human reasoning and ability as an experienced test pilot the good bugs have asked for my help. I have been put in command of the best machine-bug on their planet. My task of saving the good bugs should prove extremely difficult since the Bad-Bugs have creature-machines programmed solely for the purpose of stopping me. I will, however, be awarded valuable treasures by the good bugs for every enemy I eliminate.  \n \nTo further complicate my task the good bugs have asked me to rescue the last remaining living creature on their planet, the Pixie. They have warned me to be very cautious when approaching the Pixy since it is constantly guarded by a killer, machine-bee.","popularity":1.333333333333333,"games":[68287,55038,36950,28029,90099,14364,103020,78770,105269,57187],"tags":[1,18,268435461,268435489,536871882,536871937,536872093,536872617,536872651,536875075,536875941,536876120,536876678,536876719,1073741826],"developers":[10883],"publishers":[10883],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[970,1025,1181,1705,1739,4163,5029,5208,5766,5807],"themes":[1,18],"genres":[5,33],"first_release_date":441676800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ftr609r8ojekbblqjz6g.jpg","cloudinary_id":"ftr609r8ojekbblqjz6g","width":1000,"height":1545}}