{"id":24955,"name":"Tears Of Tiara (2005)","slug":"tears-of-tiara-2005","url":"https:\/\/www.igdb.com\/games\/tears-of-tiara-2005","created_at":1476399534013,"updated_at":1515757514582,"summary":"Tears to Tiara (ティアーズ・トゥ・ティアラ Teiazu tou Teiara) is a Japanese adult tactical role-playing game developed by Leaf. It was first released for Windows on April 28, 2005 in Japan.","storyline":"The game draws heavily from Welsh, Celt, Christian and Roman mythology, with characters named Arawn, Arthur, Epona, Llŷr, Morgan, Pwyll, Rhiannon, and Taliesin. Set in a Late Antiquity-inspired fantasy setting, story starts on an island Erin (or Hibernia, as shown on an in-game map) on the west border of the Holy Empire.\n\nPrologue is centered around the precognition-gifted priestess of the Gael tribe, Rhiannon. She is kidnapped by a rogue priest of the Holy Empire, Drwc, to be used as a sacrifice in a ritual meant to resurrect the Demon King Arawn and put Drwc in his favor. As a response the Gael people burn their village and swear to bring Rhiannon back or exact revenge on the Empire. In the middle of the ritual, as the Gael people attack Drwc's soldiers, Arawn is resurrected and offered Rhiannon. At this point, he kills Drwc, frees Rhiannon, and proclaims no intention in wreaking havoc which the legends attributed to him. Instead, he shows interest in Rhinannon's brother Arthur, the First Warrior of his tribe. Rhiannon, on the other hand, falls in love with Arawn, and by declaring her decision to marry him, makes him the chieftain of the Gael tribe (hers and Arthur's father was the previous chieftain, but Arthur could not assume the title due to being the First Warrior).\n\nAs the prologue ends, point of view is switched from Rhiannon to Arawn, revealing him to be the protagonist of the game, and the story continues with the exodus of Gael tribe to the neighboring island of Albion (or Insula Britannica, as shown on an in-game map) in hope of eluding the Empire.","popularity":2,"games":[59218,22490,74368,59048,27092,17906,22482,22406,28182,22477],"tags":[42,268435468,268435471,268435480,536870990,536871006,536871255,536871759,536871938,536874694,536875472,536878299],"developers":[3094],"category":0,"game_modes":[1],"keywords":[78,94,343,847,1026,3782,4560,7387],"themes":[42],"genres":[12,15,24],"alternative_names":[{"name":"Teiazu tou Teiara","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ueakthsivf2oarffnxke.jpg","cloudinary_id":"ueakthsivf2oarffnxke","width":788,"height":590},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kntjisqdufhz0mxhynib.jpg","cloudinary_id":"kntjisqdufhz0mxhynib","width":800,"height":600}],"videos":[{"name":"Gameplay video","video_id":"Hf-PS3uHyE4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t3po6cnjmrext9vtrmz8.jpg","cloudinary_id":"t3po6cnjmrext9vtrmz8","width":230,"height":326},"pegi":{"rating":4},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Tears_to_Tiara"}]}