{"id":25155,"name":"Paratrooper","slug":"paratrooper","url":"https:\/\/www.igdb.com\/games\/paratrooper","created_at":1477239700340,"updated_at":1513071380683,"summary":"Paratrooper is a single screen arcade action game where the player controls a stationary machine gun turret trying to shoot down all incoming enemies. The turret has unlimited ammo but a limited angle of fire (up to 90 degrees left and right).\n\nAt first, helicopters start appearing from both sides of the screen's upper part. Paratroopers are jumping down from those helicopters; if four or more of them touch the ground, they will form a human ladder, climb up to the turret, and destroy it. To avoid that, the player has to shoot either the paratroopers themselves or their parachutes - for different effects but the same results.\n\nAfter the player has withstood several waves of helicopters, bomber planes start appearing. These planes shoot bombs directly at the turret, which do not miss and destroy it right away. To counter that, the player can either eliminate the plane before it has the chance to drop the bomb, or destroy the bomb itself in mid-air. Shooting bombs scores the most points (50).\n\nSurviving this stage effectively puts the game on an indefinite loop, with more helicopter and bomber plane stages alternating with increased difficulty. There are no continues and the player has to start over if the turret was destroyed.","popularity":1.333333333333333,"games":[68287,28029,10039,36781,76246,36718,19341,36950,28751,7291],"tags":[1,268435461,268435489,536870933,536871510,536871937,536875075,536875151,536875262,536875303,536875305,536875904,536876005,1073741828],"publishers":[11165],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[21,598,1025,4163,4239,4350,4391,4393,4992,5093],"themes":[1],"genres":[5,33],"first_release_date":410140800000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":410140800000,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bpywj39a13fcx6fykqmr.jpg","cloudinary_id":"bpywj39a13fcx6fykqmr","width":480,"height":360}}