{"id":37255,"name":"Wonder Project J: Kikai no Shounen Pino","slug":"wonder-project-j-kikai-no-shounen-pino","url":"https:\/\/www.igdb.com\/games\/wonder-project-j-kikai-no-shounen-pino","created_at":1497606017368,"updated_at":1545535159631,"summary":"There was once a great scientist and inventor named Gepetto, who lived on an island farm together with his creations, his robotic helper, the pixie Tinker, and his pet animals. His greatest creation was an artificial boy named Pino. No, he was not carved from wood, but looked just like a real boy - only he could turn his head 360 degrees. But Gepetto was arrested for an unknown reason. The boy Pino looks like a real boy, but he was completed just a few moments ago, and he knows absolutely nothing. All he can do is wander aimlessly, poking objects and turning his head. It is up to you, the player, to make Pino a real man! \n \nIn this simulation\/role-playing game, you must use the robotic pixie Tinker to educate Pino. You can move Tinker around, examining objects and collecting them in an adventure-like fashion. Pino will automatically follow you to the direction you are facing, but will continue walking until you stop him. He will also pick objects and make his own \"experiments\" with them. Your goal is to train PIno in various disciplines. His stats can be raised in a RPG style: reading books increases his intelligence, throwing a ball increases his dexterity, and so on. By praising or scolding Pino you will gradually make him understand what should be done and what not.","collection":5032,"popularity":1.333333333333333,"games":[55038,29348,35994,36950,25311,17130,22425,25300,19301,26145],"tags":[18,268435468,268435469,268435487,536871818,536871882,536871938,536871939,536872060,536875297,536875472,536877370,536880637],"category":0,"keywords":[906,970,1026,1027,1148,4385,4560,6458,9725],"themes":[18],"genres":[12,13,31],"first_release_date":789609600000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":789609600000,"region":8,"human":"1995-Jan-09","y":1995,"m":1}],"alternative_names":[{"name":"Wonder Project J: Mechanical Boy Pino","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1iab.jpg","cloudinary_id":"co1iab","width":220,"height":397}}