{"id":75955,"name":"Akiba Girls","slug":"akiba-girls","url":"https:\/\/www.igdb.com\/games\/akiba-girls","created_at":1510767940278,"updated_at":1510827092564,"summary":"Akiba Girls (アキバ系彼女 Akiba Kei Kanojo) is a visual novel developed by the Japanese game company G.J?","storyline":"Shindou Nikita has a secret that he has been hiding for a long time—he loves hentai and h-games. He enters \"The Alternative Trivia Research Club\" where the first of his many sexual encounters takes place. Despite that, he finds out that both of his foster sisters are in love with him, and he has to make a choice—who does he really love. Nikita Shindou loves the world of animation more than anything; he puts his life into it. He has never fallen for a real, living girl, until the day he meets Ren Aoi. \n \nWe're introduced to young man Nikita Shindou as he's making his way through Akihabara, which is his main haunt and the place where he gets all his bishōjo games, which he plays in his room all alone in the dark. Keeping them a secret from his sister who just moved in a few months ago after their parents had died, Nikita loves playing up the characters having sex with each other and manipulating them as he can. To his surprise on his way home though, he comes across a park he hadn't remembered before and sees a beautiful woman there, one that reminds him strikingly of an older Sheeta from Laputa: Castle in the Sky! Even more amazing is that she comes into his room in some sort of dream sequence not too much later and keeps calling him Pazu and the two fool around quite a bit only for it to end up as a dream.","popularity":2,"games":[80809,105060,105059,113953,113194,103406,87682,69344,7239,7131],"tags":[536871006],"developers":[13889],"publishers":[13889],"category":0,"keywords":[94],"themes":[42],"first_release_date":1066953600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1066953600000,"region":8,"human":"2003-Oct-24","y":2003,"m":10}],"alternative_names":[{"name":"Akiba Kei Kanojo","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tu46ouzdl2qbqzjo5irr.jpg","cloudinary_id":"tu46ouzdl2qbqzjo5irr","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwic3izpbn0bybujesxv.jpg","cloudinary_id":"vwic3izpbn0bybujesxv","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o0b3ettae82nqnx46uph.jpg","cloudinary_id":"o0b3ettae82nqnx46uph","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tpi3mvzojhz1ooxk34v2.jpg","cloudinary_id":"tpi3mvzojhz1ooxk34v2","width":640,"height":480}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fo7m620snqjltjdg2f0a.jpg","cloudinary_id":"fo7m620snqjltjdg2f0a","width":256,"height":350}}