{"id":76255,"name":"Ambition: A Minuet in Power","slug":"ambition-a-minuet-in-power","url":"https:\/\/www.igdb.com\/games\/ambition-a-minuet-in-power","created_at":1511770486785,"updated_at":1545910190427,"summary":"A young woman finds herself alone in the streets of Paris, far from home and abandoned by the love of her life. In that moment, she decides to live for herself and seek her own passions, as France marches towards a violent uprising that will change history forever. Navigate the twisting social politics of pre-revolutionary Paris in a game world that’s different every time you play. Court, snub and seduce your way to the top of society. Extend your influence, uncover the intrigue of the coming revolution, and ensure that you end up on the winning side of history.","storyline":"The Joy Manufacturing Co. presents a new kind of revolutionary, romantic gameplay. \n \nA young woman finds herself alone in the streets of Paris, far from home and abandoned by the love of her life. In that moment, she decides to live for herself and seek her own passions, as France marches towards a violent uprising that will change history forever. Navigate the twisting social politics of pre-revolutionary Paris in a game world that’s automatically generated, and different every time you play. Court, snub and seduce your way to the top of society. Extend your influence, uncover the intrigue of the coming revolution, and ensure that you end up on the winning side of history. \n \nFeatures \n \n* Gameplay focused on socializing and deception. Work the room and tell people what they want to hear in order to advance your Reputation. \n* Carefully manage your social calendar to make sure you attend all the right parties without stretching yourself too thin and becoming exhausted. \n* Acquire and choose from dozens of outfits based on actual fashion plates and paintings from pre-revolutionary France. Wear these outfits to impress members of the five factions. \n* Seduce powerful individuals throughout France and manipulate them in order to solidify your power. \n* Increase your reputation with the five factions to unlock new bonuses and abilities. \n* A breathtaking soundtrack by award winning game composer, John Robert Matz! \n* Randomly generated world is different every time you play, as is the outcome of the revolution. \n* Uncover the mystery of Yvette's lost lover, Armand. \n* Become enemies with screeching harpies and chauvinistic boors, then drive them to social ruin! \n* Carefully observe the political winds and make sure you end up on the winning side of history.","popularity":2.333333333333333,"games":[55036,79134,55029,2015,26940,236,18623,32283,36553,61],"tags":[22,268435458,536873337,536873913,1073741828],"developers":[13964],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[2425,3001],"themes":[22],"genres":[2],"first_release_date":1546214400000,"pulse_count":2,"platforms":[6,14],"release_dates":[{"category":7,"platform":14,"human":"TBD"},{"category":7,"platform":6,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xtvpi9yszi3qtbc9hky3.jpg","cloudinary_id":"xtvpi9yszi3qtbc9hky3","width":1000,"height":563},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k1ph6l3ybj2dfy8wezxl.jpg","cloudinary_id":"k1ph6l3ybj2dfy8wezxl","width":1000,"height":563},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zrqciqasnaf4kx6j5crr.jpg","cloudinary_id":"zrqciqasnaf4kx6j5crr","width":1000,"height":563},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rlnj40wt0hxdxixojzya.jpg","cloudinary_id":"rlnj40wt0hxdxixojzya","width":300,"height":169}],"videos":[{"name":"Trailer","video_id":"JsGU33gmvpU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m3tna1deicvbohmovwai.jpg","cloudinary_id":"m3tna1deicvbohmovwai","width":1500,"height":2000},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCJIQ1OIcuLqh3ZUXRbaE9dQ"},{"category":6,"url":"https:\/\/www.twitch.tv\/joymanufacturingco"},{"category":5,"url":"https:\/\/twitter.com\/joymanuco"},{"category":4,"url":"https:\/\/www.facebook.com\/JoyManufacturingCo"},{"category":1,"url":"http:\/\/www.Ambition-Game.com"}]}