{"id":87355,"name":"Chapters: Interactive Stories","slug":"chapters-interactive-stories","url":"https:\/\/www.igdb.com\/games\/chapters-interactive-stories","created_at":1518701107338,"updated_at":1523426892128,"summary":"Choose your story with Chapters, the interactive story game that lets you choose your path in every story. Read through pages and pages of fun interactive stories that fit your mood, from romance to suspense!\n\nChoose your story from our top collection of romance, fantasy, sci-fi, young adult, comedy, and drama series! Chapters combines a unique style of choose your own story gameplay with fiction stories that you simply can't put down!\n\nYOU get to make the choices in each story. Decide on hard life choices such as falling in love, discovering secrets, or unravelling deep mysteries! Make your choices wisely; every ending is different!\n\nChapters Features:\n- Choose your story! Dive in and start making choices that affect the overall outcome!\n- Adventures start with you choosing your name and style to reflect your personality.\n- All stories come with info directly from the author!\n\nOur exclusive collection of choose your story games include:\n\nROMANCE - ALL THE WRONG REASONS\n- Romance story unfolds when YOU have a one night stand with the city's most notorious playboy.\n- Drama unfolds after a one night stand suddenly explodes into many more nights of forbidden passion.\n- Make the choice between what’s more important – letting go of your insanely jealous boyfriend or keeping the complicated love affair going?\n\nDRAMA - PRINCE WITH BENEFITS\n- Fantasy story mixed with comedy! Play as the hopeless romantic that never seems to catch a break.\n- Make bold choices and decide how your romantic story unfolds with your almost knight in shining armor.\n- Drama arises when you find out that he's the Prince of England. For real.\n\nSUSPENSE - KIDNAPPING THE PRINCESS\n- Choose your life as a supermodel by day and a kidnapper extraordinaire by night.\n- Make the choice to play as the hero or villain who kidnaps the only heir to a whole country.\n- Make choices to pull off the biggest kidnapping ever while keeping your feelings for the Princess in check.\n\nHOLLYWOOD STORY - STARSTRUCK\n- Try surviving high school after a world-renowned actress suddenly puts her career on hold and enrolls in YOUR high school\n- Hollywood life isn’t what it seems, and you realize there's more to this media darling than meets the eye.\n- Romance is in the air, but can YOU avoid your crazy ex long enough to figure out this mess? \n\nSUPERNATURAL - HADES’ DAUGHTER\n- Your adventures start when you unearth a fateful secret about your identity.\n- Life is about choices, so you persuade your dad, Hades', to let you go on a year abroad — to Earth.\n- Choose romance and fall in love, make dangerous friends and powerful enemies, and battle monstrous mortals and devious demons.\n- In your adventures, will you find out who you really are and return to the underworld a hero — or at all?\n\nROMANCE - BAD BOY BLUES\n- Your life choices led to you becoming a master at playing the piano and fleeing problems.\n- These choices lead you to Adriano, a brooding mob boss, who steals your heart and the rest of you.\n- Romance blossoms and you decide to jazz things up and stand your ground.\n- Have your life choices made you tough enough to rescue your handsome kidnapper and make the murderous rival family dance to your tune?\n\nAnd more interactive story games with fun choices!\n\nChapters: Interactive Stories will bring a unique and fun twist to choose your own story adventures. Whether you're an avid reader of drama, comedy, fantasy, sci-fi, young adult, romance, or even a gamer, you’ll love making choices in this interactive story game!\n\nDownload Chapters today to discover the unforgettable stories where YOU get to make the crucial choices.\n\nPlease note that Chapters: Interactive Stories is an online game that requires an internet connection to play.\n\nFollow us on: facebook.com\/ChaptersInteractiveStories","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[75102,49414,25636,74378,25311,26145,44242,75398,36608,28465],"tags":[268435468,268435469],"category":0,"genres":[12,13],"first_release_date":1507852800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1507852800000,"region":8,"human":"2017-Oct-13","y":2017,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o3g3ojbcxvbl3jmc5jlx.jpg","cloudinary_id":"o3g3ojbcxvbl3jmc5jlx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ntayeeq58d4wtbzfsaua.jpg","cloudinary_id":"ntayeeq58d4wtbzfsaua","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ekwdu3kkrb4wvjfs6cir.jpg","cloudinary_id":"ekwdu3kkrb4wvjfs6cir","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wqwxruuyboqkybfl9b7z.jpg","cloudinary_id":"wqwxruuyboqkybfl9b7z","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qv67wzkjdglavudgf8jb.jpg","cloudinary_id":"qv67wzkjdglavudgf8jb","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ciklhz6ky3clju7fwohy.jpg","cloudinary_id":"ciklhz6ky3clju7fwohy","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/onvw3wf0zr5pnzi5duy1.jpg","cloudinary_id":"onvw3wf0zr5pnzi5duy1","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/enxi5npkytk1rldeilkl.jpg","cloudinary_id":"enxi5npkytk1rldeilkl","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jseglbf66ibvf7jkdpje.jpg","cloudinary_id":"jseglbf66ibvf7jkdpje","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yp1imwwaw5qxwyjiswvi.jpg","cloudinary_id":"yp1imwwaw5qxwyjiswvi","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fjhc1kz5nxddy56gcxl7.jpg","cloudinary_id":"fjhc1kz5nxddy56gcxl7","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/chapters-interactive-stories\/id1277029359?mt=8&uo=4"}]}