{"id":17748,"name":"Unlimited Escape 2","slug":"unlimited-escape-2","url":"https:\/\/www.igdb.com\/games\/unlimited-escape-2","created_at":1455281896758,"updated_at":1523435131657,"summary":"'Unlimited escape 2' is an action \/ strategy game with unpredictable dynamics. \n \nThe adventure of our hero continues beyond the legend, with new scenarios and dangers! \nThe protagonist of the game will walk and explore endless mazes procedurally generated and will have a single mission: to save the prisoners scattered in the path leading them to the point of rescue. \n \nThe main character must also defend these prisoners from the enemies that appear in every part of the playing field. The main feature of the game is the complete procedural generation of scenarios and lighting, which allows an unlimited variety of play. With the advance of the levels, the game scenarios are becoming larger and intricate, with ever greater dangers. The number of game levels is unlimited, and the game stores statistics and many score rankings to increase the charm and challenge. \n \nThe aim of the game is to save a number of prisoners in the maze of each level, and to do this you have to group them and bring them to a save point placed randomly within the maze. In the path appear enemies that chase you and kill the prisoners who need to save. When you will shoot the enemies you have to be careful not to kill the prisoners to save. The groups of prisoners are scattered randomly in the path of each level, and to find them you'll have to explore the maze by seeking help from the map on the top screen. Enemy bases are scattered randomly in the path, and these bases are colored red. The save point instead is colored blue. \n \nEach level is a maze that is always different, unpredictable and randomly generated, as well as lights and lighting used in the level. In this way the game dynamics are always new. The number of levels is infinite, as well as the score that can be achieved. Are stored up to 100 high scores and statistics, so we challenge everyone to become legends and heroes! With the advance of the levels, the game gets bigger, richer and difficult. The number of enemy bases increase with advancing levels, as the number of prisoners to be saved.","collection":2114,"popularity":1.333333333333333,"games":[40524,34919,76438,16468,68324,37022,25640,55289,75158,32902],"tags":[1,268435488],"developers":[146],"publishers":[8666],"category":0,"game_modes":[1],"themes":[1],"genres":[32],"first_release_date":1425340800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1425340800000,"human":"2015-Mar-03","y":2015,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hxom3d54awmrsowzxyod.jpg","cloudinary_id":"hxom3d54awmrsowzxyod","width":1275,"height":719},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hsstlzerjjpmfymidxc6.jpg","cloudinary_id":"hsstlzerjjpmfymidxc6","width":1275,"height":713},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tckxyosnbpakgqjytyfr.jpg","cloudinary_id":"tckxyosnbpakgqjytyfr","width":1279,"height":715},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cmkevrehunnqrfekgrq0.jpg","cloudinary_id":"cmkevrehunnqrfekgrq0","width":1275,"height":719},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rk8mg5xlguu5wvslbffu.jpg","cloudinary_id":"rk8mg5xlguu5wvslbffu","width":1273,"height":719}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/urdeqfkw8kwivqt6yzg7.jpg","cloudinary_id":"urdeqfkw8kwivqt6yzg7","width":555,"height":556},"websites":[{"category":1,"url":"http:\/\/www.indiedb.com\/games\/unlimited-escape-2"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/318560"}],"external":{"steam":"318560"}}