{"id":28148,"name":"Seeking Evil: The Wendigo","slug":"seeking-evil-the-wendigo","url":"https:\/\/www.igdb.com\/games\/seeking-evil-the-wendigo","created_at":1492358145803,"updated_at":1523363987226,"summary":"\"This game will creep up your spine and get to your mind! Symptoms such as anxiety, increased heart rate and shivering will occur. This game is not for the sensitive type, but for those who are willing to explore the facets of fear!       \n       \nTHE LEGEND       \nThe Wendigo is a savage predator that craves human flesh and prefers to eats its victims alive. It's cursed to roam the tribal grounds of North America and is part of the traditional belief system of a number of Algonquin-speaking peoples. Although we don't know where it came from and descriptions can vary, one thing is certain: it is evil, cannibalistic, has an unending hunger and won't be satisfied after killing and consuming one victim.       \n       \nThis creature is intelligent, agile, possesses supernatural strength, has enhanced senses and excels in stealth. The combination of these abilities allows it to stalk its victims without being noticed and once it has you in sight it's probably already too late.       \n       \nCONTROLS       \nFor the best experience we advise to play Seeking Evil while standing. In the case that you prefer to play it while seated it’s strongly recommended to use a non-vr controller or the good old keyboard and mouse set-up.         \n       \nControls for keyboard and non-vr controllers are really straight-forward, but how will Seeking Evil: The Wendigo be played in VR? Let’s have a look:       \n       \nTo ensure a more immersive experience Seeking Evil doesn't rely on a point teleportation system for locomotion and the trackpad (Vive) or the analog stick (Oculus) of the left controller are used.       \n       \nIn order to sprint you can press the trackpad (Vive) or the analog stick (Oculus) of the left controller. There will also be situations where you’re chased by the Wendigo, here shaking the vr controllers as if you were running will allow you to increase your speed even more which might be a matter of life or death.       \n       \nSince using stealth is important to succeed in burning all the totems; sometimes ducking will be advised to hide from the Wendigo.        \n       \nFinally there are also a couple handheld items which can be easily picked up by aiming your hand towards an item which will then snap to your hand. Once an item is picked up it can be mounted on your belt for later use.       \n       \nGAMEPLAY       \nYou'll find yourself stranded in the creepy forests of North America. Things might seem peaceful, but don't be fooled as these grounds are cursed. To break the curse you'll need to find and burn nine totems. That's only the beginning since these haunted forests are home to a legendary creature called The Wendigo. This bloodthirsty predator is fast, smart, has great senses and will do everything it can to eat you alive.        \n       \nYou'll have to combine stealth with tactical timing to outsmart the Wendigo. Oh, and when it attacks, don't be a hero ... just RUN!\"","storyline":"\"Deep in the cursed forests of North America you're being haunted by a bloodthirsty predator. Outsmart the Wendigo and live, be reckless and face certain death!\"","rating":50,"popularity":1.333333333333333,"total_rating":50,"total_rating_count":0,"rating_count":0,"games":[37419,36334,25646,26658,27266,80916,31712,102178,11596,25311],"tags":[1,19,43,268435487,268435488,1073741831,1073741825],"developers":[9097],"publishers":[9097],"game_engines":[404],"category":0,"player_perspectives":[1,7],"game_modes":[1],"themes":[1,19,43],"genres":[31,32],"first_release_date":1493164800000,"status":4,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1493164800000,"region":8,"human":"2017-Apr-26","y":2017,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tytz7fciclnfc1jx7v9x.jpg","cloudinary_id":"tytz7fciclnfc1jx7v9x","width":1879,"height":1022},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rdowmkpjv62lpjzr2yy5.jpg","cloudinary_id":"rdowmkpjv62lpjzr2yy5","width":1879,"height":1022},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lnaljpf2thnex5ier6p5.jpg","cloudinary_id":"lnaljpf2thnex5ier6p5","width":1879,"height":1022},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mbhgool7euk2fk1npd72.jpg","cloudinary_id":"mbhgool7euk2fk1npd72","width":1879,"height":1022},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ahi0xdqqnciu6heycweg.jpg","cloudinary_id":"ahi0xdqqnciu6heycweg","width":1920,"height":1028}],"videos":[{"name":"Trailer","video_id":"-gRcgpXsFDw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vzkazgkr2zqaosv8flsb.jpg","cloudinary_id":"vzkazgkr2zqaosv8flsb","width":1863,"height":1064},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/571340"},{"category":5,"url":"https:\/\/twitter.com\/Seeking_Evil"}],"external":{"steam":"571340"}}