{"id":36448,"name":"Just Cause 3: XL Edition","slug":"just-cause-3-xl-edition","url":"https:\/\/www.igdb.com\/games\/just-cause-3-xl-edition","created_at":1495895572468,"updated_at":1515493988990,"summary":"The XL Edition is Just Cause 3 plus the Air, Land & Sea Expansion Pass plus exclusive day one Flame Wingsuit And Parachute Skins for one great price. \n \nWith over 1000 km² of complete freedom from sky to seabed, Rico Rodriguez returns to unleash chaos in the most creative and explosive ways imaginable. \n \nThe Mediterranean republic of Medici is suffering under the brutal control of General Di Ravello, a dictator with an insatiable appetite for power. Enter Rico Rodriguez, a man on a mission to destroy the General´s hold on power by any means necessary. With over 400 square miles of complete freedom from sky to seabed and a huge arsenal of weaponry, gadgets and vehicles, prepare to unleash chaos in the most creative and explosive ways you can imagine. \n \nThe Air, Land and Sea Pass includes 3 incredible DLC packs and exclusive Flame Wingsuit and Parachute Skins, which no fan will want to miss! \n \nIt´s never over for Rico Rodriguez; explore Medici with 3 new game-changing explosive experiences including new action-packed missions, new enemy types, weapons, gadgets and unique vehicles that transform the Just Cause 3 world. \n \nThe 3 add on packs will become available post launch and will unlock 7 days early for all pass holders. The skins will unlock day one.","collection":111,"popularity":1.333333333333333,"version_parent":8187,"version_title":"XL Edition","games":[23175,37088,37022,55289,59516,25300,25646,42080,44191,12579],"tags":[1,38,268435487],"category":0,"themes":[1,38],"genres":[31],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fkbzdrqw21b8n0h3ukup.jpg","cloudinary_id":"fkbzdrqw21b8n0h3ukup","width":547,"height":719},"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}