{"id":41548,"name":"Computer Golf","slug":"computer-golf","url":"https:\/\/www.igdb.com\/games\/computer-golf","created_at":1498824050048,"updated_at":1515746766893,"summary":"Press 1, 2, 3, or 4 on the alpha-numeric keyboard to correspond with the number of players. \n \nThe first hole and an electronic golfer will appear on the screen. The number at the top right of the screen indicates the hole being played. The player's scores will appear at the top left of screen in order of play. The first player's score will be farthest left. The fourth player's score will be at the farthest right. If you are playing on a color TV, the color of your score will match the color of your electronic golfer. \n \nOnce the ball is on the green (the lighter geometric segment of the course) the TV picture will automatically change to a close-up of the green so that the electronic golfer can putt out. \n \nThe trees on the course are hazards and will stop the flight of the ball. A drive into the trees will elicit a very human reaction from the electronic golfers. \n \nThe dark area outside the course is the \"rough.\" A ball must be hit back on the course when it's in the \"rough.\" The golfers cannot drive through the rough to get to the green. \n \nEach golfer plays through the entire hole before it is the next golfer's turn. \n \nUse the joy stick of the hand control units to walk the electronic golfers around the course. The left hand control is shared by players 1 and 3. The right hand control is shared by players 2 and 4. The direction of the joy stick controls the direction the electronic golfers will walk. They will walk in all vertical, horizontal and diagonal directions in accordance with the joy stick's position. \n \nThe toe of the club must overlap the ball at the start of the backswing. The action button on the hand control unit controls the swing of the club. Press down to start the backswing. The longer you press the action button, the higher the backswing. The distance traveled by the ball is determined by the length of the backswing. If you bring the backswing full circle, the club will release automatically, and the distance the ball travels will be random. Release the action button to hit the ball. The backswing of the club will always be clockwise, and the downswing will always be counter-clockwise. The direction taken by the ball will be dependent on the golfer's position in relation to it. It will be perpendicular to the angle of the toe of the club when it makes contact with the ball. \n \nYou can walk your electronic golfer away from the ball and take a practice swing to confirm direction. There is no stroke penalty for this. If you are addressing the ball and starting your backswing, but wish to change the position of your electronic golfer - simply walk him away from the ball and release the action button. There is no penalty \n \nThe player with the lowest score for the nine holes is the winner. \n \nTo play again, press the RESET key on the console and then press 1, 2, 3 or 4 on the alpha-numeric keyboard. \n \nCOMPUTER GOLF! Nine holes. Par 36 \nHole 1 - Par 4 \nHole 2 - Par 4 \nHole 3 - Par 3 \nHole 4 - Par 4 \nHole 5 - Par 5 \nHole 6 - Par 3 \nHole 7 - Par 4 \nHole 8 - Par 5 \nHole 9 - Par 4","popularity":1.666666666666667,"games":[12363,61239,41429,4284,22690,20807,18008,4192,72175,54662],"tags":[268435470,536870942,536872078,536875627,536875824],"category":0,"keywords":[30,1166,4715,4912],"genres":[14],"first_release_date":255139200000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":255139200000,"region":8,"human":"1978-Feb-01","y":1978,"m":2}],"alternative_names":[{"name":"Computer Golf","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s1zpq0cyefrius8pt1ij.jpg","cloudinary_id":"s1zpq0cyefrius8pt1ij","width":370,"height":482}}