{"id":78448,"name":"The Legend of Sword and Fairy 2","slug":"the-legend-of-sword-and-fairy-2","url":"https:\/\/www.igdb.com\/games\/the-legend-of-sword-and-fairy-2","created_at":1513538929257,"updated_at":1515849686153,"summary":"The Legend of Sword and Fairy 2 is an action role-playing game developed by the DOMO group (known for its role in developing the Xuan-Yuan Sword video game series) and the now defunct Crazy Boys group under the Taiwanese company Softstar Entertainment. It is the second installment in The Legend of Sword and Fairy (or Chinese Paladin) video game series, and serves as a sequel to the first game. The game incorporates elements of wuxia, shenmo and fantasy.","storyline":"The story is set eight years after the ending of the first game. Wang Xiaohu, a boy from the same hometown as Li Xiaoyao (the protagonist of the first game), has reached the age of 18. When he was still a child, he was impressed by the story of how Li braved danger to seek a cure for his ill aunt, and has since looked up to Li as an idol. Although he did not have an opportunity to learn from Li, he still hopes to become a great hero one day. Wang inherits his master's priced weapon, the Demon Blade, and sets off on his own adventure. He meets the three female protagonists; Li Yiru, Su Mei and Shen Qishuang. Li is the daughter of Li Xiaoyao and Zhao Ling'er; Su (appeared as a nameless baby fox in the first game) is the daughter of a serpent demon and a vixen demon, and she vows to avenge her parents, who were killed by Li Xiaoyao and Lin Yueru; Shen is a new character who has no apparent connections to the first game. \n \nIn the meantime, China is in a state of chaos, as demons have been roaming the land unchecked ever since the Demon Prison Tower collapsed in the first game. A monk called Master Qianye appears and recruits followers to form a sect known as the \"Great Merciful Sect\" to counter the demons and save the people. This sect, along with the Mount Shu Sect (now led by Li Xiaoyao), are seen as the pillars of righteousness in the jianghu. On the other hand, Kong Lin, an assistant of the Lord of Demons, seeks to retrieve three treasures and put them together, in order to resurrect the Lord and allow demons to dominate the world. \n \nThe four protagonist set foot into the dangerous world of the jianghu, where they will discover secrets of their past, understand the meaning of forgiveness and love, and join the battle between good and evil.","collection":69,"franchise":1176,"franchises":[1176],"popularity":2,"games":[13196,16468,19698,5613,28010,36792,26268,49414,26163,22480],"tags":[17,268435468,268435472],"developers":[14085],"publishers":[14085],"category":0,"game_modes":[1],"themes":[17],"genres":[12,16],"first_release_date":1043539200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1043539200000,"region":6,"human":"2003-Jan-26","y":2003,"m":1}],"alternative_names":[{"name":"Xianjian Qixia Zhuan 2","comment":"Chinese title"},{"name":"Chinese Paladin 2","comment":"Acronym"},{"name":"Xiānjiàn Qíxiá Zhuàn Èr","comment":"Chinese title"},{"name":"仙剑奇侠传二","comment":"Chinese title"},{"name":"仙劍奇俠傳二","comment":"Chinese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kswkyqdhqllbqmg3v1ca.jpg","cloudinary_id":"kswkyqdhqllbqmg3v1ca","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nqzye7svu1dvdl3tb0la.jpg","cloudinary_id":"nqzye7svu1dvdl3tb0la","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hyavgmzaerewi0obpoyz.jpg","cloudinary_id":"hyavgmzaerewi0obpoyz","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dkwjsw6xpkpw5tf7aqtk.jpg","cloudinary_id":"dkwjsw6xpkpw5tf7aqtk","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ohazpzrkqoynoitw7r1f.jpg","cloudinary_id":"ohazpzrkqoynoitw7r1f","width":640,"height":480}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/slz1uchkidutdszmr5nm.jpg","cloudinary_id":"slz1uchkidutdszmr5nm","width":800,"height":1129}}