{"id":86648,"name":"Shadows of Her Past","slug":"shadows-of-her-past","url":"https:\/\/www.igdb.com\/games\/shadows-of-her-past","created_at":1518302853043,"updated_at":1518302884430,"summary":"\"Shadows of Her Past, is a story-driven action role-playing game (ARPG) set to expand upon the events that occurred prior to Elette. For nearly a half of a century Enchantress Hermielle of the Order has been imprisoned behind the forces of an anti-spectral barrier. Unable to force her way to freedom, her only escape is to visit the memories of her past. It’s not until she is visited by a new, yet oddly familiar face does the glimmer of freedom appear, but of course it comes with a price. \n \nShadows of Her Past sends the player into the twisted and corrupted fragments of Hermielle’s memories as she battles between her past decisions and her conscience. Experience several of Pylotha’s most influential moments in history as told by Enchantress Hermielle’s point of view. With each memory digging deeper into her subconscious, the events that made her who she is today come to light.\"","storyline":"\"Since the conclusion of the Reaper Wars nearly a half a century ago, life has dramatically changed for those living in the Nation of Lotte. The landscape now shattered, their buildings drowned, and the beloved Queen Hermielle gone; a martyr to their freedom. Although challenging, the citizens of Lotte managed to adapt to their new lifestyle under the lead of Mathias Tillington. What little they knew that their Queen survived, and not just through their bard’s tales. Beneath the town of Kaepe she slumbered, banished and betrayed by the ones she once considered friends, separated from the beauties and colors of life she had once taken for granted. There she has sat for the last fifty years, unaware that the forces of darkness she once thought defeated were slowly creeping into her mind.\"","popularity":1,"tags":[1073741827],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[283],"themes":[1,17],"genres":[12],"status":3,"pulse_count":1,"platforms":[6,14,3],"release_dates":[{"category":7,"platform":3,"region":8,"human":"TBD"},{"category":7,"platform":14,"region":8,"human":"TBD"},{"category":7,"platform":6,"region":8,"human":"TBD"}],"websites":[{"category":1,"url":"http:\/\/www.theindieaccord.com\/sohp\/"}]}