{"id":13434,"name":"BraveStarr","slug":"bravestarr","url":"https:\/\/www.igdb.com\/games\/bravestarr","created_at":1444681299787,"updated_at":1513073838369,"summary":"Nuevo Texas, gran planeta árido, es donde se encuentra Kerium Secum. Este sustancia, la más importante del universo, es la que hace que funcione la Tierra. Desde su descubrimiento en Nuevo Texas han ido hasta allí muchos buscadores de tesoro esperando poder hacerse ricos. Pero también han ido personajes con peores intenciones... Pronto un tal Tex Hex y su cohorte de malvados se adueñaron del territorio, sembrando el terror. Tex está bajo la influencia de Stampede, espíritu que data del tiempo cuando Nuevo Texas era habitado sólo por dinosaurios. Lo que pretende Stampede es dar vida a los restos óseos esparcidos por doquier, y volver a mandar sobre la árida superficie. Para ello tiene que exprimir la magia del \nanciano indio Shamen. Stampede ha capturado a Shamen y le tiene preso. \nEl buenazo del Sheriff, Bravestarr, educado precisamente por Shamen cuando era niño, ha decidido perseguir a Tex Hex, destruir a Stampede y rescatar a Shamen. Ya que encarnas al sheriff, tu misión es sencilla: rescata a Shamen y liberarás a todo Texas de las garras de Stampede. Si entras en los bares y otros edificios de Fort Kerium podrás obtener información y resolver enigmas que te llevarán eventualmente a tu encuentro decisivo con Stampede. \nLa información no es fácil conseguirla, por lo que deberás cambiar objetos recogidos por dinero con el que podrás sobornar a la gente. Vete a los sitios indicados en el mapa que está en tu cohete y explora todo el planeta. Busca especialmente unos amuletos, dejados por tus enemigos y que incrementarán tu poderío de disparo, o congelarán el tiempo durante unos segundos. \nDurante los nueve días que durará tu búsqueda, el Sol se levantará y se pondrá muchas veces. Ten cuidado con las bombas que te mandarán a paseo.","franchise":687,"franchises":[687],"popularity":1.333333333333333,"games":[68287,28029,10039,76229,36950,27523,142,76723,19174,64204],"tags":[1,18,268435461,268435464,536871037,536871937,536872961,1073741828],"developers":[1098],"publishers":[7093],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[125,1025,2049],"themes":[1,18],"genres":[5,8],"first_release_date":567907200000,"platforms":[15,26,25],"release_dates":[{"category":2,"platform":26,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":15,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":25,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vv1mcx86iyv5lbhobxtd.jpg","cloudinary_id":"vv1mcx86iyv5lbhobxtd","width":1436,"height":1823}}