{"id":14234,"name":"Akira","slug":"akira--1","url":"https:\/\/www.igdb.com\/games\/akira--1","created_at":1445766852360,"updated_at":1515754460139,"summary":"2019 Neo-Tokyo is about to explode! 30 years after World War 3, Kyoko a mutant child tells of the approaching cataclysm. The colonel stored capsule 7, which contains mutation 28, better known as Akira, deep below the Olympic Stadium at a temperature close to absolute zero. When Tetsuo makes his way to the stadium and the Akira pattern becomes stronger, it is confirmed that Akira's brain is giving off psionic waves! Keneda and Resistance member Kei make their way through the sewers where they are attacked by the military and flying bikes. Keneda manages to grab a bike and flies away, taking Kei on the back. They make their way through the tunnels guided by Kyoko, who has possessed Kei in order to use her to fight against Tetsuo. Tetsuo is taken by the authorities and experimented upon by the team that lead the Akira project. A matching pattern is found between Tetsuo and Akira and as the experiment continues, Tetsuo mutates and is now out of anyone's control. Tetsuo escapes from the hospital blasting everything in his path with psionic energy. Take the role of Keneda- leader of the capsule gang and Tetsuo- childhood friend of Keneda and member of the gang in this incredible game based on Akira. Keneda is the leader of the capsules. His bike is the envy of all. Keneda leads the gang against their rivals, the clowns. During a battle between the gangs, Tetsuo, Keneda's childhood friend, loses control of his bike and just misses hitting one of the escaping mutant children. Tetsuo thinks he can control his new powers but he is wrong. Tetsuo mutates into a hideous blubbery mass. Tetsuo is totally out of control. The mutant children beg Akira to return and save them and the world from what Tetsuo has become. Keneda must battle Tetsuo in their final confrontation.","collection":4529,"franchise":62,"franchises":[62],"popularity":1.333333333333333,"games":[1877,28856,25311,28029,68287,51464,25300,19419,36662,36950],"tags":[1,18,268435466,268435489,536871015,536872229,536875054,536875069,536875222,536875736,536876241,536876391,536876495,536876712,536876996,1073741828],"publishers":[1154],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[103,1317,4142,4157,4310,4824,5329,5479,5583,5800,6084],"themes":[1,18],"genres":[10,33],"first_release_date":788832000000,"platforms":[114,16],"release_dates":[{"category":2,"platform":114,"date":788832000000,"human":"1994","y":1994,"m":12},{"category":2,"platform":16,"date":788832000000,"human":"1994","y":1994,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ytro9acdrilt5k1e7mc7.jpg","cloudinary_id":"ytro9acdrilt5k1e7mc7","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dsfbfxena4tno4ercdmb.jpg","cloudinary_id":"dsfbfxena4tno4ercdmb","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jgtbgzjtbbj42e7jgfd5.jpg","cloudinary_id":"jgtbgzjtbbj42e7jgfd5","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/reyqgstxzdyiellqsd5v.jpg","cloudinary_id":"reyqgstxzdyiellqsd5v","width":640,"height":821}}