{"id":14834,"name":"Loki: Heroes of Mythology","slug":"loki-heroes-of-mythology","url":"https:\/\/www.igdb.com\/games\/loki-heroes-of-mythology","created_at":1449447711113,"updated_at":1517271073449,"summary":"A fantasy voyage through the great mythologies, Loki allows the player to take on the role of one of the four heroes of the game, each drawn from a different mythology: a mighty Norse fighter, a fierce Greek warrior, a powerful Egyptian magician or an Aztec shaman who masters the secrets of the spirit world.\n\nWhatever hero the player adopts, he must come to the aid of the gods he worships. He will come to realize that behind the chaos that is threatening his world lies Seth, the Egyptian god of darkness and evil, who has returned from the kingdom of the dead.\n\nThe hero must therefore undertake an epic journey across the various epochs and myths. He will fight a multitude of monsters of all shapes and sizes, and even overthrow a few gods, on his way to preventing Seth establish his wicked reign.\n\nAn epic adventure across four great mythologies - Aztec, Egyptian, Greek and Norse - allowing the player to live through many of the key episodes that mark these cultures (the siege of Troy, Ragnarok, ......) and setting him in the path of the most prominent figures within each episode (Achilles, Thor, Akhenaton...).\n\nChoose from four different heroes with radically different attributes and powers. Each hero has a vast array of spells and skills to help him through his quest.\n\nInnumerable story lines through random generation of decors and items, so that nobody lives the same experience and allowing the game to be played many times without the hero ever having the same set of weapons, armour or spells.","popularity":3.666666666666667,"aggregated_rating":59,"aggregated_rating_count":1,"total_rating":59,"total_rating_count":1,"games":[36198,55092,28168,22747,2933,22387,27092,28309,68441,13555],"tags":[1,41,268435468,536871138,536871139,536871208,536871865,536871938,536872070,536872151,536872425,536872647,536873066,536875046,536875304,536875331,536875793,536875803,536875830,536875891,536877628,536883035,1073741826],"developers":[404],"publishers":[110],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[226,227,296,953,1026,1158,1239,1513,1735,2154,4134,4392,4419,4881,4891,4918,4979,6716,12123],"themes":[1,41],"genres":[12],"first_release_date":1188950400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1188950400000,"human":"2007-Sep-05","y":2007,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hz5ngkjiyneporrik4xf.jpg","cloudinary_id":"hz5ngkjiyneporrik4xf","width":768,"height":1087},"esrb":{"rating":6}}