{"id":18534,"name":"Mines of Minos","slug":"mines-of-minos","url":"https:\/\/www.igdb.com\/games\/mines-of-minos","created_at":1459353228790,"updated_at":1517270910744,"summary":"You are a robot - the last \"survivor\" in the mines of Minos. In order to still win against the overwhelming enemy you must collect robot spare parts to build yourself a small army. In order to achieve this you rummage through the maze-like mines in search for the spare parts while the enemy is hunting you. You can kill your pursuers in dropping a grenade but have to keep in mind that you only can drop one grenade at a time. After the enemy is killed it will respawn somewhere in the maze. After having found a spare part you must carry it to a predesignated safe place. You can move to different levels in the mine while pressing the joystick button and leaving the screen through the exits on the left and right sides of the screen. In order to win the game you have to get level five where you have to run into three stationary enemies. To accomplish this, you need at least two spare robots, since you will destroy one of yours every time you hit one of the three targets. \n\nThe two-player mode lets one player control the robot and the other player an enemy. However, running into the robot will cause player two to lose, except he takes control of another monster shortly before the impact by pressing the joystick button, hoping player one will run into the just release enemy.","popularity":1.333333333333333,"games":[28029,76731,25311,68287,71455,51485,36794,36950,36608,25300],"tags":[1,18,268435480,268435489,1073741827],"developers":[9476],"publishers":[9476],"category":0,"player_perspectives":[3],"game_modes":[1,2],"themes":[1,18],"genres":[24,33],"first_release_date":410140800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wwiui39alvfzdk1ibqud.jpg","cloudinary_id":"wwiui39alvfzdk1ibqud","width":1000,"height":1355}}