{"id":19134,"name":"Spider-Man Unlimited","slug":"spider-man-unlimited","url":"https:\/\/www.igdb.com\/games\/spider-man-unlimited","created_at":1462998222429,"updated_at":1529070047301,"summary":"Spider-Man Unlimited is an endless runner video game developed and published by Gameloft; it is based on the Marvel Comics superhero Spider-Man. The player controls the title character and his alternate versions during his fight against the members of the Sinister Six and their multiverse counterparts. The game's main mode features definitive goals in contrast to the traditional aim of running as far as possible. The game is also known for having regular, special, time-limited, community events. \n \nFirst announced in June 2014, Spider-Man Unlimited was released for Apple iOS, Android OS and Windows Phone on September 10, 2014. Starting in October 2014, Gameloft released seven updates that added new chapters to the story mode, Spider-Men and Spider-Women, enemies, events and stages. Since its release, it has been downloaded 30 million times and has been well received by gaming critics. Reviewers praised the game's controls, sound, animation and the variety of characters, while criticizing its energy system, which they considered a limit to the playability.","storyline":"After Spider-Man defeats a figure known as the Gold Goblin, Nick Fury tells him the Green Goblin has used a portal to assemble a multiverse Sinister Six and plans to take over Spider-Man's dimension. S.H.I.E.L.D. then used the portal to take alternative versions of Spider-Man to aid the battle. Spider-Man pursues the Goblin and his alternative versions Gold Goblin, Grey Goblin, Menace and House of M Goblin. After he defeated his arch-enemy's alternative versions, Spider-Man fights various Vultures; Classic Vulture, Ultimate Vulture, Red Vulture, Dark Vulture; Electro and his alternatives versions Classic Electro, Ultimate Electro, Modern Electro and Pure Energy Electro; Sandman and his alternate versions Classic Sandman, Noir Sandman, Dark Sandman and Pure Sand Sandman; Doctor Octopus, Classic Doctor Octopus, Chapter One Doctor Octopus, Noir Doctor Octopus and Ultimate Doctor Octopus; and Mysterio, Classic Mysterio, Superior Mysterion, Dark Mysterio and Mysterion, as well as the Sinister Soldiers—armored soldiers working for the Multiverse Sinister Six.","collection":3147,"franchise":151,"franchises":[151],"popularity":4,"games":[6285,36950,4755,81249,75235,37016,23733,96437,76888,19448],"tags":[1,268435481,268435487,536870926,536871894,536873297,536873299,536873300,536874452,536875046,536875054,536875178,536875222,536875574,536875585,536875722,536875819,536876227,536876296,536876932,536877946,536880361,536880584,1073741826],"developers":[61],"publishers":[61],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[14,982,2385,2387,2388,3540,4134,4142,4266,4310,4662,4673,4810,4907,5315,5384,6020,7034,9449,9672],"themes":[1],"genres":[25,31],"first_release_date":1410307200000,"platforms":[74,34,39],"release_dates":[{"category":0,"platform":39,"date":1410307200000,"region":8,"human":"2014-Sep-10","y":2014,"m":9},{"category":0,"platform":34,"date":1410307200000,"region":8,"human":"2014-Sep-10","y":2014,"m":9},{"category":0,"platform":74,"date":1410307200000,"region":8,"human":"2014-Sep-10","y":2014,"m":9}],"alternative_names":[{"name":"蜘蛛侠：极限","comment":"Other"},{"name":"스파이더맨 언리미티드","comment":"Other"},{"name":"スパイダーマン・アンリミテッド","comment":"Other"},{"name":"Совершенный Человек-Паук","comment":"Other"},{"name":"Homem-Aranha Sem Limites","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oq8zlxivldyretsyvwdw.jpg","cloudinary_id":"oq8zlxivldyretsyvwdw","width":175,"height":173}}