{"id":36934,"name":"Omen: Flesh Metal & Magic","slug":"omen-flesh-metal-and-magic","url":"https:\/\/www.igdb.com\/games\/omen-flesh-metal-and-magic","created_at":1497098811289,"updated_at":1513086756635,"summary":"Omen is an indie real-time strategy trading card game. This will be released as free to play game for PC. Alternative platforms are being considered.  \n \nThis game is designed to accommodate the best mechanics of real-time strategy and trading card game. Giving the players the ability to level up cards while using the spells on a real time 3d board.  \n \nWebsite:    OccultMedia.us \n \nPatreon:    Patreon.com\/OccultMedia","storyline":"The realm of Ula, a battlefield for 6 great Kingdoms, once was home to the Ulans. As their kingdoms grew, many leaders took to greed and corruption  to fulfill their thirst for power. War broke out, factions separated and became isolated as they slayed one another, creating more efficient means at eliminating the enemy. Out of the war came great users of magic and alchemy. Machines were created to house and harness this magic and as the war darkened, a solitary warlock sought to end the war. Creating the first Omen Gates, monsters spewed forth from the darkest corners of existence. The Sakura, demonic creatures of darkness, slayed hundreds of thousand. The war over, but an extermination began. Soon the Sakura overthrew their magical overlords, as the last kingdoms fell the few remaining leaders united. Congregating alchemists, mechanics, and magicians alike they forged new magical war machines. Magical walls and living forests to defeat the Sakura. Though considered a victory the Sakura were never removed. With the war never won, the Ulan united kingdom soon split.  \n \n\tThe Ulan kingdom remained in control of Beasts of war and powerful warlocks. The naturalists sought to defend, creating more living vegetation to defend them. The alchemists rummaged through the wreckage of the war piecing together contraptions capable of wielding magic. Those who sought purity and righteousness secluded themselves training pious Knights with powerful healing and protection magic. There were those who found that many of the departed were still with us, they tore into the Veil in search of truth but found only woe. These mages who delved into the Astral Plane became corrupt and vengeful as the spirits were around them. Eventually striking out at others with spectral warriors and reapers.","collection":2779,"franchise":1031,"franchises":[1031],"popularity":1.333333333333333,"games":[30229,103303,6414,6985,99118,25877,54775,103282,18879,81249],"tags":[17,268435467,536871415,536871438,536872838,536874750,1073741827],"developers":[12915],"publishers":[12915],"game_engines":[404],"category":0,"player_perspectives":[3],"game_modes":[2],"keywords":[503,526,1926,3838],"themes":[17],"genres":[11],"status":2,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cqerqcrbqxnkfyo4ln4v.jpg","cloudinary_id":"cqerqcrbqxnkfyo4ln4v","width":840,"height":736},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ehad9wowrhxkz0aovqj0.jpg","cloudinary_id":"ehad9wowrhxkz0aovqj0","width":972,"height":736},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/quqxibkq1qspyw24c42h.jpg","cloudinary_id":"quqxibkq1qspyw24c42h","width":972,"height":736}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sy2082xtwekqxjdwhbxr.jpg","cloudinary_id":"sy2082xtwekqxjdwhbxr","width":760,"height":258},"esrb":{"synopsis":"Violence","rating":4},"pegi":{"synopsis":"Fantasy Violence","rating":2},"websites":[{"category":4,"url":"https:\/\/www.facebook.com\/Omen-Flesh-Metal-Magic-456831198017151"},{"category":1,"url":"http:\/\/OccultMedia.us"}]}