{"id":41734,"name":"Star Virgin","slug":"star-virgin","url":"https:\/\/www.igdb.com\/games\/star-virgin","created_at":1498829886662,"updated_at":1516563066759,"summary":"Star Virgins about as obscure as it comes, its a promotional hour long straight to video film from Japan. That was made to promote a little seen videogame of the same name distributed by Activision that only ever appeared on the long forgotten msx system. \n \nPlays out pretty much like a bonkers live action anime movie. Its a camp science fiction fantasy comedy about a girl whose secretly the lone fighter of justice Star Virgin, its her pursuit to stop the planet being attacked from robotic & puppet monsters, giant spiders and whatever else would warrant as being an end of level boss in an 80s video game... at least I think thats the overall idea, because its obviously never been translated into English its hard to totally fathom out what the hells going on, but hey thats the beauty of the Japanese movies right. \n \nStar Virgin herself is every Japanorama fanboys wetdream, shes a cute pink power ranger with her own spacecraft & powerbike and she kicks ass with a bazooka. The whole thing would have made an awesome music video for The Flaming Lips - Yoshimi Battles the Pink Robots (what I'm oddly playing while writing this). Sure its none essential throwaway stuff, but its a fun hour even without knowing what they're saying. \n \n[Personal Reasons For Remembering] \nReally loved the spacecraft scenes complete with their robotic butler drivers and its not every day I get to see a movie featuring a robotic Statue of Liberty and an evil genius who lives on a floating volcanic island.","popularity":1.333333333333333,"games":[70861,28010,36608,34919,19658,57372,12632,40524,23175,27209],"tags":[1,536870990],"category":0,"keywords":[78],"themes":[1],"first_release_date":570672000000,"platforms":[27],"release_dates":[{"category":0,"platform":27,"date":570672000000,"region":8,"human":"1988-Feb-01","y":1988,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m7mspuzcbcxbddwwx9h7.jpg","cloudinary_id":"m7mspuzcbcxbddwwx9h7","width":165,"height":300}}