{"id":8434,"name":"Heroes Chronicles: Masters of the Elements","slug":"heroes-chronicles-masters-of-the-elements","url":"https:\/\/www.igdb.com\/games\/heroes-chronicles-masters-of-the-elements","created_at":1420272534224,"updated_at":1517271114578,"summary":"Masters of the Elements is the third part of Heroes Chronicles, following Conquest of the Underworld and preceding Clash of the Dragons.\r\nTarnum becomes that which he hates most, a Wizard, in a hectic bid to assist the Wizards of Bracada in their quest to save the planet from the destructive Elemental Lords.","storyline":"In Masters of the Elements, a ten thousand-year truce between the Elemental Lords of Air, Earth, Water, and Fire comes to an end. The Ancestors send Tarnum to stop this feud before it destroys the material world. The only way to access the elemental planes is to take control of the last remaining Elemental Conflux in Enroth. Using the forces of Gavin Magnus, the Immortal Grand Vizier of Bracada, Tarnum conquers the last Conflux and discovers the location of the Gateway to the Clouds.\r\n\r\nUpon reaching the Plane of Air, Tarnum discovers that Shalwend, Lord of Air, has already departed his realm. When Shalwend destroys the Gateway to the Clouds behind Tarnum, Tarnum is forced to find another way to return to his world. He must become a master of all four elements before returning to Antagarich. He next travels to the Plane of Water where he learns that Acwalander, the Water Lord, has left his realm as well.\r\n\r\nIn the Plane of Earth, Tarnum is shocked to find that Reamus (a wizard who traveled to the plane 200 years ago) is still alive. Even stranger, only 16 years have passed on the Plane of Earth in that time. As Gralkor, the Earth Lord, has also left his plane, Tarnum and his men realize that the Elemental Lords are using the time variations between the material world and the planes in order to gain a foothold in the material world before Tarnum can return.\r\n\r\nWhile in the Plane of Fire, Reamus and Barsolar (King Magnus's cousin and advisor to Tarnum) learn of the Plane of Magic. Magic binds the elements together, so they know it will give them the advantage they will need against the Elemental Lords. After receiving the aid of the magic elementals and returning to the Plane of Fire to free the Phoenixes enslaved by Pyrannaste, Lord of Fire, Tarnum leads his army back to the material world.\r\n\r\nThirty years have passed in the world since Tarnum had left. King Magnus brings an army to support Tarnum. While they are in camp, Magnus and Tarnum exchange stories. Tarnum learns that one of his Behemoths killed Magnus centuries ago in the battle for Castle Steelhorn, and that Magnus somehow awoke to find himself immortal and later became King of Bracada. However, Tarnum finds Magnus to be arrogant and self-righteous, refusing to consort with the man. Once the Elemental Lords are defeated, Tarnum sends his elemental troops back to their planes. He coldly lets Gavin Magnus know that the elementals will never return to Antagarich (even though they later do so in Armageddon's Blade) then asks the Magic Elementals to destroy all Confluxes and all records of the elemental planes before returning to his life as a Barbarian.","collection":194,"franchise":458,"franchises":[458],"rating":41.2079151496092,"popularity":1.333333333333333,"total_rating":41.2079151496092,"total_rating_count":6,"rating_count":6,"games":[932,26391,27209,36534,13196,76731,25921,29173,26769,28028],"tags":[17,268435471,268435472,536871208,536871969,536873311,536874694,536875257,1073741827],"developers":[97],"publishers":[99],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[296,1057,2399,3782,4345],"themes":[17],"genres":[15,16],"first_release_date":974246400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":974419200000,"region":1,"human":"2000-Nov-17","y":2000,"m":11},{"category":0,"platform":6,"date":974246400000,"region":2,"human":"2000-Nov-15","y":2000,"m":11}],"alternative_names":[{"name":"Хроники Героев: Повелители стихий"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lnv0anooeobtqzkx3u2e.jpg","cloudinary_id":"lnv0anooeobtqzkx3u2e","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l7c36xylrcqoow2dpbee.jpg","cloudinary_id":"l7c36xylrcqoow2dpbee","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jj1bijjzlojkqykpzf3t.jpg","cloudinary_id":"jj1bijjzlojkqykpzf3t","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gchbvlodcmybilpq1jtb.jpg","cloudinary_id":"gchbvlodcmybilpq1jtb","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c1ahgc7yplbxhjpaf4wf.jpg","cloudinary_id":"c1ahgc7yplbxhjpaf4wf","width":800,"height":600}],"videos":[{"name":"Game intro","video_id":"ql9GNIvTiCo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vbh6b1v0ujti8f5p1j6b.jpg","cloudinary_id":"vbh6b1v0ujti8f5p1j6b","width":640,"height":780},"esrb":{"rating":3},"websites":[{"category":2,"url":"http:\/\/mightandmagic.wikia.com\/wiki\/Heroes_Chronicles:_Masters_of_the_Elements"}]}