{"id":87334,"name":"Stray Cat Simulator","slug":"stray-cat-simulator","url":"https:\/\/www.igdb.com\/games\/stray-cat-simulator","created_at":1518700648997,"updated_at":1523427603634,"summary":"Pick your favorite breed and live the life of a Stray Cat! Survive in a massive city filled with dangerous dogs, feisty felines, and tasty rodents! Build your cat pack, pounce on mice, and battle for your life against birds, rats, and dogs!\n\nDownload the Stray Cat Simulator today while it's 50% OFF for a very limited time!\n\nGame Features\nREALISTIC SIMULATOR\nYou'll need to maintain your health, hunger, thirst, and energy if you're going to survive the harsh life of a alley cat on the street!\n\nEPIC BATTLES\nUse your razor sharp claws and powerful bite to hunt your prey and fight again your enemies! Cause too much trouble and the city will call Animal Control to steal a cat from your pack!\n\nBUILD YOUR PACK\nDominate other cats and recruit them to your pack! With up to 5 additional cats, 15 breeds, and long or short hair builds, every pack will be unique!\n\nPLAY ANY BREED\nFor the first time you can choose the breed of your starting cat. Even better you can switch and play as any cat in your pack and level them up individually!\n\nBREED YOUR OWN KITTENS\nWant to build your very own family? Once you have a mate you can breed kittens that will grow into powerful members of your pack!\n\nLEVEL UP YOUR CATS\nGain experience by defeating dangerous enemies, eating food from the trash, and completing missions! Level up your cats to increase their health and attack damage, and increase the size of your pack!\n\nMISSIONS AND ACHIEVEMENTS\nIntroducing two new mission types, \"Mark your Territory\" and “Scavenger”, to the unlimited missions and over two dozen achievements to give you a boost of experience! With the level cap increased to 200, you’ll need all the help you can get!\n\nDYNAMIC WEATHER AND DAY\/NIGHT CYCLE\nIntroducing a brand new procedural weather system with unique storms, clouds, and celestial movement. Realistic storms will bring a downpour of rain, flashes of lightning and booms of thunder!\n\nHUGE 3D CITY ENVIRONMENT\nYour cat is free to roam a massive open-world environment that is more than triple the size of the previous simulators! Busy city streets, wide-open parks, white-fenced neighborhoods, and an ALL-NEW forest zone to fight new wildlife!\n\nNEW TOUCH-BASED CONTROLS\nBrand new intuitive controls let you navigate your animal like never before! Pinch to zoom and play from your cat's perspective or get a bird's eye view of the action!\n\n15 UNIQUE CAT BREEDS\nPick your favorite breed! Customize your cat pack with any feline you’d like from the vast selection: Himalayan, Tabby, Calico, Birman, Ragdoll, Bengal, Snowshoe, Russian Blue, Norwegian, Sphynx and many more!\n\nSTRAY SURVIVAL GUIDE\nLook to your handy survival guide for information on breeds, a map of the world, achievement progress, and much more!\n\nHD GRAPHICS\nStunning High Definition graphics bring a bustling city to life! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!\n\nGLUTEN-FREE PROMISE\nWith all of our games you will always get the full game with no ads or additional purchases!\n\nDownload the Stray Cat Simulator to experience the exciting life of a stray cat surviving on the streets!\n\nIf you liked living as a Stray Cat then you'll love our other animal simulators! Download our Stray Dog Simulator and live a wild life on the streets as your favorite breed, check out the Snow Leopard Simulator and pounce on your prey from high mountaintops, or slither around a tropical rainforest with the Snake Simulator!\n\nFollow us on Facebook for more awesome animal games and simulators!\nfacebook.com\/glutenfreegames\ntwitter.com\/glutenfreegames","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[75102,49414,25636,74378,25311,26145,44242,75398,36608,28465],"tags":[268435468,268435469],"category":0,"genres":[12,13],"first_release_date":1428364800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1428364800000,"region":8,"human":"2015-Apr-07","y":2015,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sdsux61girgdmu52ldie.jpg","cloudinary_id":"sdsux61girgdmu52ldie","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vac1uudzcnoq9onehf1p.jpg","cloudinary_id":"vac1uudzcnoq9onehf1p","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qy98jpxyuoahoeeanoap.jpg","cloudinary_id":"qy98jpxyuoahoeeanoap","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qwrazkqlszi9egss5z1b.jpg","cloudinary_id":"qwrazkqlszi9egss5z1b","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/heg8tbxcbricyshjmezj.jpg","cloudinary_id":"heg8tbxcbricyshjmezj","width":480,"height":360},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ea5v9j1xgssgpgerllkw.jpg","cloudinary_id":"ea5v9j1xgssgpgerllkw","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eswkqyzmnhfkv9vkatxt.jpg","cloudinary_id":"eswkqyzmnhfkv9vkatxt","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ijhssjaww0asvi89ke9v.jpg","cloudinary_id":"ijhssjaww0asvi89ke9v","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oj0dpw437eqzorw9yfkn.jpg","cloudinary_id":"oj0dpw437eqzorw9yfkn","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gmgywcmcbe4snyhqd9tc.jpg","cloudinary_id":"gmgywcmcbe4snyhqd9tc","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lgcvclklqms7na8lzupz.jpg","cloudinary_id":"lgcvclklqms7na8lzupz","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/stray-cat-simulator\/id969211750?mt=8&uo=4"}]}