{"id":11498,"name":"Hunt the Wumpus","slug":"hunt-the-wumpus","url":"https:\/\/www.igdb.com\/games\/hunt-the-wumpus","created_at":1438497575212,"updated_at":1516165685424,"summary":"Hunt the Wumpus is an early computer game, based on a simple hide and seek format featuring a mysterious monster (the Wumpus) that lurks deep inside a network of rooms. It was originally a text-based game written in BASIC and has since been ported to various programming languages and platforms including graphical versions.\n\nThe original text-based version of Hunt the Wumpus uses a command line text interface. A player of the game enters commands to move through the rooms or to shoot \"crooked arrows\" along a tunnel into one of the adjoining rooms. There are twenty rooms, each connecting to three others, arranged like the vertices of a dodecahedron or the faces of an icosahedron (which are identical in layout). Hazards include bottomless pits, super bats (which drop the player in a random location, a feature duplicated in later, commercially published adventure games, such as Zork I, Valley of the Minotaur, and Adventure), and the Wumpus itself. The Wumpus is described as having sucker feet (to escape the bottomless pits) and being too heavy for a super bat to lift. When the player has deduced from hints which chamber the Wumpus is in without entering the chamber, he fires an arrow into the Wumpus's chamber to kill it. The player wins the game if he kills the Wumpus. However, firing the arrow into the wrong chamber startles the Wumpus, which may cause it to move to an adjacent room. The player loses if he or she is in the same room as the Wumpus (which then eats him or her) or a bottomless pit.","popularity":2.333333333333333,"games":[65503,24426,25222,236,28070,62151,18011,20342,21641,56033],"tags":[17,268435465,268435487,536870976,536871599,536871939,536873207,536873308,536873326,536873327,536873328,536875172,536875409,536875789,536875939,536886603,1073741827,1073741829],"category":0,"player_perspectives":[3,5],"game_modes":[1],"keywords":[64,687,1027,2295,2396,2414,2415,2416,4260,4497,4877,5027,15691],"themes":[17],"genres":[9,31],"first_release_date":126144000000,"platforms":[112],"release_dates":[{"category":2,"platform":112,"date":126144000000,"human":"1973","y":1973,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vf5eayigdiz5b4czfbu7.jpg","cloudinary_id":"vf5eayigdiz5b4czfbu7","width":1092,"height":1580}}