{"id":17298,"name":"Marine Park Empire","slug":"marine-park-empire","url":"https:\/\/www.igdb.com\/games\/marine-park-empire","created_at":1454928238739,"updated_at":1548131629605,"summary":"Get ready to jump in the water as you run the most exciting and wild marine park ever in the latest and greatest sea-life simulation!\n\nControl every aspect of your marine park, from caring, feeding and cleaning your animals to hiring and firing employees. Grant your visitors the thrill of a lifetime as you provide fun-filled attractions, rides and shows for them to whet their appetite while they explore your sea-life wonderland.\n\nFeaturing a free-form game where you set the rules, and a challenging non-linear scenario mode where you can test your skills at becoming next great saltwater specialist, the fun and varied gameplay in Marine Park will not leave gamers out to dry.\n\nMaintain your checkbook balances afloat, keep your denizens of the deep delighted and the visitors flowing in your park. Then dive in for wave after wave of aquatic fun!\n\nAwash with Realism: Immerse yourself in a fantastic 3D world filled with creatures from the uncharted waters of the sea. From Otters to Orcas, Octopus to Oarfish, Marine Park is overflowing with 28 unique species of marine animals big and small that you can add to your ultimate marine park. Inundate your senses with the spectacular 3d graphics and sound and realistic, lifelike animations.\n\nA Flood of Unique Items: Go overboard in your marine park designs with over 150 structures, facilities and items to decorate your park and entertain your visitors with. Build wet-and-wild rides and unique attractions that your visitors can enjoy as they have a rip-roaring time in your marine park. Only your imagination stands in the way of creating the most exciting park for all to see!\n\nFun for Sea Dogs and Landlubbers Alike: Now land and marine animals go paw-in-flipper! Marine Park gives you a whopping 60 animals and over 450 unique building and decoration items to toy with as you build not only the best zoo or marine park, but a wildlife menagerie like no other!\n\nWith a completely flexible camera, including third- and first-person perspectives, dive in with your animals and experience the world of marine life from a completely different perspective.\n\nHit the Deck Running: A new, streamlined interface that is user-friendly, task-oriented and context-sensitive allows you to model exhibits and create your marine park with the greatest of ease and the minimum of fuss.\n\nLearn the Ropes as You Go Along: Six intuitive and interactive tutorials let you get your feet wet in no time. Learn about the sea creatures, their habitats and behaviors through the animal fun facts as you create the marine park of your dreams. When you are ready, embark on your own unique underwater quest by completing all 21 challenging scenarios, or experiment with the free-form game where you set the rules.","rating":70,"popularity":7,"aggregated_rating":100,"aggregated_rating_count":1,"total_rating":85,"total_rating_count":1,"rating_count":0,"games":[17111,31515,29173,17130,55590,44242,33153,55689,17519,31173],"tags":[28,268435469,268435471,536871291,536871315,536871604,536871751,536871906,536872010,536872060,536872070,536875046,536875352,536876508,536876569,536880453,1073741827],"developers":[7432],"publishers":[269],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[379,403,692,839,994,1098,1148,1158,4134,4440,5596,5657,9541],"themes":[28],"genres":[13,15],"first_release_date":1127347200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1127347200000,"human":"2005-Sep-22","y":2005,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/piuqrjmfalfm2hien2vj.jpg","cloudinary_id":"piuqrjmfalfm2hien2vj","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rlntvbkyawui5v038jlc.jpg","cloudinary_id":"rlntvbkyawui5v038jlc","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g7rzwnx29odtwastlhpj.jpg","cloudinary_id":"g7rzwnx29odtwastlhpj","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o3lwv6ostcufjorm2lr4.jpg","cloudinary_id":"o3lwv6ostcufjorm2lr4","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h945usytvyxsorzubqnc.jpg","cloudinary_id":"h945usytvyxsorzubqnc","width":1024,"height":768}],"videos":[{"name":"Trailer","video_id":"Vv6UNlXg0do"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nu3k53moe0rsbwhknsej.jpg","cloudinary_id":"nu3k53moe0rsbwhknsej","width":354,"height":500},"esrb":{"rating":3},"websites":[{"category":1,"url":"http:\/\/www.retroism.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/294730"}],"external":{"steam":"294730"}}