{"id":19098,"name":"The Lord of the Rings Online: Riders of Rohan","slug":"the-lord-of-the-rings-online-riders-of-rohan","url":"https:\/\/www.igdb.com\/games\/the-lord-of-the-rings-online-riders-of-rohan","created_at":1462880407768,"updated_at":1545948130280,"summary":"Riders of Rohan expands the online world of Middle-earth where players join forces to ride into the Plains of Rohan. Riders of Rohan includes an increased level cap, the vast plains of Rohan including iconic locations such as Amon Hen and Fangorn Forest, the new Mounted Combat system and much more. \n \nExperience the Riders of Rohan \nJoin with the Rohirrim and ride across the sprawling Plains of Rohan; witness the breaking of the Fellowship at Amon Hen; forge alliances with the Ents of Fangorn; and aid Éomer, adopted son of Théoden, as he seeks to protect his homeland from the growing Shadow. \n \nIntroducing Mounted Combat \nRide into Combat atop your loyal War-steed as you defend the people of Rohan from the forces of Isengard and Mordor. Customize your War-steed’s armor and level its skills over time to aid you in mounted defense of King Theoden’s lands. Mount your steed and gather your fellows to fight against Warbands, contingents of roving warg riders that have been scouted all over the Plains of Rohan! It falls to you to head off and defeat this new threat before they over take the land. \n \nAdvance to level 85 \nContinue your legend in the next chapter of The Lord of the Rings Online. Experience new adventures in the epic story, and gain new skills and deeds as you face new challenges on your journey to 85!","storyline":"The Fellowship of the Ring has broken, and two of its members have been carried forcefully into the Riddermark by Saruman’s Uruks. They are taking the hobbits to Isengard, but their journey will take them across the land of the horse-lords, their bitter enemies, and they are pursued by the Three Hunters: Aragorn, Legolas, and Gimli. East Rohan is ruled by a number of powerful lords whose loyalty is to King Théoden, but the whispered treasons of Saruman have already caused dissension to root in the plains of the Riddermark. Help its people as they strive to defend themselves against the growing threat of war. Witness the Argonath, the mighty Pillars of the Kings astride the Great River Anduin, and stand by the Seat of Seeing atop Amon Hen, marvelling at the ancient works of Gondor. And then journey beneath the eaves of Fangorn, whose trees are older still, and uncover the secrets of its mysterious shepherds.","collection":137,"franchise":11,"franchises":[11],"popularity":1.333333333333333,"game":3092,"games":[19698,47823,54775,59427,64061,35450,103303,68393,18398,26765],"tags":[17,268435468,536871208,536871402,536871812,536872449,536873364,536875054,536875270,536876233,536876583,536877165,536878415,1073741826],"developers":[470],"publishers":[470],"game_engines":[487],"category":2,"player_perspectives":[2],"game_modes":[5],"keywords":[296,490,900,1537,2452,4142,4358,5321,5671,6253,7503],"themes":[17],"genres":[12],"first_release_date":1350259200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1350259200000,"human":"2012-Oct-15","y":2012,"m":10}],"alternative_names":[{"name":"Rohan","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jo8gifsmfve7px5zvpxm.jpg","cloudinary_id":"jo8gifsmfve7px5zvpxm","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"ofwBwPBCMqw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jezsxnc1wdkpere3jcio.jpg","cloudinary_id":"jezsxnc1wdkpere3jcio","width":528,"height":754},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\n\r\nIt contains: Realistic looking violence towards non human looking characters - Non realistic looking violence towards human characters - Violence causing minor injury only\r\n\r\nThis game allows the player to interact with other players ONLINE","rating":3},"websites":[{"category":2,"url":"http:\/\/lotro-wiki.com\/index.php\/Riders_of_Rohan"},{"category":1,"url":"https:\/\/www.lotro.com\/en\/lotro-store-quest-packs#rohan_info"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/The_Lord_of_the_Rings_Online:_Riders_of_Rohan"}]}