{"id":31198,"name":"Eternal Card Game","slug":"eternal-card-game","url":"https:\/\/www.igdb.com\/games\/eternal-card-game","created_at":1495626921098,"updated_at":1546375634970,"summary":"Eternal is a free-to-play online collectible card video game developed and published by Dire Wolf Digital. Eternal is currently available, as an open beta, for iPhone and iPad iOS devices on the App Store, PCs using Steam, and for Android devices using Google Play. The game features cross-platform play, allowing players to use any of the supported platforms to compete with each other. \n \nThe game is a turn-based card game between two opponents that use constructed decks with various amounts of cards. Players use their power cards to cast spells, use attachments or summon units to attack the opponent, with the goal of reducing the opponent's health to zero. Winning matches and completing quests will earn in-game gold, rewards in the form of new cards or packs, and other in-game prizes. Players can then buy card packs or buy access to card drafting modes by using gold or microtransactions to collect cards for their decks. The game features several modes of play, including ranked matches and single-player campaigns. New content for the game involves the addition of new card sets and gameplay, taking the form of either expansion packs or campaigns that reward the player with collectible cards upon completion.","storyline":"The Eternal Throne: \n \nEternal is the story of the struggle for the Eternal Throne of Myria when it is left vacant by the disappearance of King Caiphus. The Throne itself has magical properties, as depicted in the epilogue to the Empty Throne campaign, but the scope and nature of its abilities are currently unclear. \n \nScions: \n \nThe Scions from left to right: Kaleb, Eilyn, Rolant, Vara and Talir \nKing Caiphus is gone; those with the strongest claim to the vacant Eternal Throne are the five \"Scions\" in Eternal - powerful characters who could claim the Eternal Throne while having their own agendas to pursue. \n \nRolant is the Commander of the Crownwatch, the acting Regent of Argenport in the absence of an official ruler and Caiphus' uncle. He attempts to maintain order using his army, which starts a civil war within the city. \n \nEilyn is a powerful shaman of the barbarian tribes that nearly destroyed Argenport before a truce was reached that culminated with her marriage to King Caiphus. \n \nKaleb is a headstrong warrior with little interest in politics, whose status as Caiphus' illegitimate son with an unknown mother has weakened his claim to the throne. \n \nVara is the favored heir to the Eternal Throne as Caiphus' daughter, but has grown tired of being a political pawn of others so explores the Shadowlands for her own ends. \n \nTalir is among the most gifted magic users in Myria. She is Caiphus' sister and the Arch Magister of the Praxis Arcanum. \n \nOther characters: \n \nCaiphus is the former occupant of the Eternal Throne. Each of the Scions is defined by their relationship to him. \nJekk, the Bounty Hunter is the protagonist and narrator of the opening cinematic, as well as the Jekk's Bounty campaign. \n \nIcaria was the first Valkyrie and their Captain but turned against Rolant to lead a rebellion against his rule. \nAzindel took down Caiphus that ended up braking the seal of the Eternal Throne. Azindel has guided Vara through the Shadowlands and gave her a magical amulet that erased her memories. \n \nThe Strangers are an army of men whose faces are marked with a glowing purple symbol created by Azindel. \nHorus Traver is a simple homesteader who gets caught up in the struggle for the Eternal Throne.","rating":72.2592987954478,"popularity":2,"total_rating":72.2592987954478,"total_rating_count":5,"rating_count":5,"games":[106859,107226,32510,236,9570,9655,27209,7889,6414,75848],"tags":[17,268435465,268435471,536871004,536871394,536872002,536872837,536874083,1073741827],"developers":[12932],"publishers":[12932],"game_engines":[509],"category":0,"player_perspectives":[3],"game_modes":[1,2,5],"keywords":[92,482,1090,1925,3171],"themes":[17],"genres":[9,15],"first_release_date":1479427200000,"status":4,"pulse_count":1,"platforms":[34,6,39,14],"release_dates":[{"category":0,"platform":39,"date":1479427200000,"region":8,"human":"2016-Nov-18","y":2016,"m":11},{"category":0,"platform":34,"date":1479427200000,"region":8,"human":"2016-Nov-18","y":2016,"m":11},{"category":0,"platform":14,"date":1479427200000,"region":8,"human":"2016-Nov-18","y":2016,"m":11},{"category":0,"platform":6,"date":1479427200000,"region":8,"human":"2016-Nov-18","y":2016,"m":11}],"alternative_names":[{"name":"Eternal","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iumxd1bfbflzqns04jcu.jpg","cloudinary_id":"iumxd1bfbflzqns04jcu","width":1049,"height":590},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oukhxhswqrkyx3x9dsev.jpg","cloudinary_id":"oukhxhswqrkyx3x9dsev","width":1049,"height":590},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tqdfuztrkc1aob5p1kjz.jpg","cloudinary_id":"tqdfuztrkc1aob5p1kjz","width":1049,"height":590},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zekmex2rjdfzuywhmo7w.jpg","cloudinary_id":"zekmex2rjdfzuywhmo7w","width":1049,"height":590},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ola08s8tbow5bvelxyvd.jpg","cloudinary_id":"ola08s8tbow5bvelxyvd","width":1049,"height":590}],"videos":[{"name":"Gameplay video","video_id":"Z-w-7XEf4-0"},{"name":"Trailer","video_id":"dnEluJt6CMs"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rc5xbtxajo2n1tkfese2.jpg","cloudinary_id":"rc5xbtxajo2n1tkfese2","width":1024,"height":500},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.direwolfdigital.Phoenix"},{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/eternal-card-game\/id1077866163"},{"category":14,"url":"https:\/\/www.reddit.com\/r\/eternalcardgame"},{"category":6,"url":"https:\/\/www.twitch.tv\/direwolfdigital"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Eternal_(card_game)"},{"category":2,"url":"http:\/\/eternalcardgame.wikia.com\/wiki\/Eternal_Card_Game_Wikia"},{"category":1,"url":"https:\/\/www.direwolfdigital.com\/eternal\/"},{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UC9cLJOlWOCE9YmZlLF_OkRA"},{"category":5,"url":"https:\/\/twitter.com\/eternalcardgame"},{"category":4,"url":"https:\/\/www.facebook.com\/eternalcardgame"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/531640"}],"external":{"steam":"531640"}}