{"id":41398,"name":"Nazoler Land Soukan Gou","slug":"nazoler-land-soukan-gou","url":"https:\/\/www.igdb.com\/games\/nazoler-land-soukan-gou","created_at":1498816406361,"updated_at":1516739177844,"summary":"A mini-game compilation from SunSoft for the Famicom Disk System. It is the first in a series of four Nazoler games. \n \nNazoler Land Soukan Gou is the first in a series of minigame collections from SunSoft developed especially for Nintendo's Famicom Disk System peripheral. It was followed by two direct sequels and a quiz-based spin-off. \n \nNazoler Land Soukan Gou (or Nazoler Land Vol. 1) has eight minigames that the player can select from a menu after loading the game up and switching the disk around. These are: \n \nRotation Maze \nA maze-like puzzle game where a small circular being has to pass through a maze filled with dividers. The player can only pass through these dividers if there is room for it to turn around, otherwise it blocks the player's progress. The goal is to find the correct path through the maze. \n \nNazoler Fortune-Telling \nDespite using signs of the Zodiac and suggesting a fortune-telling aspect, the game is actually a variant on the classic strategy board game Mastermind: The goal is to find the right combination of Zodiac symbols, and the game will provide hints by reporting whenever the player includes the right symbol, either in the correct place (represented by a solid star) or the wrong place (represented as a hollowed star). \n \nSuper Jigsaw \nIn this game the player simply has to reconstruct an image after pieces of it have been jumbled up. All the player must do is use two cursors to point to the two pieces they wish to switch around. Restoring the image to its initial state completes the challenge. \n \nSave Princess Momoko! \nPromoted as the \"major feature\", or the most fully-developed of the minigames. The goal is to explore a dungeon in a first-person perspective, similar to classic dungeon crawlers such as Wizardry, Dungeon Master or Shining in the Darkness, while finding items and using the correct items on the right monsters to proceed past them. Encountering these monsters before finding the right item to defeat them causes the player to lose, so there's a degree of trial and error. \n \nJapan's Best Surroundings: Ultra Travel Quiz \nA quiz based on traveling around Japan and general geographical facts. The player selects which type of transportation (train, plane, etc.) they wish to take and answers questions relating to it. \n \nFamicom Reaction Test \nIn this simple \"game\", two players compete to hit the button on their controller as many times as they can in the short time limit. This test is presented like a Wild West duel. \n \nExtrusion Puzzle \nSimilar to Super Jigsaw, only the player is sliding blocks around to make a puzzle appear. Pushing one block that's against another causes all touching blocks to move at once. \n \n3D Maze \nA simple 3D maze, presented in the same first-person perspective as the Saving Princess Momoko game, though with a stark blue and white appearance. The goal is to simply find the way out.","collection":3369,"popularity":1.333333333333333,"games":[107226,87507,95776,68925,60044,27266,22477,90766,80174,236],"tags":[268435465,536871186,536872425,536875240,536875242,536878242,536878243],"category":0,"keywords":[274,1513,4328,4330,7330,7331],"genres":[9],"first_release_date":539568000000,"platforms":[51,58],"release_dates":[{"category":0,"platform":51,"date":539568000000,"region":5,"human":"1987-Feb-06","y":1987,"m":2},{"category":0,"platform":58,"date":541987200000,"region":8,"human":"1987-Mar-06","y":1987,"m":3}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sbfmcq4n0rie86fd33n4.jpg","cloudinary_id":"sbfmcq4n0rie86fd33n4","width":191,"height":209}}