{"id":47498,"name":"Inindo: Way of the Ninja","slug":"inindo-way-of-the-ninja","url":"https:\/\/www.igdb.com\/games\/inindo-way-of-the-ninja","created_at":1499869175452,"updated_at":1517270726676,"summary":"\"Inindo: Way of the Ninja\" is a console-style RPG with a touch of strategy. You navigate your hero on the world map, visit towns, and descend into dungeons. The battles are turn-based and are viewed from a third-person perspective, like in Final Fantasy games. You can move on the battle field and use melee or long-ranged attacks. You'll be able to recruit characters of various classes to your party, who will join you for profit or for other reasons. After you gain enough experience, you'll also be able to talk to daimyos (feudal rulers) of various castles and to convince them to work together against Nobunaga. You can also perform various tasks for the daimyos, such as spying. \n \n1581, Japan. Fearing a rebellion and striving to conquer the entire country, the warlock Nobunaga orders to attack the Iga ninja clan. The ninjas bravely defend their village, but, being vastly outnumbered, are mercilessly slain by Nobunaga's men. Only one survived: you, the hero of the game. Shortly before the assault you were sent to a nearby village to warn the elder of Nobunaga's attack. However, the other village is also destroyed by Nobunaga's army. You swear to avenge his crime. But for now, you are just an inexperienced young men, and are \"wanted\" by Nobunaga's men and ruthless bounty hunters. Will you be able to unite Japan in the ultimate struggle against Nobunaga?","popularity":1.333333333333333,"games":[26766,36534,36926,18822,47823,17583,26769,25921,26841,18398],"tags":[17,22,268435468,268435471,268435487,536871076,536871138,536871148,536871208,536871244,536871938,536871939,536872425,536873370,536873591,536874688,536874694,536875067,536875160,536875196,536875197,536875380,536875455,536875791,536876232,536876986,536878292,536879998,536880471,536881456],"category":0,"keywords":[164,226,236,296,332,1026,1027,1513,2458,2679,3776,3782,4155,4248,4284,4285,4468,4543,4879,5320,6074,7380,9086,9559,10544],"themes":[17,22],"genres":[12,15,31],"first_release_date":665366400000,"platforms":[27],"release_dates":[{"category":0,"platform":27,"date":665366400000,"region":8,"human":"1991-Feb-01","y":1991,"m":2}],"alternative_names":[{"name":"Inindo: Datou Nobunaga","comment":"Other"},{"name":"Super Inindo: Datou Nobunaga","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l7iuqwl2nnydbpicwo1q.jpg","cloudinary_id":"l7iuqwl2nnydbpicwo1q","width":475,"height":347}}