{"id":96398,"name":"Manic Game Girl","slug":"manic-game-girl","url":"https:\/\/www.igdb.com\/games\/manic-game-girl","created_at":1523814036654,"updated_at":1523827220634,"summary":"Manic Game Girl is an action-adventure RPG with 3D brawler mechanics created with the help of Han Jong Lee, one of the main programmers on Parasite Eve and part of the engine development team for Final Fantasy 8. \n \n\"The first self-developed PlayStation game in Korea.\" \n \nThe games development was started in 1999 and was originally planned for the Dreamcast but later switched to the PlayStation. There was trouble with the games development as the market for video games was just starting in South Korea which lead to a lack of people with experience making games at the time. \n \nThe game was released at the end of the PlayStation's production cycle after the launch of the PlayStation 2 earlier in the year. This was reflected in it's marketing at the time which mentions how it will run just as well on the newer system. \n \nThere were plans to release the game internationally by the end of the year with the North American publisher Conspiracy Entertainment but that was eventually canceled.","storyline":"Edited google translation of the story summary: \n\"Amber, a collage student, is selected as a beta tester for 'Game Stealth', a new portable game machine. But this 'Game Stealth' was more than just a game machine... \n \nAmber, through a coincidence or inevitability, has gained an unidentified power from this handheld console. She has also been unwittingly caught in a conflict between an international terrorist organization and the FBI because of it. \n \nWill she be able to use the power she obtains for a good cause?\"","popularity":1,"games":[25300,25311,71455,37088,59516,28380,24048,54842,55289,26163],"tags":[1,18,38,268435468,268435481,268435487,536871874,536871894,536872270,536873299,536873929,1073741827,1073741826],"developers":[15344],"publishers":[15344],"category":0,"player_perspectives":[2,3],"game_modes":[1],"keywords":[962,982,1358,2387,3017],"themes":[1,18,38],"genres":[12,25,31],"first_release_date":1023408000000,"platforms":[7],"release_dates":[{"category":0,"platform":7,"date":1023408000000,"region":7,"human":"2002-Jun-07","y":2002,"m":6}],"alternative_names":[{"name":"Manic Game Gal","comment":"Other"},{"name":"MGG","comment":"Acronym"},{"name":"매닉 게임 걸","comment":"Korean title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mqvu2sp9bcjge0ejxlma.jpg","cloudinary_id":"mqvu2sp9bcjge0ejxlma","width":384,"height":382}}