{"id":106010,"name":"Domination Earth","slug":"domination-earth","url":"https:\/\/www.igdb.com\/games\/domination-earth","created_at":1532349537934,"updated_at":1533031984800,"summary":"Android and iOS AR strategy game “Domination: Earth\" operates in the real world around you - military style! Check in wherever you go using your phone or tablet to capture places and pieces of land, expanding your very own global empire - like Geocaching on Steroids!  \n \nA health conscious and adventure provoking platform, it encourages hiking, cycling and other forms of travel and real-world exploration in order to collect resources - you have to physically approach each item wherever it appears in the world to pick it up. \n \nGame tactics include capturing lands to build military bases and recruiting armies to establish regional dominance. Construction resources keep appearing all over the globe, so in the process of their collection you will explore places you've never seen before! \n \nTo defend your territories, initiate alliances with neighbors to fight against foreign threats or build a missile launcher in your backyard to thwart invaders of your hometown. It’s vital check in five times in any spot to establish a new base of operations. Once you've collected enough resources you can send your armies to the overseas base in order to advance your influence remotely, even after you've left! \n \nDomination Earth also engages in \"item scrapping\": any real-world item with a barcode can be transformed into a resource by using your camera (don't worry, you still get to keep your items afterwards!). Books, toys, DVDs - almost anything becomes a source of crafting materials.","popularity":2,"tags":[1073741825],"publishers":[16025],"category":0,"player_perspectives":[1],"game_modes":[1],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kvlka8uovcutccdzbjcc.jpg","cloudinary_id":"kvlka8uovcutccdzbjcc","width":1080,"height":1848},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pd1tmeiwlavpxummy5ve.jpg","cloudinary_id":"pd1tmeiwlavpxummy5ve","width":1080,"height":1848}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ntvlhtboz0revdw7xcei.jpg","cloudinary_id":"ntvlhtboz0revdw7xcei","width":2048,"height":1072},"websites":[{"category":12,"url":"https:\/\/play.google.com\/store\/apps\/details?id=earth.domination&hl=en_IE"},{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/domination-earth\/id1279224200?mt=8"},{"category":5,"url":"https:\/\/twitter.com\/EpicDragonUK"},{"category":4,"url":"https:\/\/www.facebook.com\/domination.earth"},{"category":1,"url":"https:\/\/forum.domination.earth\/"}]}