{"id":12410,"name":"Callahan's Crosstime Saloon","slug":"callahans-crosstime-saloon","url":"https:\/\/www.igdb.com\/games\/callahans-crosstime-saloon","created_at":1441531547425,"updated_at":1513068841790,"summary":"Callahan's Crosstime Saloon is a puzzle-solving adventure game based on Spider Robinson's series of stories about the unusual patrons of Callahan's bar. The characters in the game are taken from the first book of the series, though their stories are original. The game's world is composed of still screens viewed from first-person perspective. The interaction is point-and-click, with context menus appearing when the player attempts to interact with an object on screen.","storyline":"Long Island is home to Mike Callahan's bar, which is, like many other establishments of its kind, a place for people to share their personal problems with the friendly all-knowing bartender and drown their sorrows in alcohol. One small difference between this particular bar and most others is the clientele: mythological beings, time travellers, and aliens all feel at home at Callahan's. So does Jake Stonebender, a traveling guitarist with a tragic past, inclined to help those in need. Chatting with the colorful patrons of the bar, Jake finds out that a few of them do need his assistance, and will proceed to help a vampire find his long-lost love, solve the moral dilemma of an alien whose pacifist thinking is not approved by the majority of his race, save the rainforest from destruction, and perform other good deeds that will perhaps prove to the Powers-That-Be that humanity can be allowed to exist.","popularity":1.666666666666667,"games":[13189,25222,27314,236,19448,26766,37088,25300,36950,19289],"tags":[17,18,22,268435458,268435487,536871082,536871882,536871939,536875067,536875243,1073741825],"developers":[560],"publishers":[139],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[170,970,1027,4155,4331],"themes":[17,18,22],"genres":[2,31],"first_release_date":883526400000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":883526400000,"human":"1997","y":1997,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vl4php06jvsnn9gcmhn4.jpg","cloudinary_id":"vl4php06jvsnn9gcmhn4","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sljm6mj4vduph7rh4bsp.jpg","cloudinary_id":"sljm6mj4vduph7rh4bsp","width":640,"height":480}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dp2cawrk5esilthabl8l.jpg","cloudinary_id":"dp2cawrk5esilthabl8l","width":800,"height":970}}