{"id":41610,"name":"Life Is Strange - Limited Edition","slug":"life-is-strange-limited-edition","url":"https:\/\/www.igdb.com\/games\/life-is-strange-limited-edition","created_at":1498827407586,"updated_at":1533641731458,"summary":"Life Is Strange is a graphic adventure played from a third-person view. The mechanic of rewinding time allows the player to redo any action that has been taken. The player can examine and interact with objects, which enables puzzle solving in the form of fetch quests and making changes to the environment. Items that are collected before time travelling will be kept in the inventory after the fact. \n \nThe player can explore various locations in the fictional setting of Arcadia Bay and communicate with non-playable characters. Dialogue exchanges can be rewound while branching options are used for conversation. Once an event is reset, the details provided earlier are permitted to avail themselves in the future. In some instances, choices in dialogue will alter and affect the story through short or long-term consequences. For each one of the choices, something good in the short-term could turn out worse later.","storyline":"\"LIFE IS STRANGE™ takes place in the fictional town of Arcadia Bay, Oregon, where senior student Max Caulfield returns after a 5 year absence. Reunited with her former friend Chloe, the pair will attempt to uncover the uncomfortable truth behind the mysterious disappearance of fellow student Rachel Amber.\" \n—Square Enix","collection":2724,"popularity":2,"version_parent":7599,"version_title":"Limited Edition","games":[31712,37419,78632,81249,80916,101608,25311,55038,105269,25646],"tags":[1,268435487,536888291,536888605,536893758,1073741826],"developers":[894],"publishers":[14089],"game_engines":[351],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[17379,17693,22846],"themes":[1],"genres":[31],"first_release_date":1453161600000,"platforms":[6,48,49],"release_dates":[{"category":0,"platform":49,"date":1453161600000,"region":2,"human":"2016-Jan-19","y":2016,"m":1},{"category":0,"platform":48,"date":1453161600000,"region":2,"human":"2016-Jan-19","y":2016,"m":1},{"category":0,"platform":49,"date":1453420800000,"region":1,"human":"2016-Jan-22","y":2016,"m":1},{"category":0,"platform":48,"date":1453420800000,"region":1,"human":"2016-Jan-22","y":2016,"m":1},{"category":0,"platform":6,"date":1453420800000,"region":1,"human":"2016-Jan-22","y":2016,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b7n143r2ugvebi6zktm1.jpg","cloudinary_id":"b7n143r2ugvebi6zktm1","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gwxwxy3xweuad9o0irep.jpg","cloudinary_id":"gwxwxy3xweuad9o0irep","width":1500,"height":844}],"videos":[{"name":"Trailer","video_id":"Y60Rp3QbT58"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k73nupqbgepa5i6sres7.jpg","cloudinary_id":"k73nupqbgepa5i6sres7","width":800,"height":1135},"esrb":{"synopsis":"This is an adventure game in which players assume the role of Max Caufield, a high-school student with the ability to manipulate time. As players progress through the storyline, they are presented with various dialogue and action choices. Some choices can influence other characters to engage in acts of violence (e.g., beating up a bully, shooting a man in self-defense) and\/or lead to their deaths (e.g., a character getting shot in the head or stomach, a character committing suicide). Blood is depicted around the corpses and\/or when characters are injured. The game also contains implied references to sexual assault and pictures of drugged and bound female characters (fully clothed). Additional sequences contain reference to sexual material: a porn magazine that states “Oregon's Best Boobs;” sexual graffiti on walls (e.g., “69 reasons to b*ng Rachel,\" “Victoria love D”); dialogue such as “Now I can text Warren and tell him he doesn't stand a chance...unless he's into girl-on-girl action.” During the course of the game, a character is shown smoking marijuana; one sequence depicts high-school students intoxicated with alcohol and\/or passed out in a party setting. The words “f**k,” “sh*t,” and “a*shole” are heard in the dialogue.","rating":6},"pegi":{"synopsis":"This game was rated PEGI 16 for frequent moderate violence and strong language and infrequent use of illegal drugs. Not suitable for persons under 16 years of age.","rating":4},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/user\/lifeisstrange"},{"category":8,"url":"https:\/\/www.instagram.com\/lifeisstrangegame"},{"category":5,"url":"https:\/\/twitter.com\/LifeIsStrange"},{"category":4,"url":"https:\/\/www.facebook.com\/LifeIsStrangeGame"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Life_Is_Strange"},{"category":2,"url":"http:\/\/life-is-strange.wikia.com\/wiki\/Life_is_Strange_Wiki"},{"category":1,"url":"https:\/\/www.lifeisstrange.com\/en-us"}]}