{"id":24785,"name":"Farming Simulator 17: Platinum Expansion","slug":"farming-simulator-17-platinum-expansion","url":"https:\/\/www.igdb.com\/games\/farming-simulator-17-platinum-expansion","created_at":1475699604510,"updated_at":1510736237978,"summary":"Take on the role of a modern farmer in Farming Simulator 17: Platinum Edition! Immerse yourself in three huge open worlds, loaded with a harvest of new content! \n \nDiscover a new South American playground exclusive to the Platinum Edition, and its authentic landscapes, unique vegetation, railway network, local cows, and sugarcane fields, offering a total change of scenery and more gameplay possibilities! Drive more than 275 authentic farming vehicles and equipment from over 80 manufacturers including AGCO brands (Challenger, Fendt, Massey Ferguson or Valtra), as well as new brands exclusive to this Platinum Edition such as Stara, TT, Bizon and Gessner Industries. Harvest many types of crops including sunflowers, soybeans, sugarcanes and more. Take care of your livestock – including cows, sheep, chickens and pigs – try your hand at forestry, and sell your produce to expand your farm! Transport your goods with trucks and trailers, or load and drive trains to quickly reach your destination. \n \nGrow your farm online with other players, and download community-created mods for an ever-expanding Farming Simulator experience!","popularity":1.666666666666667,"aggregated_rating":60,"aggregated_rating_count":0,"total_rating":60,"total_rating_count":0,"game":19409,"category":2,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e1ydqeitj69ho7ivzlbd.jpg","cloudinary_id":"e1ydqeitj69ho7ivzlbd","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rxagzqejbrswmdbhudlw.jpg","cloudinary_id":"rxagzqejbrswmdbhudlw","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i9rlfvmycevfvsoa98om.jpg","cloudinary_id":"i9rlfvmycevfvsoa98om","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/woysp2divqu4encma9dn.jpg","cloudinary_id":"woysp2divqu4encma9dn","width":760,"height":1079}}