{"id":28285,"name":"Ghost pirates of Voojoo island","slug":"ghost-pirates-of-voojoo-island","url":"https:\/\/www.igdb.com\/games\/ghost-pirates-of-voojoo-island","created_at":1493313475163,"updated_at":1540503733290,"summary":"Mysterious Things are Happening on Vooju Island... \n \nLegendary video game writer and developer Bill Tiller (The Curse of Monkey Island, A Vampyre Story) tells a gripping tale of pirates, ghosts, and mysterious Vooju magic. Vooju priest Papa Doc, bumbling cook Blue Belly, and impetuous pirate Jane Starling have fallen victim to the nefarious plans of the Papa Doc’s wife, the devious Queen Zimbi. The nefarious Zimbi has used her mysterious Vooju magic to curse and transform our three intrepid characters into ghosts. Can you help them rejoin their bodies before they join the ranks of the undead forever? \n \nSet amidst a mythical Caribbean world of Vooju magic and unmistakable pirate humor, Ghost Pirates of Vooju Island challenges you to help the heroic ghostly trio regain their human forms and thwart the dark machinations of the Vooju priestess and her pirate allies. The fate of the entire world lies in the hands of these three unusual heroes!","storyline":"The game follows the exploits of the game's three main protagonists, Papa Doc, Jane Starling, and Blue Belly, as they try to stop the resurrection of a demon god, which is orchestrated by Papa Doc's treacherous wife, the Vooju witch Queen Zimbi aided by the pirate crew of Greenbeard and an army of zombies. After she captures the pirate king Flint and knocks out the three protagonists, the three find themselves cursed with their souls separated from their bodies. \n \nIn the first part of the game, the three protagonists have to find a way to reacquire their bodies, a method of reattaching their souls, and a ship in order to leave Vooju island and seek help. They have to do so before they are turned into zombies or before the cock crows thrice, otherwise they would be forever lost as ghosts. \n \nIn the second part of the game, the three have to gather allies and stop Greenbeard's attempt to attack Blue Belly's home port with the aid of their ghostly powers. In the final part of the game, with their allies, the three heroes have to defeat Zimbi's evil mother Mama Malidei and stop the demon god's resurrection.","hypes":1,"popularity":1.333333333333333,"games":[76397,103232,25877,80916,109581,81249,78632,15911,11710,103054],"tags":[27,268435458,268435468,268435487,536870916,536870928,536871249,536874605,1073741828],"developers":[1485],"publishers":[2139],"game_engines":[605],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[4,16,337,3693],"themes":[27],"genres":[2,12,31],"first_release_date":1266537600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1283126400000,"region":2,"human":"2010-Aug-30","y":2010,"m":8},{"category":0,"platform":6,"date":1266537600000,"region":1,"human":"2010-Feb-19","y":2010,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ygf54wihsjq2sgot9pfm.jpg","cloudinary_id":"ygf54wihsjq2sgot9pfm","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/chu6s0uulfn0zgvuda1r.jpg","cloudinary_id":"chu6s0uulfn0zgvuda1r","width":1600,"height":1288}],"videos":[{"name":"Trailer","video_id":"qvqPrYgjexo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/frklsitigw2xy8yyztgc.jpg","cloudinary_id":"frklsitigw2xy8yyztgc","width":1132,"height":1500},"esrb":{"synopsis":"This is a puzzle-adventure game in which players follow three characters (a vooju sorcerer, a pirate cook, and a pirate spy) on a quest to find and return their spirits to their mortal bodies. Players explore a mysterious island, interact with characters, solve various puzzles, and complete quests along the way. During the course of the game, there are some slapstick depictions of violent acts: a skeleton pirate attacked by gators off screen; characters pushed off bridges or into pits of lava; guard attacked by swarms of bees. The dialogue sometimes references suggestive material (e.g., \"You stole me pantaloons while I was . . . ahem . . . 'entertaining' the talented wenches\" and Well, if it isn't Flint's two favorite harlots!\"). A few female characters are depicted with large amounts of exposed cleavage and breasts that often jiggle. Characters use language such as \"damn\" and \"hell,\" and make frequent references to beer, wine, champagne, and rum (e.g., With all this wine and rum why drink water?\"). ","rating":5},"pegi":{"rating":3},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/344030\/Ghost_Pirates_of_Vooju_Island"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Ghost_Pirates_of_Vooju_Island"}]}