{"id":37685,"name":"Hani In The Sky","slug":"hani-in-the-sky","url":"https:\/\/www.igdb.com\/games\/hani-in-the-sky","created_at":1497874612014,"updated_at":1515665784313,"summary":"A vertical-scrolling shoot-'em-up from Face for the PC Engine. It was never released outside of Japan. It was eventually followed by a sequel, Hani on the Road. \n \nHani in the Sky is a shoot-'em-up by Face, an obscure PC Engine developer best known in the west for Money Puzzle Exchanger. The player controls the eponymous Hani, a sentient haniwa figurine, as they shoot down legions of demonic spirits and youkai in the air. He is set to this task by ancient Japanese deity Izanagi, with the ultimate goal of rescuing his wife\/sister deity Izanami. \n \nThe chief feature of Hani in the Sky is the protagonist's ability to change the direction of their weapon, allowing the player to shoot in eight different directions total. This is often required to defeat enemy waves emerging from all sides of the screen as well as the fast-moving bosses. The player can also upgrade Hani's weaponry, allowing him to fire in more directions simultaneously, as well as purchase health refills and other useful items from Izanagi. \n \nHani in the Sky was eventually followed by a sequel: Hani on the Road. Unlike Sky, Hani on the Road is more of a ground-based auto-scrolling action platformer with lane-switching.","popularity":1.333333333333333,"games":[47823,12632,16468,27209,28029,68324,10039,19698,76246,19341],"tags":[1,17,268435461,268435489,536871078,536871208,536881098,1073741827],"developers":[10065],"publishers":[10065],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[166,296,10186],"themes":[1,17],"genres":[5,33],"first_release_date":604627200000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":604627200000,"region":5,"human":"1989-Feb-28","y":1989,"m":2}],"alternative_names":[{"name":"Hani in the Sky","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nbws4sybhknb9cw3gvnp.jpg","cloudinary_id":"nbws4sybhknb9cw3gvnp","width":800,"height":792}}