{"id":39585,"name":"Ta•o Taido","slug":"ta-star-o-taido","url":"https:\/\/www.igdb.com\/games\/ta-star-o-taido","created_at":1498132847342,"updated_at":1516754427211,"summary":"The game takes place on Earth, where eight martial artists from around the planet compete against each other to fight and defeat the legendary master and reveal the secrets of Ta•o Taido. The game appears to be similar to other 2D versus fighting games during its release, but has different gameplay. The player's character fights against his or her opponent in single round matches in a single player tournament mode with the computer or against another human player, while using very simplistic commands that summon charging attacks. Players press and hold two out of three buttons down to charge up, then move the joystick toward a direction to perform an attack. The longer the players hold two buttons down, the more powerful and longer the attack gets and lasts; however, there are three levels of energy, and after the third and highest charge, it returns to the first and lowest charge. \n \nShort charges create weak moves, medium charges create moderate moves, and long charges create strong attacks. Both players have 3 levels of health in each round, instead of one like in most other fighting games. Ta•o Taido also has a cooperative 2-player feature similar to the ones in SNK's Street Smart and Fatal Fury: King of Fighters. The controls can be switched to what most other fighting games have.","popularity":1.333333333333333,"games":[41828,10039,22418,65832,19333,1235,68391,1875,2977,36911],"tags":[1,268435460,536870973,536871019,536871213,536875075,536875446,536875448,536876085,536876834],"category":0,"keywords":[61,107,301,4163,4534,4536,5173,5922],"themes":[1],"genres":[4],"first_release_date":736214400000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":736214400000,"region":8,"human":"1993-May-01","y":1993,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwltihqdvwxrgs4fgzya.jpg","cloudinary_id":"vwltihqdvwxrgs4fgzya","width":275,"height":392}}