{"id":86685,"name":"Bingo Gems: Online Casino Game","slug":"bingo-gems-online-casino-game","url":"https:\/\/www.igdb.com\/games\/bingo-gems-online-casino-game","created_at":1518600638281,"updated_at":1518701385189,"summary":"Bingo is one of the most popular and easiest game played by millions of people all over the world today. It is also known as Housie and Tambola. In Italy, it is called lotto. In Paris, the game was also known as Le Lotto.\n\nThis is played in other countries like France, Great Britain and other parts of Europe. Bingo originates from the Italian lottery, Il Gioco del Lotto d'Italia. T\n\nThe objective of the Bingo gems is to mark 5 numbers up or down, across or diagonally and call “Bingo” faster than the opponents. \n\nThis is a game played on cards, which contain 25 squares arranged in five vertical columns and five side to side rows. Each space in the grid contains a number. \n\nA classic Bingo gems game uses the numbers list starting from 1 to 75. This list displays the called out numbers. And also five columns of the card are represented by letters B, I, N, G and O from left to right. The centre space is usually marked as a Free Space, and is filled already in all the cards. The range of printed numbers that can appear on the card is normally restricted by column, with the 'B' column only containing numbers between 1 and 15 inclusive, the 'I' column containing only 16 through 30, 'N' containing 31 through 45, 'G' containing 46 through 60, and 'O' containing 61 through 75.\n\nEach player try to match the numbers rolled\/drawn at random with numbers on a card. When any player completes marking, any row\/column\/diagonal\/corners, they call BINGO! or HOUSIE!. The first player to call Bingo will be the Winner.\n\nThe will to win, the desire to succeed, the urge to reach your full potential by keeping eye on the numbers are the keys that will unlock the door to excellence to increase your competency and speed. \nHappiness is playing Bingo gems..!!!\n\nStart playing the very popular & easiest Bingo gems game with your family and friends.\n\nAre you really interested in Bingo games? Are you looking for best Bingo game?\n\nThen what are you waiting for? Hurry Up!!!! Download Bingo gems Now!!\n\n**** Bingo gems Features ****\n\n1.\tFast Paced Gameplay\n2.\tSingle and multiple cards to choose from\n3.\tBoosters to help you Win\n4.\tDaily Bonus to Win credits\n5.\tPlay Bingo gems with millions of players all over the world\n\nPlease Rate and review Bingo gems and help us bring out more games for you to enjoy.\n\nYour support will be our greatest motivation!\n\nEnjoy playing Bingo gems!","rating":80,"popularity":1.666666666666667,"total_rating":80,"total_rating_count":0,"rating_count":0,"category":0,"keywords":[611,3171],"first_release_date":1512086400000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1512086400000,"region":8,"human":"2017-Dec-01","y":2017,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vje3rkpkwewqcluzqkm4.jpg","cloudinary_id":"vje3rkpkwewqcluzqkm4","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cgu790ctix5tik61aiwx.jpg","cloudinary_id":"cgu790ctix5tik61aiwx","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aynvd70atgzrzpithp5n.jpg","cloudinary_id":"aynvd70atgzrzpithp5n","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rlfzwpkilfyettakv6is.jpg","cloudinary_id":"rlfzwpkilfyettakv6is","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pbhwrdgjxufsjv9rurnc.jpg","cloudinary_id":"pbhwrdgjxufsjv9rurnc","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uv5rezywxacwcu0un50b.jpg","cloudinary_id":"uv5rezywxacwcu0un50b","width":512,"height":512}}