{"id":86885,"name":"Plug for Minecraft","slug":"plug-for-minecraft","url":"https:\/\/www.igdb.com\/games\/plug-for-minecraft","created_at":1518610204984,"updated_at":1523427903746,"summary":"** A World first! Commands for Minecraft just like the PC version!! AND Online Multiplayer with full Grief Protection! (Prevent TNT etc), all without the need to login to a Live account!\n\n** Another World first - Now you can also connect Plug to (and host) Minecraft running on other iOS devices, Windows 10 PCs, Xbox One, virtual reality platforms, and other mobile devices. (without anything extra to pay), all with the same Plug commands and features as when hosting on iOS. Just start the world on your other device and then use the App to host that game online!\n\n- Host your own server on iOS without any subscriptions EVER.\n- Full ONLINE MULTIPLAYER (including BlueTooth) - connect in seconds, not minutes like other apps (just check our reviews).\n- Get your own IP address (that's always yours and never changes) to share with your friends, so anyone can connect from any device.\n- Play with anyone, not just Xbox Live friends, and without Live Gold membership - host on our huge network of hundreds of thousands of players.\n\n- Now you can use commands like ‘invisible’, 'kick' and 'ban' in Minecraft and lots more in your OWN Minecraft Server :)\n- Post your server online WITH grief protection! (Prevent use of TNT or any other item or block!) - private AND public servers supported.\n- Play with your friends over BlueTooth when a WiFi connection isn't available.\n- Play multiplayer online on hundreds of Pocketmine servers AND thousands of servers hosted by users just like you :)\n- Make friends, and invite them to play with you.\n\nPlug for Minecraft plugs into Minecraft to give you ‘Bukkit’ style commands in your game. Plug works in both single AND multiplayer games, so both you as the owner of the world, and players who connect are able to use the commands available.\n\nPlug for Minecraft also adds full ONLINE multiplayer to Minecraft - not just playing with Xbox Live friends. Now you can play with friends located anywhere in the world AND voice chat with them while you play! Best of all you can now do this with Windows 10 PCs, Xbox One, virtual reality platforms, and other mobile devices too!!\n \nAll commands are controlled from inside Minecraft chat, just like Plugins on the PC version of Minecraft.\n\nNow you can use commands like ‘invisible’ to hide yourself in worlds. For example '.in me on' will hide you from all other players :)\n\nIn this version we’ve added an external hosting option. Now you can host any Minecraft games on your network just like you're use to with iOS. This works with Minecraft on Windows 10 PCs, Xbox One, virtual reality platforms, other iOS devices, and other mobile devices - and even Pocketmine servers running on your PC.\n\nPlug is very easy to use, all you have to do is open Minecraft and start a world. Once in the game use commands by typing them directly into the chat. For example to show help: .h\n\nPlug is a world first and no other App exists like it on the App Store. We are constantly developing it and hope to implement many more exciting things!\n\nV3.00 - As of version 3.00 you now need an internet connection for commands (even if you do not want to play online). However simple bluetooth connection will work without an internet connection.\n\nDisclaimer – This is a third party App, it is not the game Minecraft or affiliated with the game, its creators, Xbox or Xbox Live in anyway.","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[36794,36608,34919,51485,22819,40524,51683,24199,23175,16468],"tags":[1,268435489],"category":0,"themes":[1],"genres":[33],"first_release_date":1423008000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1423008000000,"region":8,"human":"2015-Feb-04","y":2015,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lhd79nnwttocccrq9tnq.jpg","cloudinary_id":"lhd79nnwttocccrq9tnq","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rjsiappv5tk2opctylmt.jpg","cloudinary_id":"rjsiappv5tk2opctylmt","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n0sstyefdqidipqs1ooo.jpg","cloudinary_id":"n0sstyefdqidipqs1ooo","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ngyu7al9rw52lxpr4cld.jpg","cloudinary_id":"ngyu7al9rw52lxpr4cld","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hlccbkqlwdihfssigdac.jpg","cloudinary_id":"hlccbkqlwdihfssigdac","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xuf7sghndnkcd7jfyp4i.jpg","cloudinary_id":"xuf7sghndnkcd7jfyp4i","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qj3qxcksjjyl7y57eil1.jpg","cloudinary_id":"qj3qxcksjjyl7y57eil1","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kesxg2jtdqhnhtnpixk8.jpg","cloudinary_id":"kesxg2jtdqhnhtnpixk8","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qh23b7meebpiixi2jbcc.jpg","cloudinary_id":"qh23b7meebpiixi2jbcc","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eiyccqrehcabqj8kq56m.jpg","cloudinary_id":"eiyccqrehcabqj8kq56m","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/trw4uovqw6d0u9enxuco.jpg","cloudinary_id":"trw4uovqw6d0u9enxuco","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/plug-for-minecraft\/id960128616?mt=8&uo=4"}]}