{"id":26738,"name":"Medieval Europe","slug":"medieval-europe","url":"https:\/\/www.igdb.com\/games\/medieval-europe","created_at":1484066784726,"updated_at":1484069046185,"summary":"Medieval Europe is a multiplayer strategic game set in Middle Ages where you can help your kingdom to be the best among the others.\r\n\r\nThe game simulates the Middle Ages so it could be a little difficult to survive.\r\n\r\nTo be successful you need to careful plan your actions, convince real people to follow you, organize the logistics, plan your tactics to win wars.\r\n\r","storyline":"In this game you will enjoy a unique adventure and experience life in the European Dark Ages were conflict was rife, and the Pope and Church were very powerful and highly influential.\r\n\r\nAre you are ready to immerse yourself in this alluring world and choose your calling? You have the option to either become an enterprising merchant or a courageous commander or a far-sighted governor or better still you are the architect of your destiny.\r\n\r\nTravel to Europe in search of glory on the battlefields or devise dangerous plots in the diplomatic world in court; transport your precious merchandise to new and flourishing markets and increment your wealth; troops of mercenaries are ready to serve those who they can benefit most from; if you manage to accumulate enough possessions, become the owner of a significant and extensive estate, and serve thy Master, you might eventually be rewarded with an noble title.\r\n\r\nWho knows... One fine day you might also be remembered as The Magnificent One...","popularity":1.333333333333333,"games":[55029,2015,12982,22399,6985,7440,36594,37059,30229,16125],"tags":[39,22,268435467,536871717,536871938,536872316,1073741829],"game_engines":[298,299],"category":0,"player_perspectives":[5],"game_modes":[2,3],"keywords":[805,1026,1404],"themes":[22,39],"genres":[11],"first_release_date":1314835200000,"platforms":[82],"release_dates":[{"category":0,"platform":82,"date":1314835200000,"region":1,"human":"2011-Sep-01","y":2011,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r4sxxmhbito8rpoi2wg5.jpg","cloudinary_id":"r4sxxmhbito8rpoi2wg5","width":974,"height":1335}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/avygznvniwqj8elgxpbo.jpg","cloudinary_id":"avygznvniwqj8elgxpbo","width":1024,"height":1024},"esrb":{"rating":4},"pegi":{"rating":3},"websites":[{"category":1,"url":"https:\/\/www.medieval-europe.eu"},{"category":4,"url":"https:\/\/www.facebook.com\/MedievalEurope\/"},{"category":5,"url":"https:\/\/twitter.com\/medieval_europe?lang=it"}]}