{"id":838,"name":"Pro Pinball: Big Race USA","slug":"pro-pinball-big-race-usa","url":"https:\/\/www.igdb.com\/games\/pro-pinball-big-race-usa","created_at":1317749255000,"updated_at":1533836798174,"summary":"A whirlwind frenzy of color, sound, and adrenaline-pumping action. Take an exciting ride across the USA for your chance to compete in the big race and win hoards of cash. But watch out for the police car on your tail. Packed with more features than your local multiplex, Big Race USA brings a whole new dimension of mind-boggling realism to your PlayStation. \n \nIf you've always wanted a pinball machine but just didn't have the money, you'll be delighted at the real-life pinball physics now available on the PlayStation. The PRO PINBALL series strikes again, this time with an auto-themed trek across the country. All of the realistic touches of arcade pinball are present from the bumpers right down to the click of the flippers. You can adjust the camera three different ways to view the table from any angle you desire, and you can even take a gander at a pre-game slideshow that details the table's layout. It's easy to change the table rules, switch the screen position, tweak the graphics and sound, and choose a difficulty level: Extra Easy, Easy, Medium, Hard, or Extra Hard. There's also a custom difficulty level that allows you to adjust any of the game's settings to provide extra challenges or assistance for yourself. Add in magnetic ball saving, multiball, and other bonuses and you've got yourself one heck of a cross-country journey. Pinball wizards and videogamers alike will revel in the thorough attention to detail and creativity in PRO PINBALL: Big Race USA.","collection":1703,"rating":70.6281500061783,"popularity":1.333333333333333,"aggregated_rating":87,"aggregated_rating_count":1,"total_rating":78.81407500308916,"total_rating_count":5,"rating_count":4,"games":[3772,103316,20385,103020,101172,46372,42817,25612,12905,23314],"tags":[1,268435466,268435486,536871846,536874337,536875117,536875368,536875410,536875411,536875412,536875531,1073741825],"developers":[681],"publishers":[340],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[934,3425,4205,4456,4498,4499,4500,4619],"themes":[1],"genres":[10,30],"first_release_date":915062400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":915062400000,"human":"1998-Dec-31","y":1998,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s46qbjqknnbkrac2clwp.jpg","cloudinary_id":"s46qbjqknnbkrac2clwp","width":546,"height":633},"esrb":{"rating":3}}