{"id":9738,"name":"Swordsman Online","slug":"swordsman-online","url":"https:\/\/www.igdb.com\/games\/swordsman-online","created_at":1429020692761,"updated_at":1517270838467,"summary":"Swordsman gameplay has a focus on action-oriented combat that is less focused on stats and more on player skill. Players can excel through character mobility, aerial combat, twitch reflexes, dodging, and dynamic combat styles inspired by martial arts.\n\nZones dynamically transform as a result of player actions and the actions of player guilds. As players move through the main story, the environment may change based on their decisions. Towns will be destroyed or saved, new NPCs and quest givers will appear, and secret rooms will be revealed. Players can see the effects of their decisions reflected in the balance between good and evil in each zone.\n\nAlthough was born in China, Swordsman Online aka Võ Lâm Truyền Kỳ became  a major hit of Vietnamese gaming community early 2000s. It survives until now and has 9 major update patches including Võ Lâm Truyền Kỳ 2 and several visual and gameplay improvement.","storyline":"Swordsman is based upon the novel The Smiling, Proud Wanderer (Xiao Ao Jiang Hu) by Louis Cha, the best-selling Chinese writer alive. He’s famed for his wuxia novels, with 100 million copies of his works sold worldwide. As part of the wuxia genre of Chinese martial arts and chivalry, in Swordsman, the player takes the role of a wandering hero and experiences the hero’s rise to glory amongst one of ten schools of martial arts, the quest to avenge the hero’s destroyed village, and the opportunity to adventure with great heroes around the world.","popularity":2,"aggregated_rating":68,"aggregated_rating_count":1,"total_rating":68,"total_rating_count":1,"games":[81249,34155,78632,102584,80916,90099,106987,101211,76253,107292],"tags":[1,22,38,268435460,268435468,268435481,268435487,536871401,1073741826],"developers":[5219],"publishers":[5219],"category":0,"player_perspectives":[2],"game_modes":[5],"keywords":[489],"themes":[1,22,38],"genres":[4,12,25,31],"first_release_date":1041379200000,"platforms":[6],"release_dates":[{"category":1,"platform":6,"date":1041379200000,"region":7,"human":"2003-Jan","y":2003,"m":1}],"alternative_names":[{"name":"Võ Lâm Truyền Kỳ ","comment":"Vietnamese Title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yv78wp2fum5i109hen1z.jpg","cloudinary_id":"yv78wp2fum5i109hen1z","width":882,"height":616}],"videos":[{"name":"Trailer","video_id":"m72J83KV2xY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rktixu3n7tqzknpfxw45.jpg","cloudinary_id":"rktixu3n7tqzknpfxw45","width":250,"height":345},"websites":[{"category":1,"url":"http:\/\/www.arcgames.com\/en\/games\/swordsman"}]}