{"id":17587,"name":"BloodRealm: Battlegrounds","slug":"bloodrealm-battlegrounds","url":"https:\/\/www.igdb.com\/games\/bloodrealm-battlegrounds","created_at":1455281589192,"updated_at":1497703773149,"summary":"BloodRealm combines all of the strategy and depth of a traditional collectible card game experience with the convenience of online gaming.  Build your own decks to play against your friends, compete in online tournaments, and explore a rich fantasy world in a single-player campaign mode.  \n\nBloodRealm places you amidst the eternal warring of the gods. The covenant which decreed that the gods would respect the free will of mortals was broken by the powerful sun god Ra, who consumed a mortal mind to serve him as champion, leading his armies into war.\n\nThat champion is you; the game begins when you shrug off the mental bondage of Ra, an act so cataclysmic that reality broke, and all of the gods the heavens bore fell to the Earth. The gods are desperate to restore their immortality and regain their place at the zenith of the world. Only you possess the strength of will powerful enough to stop history repeating and end their tyranny once and for all.\n\nCan you make your own miracle and kill the gods?\n\nThere are Six Realms of Magic in BloodRealm: Chaos, Order, Nature, Myth, Shadow and Light.  Each Champion has access to 2 of these Realms in building a deck composed of powerful ally and spell cards. Champions also have a special unique 'Blood' ability, with additional Blood powers unlocked as they Ascend to become Gods themselves.  \n\nThe free download of BloodRealm provides each player with the choice of one of three Champions, its starting Deck of Ally and Spell cards, 1000 Gold, and 36 single-player Campaign battles (each with 3 levels of difficulty). Additional Champions, single-player Campaigns, and card packs may be purchased using Gold, which may be earned by playing the game or by spending real currency.","popularity":1.333333333333333,"games":[75813,5613,49414,25636,25311,75398,18811,36608,74929,21842],"tags":[268435468,268435471],"developers":[8855],"publishers":[8854],"category":0,"game_modes":[1,2],"genres":[12,15],"first_release_date":1420329600000,"pulse_count":1,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1420329600000,"human":"2015-Jan-04","y":2015,"m":1},{"category":0,"platform":14,"date":1420329600000,"human":"2015-Jan-04","y":2015,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lq4kjkajarupilzpragd.jpg","cloudinary_id":"lq4kjkajarupilzpragd","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lfhkftdy7xvewbpamzjd.jpg","cloudinary_id":"lfhkftdy7xvewbpamzjd","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jhs8ldqqkrlw5mqybh0d.jpg","cloudinary_id":"jhs8ldqqkrlw5mqybh0d","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b8kibkyoihdifjzivfni.jpg","cloudinary_id":"b8kibkyoihdifjzivfni","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bahpvb3mqgixngas8ifi.jpg","cloudinary_id":"bahpvb3mqgixngas8ifi","width":1920,"height":1080}],"websites":[{"category":1,"url":"http:\/\/www.bloodrealm.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/311700"}],"external":{"steam":"311700"}}