{"id":26187,"name":"Heart. Papers. Border.","slug":"heart-papers-border","url":"https:\/\/www.igdb.com\/games\/heart-papers-border","created_at":1480757790561,"updated_at":1523354572468,"summary":"Heart. Papers. Border. is an optimistic strategy game about travelling, freedom and changing the world!  \n  \nYou are a freelance adventurer who wants to experience everything planet Heart has to offer, regardless of the inherited privileges determined by the country of your birth.  \n  \nCONCEPT  \nYou travel to learn, and as you pay a closer attention to what each country has to offer, you gather wisdom that you channel in a blog that grows in popularity. Eventually you come to grasp the power of your influence: where you pass, things change faster to the better, and locals that you have met increasingly demand openness from their governments. You have always been an optimist and dreamed of a completely border free world, but as you travel, you realise you might actually actually live to see your dream come true - that of living in a world without borders!  \n  \nVISUALS  \nHeart. Papers. Border. is inspired by NASA's Visions of the Future posters, The Jetsons' cartoon series and current real life events. We chose vibrant colours and a retro futuristic style to gently remind you that Heart, just like Earth, is moving towards openness, kindness and love, even though the movement might sometimes seem too slow to notice. But you can always make a difference!  \n  \nGAMEPLAY  \nHeart. Papers. Border. is as easy or as challenging as you want it to be. Through very simple control mechanics and up front information, you can strategize an optimal life that allows you to see the last border disappear in the course of your long and safe life. With multiple win conditions, challenging puzzles and morally difficult quests, Heart. Papers. Border. simply asks you how do you choose to live this virtual life  \n  \nSo how will you play?  \n- Create your Multipass and choose your Citizenship (Easy, Med, High, Random); this determines your starting conditions  \n- Take a look at your native country, look at the Top Bar to see your situation and starting conditions  \n- Click on touristic objectives to visit them, click on countries to apply for Visas and then visit them  \n- Gather hashtags from visiting objectives and write blog posts in your SpacePad  \n- Gain followers, become influential, and notice how planet Heart responds to your actions  \n  \nA few Development Details  \nThis is a Pre Alpha game, and we have many features in the pipeline which are Work in Progress now. If you wish to keep track of our progress, we shared our live game design wiki so check our presence on the web. Please keep in mind:  \n- We aim to launch the first version of Heart. Papers. Border. somewhere this summer  \n- This is an evolving game, we aim to progressively update it until we or our community is out of ideas (which we hope is for years to come)  \n- We practice Open Game Design and welcome any feedback","storyline":"You are a freelance adventurer who wants to experience everything planet Heart has to offer, regardless of the inherited privileges determined by the country of your birth.  \n  \nYou travel to learn, and as you pay a closer attention to what each country has to offer, you gather wisdom that you channel in a blog that grows in popularity. Eventually you come to grasp the power of your influence: where you pass, things change faster to the better, and locals that you have met increasingly demand openness from their governments. You have always been an optimist and dreamed of a completely border free world, but as you travel, you realise your influence into actually living to see your dream come true - that of living in a world without borders!","hypes":2,"popularity":2.333333333333333,"games":[25311,17130,34823,33603,13200,65827,35994,31515,18623,29173],"tags":[18,268435469,268435471,268435488,536871334,536871939,536873019,1073741827],"developers":[11664],"game_engines":[404],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[422,1027,2107],"themes":[18],"genres":[13,15,32],"first_release_date":1503187200000,"status":4,"platforms":[34,6,39,14,3],"release_dates":[{"category":2,"platform":34,"date":1546214400000,"region":8,"human":"2018","y":2018,"m":12},{"category":0,"platform":3,"date":1503187200000,"region":8,"human":"2017-Aug-20","y":2017,"m":8},{"category":0,"platform":14,"date":1503187200000,"region":8,"human":"2017-Aug-20","y":2017,"m":8},{"category":0,"platform":6,"date":1503187200000,"region":8,"human":"2017-Aug-20","y":2017,"m":8},{"category":0,"platform":39,"date":1537401600000,"region":8,"human":"2018-Sep-20","y":2018,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qg2ihuv7lavguhnapxvw.jpg","cloudinary_id":"qg2ihuv7lavguhnapxvw","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nhhudavay2knteja5tkv.jpg","cloudinary_id":"nhhudavay2knteja5tkv","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xsodmd405lxvqwjookqj.jpg","cloudinary_id":"xsodmd405lxvqwjookqj","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qovroumtfjcuioyoe5mi.jpg","cloudinary_id":"qovroumtfjcuioyoe5mi","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wcl2duetrvxzrwujmxuy.jpg","cloudinary_id":"wcl2duetrvxzrwujmxuy","width":1920,"height":1080}],"videos":[{"name":"Gameplay video","video_id":"Sdyeoh8mEjY"},{"name":"Gameplay video","video_id":"n6csGOImZMM"},{"name":"Gameplay video","video_id":"RVASLnOucro"},{"name":"Trailer","video_id":"jY1b0LeW6vE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mpbmvxzao4sv4l58fomx.jpg","cloudinary_id":"mpbmvxzao4sv4l58fomx","width":512,"height":512},"esrb":{"rating":1},"pegi":{"rating":2},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/604110"},{"category":9,"url":"https:\/\/www.youtube.com\/playlist"},{"category":5,"url":"https:\/\/twitter.com\/sarienn"},{"category":4,"url":"https:\/\/www.facebook.com\/heartpapersborder"},{"category":1,"url":"http:\/\/www.heartpapersborder.com"}],"external":{"steam":"604110"}}