{"id":41487,"name":"Planetary Guard: Defender","slug":"planetary-guard-defender","url":"https:\/\/www.igdb.com\/games\/planetary-guard-defender","created_at":1498818428927,"updated_at":1500269777014,"summary":"Planetary Guard: Defender is twin-stick a shoot’em up with defense elements. The player pilots a lone space tank on orbits of planets while attempting to defend planets from ever increasing waves of alien spaceships. The plot takes the player through a series of missions as a member of the Planetary Guard, a galactic militia formed of conscripts and volunteers with outdated equipment, who are left on their own to defend strategically less important backwater planets in the war against alien bugs. \n \nObjectives of missions vary from destroying all enemies to defending targets on ground or on orbit such as other space ships. Each mission features dozens of enemies with different behaviors, for example, some attempt to destroy targets on planets and some attack the player immediately where as others go for players defense structures immediately. Destroying enemies leaves debris on the battlefield and bonus pick-ups, which give either health, score bonuses, multipliers, special weapons or boosts to existing weapons. \n \nBetween missions player visits the hangar in which he can buy or upgrade his tanks main weapon, hull or shield systems. There he can also buy defences, such as mines and turrets, which are dragged to the battlefield during missions. Items are bought and upgraded with Bucks and IGC, which are gained from missions. Bucks are collected from fallen enemies and IGC is translated from score gained in missions. \n \nMissions have side objectives, of which completion is awarded with medals. Side objectives are usually something difficult to achieve such as pass the mission under X seconds or gain X amount of score in the mission. These medals are required to open new missions and as such to advance in the game.","popularity":1,"games":[76246,19341,28029,32902,24920,272,68287,10039,68142,36608],"tags":[1,268435461],"category":0,"themes":[1],"genres":[5],"first_release_date":1402704000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1402704000000,"region":8,"human":"2014-Jun-14","y":2014,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zbgozxqozjjqvw2zbpkb.jpg","cloudinary_id":"zbgozxqozjjqvw2zbpkb","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jqwiddhsdllwybu0dcdd.jpg","cloudinary_id":"jqwiddhsdllwybu0dcdd","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ll8e0o9nbwjauernluau.jpg","cloudinary_id":"ll8e0o9nbwjauernluau","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/erzjkmy5u9npf7beb4co.jpg","cloudinary_id":"erzjkmy5u9npf7beb4co","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yrg3ptdgh1ks4yu4agdf.jpg","cloudinary_id":"yrg3ptdgh1ks4yu4agdf","width":1024,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vpqkwbl1eig4h3eie167.jpg","cloudinary_id":"vpqkwbl1eig4h3eie167","width":2048,"height":1136}}