{"id":76087,"name":"Pirates Sea Journey","slug":"pirates-sea-journey","url":"https:\/\/www.igdb.com\/games\/pirates-sea-journey","created_at":1511130603240,"updated_at":1511157348136,"summary":"Sea Journey is a match three game. In between the stories told on the map, you will encounter battles. You must match three items on the puzzle to affect the outcome of the battle. Match cannonballs to fire on your enemy. Match coins to gain gold. Match scrolls to gain experience. Match red, blue or green gems to use talismans, when you get them. Later, match wheels to move your ship away to, hopefully, throw off your enemy's aim. You can match three times of your choice. After that, the enemy makes three matches. If you or your enemy match four or five of the same item, you or they will get one or two extra matches, respectively. \n \nAfter the battle, if you win, you can enter port to use your experience to upgrade you attack, defense, movement and\/or gold-gathering abilities, install any talisman you have and\/or, if you have the gold, upgrade to a better ship. Fighting battles also gains you treasure maps that lead to other islands where treasure is buried. To get the treasure, you must solve puzzles,some like a Concentration-style where you must find and match symbols of the same color.","storyline":"You are a sea captain and pirate, as was your father and grandfather. You are on the trail of buried treasure but, of course, other pirates want what you have. Defeat these scurvy dogs in sea battles and gather gold and experience.","popularity":1.333333333333333,"tags":[1073741828],"developers":[13917],"publishers":[623],"category":0,"player_perspectives":[4],"genres":[9],"first_release_date":1237161600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1237161600000,"human":"2009-Mar-16","y":2009,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s0bcmzu7bisk4yay2twa.jpg","cloudinary_id":"s0bcmzu7bisk4yay2twa","width":1024,"height":768}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ocidrkjgz5iihz0lnbe2.jpg","cloudinary_id":"ocidrkjgz5iihz0lnbe2","width":318,"height":450},"pegi":{"rating":1}}