{"id":86887,"name":"Kingdom Rush Origins HD","slug":"kingdom-rush-origins-hd","url":"https:\/\/www.igdb.com\/games\/kingdom-rush-origins-hd","created_at":1518610531874,"updated_at":1523428074163,"summary":"***Best Mobile Game 2015 DICE Nominee***\n\nThe most addicting tower defense game returns in an all-new prequel adventure - welcome to Kingdom Rush: Origins! \n\nPraise for the Kingdom Rush series: the #1 Strategy Game franchise for the iPhone, iPod touch, and iPad, Apple’s Editor’s Choice Award, IGN Editor's Choice, Slide To Play Must Have, GameInformer Gold Award, 148 Apps Editor's Choice, Jay is Games Game of the Year, Pocket Gamer Gold Award,CNET Best iPad Games, CNET Editor’s Choice Award, Gamezebo 4.5\/5, Touch Arcade 4.5\/5, Venturebeat94\/100.\n\nWhat critics are saying about Kingdom Rush: Origins:\n\n\"The Kingdom Rush franchise is one of the best tower defense series around, and the third entry, Origins, is as fun as the franchise has ever been.” –Entertainment Weekly\n\n“I’ve played plenty of tower defense games over the years, but none have ever captured my heart the way the Kingdom Rush series has.” –The Verge\n\n“Kingdom Rush Origins HD is more of the same, for the most part, and that’s an excellent thing.\" –148 Apps \n\n“Great looks, super fun game play, enjoyable music and fun Easter Eggs. Anyone who loves tower defense games ought to have this on their device.\" –TUAW\n\n“Everything you might expect from a new game in the wonderfully addictive tower defense series: new towers, new heroes, fantastic gameplay.\" –Kotaku \n\n\"If you’re a fan of tower defense, you’re well acquainted with Kingdom Rush and its sequel, Kingdom Rush Frontiers. This third entry in the series is available now, and yes, it’s the best to date.\" –Gamezebo \n\nKingdom Rush: Origins is the third installment of the award-winning Kingdom Rush saga, loved by millions and earning accolades from gamers and critics around the globe. Take a trip back to the beginning, before Vez’nan ever thought to threaten the kingdom with the gem of power, and experience even more of the lightning-fast, exceptionally captivating gameplay that made the franchise a cornerstone of essential tower defense games. In this exciting prequel, command your elven army and defend mystical lands from sea serpents, evil sorcerers, and wave after wave of gnoll tribesman, all with the help of brand-spankin’ new towers, heroes, and spells to fend off every last baddie. \n\nKingdom Rush: Origins packs in a treasure trove of new content and features while keeping the signature look that millions have come to love. \n\nGAME FEATURES\n\n\t•\tRe-enter the world of Kingdom Rush: visit mysterious elven forests, magical faery realms and even floating ruins of an ancient metropolis!\n\t•\tUnleash the power of the elves with brand new towers and troops! Elf Archers, Mystic Mages, Stone Druids and the Elven Infantry make up the backbone of your army.\n\t•\tDiscover eight new specialized tower upgrades with over 18 abilities! Vanquish your enemies with elven marksmen, runed bears, magic-wielding wizards, and even giant animated trees.\n\t•\tTake up arms against 30 new enemy types and engage in epic boss battles! Face hordes of Gnolls, giant spiders, and the terrible Twilight army.\n\t•\tMaster and upgrade nine legendary heroes and their awesome powers and spells!\n\t•\tRain lightning, summon reinforcements, and use each hero’s unique power to obliterate scores of enemies!\n\t•\tImmerse yourself in hours of gameplay with over 70 achievements, with three difficulty modes for the newbs and veterans alike. \n\t•\tPlay different game modes - Classic, Iron, and Heroic - and prove your mettle as a master tactician.\n\t•\tPurchase new-and-improved equipment using your hard earned gems in a revamped Gnome shop.\n\t•\tStudy your enemies and your towers with an in-game encyclopedia","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[25640,25311,36608,34919,11362,9760,33603,36962,40524,55888],"tags":[1,268435471],"category":0,"themes":[1],"genres":[15],"first_release_date":1416441600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1416441600000,"region":8,"human":"2014-Nov-20","y":2014,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eyjyylvybxl5ej08ycyx.jpg","cloudinary_id":"eyjyylvybxl5ej08ycyx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/otz0gjnubskdjtn6xiwb.jpg","cloudinary_id":"otz0gjnubskdjtn6xiwb","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pripdxogrk3hyhb1b5bb.jpg","cloudinary_id":"pripdxogrk3hyhb1b5bb","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sdls1nmgse8fp6l1ou2m.jpg","cloudinary_id":"sdls1nmgse8fp6l1ou2m","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/voyqhnchqks1kait5acc.jpg","cloudinary_id":"voyqhnchqks1kait5acc","width":552,"height":414}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o2xuv3jss9kxcqmmysky.jpg","cloudinary_id":"o2xuv3jss9kxcqmmysky","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/kingdom-rush-origins-hd\/id904737541?mt=8&uo=4"}]}