{"id":95287,"name":"Magic Kinder - Educational app","slug":"magic-kinder-educational-app","url":"https:\/\/www.igdb.com\/games\/magic-kinder-educational-app","created_at":1521822885173,"updated_at":1522770936696,"summary":"Magic Kinder - Educational App\n\nMagic Kinder is a world of fun and education designed to help families play and learn together through engaging games, activities, videos and stories in a safe environment.\nPlay is vital to children’s growth and development and Magic Kinder is designed to deliver learning opportunities through fun and engaging content.\nMagic Kinder is completely FREE! There are no ads, no subscription required and no in-app purchases.  \nAnd we help parents too! Magic Kinder also contains videos and activities to help you make the most of your time with your children.\nThe application does not include any reference to Kinder chocolate products. \nThe physical toy surprises are the only reference to the product. No chocolate is shown!\n\nThe app includes the following content and features:\n\nSURPRISERY\nThe Kinder Surprises toys can now be collected digitally in two different ways:\n1. Scan the QR code found in the egg and you get to unblock the same surprise or a random one.\n2. Through the ‘surprise of the day’, a random Kinder Surprise toy is unlocked.\n\nPLAY & LEARN\nIf you are looking for fun games and activities for your child, then the playzone is the right place. It has multiplayer games for 3-10 year old kids geared towards improving children’s educational and cognitive development by focusing on various skills such as perception, attention, visual, motor and problem solving skills.\nA selection of the games is focused on various topics such as: music, nursery rhymes, math and language. All designed towards being fun and playful.\nDepending on countries and date, Magic Kinder also includes games and activities from some of the most popular characters: Despicable Me, Barbie, Hello Kitty, The Happos Family, Oddbods, Care Bears and much more.\n\nWATCH VIDEOS\nNew videos are added frequently and they include: tutorials to do together as a family, cartoons, stop motion episodes, documentaries and more. Some of the activities include:\nKaraoke Style Sing and dance along videos\nRecipe and crafting tutorials to do together with your children dedicated to different festivities around the world like Halloween, Christmas, Easter, Chinese New Year, Ramadan and Diwali \nPhysical activity tutorials for the whole family \nCartoons and documentaries \nStop-motion videos featuring the Kinder egg surprise toys\n\nDISCOVER THE PLANET\nThrough a collection of quizzes, facts and curiosities your child can learn about our planet and its wonders, explore nature and the animal world\n\nDRAW & PAINT\nAmazing New Feature: Bring your kids' creations to life through Augmented Reality! This functionality enables children to see their colored animals in 3D and interact with them. They will also repeat what your child says. \n\nSTORIES\nA selection of fun and interactive bedtime stories. \n\nUSE THE APP OFFLINE - most of e content is available also without an internet connection\nMagic Kinder is certified by the kidSAFE® Seal Program. To learn more, visit http:\/\/www.kidsafeseal.com\n\nPARENT SECTION\nA pin-protected zone is available for parents to manage the account, personalise and set time limits giving you control over your child's usage of the app.\nIf you wish to contact us, please do so through contact@magic-kinder.com\nIf you have any questions regarding the privacy policy please write to privacy@ferrero.com\n\nIMAGINATION is the REAL SURPRISE!","rating":50,"popularity":1,"total_rating":50,"total_rating_count":0,"rating_count":0,"games":[95651,90806,90796,89764,89732,89493,89304,89297,89135,89129],"tags":[536872030],"category":0,"keywords":[1118],"first_release_date":1509321600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1509321600000,"region":8,"human":"2017-Oct-30","y":2017,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pki4rsergheu2v1krhqw.jpg","cloudinary_id":"pki4rsergheu2v1krhqw","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hnyekmwzev0zakk3vrzo.jpg","cloudinary_id":"hnyekmwzev0zakk3vrzo","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rwpoegfhjtuis2anm2x0.jpg","cloudinary_id":"rwpoegfhjtuis2anm2x0","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a7fiprhjrqqsysawzavy.jpg","cloudinary_id":"a7fiprhjrqqsysawzavy","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kayu0udynrhpeqmwr2xs.jpg","cloudinary_id":"kayu0udynrhpeqmwr2xs","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/or724qgajypuchgzogxu.jpg","cloudinary_id":"or724qgajypuchgzogxu","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gwd7ykshthfs0vrcsy7i.jpg","cloudinary_id":"gwd7ykshthfs0vrcsy7i","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zgs5gitoy1rzrqdpceaq.jpg","cloudinary_id":"zgs5gitoy1rzrqdpceaq","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xxk4rchtlarvo3bj4uvq.jpg","cloudinary_id":"xxk4rchtlarvo3bj4uvq","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iscdkreuqbchxblnpz0j.jpg","cloudinary_id":"iscdkreuqbchxblnpz0j","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n6a427c5djdzychclfbh.jpg","cloudinary_id":"n6a427c5djdzychclfbh","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/magic-kinder-educational-app\/id836558771?mt=8&uo=4"}]}