{"id":13469,"name":"Cauldron II: The Pumpkin Strikes Back","slug":"cauldron-ii-the-pumpkin-strikes-back","url":"https:\/\/www.igdb.com\/games\/cauldron-ii-the-pumpkin-strikes-back","created_at":1444722414415,"updated_at":1517271106009,"summary":"Cauldron II: The Pumpkin Strikes Back is a computer game developed and published by British developer Palace Software (Palace) as a sequel to their 1985 title Cauldron. The two-dimensional (2D) platform game was released in 1986 for the ZX Spectrum, Commodore 64 and Amstrad CPC home computers. Players control a bouncing pumpkin that is on a quest of vengeance against the \"Witch Queen\". The roles of the two were reversed from the first game, in which the witch defeated a monster pumpkin. \n \nFollowing the success of Cauldron, Palace employee Steve Brown began work on a sequel. To provide fans of the original title with a new experience, a very different gameplay was implemented for the sequel, although several minor features retained connections to the first. Inspired by the bouncing pumpkin character in Cauldron, Brown designed the game around the character's movement. The bouncing mechanic proved problematic for the programmers who were unable to perfect its implementation. Technical limitations also prevented them from implementing certain animations, such as turning pages of a book. \n \nCauldron II was first released on the Commodore 64. It was released in the following years on other systems and as re-releases. The game received praise, mainly for its audio-visuals, in video game magazines. Difficulty in handling the bouncing pumpkin's movement was a common complaint, although reviewers felt the overall package was of good value.","collection":1759,"popularity":1.333333333333333,"games":[16468,26848,10039,37094,1070,28010,47823,29032,37088,12632],"tags":[1,17,268435464,536872092,536873327,536875319,536875540,536876678,1073741828],"developers":[11768],"publishers":[2080],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[1180,2415,4407,4628,5766],"themes":[1,17],"genres":[8],"first_release_date":536371200000,"platforms":[15,26,25],"release_dates":[{"category":2,"platform":25,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":26,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12}],"alternative_names":[{"name":"Cauldron II: La Calabaza Contraataca","comment":"Spanish Title"},{"name":"Hexenküche II: Der Kürbis Schlägt Zurück","comment":"German Title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cvx3mdqgvbhutydwi491.jpg","cloudinary_id":"cvx3mdqgvbhutydwi491","width":769,"height":1209}}