{"id":40069,"name":"Ozma Wars","slug":"ozma-wars","url":"https:\/\/www.igdb.com\/games\/ozma-wars","created_at":1498469290810,"updated_at":1515854381434,"summary":"Ozma Wars is a 1979 fixed shooter arcade game, and the very first game developed and published by SNK, who were still known as \"Shin Nihon Kikaku\" at the time. The game is also known as the second ever vertical shoot 'em up game, after Taito's Space Invaders (which ran on the same arcade hardware), but is also additionally known as the first game with disparate \"levels\". The game is also notable for being the first action game to feature a supply of energy, resembling a life bar, a mechanic that has now become common in the majority of modern action games. The game allowed the player to refuel energy between each level, and it featured a large variety of alien enemies. \n \nThe player controls a space craft which must fend off UFOs, meteors, and comets. Instead of lives, the player is given an energy reserve that is constantly diminishing; getting hit by the enemy causes gameplay to stop momentarily and a large amount of energy is depleted. Every so often, a mothership will appear and dock with the player's spacecraft, allowing the energy to be refilled. There are 3-4 recognizable stages as the game progresses and new enemies begin to appear. After these, the mothership will appear, and the cycle starts over; this continues indefinitely until the energy reaches zero. \n \nThere are two known bootleg versions of this game called Space Phantoms and Solar Flight. In Space Phantoms the player's ship looks like an angel, and the enemies appear as different types of insects. Due to the game being monochrome and a conversion kit for Space Invaders, many Ozma Wars monitors still utilized the Space Invaders color overlay.","popularity":1.333333333333333,"games":[68287,36950,1595,27314,142,73,64204,8773,11253,26766],"tags":[18,268435461,536870915,536871078,536871213,536871644,536871776,536871859,536871882,536871937,536871970,536872390,536873066,536873186,536874547,536875158,536875347,536875358,536875539,536875608,536875879,536876028,536876123,536876240,536876467,536876634,536876857,536877659,536880608],"category":0,"keywords":[3,166,301,732,864,947,970,1025,1058,1478,2154,2274,3635,4246,4435,4446,4627,4696,4967,5116,5211,5328,5555,5722,5945,6747,9696],"themes":[18],"genres":[5],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/glye6fbcocaudepjoyse.jpg","cloudinary_id":"glye6fbcocaudepjoyse","width":850,"height":1202}}