{"id":41369,"name":"Clocks","slug":"clocks","url":"https:\/\/www.igdb.com\/games\/clocks","created_at":1498816095089,"updated_at":1516732851258,"summary":"The fourth game featured as a coverdisk on the Japanese magazine Famimaga, Clocks is a Tetris variant in which clock faces must be placed together form larger shapes. \n \nClocks, or Famimaga Disk Vol. 4 Clocks (and occasionally as \"Clox\"), is a falling blocks puzzle game that is superficially similar to Tetris or Columns. Single clock faces depicting one of four angles fall from the top and the player needs to manipulate and place them so they can form larger objects, such as simple formations like squares, diamonds and hourglass shapes to more object-intensive shapes like octagons and hexagons. \n \nThe four angles include 180 degree lines (\"12:30\"), 90 degree lines (\"12:15\"), 135 degree lines (\"~12:22\") and 45 degree lines (\"~12:07\"). Once a clock face is placed, the lines from it extend to connect to any other lines that surround it. Placing lines in such a way that it forms a shape - for example, placing four 90 degree clocks in such a way to form a square - earns the player points and removes the clocks used to form the shape. Larger shapes are more risky but earn more points. \n \nThe player is given some leeway to recover from mistakes: should the player hold the down button to make a clock fall faster, it'll destroy any clocks underneath. A misplacement, therefore, can be rectified with a correctly positioned clock if it falls quickly enough to crush the offending clock. However, the player can only do this a limited number of times per stage.","collection":3320,"popularity":1,"games":[60044,79080,55036,82953,32510,31235,20342,29173,77597,36553],"tags":[268435465,268435471,536872407,536873787,536874694,536876128],"category":0,"keywords":[1495,2875,3782,5216],"genres":[9,15],"first_release_date":672019200000,"platforms":[51,58],"release_dates":[{"category":0,"platform":51,"date":672019200000,"region":5,"human":"1991-Apr-19","y":1991,"m":4},{"category":0,"platform":58,"date":674611200000,"region":8,"human":"1991-May-19","y":1991,"m":5}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vssqbee5vujvnocxwygw.jpg","cloudinary_id":"vssqbee5vujvnocxwygw","width":256,"height":224}}