{"id":50169,"name":"Wing Commander II: Vengeance of the Kilrathi: Special Operations 2","slug":"wing-commander-ii-vengeance-of-the-kilrathi-special-operations-2","url":"https:\/\/www.igdb.com\/games\/wing-commander-ii-vengeance-of-the-kilrathi-special-operations-2","created_at":1500037627552,"updated_at":1515578273446,"summary":"Morale is at an all-time low... \n \nThe Confederation's electronic grapevine is running amok with rumors that vital intelligence has been withheld by the High Command. Luckily, Special Operations has its own sources of information, and they say the waiting game just won't cut it any longer. Someone has to lead the way, and you're getting the call! \n \nOf course it's a suicide mission — \n \nit's Special Operations! \n \n  Launch into 20 new missions with all the stirring dogfights, compelling plot lines and startling graphics you expect from the Wing Commander series! \n \n  Fly the Morningstar, the Confederation's next-generation super fighter armed with Mace tactical nuclear missiles that can wipe out an entire squadron of Kilrathi! \n \n  Renew old acquaintances — another chance to settle the score with Jazz Colson, and a few more missions with Maniac covering your wing! \n \n  Meet Crossbones, Minx and Talon, all members of Maniac's Wild Eagle Squadron who are testing the Morningstar in combat! \n \n  Refly any mission in Wing Commander II or Special Operations 1 with the Mission Selector program! \n  Hear radio messages from your wingmen and enemy pilots! (Sound Blaster™ or 100% compatible digitized sound board required for speech.) \n \n  Transfer your character from Wing Commander II or Special Operations 1! \n \nTwenty new gut-wrenching missions that could stop your heart! \n \nNot a complete game - you must own Wing Commander II to play Special Operations 2.","popularity":1,"games":[44242,18623,22470,29173,26145,22425,55689,55590,23867,22406],"tags":[268435469,536872060,536873066,536873122,536880258,536886430],"category":0,"keywords":[1148,2154,2210,9346,15518],"genres":[13],"first_release_date":710294400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":710294400000,"region":8,"human":"1992-Jul-05","y":1992,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mprfg0aanwmucb8ura4z.jpg","cloudinary_id":"mprfg0aanwmucb8ura4z","width":640,"height":843}}