{"id":51269,"name":"duplicate Heroes of Might and Magic III","slug":"duplicate-heroes-of-might-and-magic-iii","url":"https:\/\/www.igdb.com\/games\/duplicate-heroes-of-might-and-magic-iii","created_at":1500063140262,"updated_at":1500457904314,"summary":"Heroes of Might and Magic III is a turn-based strategic war game released in 1999, developed by Jon Van Caneghem through New World Computing. It is set up in a classical RPG environment and involves capturing and developing towns, gathering resources, assembling armies and sending them into combat. Each town has a theme and can only raise the type of creatures appropriate to that theme. The resources (gold, wood, ore, gems, crystal, mercury, and sulfur) can be found mostly in mines and are gathered once a day. They are used to build new buildings in your towns, to improve existing buildings, to buy armies, etc. Each army is led by a hero and consists of up to seven stacks of creatures raised in towns or recruited in countryside. The armies are sent into tactical combat, which can occur either in countryside or in towns. If the attacker captures the town, the winner can recruit the creatures raised in that town afterwards. Each game scenario (regular or campaign style) has its own objective which can vary from capturing a specific castle, defeating a specific hero or monster, gathering gold, or finding the Holy Grail.","popularity":1,"games":[11362,9760,33603,36962,55888,73075,65827,44591,2015,32283],"tags":[268435471,536872006],"category":0,"keywords":[1094],"genres":[15],"first_release_date":922579200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":922579200000,"region":8,"human":"1999-Mar-28","y":1999,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gpfez61pmw0lt5l7lggn.jpg","cloudinary_id":"gpfez61pmw0lt5l7lggn","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n8xc1mjkayvwglqk5lbs.jpg","cloudinary_id":"n8xc1mjkayvwglqk5lbs","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/spvzv3tdzm1luu473fcz.jpg","cloudinary_id":"spvzv3tdzm1luu473fcz","width":1920,"height":1080}]}