{"id":86869,"name":"Snowboard Party Pro","slug":"snowboard-party-pro","url":"https:\/\/www.igdb.com\/games\/snowboard-party-pro","created_at":1518609884715,"updated_at":1519504323024,"summary":"Snowboard Party brings the thrill of snowboarding to your mobile device! Get ready to ride the downhill slopes at extreme speed and catch some big air to perform the craziest tricks in 21 completely unique adrenaline-filled mountains\/locations. Jump on your board, learn new moves and improve your snowboarding skills to land sick freestyle trick combos and rack high scores! Experience snowboarding like never before!\n\nPlay with your friends using the new online multiplayer mode or challenge riders from all over the world using the online leaderboards. Complete over 105 level objectives, 32 achievements, gain experience and upgrade your favorite snowboarder attributes to perform better and achieve higher scores. Customize your snow gear and upgrade your board to give you an extra edge over the competition. \n\n\nHIGH DEFINITION \nSnowboard Party includes next generation 3D sport game graphics specially optimized for your mobile hardware to provide you with the best snowboarding experience.\n\nFREESTYLE \nFreestyle is all about the tricks! Perform the sickest tricks using natural and man-made park features such as rails, ski jumps, boxes, logs, rocks and innumerable other objects! Create new freestyle trick combos to hit higher scores while in the trick parks. \n\nBIG AIR \nGo big or go home! Big air competitions are contests where riders perform extreme tricks on massive ski jumps while going down the slope at high speed. \n\nHALFPIPE \nPerform a wide range of tricks while going down some of the world’s biggest halfpipes. Chain multiple tricks in a row to gain more points and achieve a better score. \n\nMULTIPLAYER \nChallenge your friends to a snowboard battle and see who can land the baddest tricks! Share and brag your results with your friends on Twitter. \n\nMASSIVE SELECTION \nSelect between 15 snowboarders and customize each of them to your preference, choosing your favorite gear. A massive collection of boards ranging from different sizes and designs are available, allowing you to complement your rider’s extreme skills and abilities. \n\nLEARN TO SNOWBOARD\nOver 50 unique tricks to master and hundreds of combinations. Follow the tutorial to get started and progress as you go. Execute the craziest combos and extreme trick sequences to rack up some impressive high scores, gain experience and make a name for yourself. \n\nGAME CONTROLLER\nCompatible with most game controllers available. \n\nCUSTOMIZABLE CONTROLS \nNew fully customizable control system to configure your own button layout. Use the right or left handed control mode, select a control preset or create your own. Use the analog stick or accelerometer option as you wish. \n\nLOADED WITH FEATURES \n• Supports all the latest generation devices and optimized for high resolution displays.\n• Online multiplayer mode to play against your friends or other riders online.\n• New fully customizable control system. You can adjust everything! \n• Learn over 50 unique tricks and create hundreds of combinations. \n• Massive mountains\/locations to ride including 21 trails\/courses located in the Rockies, Alps and Japan. Choose from big air, freestyle, and halfpipe events. \n• Customize your outfit in style!\n• Upgrade your board to improve your rider’s stats.\n• Play often to gain experience and upgrade your favorite snowboarder’s attributes. \n• Share your results with your friends on Twitter. ts.\n• Optimized for Intel x86 mobile devices.\n• Extended soundtrack featuring songs from Closer, Jack Counteract, Minds Without Purpose, Mr. TaBoo Timmons, No Blitz, Paul Spencer and the Maxines, Pear, The Pinz and We Outspoken. Courtesy of Pulse Records\/White Knight Music Group, Inc.\n• Ability to purchase experience points or special items using in-app purchases. \n• Available in the following languages: English, French, German, Italian, Spanish, Russian, Japanese, Korean, Portuguese and Chinese. \n\nSUPPORT: http:\/\/www.maplemedia.io","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[36608,34919,55715,40524,14713,23175,16468,1070,2940,68324],"tags":[1,268435470],"category":0,"themes":[1],"genres":[14],"first_release_date":1418256000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1418256000000,"region":8,"human":"2014-Dec-11","y":2014,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cj95lqrzmdsztj2mw5ms.jpg","cloudinary_id":"cj95lqrzmdsztj2mw5ms","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p3jjb3asoximtrdmbmzx.jpg","cloudinary_id":"p3jjb3asoximtrdmbmzx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fk4dlcbtq356xnlll9ud.jpg","cloudinary_id":"fk4dlcbtq356xnlll9ud","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/unx5pa1bnogyct3d7uxp.jpg","cloudinary_id":"unx5pa1bnogyct3d7uxp","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rdt2u9hacazh7llhrvua.jpg","cloudinary_id":"rdt2u9hacazh7llhrvua","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pv6xm3nj0owcbkpinuov.jpg","cloudinary_id":"pv6xm3nj0owcbkpinuov","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kfc50aefdgh4jiohxc4k.jpg","cloudinary_id":"kfc50aefdgh4jiohxc4k","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g98wjnq0i7vjy4sj85zg.jpg","cloudinary_id":"g98wjnq0i7vjy4sj85zg","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ur2tarfy2lik99istjmv.jpg","cloudinary_id":"ur2tarfy2lik99istjmv","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hmlr3sxalifxxghthpiq.jpg","cloudinary_id":"hmlr3sxalifxxghthpiq","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xntwozym4rtmeicvfe1e.jpg","cloudinary_id":"xntwozym4rtmeicvfe1e","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/snowboard-party-pro\/id922316241?mt=8&uo=4"}]}