{"id":90669,"name":"Real Racing 2 HD","slug":"real-racing-2-hd","url":"https:\/\/www.igdb.com\/games\/real-racing-2-hd","created_at":1520952247195,"updated_at":1522918408006,"summary":"Read on for important info below!\nAre you ready for the ultimate racing experience for iOS? Optimized specifically for iPad and iPad 2, Real Racing 2 HD is a heart-pounding, visually astounding 3D racer that puts the steering wheel directly in your hands. The expansive, 10-plus hour career mode and extensive, one-of-a-kind multiplayer means the fight for first place is never over. \n\nPRAISE FOR REAL RACING 2 HD\n\n“4 Stars Spectacular” – CNET\n“Real Racing 2 is without a doubt the best racing game for the iPad.” – IGN\n“The visuals have an air of sublime perfection about them.\" – Phone Mantra \n“Unrivaled in the App Store.” – No DPad\n“No other portable racer offers nearly as robust and refined an experience as Real Racing 2 HD.” – MacLife.com\n\"The enhanced multiplayer features take what already was one of the top iOS racing games and ushers it into a new era for mobile gaming.\" – Macworld\n“92 Metascore” – Metacritic.com\n\nUNSURPASSED, CUTTING-EDGE 3D VISUALS\n\nRelish exceptional, luscious graphics that push the iPad to its limits, and take full advantage of the iPad 2's enhanced hardware.\n \nBOUNDLESS, IMMERSIVE GAMEPLAY\n\n30 licensed cars from real-world manufacturers. 15 stunning locations. Regular updates supply a stream of new events, improvements and features.\n\nWORLD CLASS CAREER MODE\n\nOver 10 hours of Cup, Head to Head, Championship, Time Trial and Elimination races await your expert skills.\n\nINTUITIVE PRECISION CONTROLS\n\nTake the wheel as your iPad becomes the ultimate racing implement. Come to grips with unerring handling on iPad 2, thanks to full gyroscope support.\n\nTHRILLING MULTIPLAYER\n\nCompete over local Wi-Fi or online with players of Real Racing 2 HD and Real Racing 2, and experience pioneering 16-player online multiplayer.\n\nPlay wirelessly on your HD TV through AirPlay and an Apple TV, challenge friends to a split screen multiplayer race with Party Play and enjoy enhanced visuals – for second and third generation iPads!\n\nTAKE THE RACE ONLINE\n\nTrack your progress against the world's top racers using Game Center and Firemint's Cloudcell technology. Record and upload videos of your best to YouTube for max kudos.\n\nDRIVE ANYWHERE, ANYTIME\n\nUpload and download your save games between Real Racing 2 HD and Real Racing so your progress is always synced. \n\nReal Racing 2 HD is the racing game to own. Buy now, or \"Gift this App\" to a friend and introduce them to the greatest racing experience on iOS.\n\n--------------------------------------------------------------\n* For more information or support please visit\nhttp:\/\/www.firemint.com\n---------------------------------------------------------------\n\nRequires acceptance of EA’s Privacy & Cookie Policy and User Agreement.\n\nBy installing this game, you consent to its installation and the installation of any game updates or upgrades released through your platform. You can turn off automatic updates through your device settings, but if you do not update your app, you may experience reduced functionality.\n\nSome updates and upgrades may change the way we record usage data and metrics, or change data stored on your device. Any changes will always be consistent with EA’s Privacy and Cookie Policy, available at privacy.ea.com. You can withdraw your consent at any time by removing or disabling this app, visiting help.ea.com for assistance, or by contacting us at ATTN: Privacy \/ Mobile Consent Withdrawal, Electronic Arts Inc., 209 Redwood Shores Pkwy, Redwood City, CA, USA.","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[36608,34919,40524,28004,23314,23175,28856,16468,1070,2940],"tags":[1,268435466],"category":0,"themes":[1],"genres":[10],"first_release_date":1299801600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1299801600000,"region":8,"human":"2011-Mar-11","y":2011,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/epg1vdyo3hxw0tze65zl.jpg","cloudinary_id":"epg1vdyo3hxw0tze65zl","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c53n5jrgmvokyktp1rta.jpg","cloudinary_id":"c53n5jrgmvokyktp1rta","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nc5mp9mf7fc9jjqldjhj.jpg","cloudinary_id":"nc5mp9mf7fc9jjqldjhj","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pj8azrzfuptxdhloj9kz.jpg","cloudinary_id":"pj8azrzfuptxdhloj9kz","width":552,"height":414}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cumfvtviqrdorlpimbk0.jpg","cloudinary_id":"cumfvtviqrdorlpimbk0","width":512,"height":512},"websites":[{"category":11,"url":"https:\/\/itunes.apple.com\/us\/app\/real-racing-2-hd\/id414566922?mt=8&uo=4"}]}