{"id":11129,"name":"Bank Heist","slug":"bank-heist","url":"https:\/\/www.igdb.com\/games\/bank-heist","created_at":1434355847433,"updated_at":1515663950314,"summary":"Bank Heist is a maze video game published by 20th Century Fox for the Atari 2600.\nEach level in Bank Heist is a maze-like city (similar to Pac-Man). The objective of the game is to rob as many banks as possible while avoiding the police. The player controls a car called the Getaway Car. The car has a limited amount of fuel, which can be refilled by changing cities. Robbing a bank will cause a cop car to appear, as well as another bank. Up to three cars can be present in a city at a time. Cars can be destroyed by dropping dynamite out the tail pipe of the Getaway Car (however, dynamite can also destroy the Getaway Car). The player starts out with four spare cars (lives). Lives are lost by running out of fuel, being hit by dynamite, or hitting a cop car. If the player can rob nine banks in one city, an extra car is earned.\nThe left and right difficulty switches alter how hard the game is. When the left difficulty switch is set to A, the cop cars are smarter in catching the Getaway Car; when it's set to B, enemy cars move in a more set pattern. When the right difficulty switch is set to A, the banks appear in random spots; when the switch is set to B, the banks appear in preset locations.","popularity":1.333333333333333,"games":[28856,25646,36662,19934,14363,40470,55678,37094,29525,54789],"tags":[1,268435465,268435466,536870929,536871155,536871599,536871690,536872581,536872695,536875069,536875154,536876123,536876289,536876354,536876564,536879184,1073741827],"developers":[2097],"publishers":[2097],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[17,243,687,778,1669,1783,4157,4242,5211,5377,5442,5652,8272],"themes":[1],"genres":[9,10],"first_release_date":441676800000,"platforms":[59],"release_dates":[{"category":2,"platform":59,"date":441676800000,"human":"1983","y":1983,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sv1xpohgc4aphugz3jsr.jpg","cloudinary_id":"sv1xpohgc4aphugz3jsr","width":1280,"height":720}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/al6f4hqikqbdwmxbrehb.jpg","cloudinary_id":"al6f4hqikqbdwmxbrehb","width":307,"height":462}}