{"id":25629,"name":"Pulse Cage Episode 1","slug":"pulse-cage-episode-1","url":"https:\/\/www.igdb.com\/games\/pulse-cage-episode-1","created_at":1478559897814,"updated_at":1479422379505,"summary":"A visual novel. An anxious young girl in a small community comes to realize that she's being stalked by a mysterious admirer. On a journey to find herself (and not the person her family has molded her into), she soon finds out that a video exposing her in a new light has been sent to her friend's phone. She breaks out of her parents customs, after others begin to see her in a different way. In a desperate act, not knowing where else to look, she tries to find herself in other people as she grows closer to them. Holding tightly to the idea that she can be different, she opens herself up to the 'real world' that's been hidden from her, as she challenges herself to be ambitious and outgoing. Too much exposure makes her feel threatened and afraid, with no place to hide. Eventually, she chooses who she wants to be and only lets her body be controlled by its own pulse.","storyline":"An anxious young girl in a small community comes to realize that she's being stalked by a mysterious admirer. On a journey to find herself (and not the person her family has molded her into), she soon finds out that a video exposing her in a new light has been sent to her friend's phone. She breaks out of her parents customs, after others begin to see her in a different way. In a desperate act, not knowing where else to look, she tries to find herself in other people as she grows closer to them. Holding tightly to the idea that she can be different, she opens herself up to the 'real world' that's been hidden from her, as she challenges herself to be ambitious and outgoing. Too much exposure makes her feel threatened and afraid, with no place to hide. Eventually, she chooses who she wants to be and only lets her body be controlled by its own pulse.","popularity":1.666666666666667,"games":[25311,26145,26163,19376,28465,16309,34919,19290,25211,33603],"tags":[43,31,268435469,268435468,268435488,536871006,536871029,536872373,536872849,536873174,1073741829,1073741825],"developers":[11444],"game_engines":[179],"category":0,"player_perspectives":[1,5],"game_modes":[1],"keywords":[94,117,1461,1937,2262],"themes":[31,43],"genres":[12,13,32],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/awyrcbgngaowxougbnwk.jpg","cloudinary_id":"awyrcbgngaowxougbnwk","width":1111,"height":635}],"videos":[{"name":"Trailer","video_id":"r48iYmsUCLU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zbfajpenc1mgzqalm3gi.jpg","cloudinary_id":"zbfajpenc1mgzqalm3gi","width":1029,"height":800},"esrb":{"rating":5},"websites":[{"category":1,"url":"http:\/\/beastcarving.wixsite.com\/studio\/pulse-cage-1"}]}