{"id":28529,"name":"Motor Psycho","slug":"motor-psycho","url":"https:\/\/www.igdb.com\/games\/motor-psycho","created_at":1494319444401,"updated_at":1513073768261,"summary":"You finished it at last! And now you are going crazy waiting to test your sleek, hot, fast customized bike. It absorbs your every waking moment, you dream about it every night. It has become an obsession. And you know just the place to try it out. \n \nThe annual MotorPsycho Competition (for deranged, psychopathic, and other unusual biker types) is this weekend! Its obstacle-laden course is legendary among motorcycle maniacs. Of course, nobody in their right mind would attempt this course. The die-hard spectators remind you that fan is short for fanatic. They've staked out their favorite spots to view the races, and they are waiting for the roar of revving engines, the squeal of tires, the crunch of metal... \n \nIt's you against the clock and your bike is built for speed. All you need to do is point it in the right direction and go for it! \n \nFour different tracks will separate the veterans from the rookies. (Or the schizophrenics from the psychotics.) Weekend amateurs will eat your dust, but you've got some pretty insane competition from your fellow, uh, pros. Some of these guys look hungry for the sweet taste of victory, but some of them look hungry for the taste of raw meat! \n \nSo rev 'er up and let 'er rip! The winner's circle (or the guy with the clean white coat) awaits.","popularity":1.333333333333333,"games":[58785,12347,40470,28856,67685,64284,64272,60974,67625,80441],"tags":[268435466,536870969,536874337,536875069,536875117,536875413],"category":0,"keywords":[57,3425,4157,4205,4501],"genres":[10],"first_release_date":633830400000,"platforms":[60],"release_dates":[{"category":0,"platform":60,"date":633830400000,"region":8,"human":"1990-Feb-01","y":1990,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/opftizk5etldy2cvrhrn.jpg","cloudinary_id":"opftizk5etldy2cvrhrn","width":1536,"height":2100}}