{"id":41729,"name":"Daikoukai Jidai","slug":"daikoukai-jidai","url":"https:\/\/www.igdb.com\/games\/daikoukai-jidai","created_at":1498829863722,"updated_at":1500302435015,"summary":"he Franco family used to be one of the influential houses of Portugal. That is until the head of the family sailed out of a disastrous voyage to find the kingdom of Prester John. The disarray that followed brought about an end to the nobility of the Franco name. 100 years have passed and Portugal has prospered through it's sailing and trading empires. Young Leon Fanco wishes to restore his family's good name and make a name for himself as a sailor. At the heart of his ambition is the fair lady, Christiana, who is desired by the likely heir to the kingdom. Towards that end, Leon has been working hard to secure finances for his first ship. With the first step of his dream complete, Franco sails out with his father's good friend as first mate, you're off to find fame, adventure and fortunes out on the sea and in uncharted waters. \n \nUncharted Waters is a sailing and trading simulation. Your goal is initially to sail between ports and trade goods between them to make a profit. Along the way, you may be called upon by merchants and royalty to do specific tasks. Several different nations as well as pirates roam the sea and not all have good relations with one another. You can take as long as you want and explore as much of the world as possible to complete your ultimate task of marrying Christiana, which will require your fame rating to be quite high anyway. Available at most ports is a trader for cargo, a supply station for your crew's food and water as well as repairs, a shipbuilder, an item store and finally a pub for gaining information, crew and gambling. \n \nAll of the game progresses on an overhead-view, by sea you navigate your fleet by direction and can issue additional orders including landing on any piece of land to search for supplies. A variety of hazards live at sea including storms, other ships, seaweed and simply bad winds and currents.","popularity":1.333333333333333,"games":[44242,24491,28465,75579,75275,34919,75102,33603,36962,55888],"tags":[268435469],"category":0,"genres":[13],"first_release_date":633830400000,"platforms":[27],"release_dates":[{"category":0,"platform":27,"date":633830400000,"region":8,"human":"1990-Feb-01","y":1990,"m":2}]}