{"id":42029,"name":"Daichikun Crisis: Do Natural","slug":"daichikun-crisis-do-natural","url":"https:\/\/www.igdb.com\/games\/daichikun-crisis-do-natural","created_at":1499067415052,"updated_at":1516652711100,"summary":"A real-time strategy game in which a family of cow-people have to grow and sell crops on an island crawling with monsters. \n \nOverview: \nDaichikun Crisis: Do Natural is a 1989 PC Engine game that follows a family of cow anthropomorphs as they cultivate their home of Moo Cow Island. It uses a real-time strategy format where players explore the island and plant various crops. They must also fight off the occasional monster attack from the nearby volcanos, and clear the resulting toxic ash away. \n \nThe game is thought to be derived from an educational kid's TV show about agriculture shown in the Hokkaido region. Fans have observed the similarity of Daichikun's family and companions and those featured in the TV show, and the similar theme of farming in a harsh climate. \n \nGameplay: \nThe player controls the oldest son of the family, the titular Daichikun, and his family members Hokkaido (grandpa), Suzuran (mama), Oozora (little brother), Marimo (little sister) and their friends Goro the bear and Alice the crow are all AI controlled and will follow the player until they find themselves a task to complete. Daichikun can use the flying \"Geiger No\" vehicle to move around and clear ash away quickly, though it cannot attack. \n \nAdditional factors unlock as the player progresses with the game, like a port town and various power-ups. The game is on a fast seasonal cycle - a minute represents a month - and various crops do better (or worse) depending on the time of the year.","popularity":1.333333333333333,"games":[29173,55689,55590,18623,9789,9199,44242,33603,11419,8773],"tags":[268435467,268435469,268435471,536871906,536872060,536872383],"category":0,"keywords":[994,1148,1471],"genres":[11,13,15],"first_release_date":627696000000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":627696000000,"region":5,"human":"1989-Nov-22","y":1989,"m":11},{"category":0,"platform":86,"date":630288000000,"region":8,"human":"1989-Dec-22","y":1989,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c0xmaargmay8eueuxvt4.jpg","cloudinary_id":"c0xmaargmay8eueuxvt4","width":297,"height":300}}