{"id":50229,"name":"Twisted Lands: Insomniac","slug":"twisted-lands-insomniac","url":"https:\/\/www.igdb.com\/games\/twisted-lands-insomniac","created_at":1500038020536,"updated_at":1516710427389,"summary":"The Twisted Lands saga continues in the gripping sequel to the best-selling Twisted Lands: Shadow Town! Steeped in psychological horror, Twisted Lands: Insomniac follows Angel, the wife of the central character in the original game, as she attempts to escape the mental hospital in which she's imprisoned. Players will explore the fragile boundary between what's real and what the mind perceives as they guide Angel on her mystifying quest to remember who she is. \n \nAs players navigate an artfully rendered mansion, a decaying lighthouse, and the ominous corridors of the hospital, a rich and disturbing back-story will emerge that answers questions the first game raised and leads players to a conclusion even more shocking than Shadow Town's. With its well-hidden items, clever puzzles and cunning mini-games, Twisted Lands: Insomniac offers an unforgettable journey down the sometimes warped paths of the human mind. \n \nHelp Angel figure out what is real and what is in her head as she attempts to escape from a Mental Hospital! Explore a haunting environment as you go on Angel’s mystifying quest!","collection":3808,"rating":90,"popularity":1.333333333333333,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[13189,11296,25646,54678,27266,13163,25222,19448,55935,26914],"tags":[19,268435465,268435487,536871133,536871939,536871944,536872032,536872328,536872793,536872983,536875046,536875057,536875242,536875422,536875429,536876647,536877960],"category":0,"keywords":[221,1027,1032,1120,1416,1881,2071,4134,4145,4330,4510,4517,5735,7048],"themes":[19],"genres":[9,31],"first_release_date":1321660800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1321660800000,"region":8,"human":"2011-Nov-19","y":2011,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n89p2pagyhvkqxhmebgm.jpg","cloudinary_id":"n89p2pagyhvkqxhmebgm","width":175,"height":150}}