{"id":6829,"name":"Ripper","slug":"ripper","url":"https:\/\/www.igdb.com\/games\/ripper","created_at":1400535131384,"updated_at":1517270889384,"summary":"Ripper is an interactive movie point-and-click adventure game developed and published by Take-Two Interactive for MS DOS. The game has a cast that includes celebrities such as Christopher Walken, Karen Allen, Burgess Meredith and John Rhys-Davies. It also featured the hit Blue Öyster Cult song \"(Don't Fear) The Reaper\".","storyline":"Ripper takes place in New York City in the year 2040. It opens with the investigation of the recent murder of Renee Stein, the third victim of a serial killer known as \"The Ripper\", largely out of the modus operandi similarity to Jack the Ripper. The player assumes the role of Jake Quinlan, a reporter for the Virtual Herald, whom The Ripper sends messages to detailing his murders (an act attributed to Jack the Ripper, although no letters have been proven to come from him). Along with the police (whose investigation is headed by Detective Vincent Magnotta), Quinlan is seeking The Ripper's true identity.\n\nAfter investigating Renee Stein's murder, Quinlan receives a message from The Ripper, who warns Quinlan that his girlfriend, Catherine Powell, will be the next victim, as she has gotten too close to discovering his identity. Quinlan manages to find Powell still alive, but in a coma \"deeper than anyone thought possible.\" Cybersurgeon Claire Burton at the Meta-Cognition Center of the Tribeca Center Hospital manages to retrieve a distorted image of Powell's attacker, but requires additional information from Quinlan to make it clearer. (This is also a reference to Jack the Ripper, as the police hypothesized that they might be able to get an image of the killer from the retinas of the victims.) He provides this through investigating into what Powell was on to in her investigation and homes in on three possible suspects for The Ripper's murders. In order to transmit this information into Powell's brain directly, he enlists the help of Joey Falconetti, a hacker who specializes in interfacing directly with the human brain.\n\nQuinlan's investigation leads him to discover that all of The Ripper's victims and all of those associated with the investigation of The Ripper (except Quinlan himself) were involved with an old gaming group known as the Web Runners, who played a game based on the Jack the Ripper mystery. The last session of this game somehow caused one of the players to die in real life. The player that died happened to be Catherine Powell's mother. Assistance from a pathologist named Vic Farley reveals that The Ripper's murders were done by placing a code into a victim's brain while in cyberspace that caused their internal body pressure to rise to a point of explosion, which Farley experiences immediately after providing his explanation. Quinlan also finds a cyberspace weapon developed by a murdered cyberarchitect named Hamilton Wofford, designed specifically to kill The Ripper inside a virtual recreation of the historic Whitechapel district of London, where the Jack the Ripper murders took place. After assembling the weapon and gathering the necessary protection from The Ripper's weapon, Quinlan enters cyberspace, kills The Ripper, and manages to escape the virtual Whitechapel in time to escape its destruction.\n\nThe Ripper can be one of four possible suspects: Joey Falconetti, Claire Burton, Vincent Magnotta, or Catherine Powell. With each play-through, certain clues and actual identity of The Ripper vary, though the bulk of the story is unchanged, and clues indicating the guilt of all four suspects will appear regardless of who the killer is. For instance, Catherine Powell experiences mysterious surges in brain wave activity that coincide with all the Ripper's murders regardless of whether or not she actually is the Ripper, and no alternative explanation for these surges is provided. However, the changes in the game's story and puzzles are limited to the game's third act- after Farley's death.","rating":70,"popularity":1.333333333333333,"aggregated_rating":36,"aggregated_rating_count":1,"total_rating":53,"total_rating_count":4,"rating_count":3,"games":[18011,56033,51524,25646,13189,36950,55038,13524,18020,8762],"tags":[1,18,19,268435458,268435465,268435487,536871015,536871041,536871292,536871878,536871882,536871939,536871984,536872032,536872225,536872328,536872715,536875199,536875322,536875426,536875535,536875691,536875840,536876191,536876391,536876663,536876875,536876881,536877278,536878005,536878396,536878567,536880223,536880769,536882797,1073741825],"developers":[139],"publishers":[139],"category":0,"time_to_beat":{"normally":54000},"player_perspectives":[1],"game_modes":[1],"keywords":[103,129,380,966,970,1027,1072,1120,1313,1416,1803,4287,4410,4514,4623,4779,4928,5279,5479,5751,5963,5969,6366,7093,7484,7655,9311,9857,11885],"themes":[1,18,19],"genres":[2,9,31],"first_release_date":825552000000,"platforms":[13],"release_dates":[{"category":0,"platform":13,"date":825552000000,"region":2,"human":"1996-Feb-29","y":1996,"m":2},{"category":0,"platform":13,"date":825552000000,"region":1,"human":"1996-Feb-29","y":1996,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jxo1ghlmo5y9laiho1r2.jpg","cloudinary_id":"jxo1ghlmo5y9laiho1r2","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a0g8s8zjivbaxuk4wmoy.jpg","cloudinary_id":"a0g8s8zjivbaxuk4wmoy","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j5f6kddrtlgph0wcnwpk.jpg","cloudinary_id":"j5f6kddrtlgph0wcnwpk","width":640,"height":480}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/glfdmcmc7dcwgl9ep1kb.jpg","cloudinary_id":"glfdmcmc7dcwgl9ep1kb","width":522,"height":640},"esrb":{"rating":6}}