{"id":72729,"name":"X-Change 3","slug":"x-change-3","url":"https:\/\/www.igdb.com\/games\/x-change-3","created_at":1507091808925,"updated_at":1541350736230,"summary":"Third installment in the X-change series.","storyline":"You are Takuya Aihara, the hero\/heroine of the story. You've been blessed with a very interesting life: several years ago you were changed a girl through bizarre chemistry accidents, not once but twice. Now as you approach your final year of university with faithful girlfriend Asuka at your side, you almost get nostalgic thinking about those crazy days you spent as a girl. \n \nUntil it happens again, that is: that troublesome Kouji, still madly in love with your female persona, secretly gets Asami-senpai to whip up some of the sex-change potion and tricks you into drinking it! It'll be harder than ever for you to change back into your male self this time, but you've got no choice: you have to find a way to return to normal before your female body becomes permanent. Although Asuka is one of the most understanding women in the world, there's no way she'll stay with you as a girl -- that's just not her thing. \n \nAs you start another round of bizarre sexual adventures in your female body, virtually all the characters from the past X-Change games are back: your twisted sister Natsumi, who loves to tease you; the ingenius Asami-senpai; the endlessly experimenting Chisato; and a host of others from the first two games. With an even richer and more complex game story than last time, you'll have loads of fun exploring college life in your new female body, with many rewarding story lines to discover. Where will it all end?","collection":4608,"hypes":1,"popularity":1.333333333333333,"games":[59218,59048,22490,22482,17906,58814,12151,22425,28207,15830],"tags":[42,268435487,536870990,536871006,536871255,536871759,536871939,536872225,536872873,536875338,536875831,536875833,536876196,536877398,536877841],"developers":[16870],"publishers":[11812,16870],"category":0,"keywords":[78,94,343,847,1027,1313,1961,4426,4919,4921,5284,6486,6929],"themes":[42],"genres":[31],"first_release_date":1153180800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1153180800000,"region":2,"human":"2006-Jul-18","y":2006,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5jlz.jpg","cloudinary_id":"sc5jlz","width":533,"height":400}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1hek.jpg","cloudinary_id":"co1hek","width":233,"height":349},"esrb":{"rating":7}}