{"id":75529,"name":"Batman: Arkham Origins - Season Pass","slug":"batman-arkham-origins-season-pass","url":"https:\/\/www.igdb.com\/games\/batman-arkham-origins-season-pass","created_at":1510051878175,"updated_at":1510056319935,"summary":"Enhance your ARKHAM ORIGINS experience by purchasing a season pass today! Gain access to new challenge maps, two Skin packs, and an epic new story campaign adventure. In addition to hours of new content, you'll also unlock two exclusive Batman™ Skins: Gotham by Gaslight Batman™ and Brightest Day Batman™. \n \nAll Skins can be used in the story campaign upon completion of the main story, in the challenge maps, and online. All other Season Pass content is for use exclusively in the story campaign mode. All content included in the Season Pass can also be purchased individually. \n \nSeason Pass Skin Pack - Key Features: \nGotham by Gaslight Batman™: Bring a little bit of 1889 into your gameplay. Wear the suit inspired by Brian Augustyn and Mike Mignola's hit graphic Novel GOTHAM BY GASLIGHT. \nGotham by Gaslight Batman™: From the natural fiber trousers to the leather utility belt loaded with throwing knives, every detail is painstakingly modeled after that of the comic. \nBrightest Day Batman™: Play as Brightest Day Batman™, the Batman™ resurrected from the dead by the White Light in Geoff Johns and Peter Tomassi's BRIGHTEST DAY series. \nBrightest Day Batman™: Brightest Day Batman™'s suit is white, unlike any others in the game. \n \nNew Millennium Skins Pack - Key Features: \nDress to impress: Get the latest gear without paying full price. Save big on the New Millennium Skins Pack with this Season Pass! \n \nThe coolest Skins: The New Millennium Skin Pack includes 5 of the most sought-after Skins: (1) Red Son Batman™, (2) Blackest Night Batman™, (3) New 52 Batman™, (4) Batman™: Noel, (5) 1st Appearance Batman™, and (6) One Year Later Robin \n \nInfinite Earth Skins Pack - Key Features: \nDress to impress: Get the latest gear without paying full price. Save big on the Infinite Earth Skins Pack with this Season Pass! \nThe Skins you've been wanting: The New Millennium Skin Pack includes 5 of the best Skins: (1) Earth 2 Dark Knight, (2) Long Halloween Batman™, (3) Batman™: Dark Knight of the Round Table, (4) Thrillkiller Batman™, (5) Earth 2 Batman™, (6) Classic Tim Drake Robin \n \nInitiation DLC - Key Features: \nTravel back in time: Journey to the days before Batman™ even existed and take control of a young Bruce Wayne in the final stages of his martial arts training. Experience exotic locales including a bamboo forest and mountain-top monastery. \nWhere Batman really began: Witness the birth of the world's most powerful crime fighter with this DLC containing 2 Skins ( Bruce Wayne and Vigilante Bruce Wayne), four challenge maps, and a challenge campaign. \n \nCold, Cold Heart DLC - Key Features: \nReturn to Gotham City to ring in the New Year, Arkham Origins style. When the CEO of GothCorp is kidnapped, by Mr. Freeze, Batman™ sets out to bring him to justice. Along the way, he will uncover the tragic history of his new enemy, prompting our hero to attempt the impossible: save the victim AND the villain. Hours of narrative-driven gameplay and new Open World content await!","popularity":1.666666666666667,"game":2003,"category":1,"first_release_date":1398124800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1398124800000,"human":"2014-Apr-22","y":2014,"m":4}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e96x0or2ydukzrmmltgu.jpg","cloudinary_id":"e96x0or2ydukzrmmltgu","width":271,"height":377}}