{"id":12995,"name":"Fairlight","slug":"fairlight","url":"https:\/\/www.igdb.com\/games\/fairlight","created_at":1443199367995,"updated_at":1517271106680,"summary":"The player controls an adventurer named Isvar that can be moved in a castle which is not only three-dimensional isometric view, but realistic in terms of the way objects behave. Each object has its own physical properties and resultant characteristics in terms of how much else can be carried alongside it. Certain objects have special uses (e.g. keys open certain doors), and there is a puzzle element to the game to discover how some of these objects relate to the world in order to help the player solve the game. \n \nIn addition to carrying objects, they could also be stacked on top of each other to enable Isvar to climb up to rooms above him or to reach important objects perched high above on platforms. There are also a number of secret areas in the castle that are not visually obvious to the player and can only be discovered through exploration. \n \nDuring Isvar's exploration of the castle he is accosted by its guards and monsters - trolls, monks, guards, tornadoes, man-eating plants, bubbles, etc. all of which weaken Isvar's energy. The castle also contains food and magical potions which will restore his health. In addition, certain game objects can affect the enemies, (by either killing them, distracting them, or freezing them, depending on the object and the type of enemy they are used upon) \n \nOnce defeated in combat a guard disappears leaving only his helmet behind. Helmets can be picked up and carried by Isvar, and placed somewhere else out of harms way (or into the path of a tornado, that destroys any object it touches). If Isvar leaves the room, the guard will regenerate from the helmet.","collection":2557,"popularity":1.333333333333333,"aggregated_rating":70,"aggregated_rating_count":1,"total_rating":70,"total_rating_count":1,"games":[47823,35371,80916,24426,55092,28168,23733,34155,28309,28070],"tags":[1,17,22,268435465,268435487,536870984,536871063,536871139,536871208,536871213,536871470,536871945,536872352,536872647,536875361,536875524,536875870,536876718,536879790,536879883,536880002,536881000,1073741827,1073741826],"publishers":[7253],"category":0,"player_perspectives":[2,3],"game_modes":[1],"keywords":[72,151,227,296,301,558,1033,1440,1735,4449,4612,4958,5806,8878,8971,9090,10088],"themes":[1,17,22],"genres":[9,31],"first_release_date":504835200000,"platforms":[15,26,25,154],"release_dates":[{"category":2,"platform":154,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":25,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":26,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12}],"alternative_names":[{"name":"Fairlight: A Prelude: The Light Revealed","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fikek8kzcgtqzubcvhil.jpg","cloudinary_id":"fikek8kzcgtqzubcvhil","width":1000,"height":1190}}