{"id":1895,"name":"Quest for Glory III: Wages of War","slug":"quest-for-glory-iii-wages-of-war","url":"https:\/\/www.igdb.com\/games\/quest-for-glory-iii-wages-of-war","created_at":1358697167704,"updated_at":1532428180091,"summary":"Wages of War is the third game in the Quest for Glory series. It is set in the Africa-like world of Tarna, where the hero travels with paladin Rakeesh, his new Liontaur friend he has met in the previous game. Shortly after his arrival, the hero learns about the conflict between the human Simbani tribe and the seemingly malevolent neighboring Leopardmen. It is now time for our hero to become a skillful diplomat and prevent an upcoming war between the two nations. \n\nThe basic gameplay system is similar to that of the two preceding games. The game has an adventure-like structure and gameplay elements, including puzzles to solve, inventory items to use, and characters to talk to, as well as a role-playing system with combat and character development. As in the predecessors, the player character can be either a fighter, a thief, or a mage; in this installment, the paladin class is selectable from the beginning of the game (unlike the previous game, where the hero could only earn the title of a paladin during the course of the story). Saved characters from the previous game can be imported.\n\nLike in the earlier Quest for Glory games, the main character's parameters increase directly after battles or by repeatedly performing various actions. New to the series is an overworld map on which the hero travels between locations. Hostile encounters may occur randomly while traversing the map. Combat system is similar to the predecessors, with real-time battles where the player selects various offensive and defensive options. \n\nGraphics engine and interface in this installment are the same as in the remake of the first game: it has 256-color graphics and an icon-based interface which was used by Sierra for their contemporary adventure games.","collection":355,"popularity":1.333333333333333,"games":[26765,18398,55092,28168,22387,26951,47823,11169,27092,26553],"tags":[17,268435468,268435487,536871138,536871139,536871208,536871244,536871938,536871939,536872328,536873364,536875196,536875299,536875531,536875713,536875735,536875738,536875896,536876232,536876286,536876571,536876575,536876585,536876900,536876986,536877965,536879186,536879191,536879765,536880027,1073741828],"developers":[32],"publishers":[32],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[226,227,296,332,1026,1027,1416,2452,4284,4387,4619,4801,4823,4826,4984,5320,5374,5659,5663,5673,5988,6074,7053,8274,8279,8853,9115],"themes":[17],"genres":[12,31],"first_release_date":712627200000,"platforms":[13],"release_dates":[{"category":0,"platform":13,"date":712627200000,"region":8,"human":"1992-Aug-01","y":1992,"m":8}],"alternative_names":[{"name":"Quest for Glory 3: Wages of War","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ozei11mj3lql5gxak3o4.jpg","cloudinary_id":"ozei11mj3lql5gxak3o4","width":320,"height":200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ibwiqlzdhw9dxfyv2qxt.jpg","cloudinary_id":"ibwiqlzdhw9dxfyv2qxt","width":320,"height":200}],"videos":[{"name":"Trailer","video_id":"NbWW6blSGZY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hm2pztd1phgfc18xcdqq.jpg","cloudinary_id":"hm2pztd1phgfc18xcdqq","width":640,"height":794},"esrb":{"rating":6}}