{"id":22695,"name":"Attack of the Timelord!","slug":"attack-of-the-timelord","url":"https:\/\/www.igdb.com\/games\/attack-of-the-timelord","created_at":1471403255875,"updated_at":1522182518916,"summary":"Press 1 on the alpha-numeric keyboard. \n \nYou have just attracted the attention of Spyrus the Deathless - Timelord of Chaos. \n \nYour only defense is a laser cannon mounted on the leading edge of your Time Machine. Fortunately, you have an unlimited supply of laser energy. You'll need it. \n \nPress the action button of the left hand control to fire your laser cannon. \n \nUse the joystick of the left hand control to maneuver your Time Machine at the base of the screen. It will travel in the direction you move the joystick. \n \nLevel One \nThe Timelord's fleet of Time Ships will bombard you with missiles. You score points for each missile and Time Ship destroyed. If you destroy all of the Time Ships, the game will automatically proceed to Level Two. \n \nLevel Two \nThe Timelord is beginning to take you seriously. The next fleet he sends through the warp is armed with missiles and antimatter mines. These are launched in various combinations. If you evade destruction and destroy the fleet, the game will progress to Level Three. \n \nLevel Three \nThe next fleet you encounter carries the much feared lethal anihilators in its arsenals. These weapons will home in on you and require swift evasive action. If you succeed in destroying this fleet, the game automatically progresses to Level Four. \n \nLevel Four \nYou have now earned the Timelord's respect. This is a very mixed blessing. The next fleet has the legendary Nucleonic Time killers as part of its weapons systems. These destroyers are extremely lethal because they're piloted by expendable robots programmed to anticipate human reactions. \n \nAs you go through the entire 256 game levels, you'll face increasingly faster Time Ships and gradually greater fire power. \n \nThe Timelord will deploy his weapons like a chess master deploys his pieces. There are literally millions of possible combinations of weapons, timing and placement. Your evasion of a weapon of one kind can put you right in the path of another. \n \nYour Time Machine will disintegrate on contact with any of the Timelord's weapons. The game will automatically start again at Level One. \n \nScoring: \n- MISSILES = 2 POINTS \n- ANTIMATTER MINES = 4 POINTS \n- TIME SHIPS = 5 POINTS \n- ANNIHILATORS = 8 POINTS \n- TIME KILLERS = 16 POINTS \n \nThe score of each game is displayed at the lower right corner of the screen. \n \nThe highest score in a series of games is shown at the lower left corner of the screen. Six question marks request the name of the high scoring player. Enter any name up to six letters through the keyboard. If the name is shorter than six letters, press the space bar to erase the remaining question marks. The score and high player's name will remain on the screen until a higher score is achieved in succeeding games. \n \nTo start a new scoring cycle, press RESET and then 1. \n \nIf you press 0 (zero), the Timelord's transmission frequency will be jammed. He will not reappear each time you destroy a fleet of his Time Ships.","popularity":1.666666666666667,"games":[68287,28029,36950,19341,25311,64204,27314,71455,34919,25300],"tags":[1,18,268435461,268435469,268435489,536871882,536875789,1073741827],"publishers":[9542],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[970,4877],"themes":[1,18],"genres":[5,13,33],"first_release_date":410140800000,"platforms":[133],"release_dates":[{"category":2,"platform":133,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tex55t38lcdwga0lheew.jpg","cloudinary_id":"tex55t38lcdwga0lheew","width":1000,"height":1336}}