{"id":23895,"name":"M.U.L.E.","slug":"mule","url":"https:\/\/www.igdb.com\/games\/mule","created_at":1473712594633,"updated_at":1547216548893,"summary":"M.U.L.E. is about four hopeful explorers trying to make a fortune on a virgin planet. This is done by producing various goods (Food, Energy, Smithore, Crystite). Each of these goods have their uses: if you don't have enough food, you will have less time during your turn. If you don't have enough energy, your output will be lower. If enough smithore isn't produced, there will be a shortage of M.U.L.E.s. Crystite is the big earner that can make or break your game. \n \nYou start the game by selecting your race. Some are easier to play, some harder. There are three levels of difficulty, in the easiest the game only lasts 6 turns, but the real game is 12 turns. Crystite is not available at the easiest level. \n \nEach turn starts with land claim. Each player gets to choose a spot of land for themselves from the map. If two players choose the same spot, the player with less money wins. The map consists of different landscape. River is best for producing food, plains for energy, mountains for smithore. Crystite is hidden and must be first found by taking a land sample to the town. \n \nAfter the land claim each player takes turns in cultivating their land and do other tasks. They can buy M.U.L.E.s to start production on their land, sabotage other players by buying M.U.L.E.s and letting them loose, try to catch the Wumpus for cash and try to find crystite veins. The time to do these things depends on if the player has enough food. Finally the player goes to the casino and wins a small amount of money, depending on how much time was left.","storyline":"IRATA. A New World rich with opportunity. For wealth. And power. And you can become the richest, most powerful inhabitant of the newly discovered planet by owning the most land, mining the most precious metal, and supplying the most food and energy to all the peasants - otherwise known as your opponents. To win you need MULEs (Multiple Use Labor Elements), kind of mechanical donkeys which do your dirty work: growing food, mining, and producing energy. MULEs are critical, so you want to get as many as possible as cheaply as possible. And by the way, treachery is acceptable. So use it when needed. Then sit back and enjoy your wealth and power, OH MIGHTY RULER!","popularity":1.666666666666667,"games":[34823,13200,25311,29173,9789,17130,55590,55036,17686,17111],"tags":[1,18,27,268435469,268435471,268435480,536871262,536871882,536871906,536872552,536873089,536874694,536875245,536875710,536876282,536880536,1073741827],"developers":[5125],"publishers":[341,1,489,2391],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[350,970,994,1640,2177,3782,4333,4798,5370,9624],"themes":[1,18,27],"genres":[13,15,24],"first_release_date":441676800000,"platforms":[13,65,125,15,77,18,27],"release_dates":[{"category":0,"platform":77,"date":586396800000,"region":5,"human":"1988-Aug-01","y":1988,"m":8},{"category":0,"platform":125,"date":562723200000,"region":5,"human":"1987-Nov-01","y":1987,"m":11},{"category":2,"platform":65,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12},{"category":2,"platform":15,"date":441676800000,"region":2,"human":"1983","y":1983,"m":12},{"category":2,"platform":27,"date":599529600000,"region":5,"human":"1988","y":1988,"m":12},{"category":0,"platform":18,"date":654652800000,"region":2,"human":"1990-Sep-30","y":1990,"m":9},{"category":2,"platform":13,"date":504835200000,"region":2,"human":"1985","y":1985,"m":12}],"alternative_names":[{"name":"MULE","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1ike.jpg","cloudinary_id":"co1ike","width":226,"height":323}}