{"id":25495,"name":"Ravensburger Puzzle","slug":"ravensburger-puzzle","url":"https:\/\/www.igdb.com\/games\/ravensburger-puzzle","created_at":1478020123748,"updated_at":1523428419515,"summary":"The best jigsaw puzzle app for iPhone and iPad - of course from Ravensburger. A huge selection of motifs, intuitive controls, original Ravensburger quality, beginner-friendly tutorials.\n\nFor more than 50 years, Ravensburger has been known as the European market leader for its high-quality jigsaw puzzles. We now offer a combination of the tradition and expertise of classical puzzles with the advantages and possibilities of digital puzzles for iPhone and iPad (from iPhone 4 and iPad 2 onwards). \n\nNever before has it been so easy to follow your passion for jigsaw puzzles. Whether at home or while traveling, your smartphone or tablet allows you to access your personal puzzle collection anytime and anywhere. \n\nNo lost pieces, no occupying the dinner table for weeks. Start the app, select a puzzle and go. For beginners, kids or puzzle pros: The original Ravensburger stamps in 20, 40, 60, 100, 150, 200, 300, 400 or 500 pieces offer every puzzler a challenge.\n\nThe comprehensive tutorials allow an ideal introduction to the digital world of jigsaw puzzles so you can play like a master puzzler after only a few minutes and enjoy 100% of the puzzle fun.\n\nFeatures:\n\n▶ More than 1.600 new puzzles from the most popular categories are available in the shop \n▶ All of the puzzles can be played in the original Ravensburger stamp version with 20 - 500 pieces \n▶ Intuitive puzzle controls\n▶ Helpful sorting options for a better overview on your iPhone or iPad\n▶ Practical use of the digital medium with several puzzle aids \n▶ Sophisticated 3D look of the puzzle pieces with physically realistic behavior\n▶ New motifs and puzzles offered weekly in the puzzle shop\n▶ Original motifs from Gelini available in the shop (licensed motifs might not be available in every country)\n▶ Different table backgrounds can be selected for a customized look\n▶ Free selection of the background music using the iOS music app\n▶ Game Center support for comparing your high scores and puzzle success \n▶ Playing the app does not require an internet connection – an internet connection is only necessary for the initial download of newly purchased puzzles\n\nThis game contains the possibility to buy extra content through in-app purchases. With the initial purchase of the game comes a basic number of motifs which can be played for free. Additional motifs can be bought within the game.\n\nPlease note: This app only works properly with the following devices: iPhone 4 and newer, iPad 2 and newer, iPod touch 4th generation (only up to a maximum of 60 pieces) and iPod touch 5th generation\n\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬ \n\nFeel free to check out Ravensburger’s other games, including Scotland Yard, THE aMAZEing Labyrinth, San Juan and Puerto Rico, along with many, many others. \n\nBecome a fan of Ravensburger Digital on Facebook and find out more about our new apps, exclusive competitions and behind the scenes information about the development of our apps: \n\nhttp:\/\/www.facebook.com\/RavensburgerDigitalGmbH","rating":80,"popularity":1.333333333333333,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[19222,41348,10225,27266,91177,90837,90671,90051,89132,88889],"tags":[268435465,536872030],"category":0,"keywords":[1118],"genres":[9],"first_release_date":1395792000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1395792000000,"region":8,"human":"2014-Mar-26","y":2014,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g4xlinplcgp8dr6ja9yr.jpg","cloudinary_id":"g4xlinplcgp8dr6ja9yr","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mtzuz1cmcorbdkzkjdms.jpg","cloudinary_id":"mtzuz1cmcorbdkzkjdms","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xgfi9dn7rv25a2o4inxe.jpg","cloudinary_id":"xgfi9dn7rv25a2o4inxe","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/chk6qi2tqzjs7yh4bec6.jpg","cloudinary_id":"chk6qi2tqzjs7yh4bec6","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ymnxfr3ehcznwhijgqd3.jpg","cloudinary_id":"ymnxfr3ehcznwhijgqd3","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wvtqszokqk6hyjncagdh.jpg","cloudinary_id":"wvtqszokqk6hyjncagdh","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y2dvoths7ltlrf05pizy.jpg","cloudinary_id":"y2dvoths7ltlrf05pizy","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qi5ykfq3t5kaj34iqgds.jpg","cloudinary_id":"qi5ykfq3t5kaj34iqgds","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tm6xalzxj5lqhotrtsbc.jpg","cloudinary_id":"tm6xalzxj5lqhotrtsbc","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cljzvhzgmjxrhy3wyzqn.jpg","cloudinary_id":"cljzvhzgmjxrhy3wyzqn","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gawxqf2petq14ghackby.jpg","cloudinary_id":"gawxqf2petq14ghackby","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/ravensburger-puzzle\/id657342303?mt=8&uo=4"}]}