{"id":42395,"name":"Farland Story 2","slug":"farland-story-2","url":"https:\/\/www.igdb.com\/games\/farland-story-2","created_at":1499073131419,"updated_at":1515641886280,"summary":"Farland Story 2 is an independent side-story to the Farland Story series (this game shouldn't be confused with Farland Story Denki: Arc Ou no Ensei, which is also known as \"Farland Story 2\"). The game is set in the same time line as the second and the third \"mainstream\" Farland Story games, 20 years after Arc has become a king. Peace has returned to the world, but on the continent of Ionia, an emperor is plotting an evil scheme. His son Riad refuses to accept the methods of his father, especially when he wants to use Serena, a girl he loves, for his plans of war and conquest. During a quarrel, Riad attacks the emperor's minister, and is forced to flee the castle together with Serena. The adventure of the runaway prince begins... \n \nGraphically and gameplay-wise, the game is similar to other Farland Story games, although its setting is generally more dark. The game consists of large strategic battles, during which you move your party over the battle location, attacking enemies physically when they are in range of your weapons, and casting healing and offensive magic. Like in other Farland Story games, the death of the main character (Riad in this case) means instant Game Over.","collection":3497,"popularity":1,"games":[27092,26766,12632,36926,22258,36534,18398,75813,29173,17583],"tags":[268435468,268435471,536871208,536871938,536874694,536880637],"category":0,"keywords":[296,1026,3782,9725],"genres":[12,15],"first_release_date":822268800000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":822268800000,"region":8,"human":"1996-Jan-22","y":1996,"m":1}],"alternative_names":[{"name":"Farland Story 2: Dance of Destruction","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d6lqflwjmxy1frdvqsbi.jpg","cloudinary_id":"d6lqflwjmxy1frdvqsbi","width":211,"height":384}}