{"id":4295,"name":"Foes of Ali","slug":"foes-of-ali","url":"https:\/\/www.igdb.com\/games\/foes-of-ali","created_at":1390762092200,"updated_at":1515797297702,"summary":"Foes of Ali is a 3-D boxing game with ten different boxers to choose from: George Chuvalo, Henry Cooper, Jimmy Ellis, Bob Foster, Joe Frazier, Sonny Liston, Ken Norton, Leon Spinks, Chuck Wepner and of course the games namesake Muhammad Ali. \n \nThere are three modes to choose from: Exhibition where the player can choose any boxer to fight another, or the player can choose any of Ali's historic fights to play, Tournament where a player fights a series of boxers in an 8 man tournament tree to become champion and Career Mode, where the player can only play as Muhammed Ali and fight the other boxers in order as he did in real life. \n \nPlayers fight opponents with the basic punch moves, jabs, uppercuts and hooks along with defensive moves like blocking and grabbing. Fatigue is not simulated, but players can slow down their opponents after a series of large successful hits along with bruises, blooded and black eyes. \n \nThere are 21 different camera views to choose from, including first-person that will react to their fighters being hit (ex. if a player keeps getting hit in the eyes, the screen will start to blacken, simulating a swollen eye and if they take a hard enough punch they will actually see the game through double vision). Championship photos of each boxer is also show before a fight and commentary is provided by Tim Gammon.","collection":3637,"popularity":2,"games":[78307,78516,22690,60492,42426,70861,65428,65425,44419,51464],"tags":[268435470,536870970,536870990,536871544,536872078,536875053,536875749,536875750],"category":0,"keywords":[58,78,632,1166,4141,4837,4838],"genres":[14],"first_release_date":799027200000,"platforms":[29,50],"release_dates":[{"category":0,"platform":29,"date":799027200000,"region":5,"human":"1995-Apr-28","y":1995,"m":4},{"category":2,"platform":50,"date":820368000000,"human":"1995","y":1995,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gvag6t4xhi1ps7xvgk7o.jpg","cloudinary_id":"gvag6t4xhi1ps7xvgk7o","width":1279,"height":2156},"esrb":{"rating":3}}