{"id":50595,"name":"Space Pinball","slug":"space-pinball","url":"https:\/\/www.igdb.com\/games\/space-pinball","created_at":1500050354160,"updated_at":1513001856496,"summary":"Normally you would think that prototypes of released games are not even half as interesting as any unreleased stuff, and I'd say you're right, but in some cases those hardly resemble the final product. You can say the latter about this early version of what would later be released as \"Galactic Pinball\". What people got to play at Shoshinkai 1994 and CES 1995, where the Virtual Boy was first unveiled to the japanese and later the american people, looks (and feels) very different than the final released product, although, as you might think, many things were changed for good. \n \nWhen you start up the game, you see an early version of the adjustment screen, after which the game jumps directly to the title. No Precaution or Automatic Pause yet, but that wouldn't have made much sense anyway in an early exhibition software, would it? While the title screen looks a bit different with the different game logo, the following stage select screen has barely been changed for \"Galactic Pinball\", there are also five options which can be selected by rotating them. Instead of 4 tables and the highscores there are 5 tables in this prototype, though, and here at latest, it is becoming very interesting. \nNone of the 5 available tables can be found in the final version of the game like they are in the prototype, but some still remind of \"Galactic Pinball\" more or less.","collection":2095,"popularity":1.333333333333333,"games":[44242,18623,22470,29173,22425,26145,55590,55689,22406,23867],"tags":[268435469,268435486,536871846,536872060,536872957,536873064,536875074,536875404,536875411,536875412,536875416,536876435],"category":0,"keywords":[934,1148,2045,2152,4162,4492,4499,4500,4504,5523],"genres":[13,30],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pnsena3mz8ygofdezq1w.jpg","cloudinary_id":"pnsena3mz8ygofdezq1w","width":875,"height":1160}}