{"id":10199,"name":"The Path","slug":"the-path","url":"https:\/\/www.igdb.com\/games\/the-path","created_at":1431222179600,"updated_at":1547114592760,"summary":"The Path is a psychological horror art game developed by Tale of Tales originally released for the Microsoft Windows operating system on March 18, 2009 in English and Dutch, and later ported to Mac OS X by TransGaming Technologies. \n \nIt is inspired by several versions of the fairy tale Little Red Riding Hood, and by folklore tropes and conventions in general, but set in contemporary times. The player can choose to control one of six different sisters, who are sent one-by-one on errands by their mother to see their sick grandmother. The player can choose whether to stay on the path or to wander, where wolves are lying in wait. \n \n \nPLOT: \nThe game begins in an apartment. The player is shown six sisters to choose from and is given no information about them other than a name. When the player selects a girl, the journey begins. \n \nThe player is given control of the girl, and is instructed: \"Go to Grandmother's house and stay on the path.\" \n \nAs the player explores, they find various items scattered around. For a girl to pick up or examine an object, the player needs to either click on the interaction button or move her close enough for a superimposed image of the object to appear on the screen, then let go of the controls. The character will interact and an image will appear on the screen, indicating what has been unlocked; every item a girl encounters in the forest shows in some shape or form in Grandmother's house, and some objects open up whole new rooms. Small text will also appear, a thought from the current character. Some items can only be picked up once and do not appear in subsequent runs. However, each character will say something different about an object, so the player has the option to access a \"basket\" to see what they have collected. \n \nIt is not required to find the Wolf. In this game, there are no requirements but the ending at Grandmother's house does change dramatically after the wolf encounter. The girl encounters the Wolf, there is a brief cut scene, and the screen goes black. Afterward, the girl is lying on the path in front of Grandmother's house. \n \nWhen the player enters Grandmother's house, the style of gameplay changes. It is now in first person, and the character moves forward along a pre-determined path. If the player got there without interacting with the Wolf, they arrive safely, cozy up next to Grandmother and are sent back to the apartment. The girl the player guided will still be there, and can be played again. If the player did go to the Wolf, then everything in the house is darker, and if the player remains still for too long, darkness clouds the screen, and something growls. Depending on the girl, doors are scratched, or furniture tipped over and broken, or strange black threads are draped across everything. Instead of ending with Grandmother, the music crescendos as the player enters a final surreal room before falling down, and things black out again. Images flash on the screen, featuring the girl being attacked by her Wolf, before the player is relocated back in the apartment. The girl played is not there, and will remain absent. \n \nWhen all of the girls have encountered their wolves, a girl in a white dress, who could be previously encountered by the sisters, becomes playable and visits Grandmother's house. The girl will then travel through the house, now a combination of all of the end rooms of the previous girls ending with the no-wolf room. Upon reaching the grandmother, the girl appears in the apartment covered in blood, but alive. The sisters all return through the door and the game starts over. \n \n \nDEVELOPMENT: \nThe Path was first announced on the Tale of Tales Game Design forum on March 16, 2006 under the working title 144, on the pattern of their first-started, on-hiatus \"Tale of Tales\" 8 (chosen for the universal, language-independent nature of arabic numerals). This number originally referred to the six 24-hour periods of the six days in which the game was set, but in the released version refers to the 144 coin flowers. \n \nAccording to the developer, the game is not meant to be played in the traditional sense, in that there is no winning strategy. In fact, much of the gameplay requires the player to choose the losing path for the sisters to run into encounters which they (and the player) are meant to experience. Even the story narratives are not typical for a game, as explained by the developer, \"We are not story-tellers in the traditional sense of the word. In the sense that we know a story and we want to share it with you. Our work is more about exploring the narrative potential of a situation. We create only the situation. And the actual story emerges from playing, partially in the game, partially in the player’s mind.\" \n \n \nRECEPTION: \nIain McCafferty of Videogamer.com called The Path \"a hugely significant work in terms of what a video game can be beyond the realms of throwaway entertainment\" and \"potentially a seminal moment in video games.\" He claimed that \"It will be years before a game made by the big budget software houses like Ubisoft or EA is brave enough to attempt anything remotely similar, but The Path shows promising signs that gaming is starting to grow up.\" \n \nHeather Chaplin of Filmmaker Magazine pointed out how uniquely feminine The Path is: \"For me, The Path is about what a remarkably fine line it is that separates childhood from adulthood, innocence from cynicism, and how utterly not black-and-white most things in life are.\" \n \nTim Martin of The Daily Telegraph cited The Path as a recent example of a \"vigorous experimentation with techniques of narrative.\" He likened it to \"an Angela Carter novel, as siphoned through The Sims.\" \n \nSteven Poole of Edge opined that the game is \"a supremely boring collection of FMVs with pretensions to interactivity that very quickly wears out its joke about control and becomes a tedious slab of nihilistic whimsy,\" yet noting that the game features a \"lugubrious, Lynchian surrealism\" and that \"in its ornery and precious way, The Path is a triumph of atmosphere, coming much closer than the cruder shocks of games such as Silent Hill or Bioshock to a dramatization of what Ernst Jentsch and Freud analyzed as the \"uncanny\" in literature.\" \n \nAwards \nAn in-progress, alpha-stage version of The Path was nominated for Excellence in Visual Arts after being exhibited at the Independent Games Festival in 2008. The game also has been honored with two awards at Bilbao, Spain's hóPLAY International Video Game Festival. The game won Best Sound and Best Design.","storyline":"The game begins in an apartment. The player is shown six sisters to choose from and is given no information about them other than a name. When the player selects a girl, the journey begins. \n \nThe player is given control of the girl, and is instructed: \"Go to Grandmother's house and stay on the path.\" \n \nAs the player explores, they find various items scattered around. For a girl to pick up or examine an object, the player needs to either click on the interaction button or move her close enough for a superimposed image of the object to appear on the screen, then let go of the controls. The character will interact and an image will appear on the screen, indicating what has been unlocked; every item a girl encounters in the forest shows in some shape or form in Grandmother's house, and some objects open up whole new rooms. Small text will also appear, a thought from the current character. Some items can only be picked up once and do not appear in subsequent runs. However, each character will say something different about an object, so the player has the option to access a \"basket\" to see what they have collected. \n \nIt is not required to find the Wolf. In this game, there are no requirements but the ending at Grandmother's house does change dramatically after the wolf encounter. The girl encounters the Wolf, there is a brief cut scene, and the screen goes black. Afterward, the girl is lying on the path in front of Grandmother's house. \n \nWhen the player enters Grandmother's house, the style of gameplay changes. It is now in first person, and the character moves forward along a pre-determined path. If the player got there without interacting with the Wolf, they arrive safely, cozy up next to Grandmother and are sent back to the apartment. The girl the player guided will still be there, and can be played again. If the player did go to the Wolf, then everything in the house is darker, and if the player remains still for too long, darkness clouds the screen, and something growls. Depending on the girl, doors are scratched, or furniture tipped over and broken, or strange black threads are draped across everything. Instead of ending with Grandmother, the music crescendos as the player enters a final surreal room before falling down, and things black out again. Images flash on the screen, featuring the girl being attacked by her Wolf, before the player is relocated back in the apartment. The girl played is not there, and will remain absent. \n \nWhen all of the girls have encountered their wolves, a girl in a white dress, who could be previously encountered by the sisters, becomes playable and visits Grandmother's house. The girl will then travel through the house, now a combination of all of the end rooms of the previous girls ending with the no-wolf room. Upon reaching the grandmother, the girl appears in the apartment covered in blood, but alive. The sisters all return through the door and the game starts over.","rating":67.9178190467523,"popularity":2,"aggregated_rating":80,"aggregated_rating_count":2,"total_rating":73.95890952337615,"total_rating_count":14,"rating_count":12,"games":[36553,35371,26658,23345,18020,7504,26940,18623,56033,19319],"tags":[19,22,268435471,268435487,268435488,536870984,536871043,536871063,536871068,536871208,536872031,536872032,536872098,536872225,536872436,536872613,536872633,536872819,536873878,536874694,536875050,536875057,536875231,536875637,536875657,536875880,536875956,536876343,536876345,536876770,536876838,536877028,536878101,536878329,536879774,536880166,536880404,1073741826],"developers":[5055],"publishers":[5055],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[72,131,151,156,296,1119,1120,1186,1313,1524,1701,1721,1907,2966,3782,4138,4145,4319,4725,4745,4968,5044,5431,5433,5858,5926,6116,7189,7417,8862,9254,9492],"themes":[19,22],"genres":[15,31,32],"first_release_date":1237334400000,"platforms":[6,14],"release_dates":[{"category":0,"platform":14,"date":1237334400000,"region":8,"human":"2009-Mar-18","y":2009,"m":3},{"category":0,"platform":6,"date":1237334400000,"region":8,"human":"2009-Mar-18","y":2009,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l9iww5bbu5cextlvmhql.jpg","cloudinary_id":"l9iww5bbu5cextlvmhql","width":1364,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rf4gykvwguxzalptih3x.jpg","cloudinary_id":"rf4gykvwguxzalptih3x","width":1364,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eyccyvop99bnof7usdke.jpg","cloudinary_id":"eyccyvop99bnof7usdke","width":1364,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oguw0nh6q1uxndmssiu3.jpg","cloudinary_id":"oguw0nh6q1uxndmssiu3","width":1364,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rrxrziwary4ssmtlejor.jpg","cloudinary_id":"rrxrziwary4ssmtlejor","width":1364,"height":768}],"videos":[{"name":"Gameplay video","video_id":"WEPSeFDM0Kg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wlovyz8bjlxqktozqcwz.jpg","cloudinary_id":"wlovyz8bjlxqktozqcwz","width":1800,"height":2648},"esrb":{"rating":6},"external":{"steam":"27000"}}