{"id":21699,"name":"Need for Speed Most Wanted U","slug":"need-for-speed-most-wanted-u","url":"https:\/\/www.igdb.com\/games\/need-for-speed-most-wanted-u","created_at":1469795418558,"updated_at":1542383841142,"summary":"\"Designed specifically for the Wii U, Need for Speed Most Wanted U delivers gameplay mechanics built for the unique features of the Wii U™ GamePad controller. The local co-op mode, called Co-Driver, allows one player to drive using the Wii Remote™ controller or Wii U Pro Controller while another player uses the Wii U GamePad to provide control and navigation assistance on an interactive real-time map. Using just their fingertips, the partner can distract pursuing cops, switch from night to day or activate enhanced performance for any car and even control the amount of traffic on the road.For another competitive edge, players can switch into their favorite cars, track milestones, uncover the city’s hidden gems and more, all on the fly with the Wii U touch screen, ensuring nothing ever slows them down.  \n  \nNeed for Speed Most Wanted U brings the blockbuster action of the open world racer to players’ fingertips. The entire game is playable off-screen using the Wii U GamePad, so gamers never have to put the game down.  \n  \nNeed for Speed Most Wanted U includes the Ultimate Speed Pack expansion, so players can take to the streets with five of the most absurdly fast cars ever made: McLaren’s F1 LM, Lamborghini’s minimalist artwork, the Aventador J, the track-focused Pagani Zonda R, Bugatti’s reigning world speed champion, the Bugatti Veyron Grand Sport Vitesse and Hennessey’s savage 275 mile-an-hour ragtop beast, the Venom GT Spyder.  \n  \nFinally with Need for Speed Most Wanted U, gamers are competing against the people they want to defeat most – their friends. With EA’s innovative online technology Autolog 2, the game automatically tracks and compares best race times, high scores and more. These stats are broadcast throughout the open world, fueling friendly competition and rivalries.Need for Speed Most Wanted’s online multiplayer also ups the ante for social competition. Gamers pick a car, meet up with their friends and are immersed in a non-stop playlist of action-packed events. Whether it’s competing for the best starting position, the ultimate jump, or finishing first place, if there’s something to do, there’s someone to beat. Any Speed Points earned on Wii U will add to your existing total if you are playing the game on any of the other available platforms through CloudCompete.\"","collection":12,"rating":82,"popularity":1.333333333333333,"aggregated_rating":83,"aggregated_rating_count":4,"total_rating":82.5,"total_rating_count":7,"rating_count":3,"games":[81249,31712,86041,90099,101172,103316,76253,78149,23314,27378],"tags":[1,38,268435466,1073741826,1073741825],"developers":[347],"publishers":[1],"category":0,"player_perspectives":[1,2],"game_modes":[1,2,3],"themes":[1,38],"genres":[10],"first_release_date":1363219200000,"platforms":[41],"release_dates":[{"category":0,"platform":41,"date":1363219200000,"region":5,"human":"2013-Mar-14","y":2013,"m":3},{"category":0,"platform":41,"date":1363824000000,"region":1,"human":"2013-Mar-21","y":2013,"m":3},{"category":0,"platform":41,"date":1363824000000,"region":3,"human":"2013-Mar-21","y":2013,"m":3},{"category":0,"platform":41,"date":1363651200000,"region":2,"human":"2013-Mar-19","y":2013,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dgzp5ygmhmnqgngi4a9r.jpg","cloudinary_id":"dgzp5ygmhmnqgngi4a9r","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hzymg28360mwx4hbmvvq.jpg","cloudinary_id":"hzymg28360mwx4hbmvvq","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/frx7ryib9c8xyfsrhqmh.jpg","cloudinary_id":"frx7ryib9c8xyfsrhqmh","width":3840,"height":2160},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h9urzxipogkahnecz1rh.jpg","cloudinary_id":"h9urzxipogkahnecz1rh","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kcaqz89cqgh98fv3jk4u.jpg","cloudinary_id":"kcaqz89cqgh98fv3jk4u","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cxasmuatj9i3xvwia6vq.jpg","cloudinary_id":"cxasmuatj9i3xvwia6vq","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/scuqkwfdt5xypvdbkuo4.jpg","cloudinary_id":"scuqkwfdt5xypvdbkuo4","width":1200,"height":675},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uc3ilqy0quamqjnf6sxz.jpg","cloudinary_id":"uc3ilqy0quamqjnf6sxz","width":1200,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/czxz71mhfwbfatawhpa1.jpg","cloudinary_id":"czxz71mhfwbfatawhpa1","width":1200,"height":675},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jtsjf0vuhtrhpodtkiqx.jpg","cloudinary_id":"jtsjf0vuhtrhpodtkiqx","width":650,"height":365}],"videos":[{"name":"Trailer","video_id":"67KSlbAgSig"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dh7zpjpsguyiqe0dnvua.jpg","cloudinary_id":"dh7zpjpsguyiqe0dnvua","width":768,"height":1080},"esrb":{"synopsis":"This is an arcade-style racing game in which players compete in underground street races with real-world cars. As players speed through a fictional city and perform various stunts (e.g., jumping off ramps, drifting around corners, driving into oncoming traffic), they are sometimes rewarded for forcing other vehicles—including police cruisers—to crash. Collisions are sometimes accompanied by slow-motion effects; vehicle damage is indicated by crashing sounds, visible dents, cracked windshields, and\/or flying debris. Some racing areas contain signs that depict fictional business names and\/or catchphrases with humorous innuendo (e.g., a massage parlor called Roman Hands; a cargo company named GoodsEx); a couple of these signs advertise a distillery and winery.","rating":4},"pegi":{"synopsis":"The content of this game is suitable for persons aged 7 years and over only.\r\r\nIt contains: Violence that is not shown but is implied\r\r\nThis game allows the player to interact with other players ONLINE","rating":2}}