{"id":2399,"name":"Darklight Conflict","slug":"darklight-conflict","url":"https:\/\/www.igdb.com\/games\/darklight-conflict","created_at":1372878648785,"updated_at":1500536670824,"summary":"Darklight Conflict is a space combat simulator video game developed by Rage Software and published by Electronic Arts in 1997 for PCs running MS-DOS or versions of Microsoft Windows before Windows 2000, and the Sega Saturn and Sony PlayStation game consoles. In this game, you play the part of a contemporary human fighter pilot abducted by the alien Repton species during your aerial battle, and biologically modified to become a starfighter pilot for them in their war against the Evil Ovon race. \n \nIn the game itself, you would usually pilot one of three different starfighters, each with different strengths and weaknesses, along with occasionally piloting a captured enemy ship, or controlling a gun turret on your Mothership (The \"War Drum\"). The missions are quite varied, ranging from simple combat missions to missions where you need to defend your mothership, destroy an enemy Ovon mothership, clear an asteroid field, or retrieve an object with a tractor beam. Your ship moves between mission areas via \"hyperspace portals\", passing through a hyper-space environment, resembling that seen in 2001: A Space Odyssey. Often during hyperspace transit, varying streams of energy are encountered - yellow energy replenishing the energy which fuels the ship, while blue energy drains it, reducing the ship's effectiveness. \n \nAfter you complete the four campaigns and destroy the Ovon home-world for the Reptons, they reward you by sending their best pilots to kill you in an honorable way (after all, they don't need a human in their society and war history). You manage to escape and jump to Earth, where centuries have passed since you were gone. Your ship is greeted by the Earth Defense Fleet, which destroys all Repton ships in hot pursuit.","popularity":1.333333333333333,"aggregated_rating":70,"aggregated_rating_count":1,"total_rating":70,"total_rating_count":1,"games":[25311,44242,28465,34919,33603,36962,55888,65827,43130,28277],"tags":[18,268435469,536870936,1073741825,1073741826],"developers":[543],"publishers":[1],"category":0,"player_perspectives":[1,2],"game_modes":[1,2],"keywords":[24],"themes":[18],"genres":[13],"first_release_date":883526400000,"platforms":[13],"release_dates":[{"category":2,"platform":13,"date":883526400000,"human":"1997","y":1997,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/httxcslxpfehbqnggrmr.jpg","cloudinary_id":"httxcslxpfehbqnggrmr","width":1110,"height":1434}}