{"id":25299,"name":"Mass Effect 3: Retaliation","slug":"mass-effect-3-retaliation","url":"https:\/\/www.igdb.com\/games\/mass-effect-3-retaliation","created_at":1477555099616,"updated_at":1490880029160,"summary":"The battle to save the galaxy rages on and a familiar foe returns in the largest downloadable content pack to-date for Mass Effect 3 multiplayer! Mass Effect 3: Retaliation ups the challenge by adding treacherous environmental hazards to existing maps and will introduce the infamous Collectors as a new enemy faction in multiplayer. \n \nAlso making its way into the Mass Effect 3: Retaliation pack is a brand-new challenge system that will reward players for their accomplishments in multiplayer. This new feature will give players the ability to track and compare progress across different multiplayer challenges. \n \nThe entire pack will include: \n \nNew “Hazard” Versions of Existing Maps: Wage war across six maps as a regular rotation of Firebases will be introduced to different hazards and traps. Survive the onslaught of Acid, Lightening, Meltdowns, Sandstorms, Swarms and Whiteouts! \n \nNew Deadly Enemy Faction: Prepare to face off against the Collector Praetorian, Scion, Abomination, Trooper, and Captain. Reports have also come in that Cerberus has enlisted the Dragoon to their ranks and the Geth are deploying new Drones to the battlefield. \n \nNew Unlockable Weapons: The Collectors have also brought deadly new weapons to the fight: the Collector Assault Rifle, Sub-Machine Gun, and Sniper Rifle.  Unlock these weapons and new equipment upgrades to build to your arsenal. \n \nNew Class Kits to Unlock: A host of new characters have joined the war to fight this new threat, including the Turian Havoc Soldier and Turian Ghost Infiltrator. Additional class kits will be added as the weeks progress.  \n \nNew Powerful Upgrades: Outfit your weapons with three new ammo modifications and fortify your gear with five unique upgrades to defeat even the toughest foes. \n \nNew Multiplayer Challenge Feature: Think you are the best soldier in the Alliance? Make sure to track your progress in the new “Challenges” database. Complete various multiplayer assignments and feats of strength to unlock titles and banners to display in-game, and then compare your progress against your friends.","popularity":1.666666666666667,"game":75,"developers":[2],"publishers":[2],"category":1,"game_modes":[2],"keywords":[541,3097],"genres":[5],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r7qnp7cdccps5qub8eyb.jpg","cloudinary_id":"r7qnp7cdccps5qub8eyb","width":900,"height":508},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wczajzboxp3kz9yzdutz.jpg","cloudinary_id":"wczajzboxp3kz9yzdutz","width":900,"height":508},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ggfkls5bl0qcxrx4iaa9.jpg","cloudinary_id":"ggfkls5bl0qcxrx4iaa9","width":900,"height":506}],"videos":[{"name":"Trailer","video_id":"bpyHMv7lQ7g"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wit3qgmutpt4n6dufbok.jpg","cloudinary_id":"wit3qgmutpt4n6dufbok","width":1024,"height":1024},"websites":[{"category":2,"url":"http:\/\/masseffect.wikia.com\/wiki\/Mass_Effect_3:_Retaliation"},{"category":1,"url":"http:\/\/masseffect.bioware.com\/downloads\/multiplayer_packs\/"}]}