{"id":26199,"name":"Road Fist","slug":"road-fist","url":"https:\/\/www.igdb.com\/games\/road-fist","created_at":1480797709317,"updated_at":1523361642785,"summary":"Road Fist is a Beat 'em up style action game inspired by classic 80's \/ 90's fighting movies. The 3D movement provides a new panorama within the bilateral view (2D), adding more freedom and requiring a greater sense of direction from the player. The gameplay and difficulty is based on games like Dark Souls, where a stamina system is implemented and each enemy encountered can be deadly. The gloomy look comes accompanied by a stimulating, dense and varied soundtrack.","storyline":"Fear and chaos spread to the outskirts of the city. Volcan, the drug smuggler, is dominating peripheral neighborhoods with the goal of building his bloody empire at Road Fist. He will count on the help of his faithful subordinates. Among them are, assassins, mercenaries and also gangs of criminals. But not everything seems lost. Two skilled street fighters (Aris & Kyra) decided to join forces and stop Volcan's dirty plans once and for all. It's up to you to guide them through the dangerous streets of Road Fist, preventing more innocent lives from being lost. A long night is coming. Rain, mist, dust and blood will make it difficult. But do not forget, your fists will be your best allies. \n\n\nProtagonists\n\n• Aris - After getting involved in many street fights, he was expelled by his master of the Dojo where he practiced Karate . His goal is to test his skills and prove his sense of justice to his master. \n\n• Kyra - As kickboxing World Champion of several tournaments, she lost her father who was brutally murdered by the criminals of the city. Her goal is revenge for those responsible. \n\n\nVillains\n\n• Volcan - The boss responsible for the violent gangs of Road Fist, became a millionaire with money laundering and drug trafficking. He is known as the Red Volcano, for never having lost a fight. \n\n• Jambo - As a Former heavyweight boxing champion, he destroyed his career with illegal fights and drugs. He is Volcan's right arm. \n\n• Bogoss - This maniac clown of the city is known for organ trafficking. He is always accompanied by his septer \"Víbora\". \n\n• Maya - The killer ninja who usually stays on the dark side of the city, uses a Katana to kill. Her past is unknown. \n\n• Knox - As a former detainee at a maximum security prison, this bloodthirsty psychopath kills just for pleasure. \n\n• Shing - He was previously a member of the Yakuza. This wanderer now seeks challenges through the streets of the city.","hypes":1,"popularity":1.333333333333333,"games":[76253,34919,37419,109438,32902,134,80916,107182,102178,19959],"tags":[1,268435481,268435488,1073741828],"game_engines":[404],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[1],"genres":[25,32],"first_release_date":1484870400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1484870400000,"region":8,"human":"2017-Jan-20","y":2017,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/imoaexfocxdgvadzb9hz.jpg","cloudinary_id":"imoaexfocxdgvadzb9hz","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mccrrq6nnh517w2d424d.jpg","cloudinary_id":"mccrrq6nnh517w2d424d","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/th27oufwjithzfcnulpo.jpg","cloudinary_id":"th27oufwjithzfcnulpo","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/arheaf91lth8tamyhtcg.jpg","cloudinary_id":"arheaf91lth8tamyhtcg","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tt7frabkrghfosq2gk2r.jpg","cloudinary_id":"tt7frabkrghfosq2gk2r","width":1280,"height":720}],"videos":[{"name":"Trailer","video_id":"fiY3nobzf6k"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/omiuspsuhz5w4gszjk2v.jpg","cloudinary_id":"omiuspsuhz5w4gszjk2v","width":1280,"height":720},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/577330"}],"external":{"steam":"577330"}}