{"id":373,"name":"Might & Magic: Heroes VI","slug":"might-magic-heroes-vi","url":"https:\/\/www.igdb.com\/games\/might-magic-heroes-vi","created_at":1300380215000,"updated_at":1548028465739,"summary":"The adventure in Heroes VI, starting 400 years before events in Heroes V, catapults a family of heroes into a fast-paced epic story where Angels plot to end -- once and for all -- an unfinished war with their ancient rivals, the Faceless. \nA legendary Archangel General is resurrected, but with his powers crippled. Plagued by horrible memories of the Elder Wars, he plots to recover his powers and take control of Ashan while destroying both Faceless and Demons in a series of carefully orchestrated attacks and betrayals. He underestimates, however, the power of the all-too-human Griffin dynasty.","storyline":"In the everlasting war between the Orcs and the Griffin Empire, led by duke Pavel Griffin, Toghrul, an Orc shaman, summons the demons in order to help him and his tribe get rid of Pavel. The demons then overpower Pavel and slay him, but his sister, Sveltana (a necromancer in disguise) is able to trap Pavel's soul in the Griffin familial sword with which he has fought. However, before she can intervene, an Angel descends and steals the sword. \n \nCounseled by Angels in the impending war against the demons, Emperor Liam Falcon posts a decree enabling Duke Gerhart of the Wolf duchy to exterminate Orcs in the Empire. Duke Slava, Pavel's son, retaliates in solidarity with the Orcs, and the Dukes' bickering forces cause the Archangel Uriel - Michael's brother - to intervene. Uriel decides that Slava's eldest daughter, Irina, is to be betrothed to Gerhart to force a lasting peace. A decade passes, and Sandor learns that Irina has been imprisoned in the Wolf Duchy's jails for injuring Gerhart. He rouses an army of Orcs to free his half-sister, and the renegades flee to the Jade Ocean, where Sandor leaves Irina in Hashima and departs. Irina quickly befriends the native Naga and assists them in destroying a Wolf trading port, before discovering she is pregnant with Gerhart's child. \n \nGerhart accuses Slava of orchestrating Sandor's attack, and the two dukes are called before the Emperor, where Slava's daughter Anastasya - Uriel's pupil and lover - kills Slava with a concealed knife before the court. Anton is crowned Duke, but the inquisition tries to force a confession from Anastasya, fearing she is in league with the Faceless; Anton elects to euthanize his sister before she can be tortured. He learns that Jorgen - one of Slava's former advisers - is an undercover Faceless, but not Slava's killer, while Anastasya is resurrected by Sveltana as an undead. Resolving to learn who manipulated her into slaying her father, she frees Jorgen from the inquisition before traveling onward to Heresh with her aunt. Meanwhile, Kiril finds himself abandoned in Sheogh by his mentor, the Archangel Sarah, with the soul of a demon prince sharing his body. Desperate to expunge the demon, he pursues Sarah as a renewed demon invasion begins. \n \nSveltana is kidnapped by Anastasya's rival, Miranda. Suspecting her of Slava's murder, Anastasya kills Miranda, and she explains that Anastasya was controlled with a comb empowered by Faceless magic. Irina ransacks the Wolf duchy, slaughtering Gerhart, and both she and Sandor devote their resources to the eradication of the demons. Michael dispatches Anton to assist Gerhart against the Naga, but Anton soon learns the Duke has already been killed. Using the comb, Anastasya enters the mind of her betrayer: Uriel, who had sought to use her soul to reincarnate his mother. Enraged, Anastasya destroys Uriel's mind, and both he and Emperor Liam are slain in battle, leaving Anton to eliminate the remaining demons. Kiril finally apprehends Sarah, who reveals she sold Kiril's soul to the demons in order to cripple the Faceless by destroying their repository of knowledge; Kiril usurps the repository and frees himself of possession, while Sveltana discovers that Pavel's soul was used to resurrect Michael. \n \nWith the demons overcome, Michael appeals to the Griffin heirs to assist him in ending his war against darkness. If the alignment of the player's chosen heir is Tears, the heir rejects Michael's calls to arms and leads armies against the Angels, alongside Cate. Michael is killed in battle and Cate succeeds in sending the remaining deceased Angels' souls to Elrath, but the ritual ultimately results in her death. Alternatively, if the heir's alignment is Blood, they launch an offensive against Cate, sponsored by Michael, and succeed in slaying her to apparently prevent the impending conflict. \n \nIn both instances, the Griffins lament Cate's death and bury her with Slava, while Jorgen conspires with the Dark Elf Raelag to instigate the war against Elrath in the wake of her absence.","collection":194,"franchise":458,"franchises":[458],"rating":73.6841577070596,"popularity":6.666666666666667,"aggregated_rating":77.6666666666667,"aggregated_rating_count":4,"total_rating":75.67541218686316,"total_rating_count":45,"rating_count":41,"games":[364,14394,363,370,5042,22387,5652,26841,5550,9278],"tags":[17,22,268435468,268435471,268435472,536870984,536871059,536871063,536871172,536871208,536871304,536871327,536871384,536871390,536871496,536871717,536871938,536872070,536872120,536872205,536872544,536872835,536872953,536873154,536873822,536873906,536873949,536874094,536874343,536874694,536875046,536875160,536875161,536875196,536875263,536875455,536875671,536875679,536875699,536875709,536875775,536875778,536875929,536875956,536876058,536876062,536876232,536876281,536876590,536876598,536876601,536876607,536876847,536877164,536877616,536877779,536878215,536878338,536878452,536879765,536880428,536880645,536880646,536880744,536880864,536881632,536882496,536882862,536883269,536883373,1073741827],"developers":[103,2514,794],"publishers":[104],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[72,147,151,260,296,392,415,472,478,584,805,1026,1158,1208,1293,1632,1923,2041,2242,2910,2994,3037,3182,3431,3782,4134,4248,4249,4284,4351,4543,4759,4767,4787,4797,4863,4866,5017,5044,5146,5150,5320,5369,5678,5686,5689,5695,5935,6252,6704,6867,7303,7426,7540,8853,9516,9733,9734,9832,9952,10720,11584,11950,12357,12461],"themes":[17,22],"genres":[12,15,16],"dlcs":[13457],"standalone_expansions":[8112],"first_release_date":1318464000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1318464000000,"region":2,"human":"2011-Oct-13","y":2011,"m":10},{"category":0,"platform":6,"date":1318464000000,"region":3,"human":"2011-Oct-13","y":2011,"m":10},{"category":0,"platform":6,"date":1318550400000,"region":1,"human":"2011-Oct-14","y":2011,"m":10},{"category":0,"platform":6,"date":1322179200000,"region":5,"human":"2011-Nov-25","y":2011,"m":11}],"alternative_names":[{"name":"Heroes of Might and Magic VI\nHeroes of Might and Magic 6\nHoMM VI\nHoMM 6","comment":"Other"},{"name":"MMH6","comment":"Acronym"},{"name":"Меч и Магия: Герои VI","comment":"Russian title"},{"name":"Might & Magic: Heroes 6"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tnbmu6qopro26fqhhum5.jpg","cloudinary_id":"tnbmu6qopro26fqhhum5","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dlqytw2g3ghg9p0tt1jn.jpg","cloudinary_id":"dlqytw2g3ghg9p0tt1jn","width":1680,"height":1050},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o54ysuqtos9nvy0hftbu.jpg","cloudinary_id":"o54ysuqtos9nvy0hftbu","width":800,"height":640},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eg2qhyzo5s0js7zmirly.jpg","cloudinary_id":"eg2qhyzo5s0js7zmirly","width":1000,"height":619},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i4tni6dhrgglki8n4ycm.jpg","cloudinary_id":"i4tni6dhrgglki8n4ycm","width":1000,"height":619}],"videos":[{"name":"Trailer","video_id":"wEBGPcRBnQU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ymsu58getycdspumugfj.jpg","cloudinary_id":"ymsu58getycdspumugfj","width":350,"height":495},"esrb":{"synopsis":"This is a strategy role-playing game in which players build and manage cities, explore magical lands, and battle enemy hordes in turn-based combat. Players can assume control over dragons, knights, spirits, and other fantasy creatures that engage in grid-based combat. Characters use swords, spears, and elemental attacks (e.g., lightning bolts, fireballs, volcanic eruptions) to defeat enemy units; damage is indicated by a loss of hit points. Cutscenes depict other instances of violence: creatures punching, slashing, or stomping on each other; a chained prisoner getting stabbed with a sword. During the course of the game, the dialogue occasionally references suggestive\/sexual material (e.g., “pregnant from Gerhart's brutality,”“You were an imp sucking succubus teats,” and “The Empire bartered me to a rapist for political ends.”). The words “b*tch,”“bastard,” and “hell” appear in the dialogue.","rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\r\nIt contains: Realistic looking violence\r\nThis game allows the player to interact with other players ONLINE.","rating":4},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/48220"},{"category":1,"url":"http:\/\/might-and-magic.ubi.com\/heroes-6\/en-GB\/home\/"}],"external":{"steam":"48220"}}