{"id":53173,"name":"Hard West - Complete Edition","slug":"hard-west-complete-edition","url":"https:\/\/www.igdb.com\/games\/hard-west-complete-edition","created_at":1501591976300,"updated_at":1524914796969,"summary":"The Hard West: Complete Edition is the most comprehensive version of the game as it includes all available content in one place: \n \nCONTENTS: \n- Hard West \n- Scars Of Freedom DLC \n- Hard West Original Digital Soundtrack composed by celebrated Composer and Sound Designer Marcin Przybyłowicz (The Witcher 3: Wild Hunt, The Vanishing of Ethan Carter). All tracks are provided as High Quality MP3 and FLAC files \n- Digital Artbook \n- Original Digital Comic Book","storyline":"Welcome to the Wild West like you’ve never seen it before. When a tragic turn of events sets one man down a path of supernatural chaos and revenge, he must brutally hunts down all those whom wronged him. Follow Warren on his descent into the darkest recesses of the human soul, and try to survive in a world full of hard choices and even harder consequences. Because in this world, death is a constant presence and the black pacts which you make with forces beyond human comprehension will forever haunt all those around you. \n \nFight and survive through 8 unique story-based scenarios, and try your hand at more than 40 individually designed turn-based combat missions. Journey deeper into the world of Hard West and meet a colorful cast of playable characters whose fates are intimately intertwined with yours. Together you will need to make divisive choices to uncover the ultimate plans of the ancient powers at play, as you unravel a deep narrative storyline featuring multiple endings depending on the choices you make during the game.","popularity":1.333333333333333,"version_parent":7675,"games":[37419,25646,25311,11596,27266,28148,13189,27088,80916,26145],"tags":[1,19,268435471,268435480,268435487,268435488,536874990,1073741827],"developers":[3225],"publishers":[6549],"game_engines":[13],"category":3,"player_perspectives":[3],"game_modes":[1],"keywords":[4078],"themes":[1,19],"genres":[15,24,31,32],"first_release_date":1456963200000,"platforms":[6,14],"release_dates":[{"category":0,"platform":14,"date":1456963200000,"region":8,"human":"2016-Mar-03","y":2016,"m":3},{"category":0,"platform":6,"date":1456963200000,"region":8,"human":"2016-Mar-03","y":2016,"m":3}],"pegi":{"rating":4},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/bundle\/2485\/Hard_West___Complete_Edition"},{"category":1,"url":"http:\/\/www.creativeforge.pl\/"}]}