{"id":6273,"name":"Red Faction","slug":"red-faction","url":"https:\/\/www.igdb.com\/games\/red-faction","created_at":1398049600301,"updated_at":1547996539929,"summary":"JOIN THE REVOLUTION! \nLured to Mars by the Ultor Corporation's promise of a better life, thousands have come to seek their fortune and work for the massive mining company. But all is not as it seems. A deadly plague is sweeping through the barracks, and miners suffer daily abuse at the hands of the Ultor guards. Is a revolution on the horizon? \nRed Faction revolutionizes gaming with Geo-Mod technology, the ability to completely alter and destroy the environment in real-time. Featuring 5 controllable vehicles, 15 weapons of mass destruction, unparalleled multiplayer action, and a setting on Mars in the midst of a deadly plague and rebellion, Red Faction sets the gold standard in gaming! \n \nGeo-Mod technology — the only FPS with real-time, arbitrary geometry modification \n \nUnparalleled multiplayer action, with Geo-Mod specific strategies \n \nAdvanced physics simulation - supports falling geometry, particles and liquid \n \nFive land, sea and air vehicles to commandeer and control \n \nA compelling storyline across 20 diverse levels \n \nStealth and action driven objectives \n \nVaried environments including natural settings unique to the genre \n \nDynamic, real-time lighting including lightmaps, object shadow casting and more \n \nAdvanced AI behavior \n \nReal-time skeletal deformation and interpolation for silky smooth animations \n \nLocation-based damage system \n \nMultiplayer support for LAN and TCP-IP (up to 32 players)","storyline":"Red Faction takes place on Mars around the year 2070. Earth’s minerals are being depleted and humans need more of them to survive. The vast Ultor Corporation runs the mining operation on Mars. The living conditions are deplorable, human rights for the miners are few and a disease called \"The Plague\" is running rampant throughout the colony with no known antidote available - predominantly within the confines of the mine complex. Parker, a downtrodden miner, came to Mars to make a new start in his life - taken in by the promises and advantages Ultor has to offer in the mines of Mars. \n \nAfter a routine day in the mine with the typical aggression toward miners and cramped living conditions and poor nutrition, he witnesses the spark that starts a rebellion when a security guard abuses a miner at the end of his shift and heartlessly kills him. Parker takes up arms, with the help of Hendrix, a rebellious Ultor security technician who guides Parker through the complex. Hendrix tries to get Parker to join up with a group of miners who are about to steal a supply shuttle and escape the complex, but Parker arrives too late. The shuttle takes off, and is destroyed by missiles moments later. \n \nParker traverses through the Ultor complex, eliminating any resistance Ultor throws at him, and even (with the help of Orion, a high-ranking Red Faction member) kidnapping a high-ranking Ultor administrator, Gryphon, for Eos, leader of the Red Faction. Parker learns from Gryphon about Dr. Capek, who created \"The Plague\". Capek has been experimenting with nanotechnology, and the Plague is a side-effect of injections at the miners' annual medical checkup. Hendrix directs Parker to Capek's secret underground laboratory, where he and Eos meet up and take down Capek. As Capek dies, he tells Eos there is a cure for the Plague but refuses to tell her how to make it and bluntly states \"Hope you all Die!\" With Capek dead the lab's self-destruction sequence initiates, Eos stays behind to find the files on the cure while Parker continues to the Communications center. \n \nAfter sending a distress call to the Earth Defense Force Parker destroys the missile defense system, so that he can stow away on a shuttle to an Ultor space station in Martian orbit to deactivate a laser defense system without getting shot down. After destroying the space station, Parker lands back on Mars via an escape pod, Ultor brings out its reserve of mercenaries to help them in their fight against the miners. Hendrix tells Parker that the mercenaries have orders to destroy the mining complex, covering up any proof of Ultor's wrongdoing, Hendrix is killed soon after this by the mercenaries. \n \nAfter fighting his way through the mercenary base, Parker confronts Masako, the mercenary leader. After he kills Masako, Parker sees that Eos is tied up and sitting on the floor next to the bomb, which has been set to explode. After deactivating it, the Earth Defense Force arrives just in time to save Parker and Eos from a fighter aircraft. Eos tells Parker that an antidote for the Plague has been made and it is being given to any sick miners. She also tells him she is leaving Mars, and that Parker should enjoy his new status as a hero.","collection":100,"rating":72.66378002746771,"popularity":5.333333333333333,"aggregated_rating":70,"aggregated_rating_count":2,"total_rating":71.33189001373385,"total_rating_count":55,"rating_count":53,"games":[68287,36950,55038,15443,7333,57187,7350,23852,90099,23188],"tags":[1,18,268435461,536871072,536871365,536871378,536871478,536871835,536871882,536871937,536871939,536872039,536872070,536872358,536873142,536874315,536875062,536875199,536875242,536875521,536875531,536875839,536876365,536880684,536889479,536891450,536892109,536892110,1073741825],"developers":[507,2733],"publishers":[197,753,390],"game_engines":[135],"category":0,"player_perspectives":[1],"game_modes":[1,2,4],"keywords":[160,453,466,566,923,970,1025,1027,1127,1158,1446,2230,3403,4150,4287,4330,4609,4619,4927,5453,9772,18567,20538,21197,21198],"themes":[1,18],"genres":[5],"first_release_date":990403200000,"pulse_count":4,"platforms":[45,6,14,42,8],"release_dates":[{"category":0,"platform":42,"date":1071014400000,"region":2,"human":"2003-Dec-10","y":2003,"m":12},{"category":0,"platform":14,"date":1006905600000,"region":2,"human":"2001-Nov-28","y":2001,"m":11},{"category":0,"platform":6,"date":1000684800000,"region":2,"human":"2001-Sep-17","y":2001,"m":9},{"category":0,"platform":8,"date":990403200000,"region":2,"human":"2001-May-21","y":2001,"m":5},{"category":0,"platform":8,"date":993168000000,"region":1,"human":"2001-Jun-22","y":2001,"m":6},{"category":0,"platform":6,"date":1001635200000,"region":1,"human":"2001-Sep-28","y":2001,"m":9},{"category":0,"platform":42,"date":1071187200000,"region":1,"human":"2003-Dec-12","y":2003,"m":12},{"category":0,"platform":6,"date":1249430400000,"region":8,"human":"2009-Aug-05","y":2009,"m":8},{"category":0,"platform":45,"date":1334707200000,"region":2,"human":"2012-Apr-18","y":2012,"m":4},{"category":0,"platform":45,"date":1335225600000,"region":1,"human":"2012-Apr-24","y":2012,"m":4}],"alternative_names":[{"name":"红色派系","comment":"Chinese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/civuiw4t4v6llmblbegf.jpg","cloudinary_id":"civuiw4t4v6llmblbegf","width":1280,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gwwvf2pwdjdqrtbhquck.jpg","cloudinary_id":"gwwvf2pwdjdqrtbhquck","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/scf1uhqrffuz7iba2xlq.jpg","cloudinary_id":"scf1uhqrffuz7iba2xlq","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y9y6rqmjqtteny2hjxtv.jpg","cloudinary_id":"y9y6rqmjqtteny2hjxtv","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hru2b1iorheql9vupqiv.jpg","cloudinary_id":"hru2b1iorheql9vupqiv","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"MPlJB2Xom84"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b9f1fj7psd8nv9c71ex3.jpg","cloudinary_id":"b9f1fj7psd8nv9c71ex3","width":256,"height":310},"esrb":{"rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Realistic looking violence.","rating":4},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Red_Faction_(video_game)"},{"category":1,"url":"http:\/\/www.redfaction.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/20530"},{"category":2,"url":"http:\/\/redfaction.wikia.com\/"}],"external":{"steam":"20530"},"multiplayer_modes":[{"platform":6,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false,"onlinemax":32,"offlinemax":32}]}