{"id":87373,"name":"My Bakery Empire","slug":"my-bakery-empire","url":"https:\/\/www.igdb.com\/games\/my-bakery-empire","created_at":1518701257093,"updated_at":1523426774390,"summary":"~~> Help Lizzie open up world-famous bakeries and take specific orders from her demanding customers!\n~~> Learn how to bake delicious, mouth-watering desserts!\n~~> With your assistance, Lizzie will become the most talented pastry chef ever!\n\nIt's been Lizzie's lifelong dream to someday open up a bakery of her own. Now that day has finally arrived! She's graduating from college, and she's more than ready to get baking. But she needs your help! Have fun opening up lots of yummy bakeries, baking with Lizzie and becoming a true baking professional who’s famous for beautiful, tasty delights!\n\nFeatures:\n> Help Lizzie open up a bakery… and then another… and another! There’s no such thing as too many bake shops!\n> Take specific orders from your customers, and serve them with a smile! Make sure they get exactly what they asked for!\n> Learn how to bake tons of desserts from so many yummy recipes!\n> Make your cakes extra fancy with colorful cake decorations!\n> Dress up Lizzie like the true baker she is! Give her a pretty chef’s hat and a pretty apron!\n> Show off your baker skills and win first prize in baking contests and cake fairs!\n> Get ready to bake the tastiest desserts ever, from apple yogurt smoothies to princess birthday cakes!\n> Build up your reputation and become the most famous baker in the world!\n> Earn money if your customers are satisfied with your service, and use it to open new bakeries. \n\nABOUT Coco Play\nCoco Play Limited is China-based developer of creative and unique apps for kids. Founded in 2013, Coco Play provides rich 3D simulation-based games for the whole family. Coco Play is a subsidiary of TabTale, a leading, global creator of innovative games, interactive books and educational apps.\nVisit us: http:\/\/www.tabtale.com\/ \nLike us: http:\/\/www.facebook.com\/TabTale\nFollow us:@TabTale\nWatch us: http:\/\/www.youtube.com\/Tabtale\n\nCONTACT US \nLet us know what you think! Questions? Suggestions? Technical Support? Contact us 24\/7 at WeCare@TabTale.com\n\nFOR PARENTS \nThe app is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on this device. The app may include advertising for TabTale and certain third parties which will redirect users to our sites, apps or third-party sites.\nPrivacy is important to us. The app may enable collection of limited user data by TabTale or its carefully selected providers (e.g. ad networks and analytics) for limited legal purposes described in our Privacy Policy (e.g. respond to support queries; enable, analyze and improve the app’s features and services; serve contextual ads). The app includes certain features only accessible behind an age-gate to protect children (e.g. restrict behavioral ads; social networks links to connect with others while playing; option to accept push notifications to inform of exciting news e.g. updates). By downloading or using the app you accept our Privacy Policy: http:\/\/tabtale.com\/privacy-policy\/ and Terms of Use: http:\/\/tabtale.com\/terms-of-use\/ and permit such uses for users of your device.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[49414,25636,36608,21842,28080,75102,18862,16468,19567,72412],"tags":[268435468,536872030],"category":0,"keywords":[1118],"genres":[12],"first_release_date":1507593600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1507593600000,"region":8,"human":"2017-Oct-10","y":2017,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vxcaxwr2aji3zcme9mlx.jpg","cloudinary_id":"vxcaxwr2aji3zcme9mlx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/evks2csxx9zyxvxlwmup.jpg","cloudinary_id":"evks2csxx9zyxvxlwmup","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nktsxg4kadj6gap2qes3.jpg","cloudinary_id":"nktsxg4kadj6gap2qes3","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rb3k6ylzj1qyxyksystr.jpg","cloudinary_id":"rb3k6ylzj1qyxyksystr","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oouzxnecni0jmshyeszp.jpg","cloudinary_id":"oouzxnecni0jmshyeszp","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/arvlqzncy79rou1tmkct.jpg","cloudinary_id":"arvlqzncy79rou1tmkct","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ruvv11tpqennt2hbfxu7.jpg","cloudinary_id":"ruvv11tpqennt2hbfxu7","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uelwhqtpgg24cumoaxw3.jpg","cloudinary_id":"uelwhqtpgg24cumoaxw3","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k6ii59lqrbtpuxbpv92r.jpg","cloudinary_id":"k6ii59lqrbtpuxbpv92r","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i3mcvbdaips8uoxguv4y.jpg","cloudinary_id":"i3mcvbdaips8uoxguv4y","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ku4a0dhjimq6jtwlwgr1.jpg","cloudinary_id":"ku4a0dhjimq6jtwlwgr1","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/my-bakery-empire\/id1258500723?mt=8&uo=4"}]}