{"id":13428,"name":"Bounder","slug":"bounder","url":"https:\/\/www.igdb.com\/games\/bounder","created_at":1444681023628,"updated_at":1515699331898,"summary":"The player controls a tennis ball which is used to navigate courses, composed of numerous tiles, which are suspended high above ground. The ball must be bounced past walls and over enemies; coming into contact with either, or plummeting over the edge of the course, results in the loss of one of the player's seven lives.[1] Courses feature power squares, which push the tennis ball forward and allow longer jumps, these must be utilized to complete the course. Power squares are also used to enable the tennis ball to reach mystery spaces, tiles with question marks, which contain extra lives and bonus jumps which are used on bonus screens. Mystery spaces can also destroy the tennis ball, resulting in the loss of a life, through instant destruction or by freezing the ball in place while a missile flies across the play area and explodes.[2] \n \nThe bonus screen is accessed every time a course is completed, it consists of mystery spaces which increase the player's score when bounced on for the player to receive. 40 bounces are allowed on each bonus screen, though this figure can be increased by the player uncovering more from mystery squares during the preceding course. Once all bounces are used or all of the mystery spaces are bounced on, play moves to the next course.[2] Bouncing on all mystery spaces awards the player 10,000 points as well as an extra life.[3]","collection":2551,"popularity":1.333333333333333,"aggregated_rating":60,"aggregated_rating_count":1,"total_rating":60,"total_rating_count":1,"games":[51485,76731,1070,19934,29173,55036,24199,25640,10039,25311],"tags":[1,268435464,268435471,268435489,536874694,1073741826],"developers":[3212],"publishers":[3212],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[3782],"themes":[1],"genres":[8,15,33],"first_release_date":504835200000,"platforms":[15,26,25,27],"release_dates":[{"category":2,"platform":25,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12},{"category":2,"platform":27,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":26,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ntkdp96jpupptuvsoo0j.jpg","cloudinary_id":"ntkdp96jpupptuvsoo0j","width":1000,"height":968}}