{"id":24828,"name":"Targ","slug":"targ","url":"https:\/\/www.igdb.com\/games\/targ","created_at":1475823537992,"updated_at":1517271058923,"summary":"Targ is a one or two player shooter game released by Exidy in 1980. Your town is invaded by Targ riders, you must manouvre the heroic vehicle Whummel to destroy them. From time to time, a Spectar comes into screen, and can be destroyed for extra bonus. \n \nAction takes place into a 9x9 grid, \"Crystal City\", where the player's vehicle must avoid and chase down 10 enemy wedge-shaped vehicles. When all enemies are destroyed, you are awarded an extra bonus and can access the following level. Two players can alternate in the game. You use a 4 way joystick to control the Whummel, and a pushbutton to fire at enemies. Progressing in the gameplay causes the Targs to become faster and smarter, for a fast and furious gameplay. \n \nA small trivia on the game and characters name: apparently, Targ stands for Target, Spectar stands for Special Target. \n \nWhile in that period many western companies licensed games from japanese developers (Exidy itself licensed Nintendo's Sheriff as Bandido) targ is one of the few western games that made it in the opposite way, being licensed by Sega for japanese distribution. \n \nThis game has a sequel, always released in 1980, Spectar.","popularity":1.333333333333333,"games":[68287,11253,55752,22690,28029,10039,15851,18764,36781,20918],"tags":[1,268435461,268435470,268435486,268435489,536871223,536871846,536871937,536872078,536875046,536875412,536875416,536879173,1073741827],"developers":[2523],"publishers":[2523],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[311,934,1025,1166,4134,4500,4504,8261],"themes":[1],"genres":[5,14,30,33],"first_release_date":347068800000,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":347068800000,"region":2,"human":"1980","y":1980,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jgl0dy6ehmjzytlzldnz.jpg","cloudinary_id":"jgl0dy6ehmjzytlzldnz","width":1000,"height":216},"esrb":{"rating":3}}