{"id":26728,"name":"Revhead","slug":"revhead","url":"https:\/\/www.igdb.com\/games\/revhead","created_at":1484040563173,"updated_at":1536868727788,"summary":"Revhead is a car racing simulation game, where you have to build your own race car.  \nYou have a friend Charlie, who is busy with building race cars. He would need some help from you and he invites you to Australia. You start your journey somewhere in a small village in Australia, where the only way to get recognised if you are able to build the fastest and best racing car around. You have Charlie, his expertise and his garage. The rest is up to you!  \nBe smart and use your resources wisely, then you can build up as many cars you need!  \nIf you would run out of money, you can always ask Charlie for some job. There is always something you can do in the garage!  \nGrow your car value with earning racing points and keeping them in prefect condition, challenge others to win their rides, accomplish missions to build custom cars for customers and earn local's respect.  \n \nEither way, there will be one question at the end. Can you be the next Revhead?  \n \nAbout the game \n \nRevhead is about to build and race with your dream car and while all of your racing skills will be required to beat others on a track, you also have to master mechanical skills to be able to fix maintain or re-build your car.  \nA real car is built up from thousands of components. Each connected to each-others at some level and they works together as a car. In this game, every car is built up from almost 100 individual components, connected to each-other the same way as in reality. Each component can be removed, replaced and swapped between other cars. This way, you can not only customise your paint work and outlook, but the handling and performance of the car as well.  \n \nYou have to think as a real Revhead! You can buy or sell cars and components, fix and tweak your car to make it the fastest around. However, a good race car is not always about the fastest or strongest, but the one which matching with it’s driver. Set your car the way it fits for your driving skills and racing conditions.  \n \nUnderstand your car! \n \nWatch your car when driving, how is it handling, how smoky is it or what noise coming from the hood. All these can help you to identify the real problem.  \n \nDid you put a bigger engine in your car and your water temperature rising too quickly? You could monitor what is happening if you would have an oil temperature gauge, but you are missing it on your dashboard? No problem, find another dashboard and gauges and replace it.  \nYou need a 4x4 but you don’t have a budget? Buy a wreck cheap car and transfer it to a 4x4 supercharged racing beast, using wrecked cars and used components from the newspaper.  \nYou engine is strong, but your car don’t reach the speed you need? Make sure your gears and differential also also matching with your goals.  \n \nRacing and what is behind it \n \nIn the reality, racing is about 80% mechanical work, 19% testing and 1% racing. In this game, we try to get closer to this, while we still wanted to keep the fun. If you like cars, if you do understand that a car is not only about 4 wheels, 1 motor and a steering wheel, if you don’t afraid of mistakes, if you dare to challenge others, even when you are with your most loved car, then Welcome in Noordu, the land of Revheads!","storyline":"In the middle of the summer holiday you get a postcard from uncle Charlie. He just moved to a small village Noordu, somewhere in Australia. Charlie was one of the most famous racer around Australia, he earned the Revhead title more times then anyone else. Later, he worked for the best race garages as the best mechanic and instructor. Today, Charlie opened his garage and his own race track nicked as the “Backyard”. He knows you love cars and he could use some help to get the business up and running. He invites you to Australia to check his new place and help him out. You can help Charlie with fixing cars in his garage or help to promote his new track and get your race carrier starting. You don’t have much money, so you need to be creative if you want to stay longer. \nWhile Charlie can help you with some work in his garage, you can find cars and parts in local newspapers, use Charlie’s garage to fix or tune any of your cars. Soon, you find yourself between local racers, challenge them and win their money or rides. You realize that you can make not only good money, but you can be a part of something special. \nSomething, that is not exist anywhere else! \nYou learn more and more about cars and enjoy the world of real revheads! Be the best and earn the title of Revhead!","rating":50,"popularity":1.333333333333333,"total_rating":50,"total_rating_count":1,"rating_count":1,"games":[37419,34919,25311,35994,78550,61616,82117,27744,28465,18020],"tags":[1,268435466,268435469,268435488,268435489,536871216,536871396,536871647,536872695,536872736,536873790,536874118,1073741827,1073741825,1073741826],"developers":[11912],"publishers":[11912],"game_engines":[404],"category":0,"player_perspectives":[1,2,3],"game_modes":[1,2],"keywords":[304,484,735,1783,1824,2878,3206],"themes":[1],"genres":[10,13,32,33],"first_release_date":1489104000000,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1489104000000,"region":8,"human":"2017-Mar-10","y":2017,"m":3},{"category":0,"platform":14,"date":1489104000000,"region":8,"human":"2017-Mar-10","y":2017,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pkzopz7dik9i7dp5jh9c.jpg","cloudinary_id":"pkzopz7dik9i7dp5jh9c","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k19ffpjmutgcxhjfaza0.jpg","cloudinary_id":"k19ffpjmutgcxhjfaza0","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wa0cyy4ee8yw5ujmzan5.jpg","cloudinary_id":"wa0cyy4ee8yw5ujmzan5","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/un4gwl6ksrvo29lo9q7q.jpg","cloudinary_id":"un4gwl6ksrvo29lo9q7q","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zpo0xoribg1z67zlgrfg.jpg","cloudinary_id":"zpo0xoribg1z67zlgrfg","width":1280,"height":720}],"videos":[{"name":"Gameplay video","video_id":"wNDaZ_xs0FA"},{"name":"Trailer","video_id":"CTI9CCVx3Qg"},{"name":"Gameplay video","video_id":"PkudwoXxeIo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hr4fnxbloklpaobaua4a.jpg","cloudinary_id":"hr4fnxbloklpaobaua4a","width":2560,"height":1440},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/589760"},{"category":5,"url":"https:\/\/twitter.com\/Revheadgame"},{"category":4,"url":"https:\/\/www.facebook.com\/revheadgame\/"},{"category":1,"url":"http:\/\/www.revheadgame.com"}],"external":{"steam":"589760"}}