{"id":41528,"name":"Casino Slot Machine","slug":"casino-slot-machine","url":"https:\/\/www.igdb.com\/games\/casino-slot-machine","created_at":1498819560724,"updated_at":1500272613065,"summary":"Press the 0 (zero) key on the alpha-numeric keyboard. \n \nTell the computer how many people are playing by pressing 1, 2, 3 or 4 on the keyboard. The right hand control activates all the slot machine functions and is used by each player in turn. \n \nThe arrow will be pointing to the betting figure at the bottom of the slot machine. It will be set at $0.10 at the beginning of each player's first turn. You can increase your bet to $0.25 or $1.00 by pushing the joystick of the right hand control forward. To decrease your bet, pull the joystick towards you. \n \nYou can place bets that winning combinations will appear in any of the three horizontal or two diagonal rows. The horizontal rows are marked by dashes. The diagonal rows are marked by slanted lines. \n \nTo place a bet, use the joystick of the right hand control to point the arrow to the dash or slanted line marking the row you wish to bet on. Then press the action button. You can bet on as many combinations as you wish. Each time a bet is placed, the money will be deducted from the player's total at the bottom of the screen. IMPORTANT! The amount of the bet cannot be changed after the arrow is moved away from the betting amount indicator at the bottom of the slot machine. \n \nAfter all bets are placed, use the joystick to point the arrow to the handle of the slot machine at the right side of the screen. Pull the joystick to you and the reels will start spinning. NOTE: The arrow can point to the top, middle or bottom of the handle. The reels will spin with the same action. \n \nThe reels will stop spinning one at a time and the computer will automatically pay off for winning combinations. Coins will drop from the bottom of the slot machine and be automatically added to the player's total. The winning combinations will be signaled by flashing markers or coins on the winning rows and diagonals. \n \nWhen the first player's turn is over and the results are displayed on the screen, press the action button to start the next player's turn. \n \nThe duration of play should be mutually decided at the beginning of the game. You can play for a pre-determined length of time or until one of the player's wins or loses a pre-agreed upon amount of money. \n \nTo start a new game, press RESET and then press 0 (zero) on the alpha-numeric keyboard. \n \nWINNING COMBINATIONS \nCherry + Anything + Anything = 3 coins \nCherry + Cherry + Anything = 8 coins \nOrange + Orange + Bar = 10 coins \nOrange + Orange + Orange = 10 coins \nPlum + Plum + Bar = 14 coins \nPlum + Plum + Plum = 14 coins \nBell + Bell + Bar = 18 coins \nBell + Bell + Bell = 18 coins \nMelon + Melon + Bar = 100 coins \nMelon + Melon + Melon = 100 coins \nSeven + Seven + Seven = 200 coins \nBar + Bar + Bar = 100 coins","popularity":1.333333333333333,"category":0,"first_release_date":255139200000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":255139200000,"region":8,"human":"1978-Feb-01","y":1978,"m":2}]}