{"id":12623,"name":"Sherlock: The Riddle of the Crown Jewels","slug":"sherlock-the-riddle-of-the-crown-jewels","url":"https:\/\/www.igdb.com\/games\/sherlock-the-riddle-of-the-crown-jewels","created_at":1442433187449,"updated_at":1515687354354,"summary":"Sherlock: The Riddle of the Crown Jewels is an interactive fiction computer game designed by Bob Bates and published by Infocom in 1987. Like most titles Infocom produced, the use of ZIL made it possible to release the game simultaneously for many popular computer platforms, including the Apple II, IBM PC, Atari ST, and Commodore 64. Sherlock is based on the legendary fictional detective Sherlock Holmes, created by Sir Arthur Conan Doyle. It is Infocom's thirty-first game and is the first of two Infocom games developed by Challenge, Inc. using Infocom's development tools. \n \nThe year is 1887, and all of England is gearing up for the celebration of Queen Victoria's Golden Jubilee, marking her 50th year as monarch. London, naturally, is especially frenzied. Reading the paper one morning, Sherlock Holmes seizes upon one seemingly unimportant notice: the Tower of London has been closed for \"reasons of security.\" The great detective is unsurprised when, moments later, he is asked to investigate the theft of the Crown Jewels. The clues left behind, however, positively reek of a carefully laid trap; Sherlock decides that he must step aside and allow Dr. Watson to pursue the thief instead. But if the Jewels are not replaced within 48 hours, the British government will be forced to admit that their most prized possessions were stolen and suffer worldwide humiliation. \n \nThe player fills the role of Watson, travelling around London in Hansom cabs while attempting to recover the Crown Jewels while encountering many characters from Doyle's stories such as Mrs. Hudson, Mycroft Holmes, and Wiggins of the Baker Street Irregulars.","franchise":297,"franchises":[297],"popularity":1.666666666666667,"games":[13189,54699,22425,14362,26163,54678,25222,17354,25211,41895],"tags":[20,43,268435487,536871130,536871878,536871939,536872113,536872715,536873249,536873308,536873889,536875172,536875228,536875342,536875358,536875362,536875372,536875658,536875760,536875891,536875953,536876258,536876278,536877839,536878077,536878377,536881273,536882971,1073741829],"developers":[13368],"publishers":[368],"category":0,"player_perspectives":[5],"game_modes":[1],"keywords":[218,966,1027,1201,1803,2337,2396,2977,4260,4316,4430,4446,4450,4460,4746,4848,4979,5041,5346,5366,6927,7165,7465,10361,12059],"themes":[20,43],"genres":[31],"first_release_date":599529600000,"platforms":[14,13,16,75,15],"release_dates":[{"category":2,"platform":14,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12},{"category":2,"platform":75,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12},{"category":2,"platform":13,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12},{"category":2,"platform":15,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12},{"category":2,"platform":16,"date":599529600000,"region":2,"human":"1988","y":1988,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/udgxjn2bycvxxfb7yvfe.jpg","cloudinary_id":"udgxjn2bycvxxfb7yvfe","width":800,"height":976}}