{"id":14023,"name":"Cyclone","slug":"cyclone","url":"https:\/\/www.igdb.com\/games\/cyclone","created_at":1445366537257,"updated_at":1517271090786,"summary":"The player controls a rescue helicopter and must retrieve five supply crates from a collection of islands, while a dangerous cyclone is in the area. \n \nWhile searching for the missing crates, the player may optionally earn bonus points by rescuing refugees from the islands. There is no limit on the number of crates or refugees the helicopter can carry, and the player only needs to return to Base Island after the last crate has been found and loaded. \n \nHindering progress is the cyclone itself, which can cause the helicopter to behave erratically at long range, and crash at close range. While over open water the helicopter must avoid low flying planes which traverse the screen occasionally. The player also has limited fuel - which can be replenished at helipads on several of the islands - and a time limit in which to retrieve the crates. The screen display warns the player of the cyclones proximity, any approaching planes, and also the remaining time and fuel. \n \nThe view has two aspects of North and South to switch between, which is necessary as some of the crates are hidden behind buildings or terrain. There is also a map view to help locate the cyclone and the islands. \n \nOnce completed the game loops, with no change in difficulty. \n \nPanayi’s previous game, Tornado Low Level, (and to a lesser extent Android 2,) featured similar graphics.","popularity":1.333333333333333,"games":[76731,19934,29173,55036,25311,25640,26769,23345,55590,19376],"tags":[1,268435471,268435480,268435489,536870933,536874694,1073741826],"developers":[11615],"publishers":[11615],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[21,3782],"themes":[1],"genres":[15,24,33],"first_release_date":504835200000,"platforms":[26],"release_dates":[{"category":2,"platform":26,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/smcg0kmey8e0wxj3o2ri.jpg","cloudinary_id":"smcg0kmey8e0wxj3o2ri","width":750,"height":562}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wqpccc3ss9ouymbmdoar.jpg","cloudinary_id":"wqpccc3ss9ouymbmdoar","width":800,"height":1119}}