{"id":19723,"name":"Sonic: Before the Sequel","slug":"sonic-before-the-sequel","url":"https:\/\/www.igdb.com\/games\/sonic-before-the-sequel","created_at":1466642193319,"updated_at":1521911456181,"summary":"Sonic Before the Sequel (abbreviated Sonic BTS) is a fan game created by LakeFeperd that is meant to explain the events that may have taken place between Sonic the Hedgehog 1 and Sonic the Hedgehog 2. In it, the player plays as Sonic and Tails, alternating between the duo through numerous zones as Sonic goes to stop Dr. Eggman from launching the Death Egg, with Tails trying to keep up and eventually meet and team up with Sonic. An update was released during SAGE 2012, adding improved graphics, an original soundtrack made by Falk, KgZ, Andy Tunstall & Funk Fiction, and a bonus boss if you reach the good ending. A sequel, Sonic After the Sequel, and an interequel, Sonic Before the Sequel Aftermath (which has now formed into another fangame by LakeFeperd called Sonic Chrono Adventure), were released as well.","storyline":"After the events of Sonic 1, Sonic releases the Chaos Emeralds and is teleported to Hilltop Heights Zone. There, he catches sight of the nearly completed Death Egg and speeds off to stop it's impending launch. Later on after duking it out with Eggman, he heads off into Star Shore Zone. There, Tails is looking awkwardly at a Motobug that seems to be asleep, and he tries to touch it, and it awakes, and just as it is about to attack Tails, Sonic comes out of nowhere, destroys the badnik, and hurries off. Tails, amazed at the sight, sets out to follow the blue bur.","popularity":1.333333333333333,"games":[23175,51485,26848,1070,59516,55289,37022,27239,1124,25646],"tags":[1,268435464,268435487,536873378,1073741828],"developers":[10185],"publishers":[10184],"game_engines":[357],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[2466],"themes":[1],"genres":[8,31],"first_release_date":1344124800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1344124800000,"region":8,"human":"2012-Aug-05","y":2012,"m":8}],"alternative_names":[{"name":"Sonic BTS"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/irxthckecuyjtxasgm6l.jpg","cloudinary_id":"irxthckecuyjtxasgm6l","width":320,"height":240},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvi77sr7hc1qcqagcamy.jpg","cloudinary_id":"yvi77sr7hc1qcqagcamy","width":320,"height":240}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kxvzecht5winio50ikyr.jpg","cloudinary_id":"kxvzecht5winio50ikyr","width":707,"height":1000},"esrb":{"rating":4},"websites":[{"category":1,"url":"http:\/\/info.sonicretro.org\/Sonic_Before_the_Sequel"}]}