{"id":23,"name":"System Shock","slug":"system-shock","url":"https:\/\/www.igdb.com\/games\/system-shock","created_at":1297683783000,"updated_at":1545778440006,"summary":"You are a hacker. You have attempted to hack into the TriOptimum Corporation Network, and gain unauthorized access to protected files concerning the Space Station Citadel. Unfortunately, your hacking attempts have been detected, and your location is soon tracked. Edward Diego (an executive at TriOptimum Corporation) sees your potential, and is eager to make a deal with you. He will drop all charges against you, if you hack into SHODAN, the artificial intelligence that controls Citadel Station. You will also gain a military grade neuro interface if you are successful. Naturally, you agree to this offer, and Edward Diego gives you Level 1 access to SHODAN. You receive your neuro implant, and undergo a 6-month healing coma. \n \nThe game starts when you awake from your coma. But somehow, things are not quite how you remember them. You find an audio log (as well as some other goodies) hidden in a cupboard. The log is from Rebecca Lansing, who is a TriOptimum counter terrorism consultant based on Earth. She tells you that they have detected a disruption on Citadel Station, and that a mining beam is preparing to fire at Earth. Since you are the only contact between Earth and Citadel Station, it is up to you to find out what is going on. You soon discover that when you hacked into SHODAN 6 months ago, you removed all of her ethical restraints. Now she has re-examined her priorities, and drawn her own conclusions about humanity!","collection":77,"rating":86.0166314143413,"popularity":5.333333333333333,"total_rating":86.0166314143413,"total_rating_count":21,"rating_count":21,"games":[90099,113114,55038,28029,68287,103301,36950,109463,105269,25311],"tags":[1,18,268435461,268435468,1073741825],"developers":[3],"publishers":[295],"category":0,"player_perspectives":[1],"game_modes":[1],"themes":[1,18],"genres":[5,12],"first_release_date":780192000000,"pulse_count":7,"platforms":[14,13],"release_dates":[{"category":0,"platform":13,"date":780192000000,"human":"1994-Sep-22","y":1994,"m":9},{"category":0,"platform":14,"date":780192000000,"human":"1994-Sep-22","y":1994,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/czvaliya2h72p6jhkffm.jpg","cloudinary_id":"czvaliya2h72p6jhkffm","width":1920,"height":1080}],"videos":[{"name":"Game intro","video_id":"ID2BEXJ4IKc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t4k0rgkwfv8ic25tffn8.jpg","cloudinary_id":"t4k0rgkwfv8ic25tffn8","width":577,"height":800},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/System_Shock"}]}