{"id":25123,"name":"Nightmare: The Elemental Curse","slug":"nightmare-the-elemental-curse","url":"https:\/\/www.igdb.com\/games\/nightmare-the-elemental-curse","created_at":1477184545760,"updated_at":1513784065910,"summary":"Although this game is in development, I don't think right now is the appropriate time to mention the creation of the game until the trailer is done and more content is available. \n \nIf you want to find information, keep an eye out on gamejolt. \n \nGoodbye and see you all soon \n- Jesus Barajas (Lead....well.....Everything)","storyline":"The whole thing takes place in California in our present year (2017) and present day. It all started after Jesus heard rumor at school about some \"Hidden entrance in the mountains\", so he thought it would be interesting to check it out and maybe bring his friends with him. So he asks his friends and they all agree to go, even if the walk was painful and long. After what seemed like hours of searching and walking. They finally found the mountain with the entrance, but it was really more of a small cave. Eventually the reach a dead end and they all decide to leave, except for Jesus, he wanted to stay because there had to be something else. After screaming \"Guys!\" for a long time, he gets angry and stomps, Hard! The floor collapses and reveals a small abandoned shaft. Since the only way out was to climb and they didn't want to do anymore climbing, they went and looked around the shaft and found a door with weird inscriptions written on it. It turned out to be a puzzle, after the puzzle was solved, the door opened and revealed a passage way that lead to 8 pillars with stones on each one, except for a red one, a stone was missing. They all decided to take a stone with them. They all climb to the top of the pillar they all chose and grabbed the stone, but as soon as they touched them, they dissolved into their skin and began to glow. After about 2 minutes of glowing and floating slowly, they tried to figure out what happened. Jesus tried to get up, but as soon as he did...he flew in the air while leaving a really light blue trial from his hand, then it all became clear, it turned out that the stones they collected were elemental stones. They all wanted to be sure that they are careful with their \"Newfound Powers\", so they all went into different tunnels and began to test them out. Jesus didn't want to practice yet, he wanted to look around the shaft and manged to find something interesting, he found the missing stone. He told every body and they all decided to put the stone back on the pedestal. So they went back to the pathway and Jesus climbed up the red pillar and put the stone back on. As soon as he did, he flew and hit the wall! Now i know what you're thinking, \"He probably got more power\", no, instead he slowly turned into something else, he turned into the ancient demon, Nightmare, and chased them all out of the shaft and out of the mountain. He left behind a trial of blood and the other 6 were covered in blood. This is where they had to get back home fast, they had to go at godspeed because the mountains were in a nearby neighborhood and some of the neighbors began to call the police. After running about 1-3 miles, they finally made it back and cleaned themselves. They then were thinking about what they were gonna do since Jesus turned into a monster and is gone. They decide to turn on the TV and see a news report about a monster flying around and opening portals. They then knew what they had to do, they had stop the thing that Jesus turned into, but the thing is that when they left they cave, Nightmare stole their stones and hid them. Now they had to find them ,stop Nightmare, and free Jesus before its too late.","hypes":1,"popularity":1.333333333333333,"games":[25311,36609,37088,23175,25300,59516,55289,16999,37022,25646],"tags":[1,38,268435460,268435471,268435487,1073741829,1073741826],"developers":[11345],"publishers":[11345],"game_engines":[13],"category":0,"player_perspectives":[2,5],"game_modes":[1,2],"themes":[1,38],"genres":[4,15,31],"status":5,"alternative_names":[{"name":"N:TEC","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qudbwxurajelcado8n2i.jpg","cloudinary_id":"qudbwxurajelcado8n2i","width":1366,"height":597},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ruiz9f1fytazznnhqpyq.jpg","cloudinary_id":"ruiz9f1fytazznnhqpyq","width":1918,"height":908}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jxfwrgtleqqopwm2hley.jpg","cloudinary_id":"jxfwrgtleqqopwm2hley","width":1080,"height":1300},"esrb":{"rating":5},"pegi":{"rating":3}}