{"id":91323,"name":"Darkest Dungeon: Crimson Edition","slug":"darkest-dungeon-crimson-edition","url":"https:\/\/www.igdb.com\/games\/darkest-dungeon-crimson-edition","created_at":1521130576875,"updated_at":1548778244868,"summary":"Darkest Dungeon®: Crimson Edition contains Darkest Dungeon plus Darkest Dungeon®: The Crimson Court DLC.\n\nDarkest Dungeon is a challenging gothic roguelike turn-based RPG about the psychological stresses of adventuring.\n\nRecruit, train, and lead a team of flawed heroes through twisted forests, forgotten warrens, ruined crypts, and beyond. You'll battle not only unimaginable foes, but stress, famine, disease, and the ever-encroaching dark. Uncover strange mysteries, and pit the heroes against an array of fearsome monsters with an innovative strategic turn-based combat system.\n\n* The Affliction System – battle not only monsters, but stress! Contend with paranoia, masochism, fear, irrationality, and a host of gameplay-meaningful quirks!\n* Striking hand-drawn gothic crowquill art style\n* Innovative turn-based combat pits you against a host of diabolical monsters\n* Narration system to celebrate your successes...and failures\n* 15 (and counting!) playable hero classes, including Plague Doctor, Hellion, and even the Leper!\n* Camp to heal wounds or deliver inspiring speeches.\n* Rest your weary, shell-shocked characters in town at the Tavern or the Abbey to keep their stress in check.\n* Classic CRPG and roguelike features, including character permadeath, procedural dungeons, and incredible replay\n\nCan you stem the tide of eldritch horrors erupting across your family’s ancestral estate? Descend at your peril!\n\n\"THE BLOOD...I MUST HAVE THE BLOOD!\"\n\nDarkest Dungeon®: The Crimson Court is the first expansion for the award-winning grim and gothic RPG by Red Hook Studios. Crimson Court is a parallel campaign experienced alongside the main Darkest Dungeon content that will provide you with new challenges and variation at every difficulty level. The narrative grounding sheds some light on the Ancestor’s early days, and will be presented in the same style of cut-scenes you’ve seen elsewhere in the game.\n\n* A new hero class: The Flagellant!\n* A new dungeon region: The Courtyard\n* A full faction of new deadly foes\n* 5 new Bosses with some of the most complex and devious mechanics yet.\n* A new wandering boss: The Fanatic\n* Districts: 10 new buildings to upgrade your Town\n* Massive, sprawling maps with locked doors, prisoner rooms, and progress saves\n* Lore-driven trinket sets for all heroes - with set bonuses!\n\nAs the Crimson Curse spreads unrelentingly over the estate, parties will battle new enemies in familiar regions, as well as setting foot in a completely new sprawling environment: the Courtyard. There, amidst unique curios, traps and obstacles, a complete faction of new blood-crazed foes lie in wait, overseen by three distinct boss encounters. These slavering enemies and epic encounters will introduce new combat mechanics, testing the limits of your favorite strategies.\n\nAs the infestation grows and your roster begins to sicken, the Fanatic will emerge to roam the hallways, confusing friend and foe alike in his zealous quest to exterminate the Curse.\n\nThe odds are not completely stacked against you, however! A new playable hero class will be added alongside powerful new trinkets, town events, and a fresh way to expand and upgrade your Hamlet.","popularity":1.333333333333333,"version_parent":8965,"version_title":"Crimson Edition","category":0,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bmk3ittxxgrx4mzzbuxi.jpg","cloudinary_id":"bmk3ittxxgrx4mzzbuxi","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ig9zdocvvcky9ansxmkw.jpg","cloudinary_id":"ig9zdocvvcky9ansxmkw","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c2ccdssssxs8i85xvjhx.jpg","cloudinary_id":"c2ccdssssxs8i85xvjhx","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gnkrqgjmsqlrpojzjd8m.jpg","cloudinary_id":"gnkrqgjmsqlrpojzjd8m","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xir1jjmtg4gwpdv6leki.jpg","cloudinary_id":"xir1jjmtg4gwpdv6leki","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g1pmlpyy1fmjpdq5l8p9.jpg","cloudinary_id":"g1pmlpyy1fmjpdq5l8p9","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vtyavz5nduseunxwvz2e.jpg","cloudinary_id":"vtyavz5nduseunxwvz2e","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cvnlorw8t8mcede4ibqs.jpg","cloudinary_id":"cvnlorw8t8mcede4ibqs","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gs9q8ye8fm8hc16drp60.jpg","cloudinary_id":"gs9q8ye8fm8hc16drp60","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wxlejhqz5kspd0ompx9j.jpg","cloudinary_id":"wxlejhqz5kspd0ompx9j","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vriitf9nd3pwd0te5xif.jpg","cloudinary_id":"vriitf9nd3pwd0te5xif","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jvgwhlls0pcfhnptvzkz.jpg","cloudinary_id":"jvgwhlls0pcfhnptvzkz","width":1920,"height":1080}],"esrb":{"synopsis":"May contain content inappropriate for children.","rating":5}}