{"id":15889,"name":"Albert Odyssey","slug":"albert-odyssey","url":"https:\/\/www.igdb.com\/games\/albert-odyssey","created_at":1452508316910,"updated_at":1532568453563,"summary":"Albert Odyssey (アルバートオデッセイ Arubaato Odessei?) is a tactical role-playing video game developed and published by Sunsoft and released for the Super Nintendo Entertainment System in Japan in March 1993. The game features strategy-based combat in addition to traditional role-playing game elements in two-dimensional environments. It is the first game in the Albert Odyssey series, and was followed by two sequels, Albert Odyssey 2: Jashin no Taidou in 1994, and Albert Odyssey: Legend of Eldean in 1996. On June 12, 1996, Albert Odyssey was made available as a full game download on the Satellaview add-on as BS Albert Odyssey (BSアルバートオデッセイ BS Arubaato Odessei?),[citation needed] and the original Albert Odyssey was re-released for Satellaview in March 1998.[1] \n \nPlayers assume the role of Albert, the young heroic swordsman who lives in a fantasy world filled with monsters and mythical creatures. While much of the world remains in relative peace following a great war many years before, a military faction led by the dark magician Globus has emerged to conquer the newly pacified nations and expand their empire. With the help of Albert's friends as well as hired mercenaries, the player must travel the world and eventually confront Golbus and his forces to prevent another large-scale conflict.","collection":1991,"popularity":1.333333333333333,"games":[75813,76397,49414,5613,25636,87004,89560,104236,103020,51213],"tags":[268435468,268435471,1073741827],"category":0,"player_perspectives":[3],"game_modes":[1],"genres":[12,15],"first_release_date":731289600000,"platforms":[58],"release_dates":[{"category":0,"platform":58,"date":731289600000,"region":5,"human":"1993-Mar-05","y":1993,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qxi49b2rtze9ewdwlt5z.jpg","cloudinary_id":"qxi49b2rtze9ewdwlt5z","width":256,"height":222}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lpa86lakjufzwkle03sj.jpg","cloudinary_id":"lpa86lakjufzwkle03sj","width":215,"height":398}}