{"id":21489,"name":"The Experiment","slug":"the-experiment","url":"https:\/\/www.igdb.com\/games\/the-experiment","created_at":1469312662224,"updated_at":1541161049147,"summary":"Over sweeping cliffs and across scenic coastlines, this innovative shared adventure begins in the bowels of an old, dilapidated ship grounded ashore. Mysteriously, you find yourself in the ship’s operations room faced with a highly advanced panel of controls, surveillance monitors, and a wide array of sophisticated technology. As you scan the monitors frantically searching for answers to what this place is and why you are there, the only signs of life you have come across are a series of strange, curiously hard to identify animals, but then you see her; a woman. \n \n \nHelp Yourself by Helping Her \nProfessor Lea Nichols is a research scientist in her thirties and could be described as beautiful if the strain of her situation wasn’t so etched into her features. As hard as you try you are unable to communicate with her, but it is clear she is being held captive by someone or something and wants help. The problem is, apparently you too are being held prisoner by an unseen captor. Soon you come to realize that the only way to escape is to help one another. But how and why is it that control over both your fates seems has been placed into your hands? \n \nUse the Tools You Have \nIf you can discover a way to use the few tools tools you’ve been given (the surveillance system, an Intranet and other technologies) to Watch, Communicate, Search and eventually Take Control, you may both have a chance at escape. But remember that things are not always as they appear, even in the most controlled of experiments.","popularity":1.666666666666667,"aggregated_rating":65,"aggregated_rating_count":2,"total_rating":65,"total_rating_count":2,"games":[13189,26658,55038,25646,11296,18011,36950,11490,18225,18020],"tags":[18,19,268435487,536871882,536872032,536883035,536886421],"category":0,"keywords":[970,1120,12123,15509],"themes":[18,19],"genres":[31],"first_release_date":1204675200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1204675200000,"region":8,"human":"2008-Mar-05","y":2008,"m":3}],"alternative_names":[{"name":"Experience 112","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x6ls6nbyz97agldzovmb.jpg","cloudinary_id":"x6ls6nbyz97agldzovmb","width":480,"height":384}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ne48rwtc4bvtjryls8cm.jpg","cloudinary_id":"ne48rwtc4bvtjryls8cm","width":800,"height":1112},"esrb":{"rating":5},"pegi":{"rating":4}}