{"id":50389,"name":"Perry Rhodan: Myth Of The Illochim","slug":"perry-rhodan-myth-of-the-illochim","url":"https:\/\/www.igdb.com\/games\/perry-rhodan-myth-of-the-illochim","created_at":1500040328866,"updated_at":1500461492661,"summary":"For nearly 3000 years the astronaut Perry Rhodan, who has become immortal through a cell activator, has controlled the fate of his people, when suddenly an explosion shakes teh centre of the Terranian Power. \n \nDuring this explosion Perry Rhodan`s immediate confidante Mondra is kidnapped by extraterrestrial combat robots. Alone he tries to find the true reasons for the irruption as well as the manipulators behind the consipracy. During his search he discovers recordings about the myth of a thought to be dead, extraterrestrial race that had enslaved humanity a long, long time ago - the Illochim. With bravery, cleverness and brilliant investigation, he manages to light up the darkness.. \n \nHis untiring search leads him to many foreign races across teh galaxy, away from his mother planet Terra to the subterranean colonies of the planet Gom Callaedus in undiscovered enemy territory. While fighting with organ traders and exiled criminals the secret behind the ganerous incidents is finally solved: the truth about the awakened, life-threatening danger for the residents of teh Milky Way is lying buried on the far away moon Betha\/ \n \nCinematic Gameplay: More than 120 movie-like scenes and more than 50 fully animated real-time characters with facial expression and lip-sync voiceovers. Each picture is brought to life through countless, real-time effect animations. \n \nSpecial effects: All appearing 3D objects are fully enlightened by numerous light sources that make the scenes appear absolutely movie-like. \n \nBreathtaking design: The high performance engine allows the handling of trick techniques that are also used for large movie productions.","popularity":1,"category":0,"genres":[31],"first_release_date":1213574400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1213574400000,"region":8,"human":"2008-Jun-16","y":2008,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mhdvbpwhfvdf6a5ek6yb.jpg","cloudinary_id":"mhdvbpwhfvdf6a5ek6yb","width":1403,"height":1022},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a1r2ajj8obncfayls528.jpg","cloudinary_id":"a1r2ajj8obncfayls528","width":1400,"height":1022},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xgcuzchgqmajcead8o7w.jpg","cloudinary_id":"xgcuzchgqmajcead8o7w","width":1404,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bd9pjhwzgrwv6kbskw45.jpg","cloudinary_id":"bd9pjhwzgrwv6kbskw45","width":1400,"height":1019},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cloyo2ilca7abojyaldy.jpg","cloudinary_id":"cloyo2ilca7abojyaldy","width":1402,"height":1019}]}