{"id":66989,"name":"Metal Saga: Hagane no Kisetsu","slug":"metal-saga-hagane-no-kisetsu","url":"https:\/\/www.igdb.com\/games\/metal-saga-hagane-no-kisetsu","created_at":1505347354185,"updated_at":1516148015247,"summary":"Metal Saga: Hagane no Kisetsu (Japanese: メタルサーガ ～鋼の季節～, literally Metal Saga: Season of Steel) is a post-apocalyptic role-playing video game developed by Crea-Tech and published by Success in 2006. It running in Nintendo DS and it is a full touch screen controlled game. \n \nMetal Saga: Hagane no Kisetsu is the fifth game of Metal Max series. Unlike its predecessor Metal Saga, the game wasn't released in North America. And in 2007, a sequel was released on mobile phone as an incarnation of Metal Saga and was released in Japan in 2007. \n \nThis entry is very different with original games. For example, multiple characters sit in only a tank instead of one person sit in one, and using \"durability\" instead of tank's armor.","storyline":"In the near future, the world was devastated by a supercomputer named Noah. However, remnants of humanity survived this cataclysm, naming the event Great Destruction. Noah continued its intent to wipe Earth clean of humanity in this post-apocalyptic world. However, a hunter named Rebanna destroyed Noah before its ambition was fulfilled. Noah foresaw the possibility of its demise, and so devised \"Noah consciousness awakening program\" in this unlikely event and stores it within indestructible super-alloy shell called \"Noah Seed.\" Under this threat, Rebanna's children undertake the task to fight the resurrected supercomputer.","collection":4231,"franchise":1144,"franchises":[1144],"popularity":2.333333333333333,"games":[65858,18908,36926,1877,47823,25300,54842,37088,12632,11169],"tags":[1,33,268435468,536870981,536871033,536871818,536871938,536872225,536875309,536875559,536875762,536875767,536875770,536876391,536877035,536880092,536880422,536881260],"developers":[13874],"publishers":[5836],"category":0,"keywords":[69,121,906,1026,1313,4397,4647,4850,4855,4858,5479,6123,9180,9510,10348],"themes":[1,33],"genres":[12],"first_release_date":1150329600000,"platforms":[20],"release_dates":[{"category":0,"platform":20,"date":1150329600000,"region":5,"human":"2006-Jun-15","y":2006,"m":6}],"alternative_names":[{"name":"メタルサーガ ～鋼の季節～","comment":"Japanese title"},{"name":"Metal Saga: Season of Steel","comment":"Acronym"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/amuqyntpycg0wchln8vn.jpg","cloudinary_id":"amuqyntpycg0wchln8vn","width":320,"height":288}}