{"id":7989,"name":"The Ren & Stimpy Show: Veediots!","slug":"the-ren-and-stimpy-show-veediots","url":"https:\/\/www.igdb.com\/games\/the-ren-and-stimpy-show-veediots","created_at":1414715359018,"updated_at":1530397899110,"summary":"Veediots! lets the player experience four classic episodes of the Ren & Stimpy Show. One is the episode, \"The Boy Who Cried Rat\", where the player takes control of Ren, who's dressed like a mouse, in which he has to reach the end of a house while avoiding obstacles and enemies as well as Stimpy. Towards the end of this stage, the player must travel through Stimpy's mouth in order to complete the stage by avoiding various pitfalls and obstacles. \n \nThe second episode is \"In the Army\" where once again the player takes control of Ren as they travel through an army base, punch at enemies including soldiers, avoid various pitfalls and use various objects scattered throughout the stage in order to advance. \n \nThe third episode is \"Stimpy's Invention\", where the player takes control of Stimpy as they must escape a demented laboratory by avoid pitfalls and enemies and collect items to complete the \"Happy Helmet\" and use it on Ren in order to complete the stage. \n \nThe final stage is \"Marooned\" where the player takes control of Stimpy and is swallowed by a giant alien and must avoid various enemies as the fall down the throat of the giant alien. Once Stimpy lands in the stomach, the player must make it to the end of the level, attacking enemies and avoid pits of acid in order to reach the end of the stage. \n \nThere are also power-ups for each stage including health icons and powered toast icons that will give the player a brief stint of invincibility. The game also features the voice talent of Billy West.","collection":3754,"franchise":470,"franchises":[470],"popularity":1,"games":[36868,51464,26196,1936,27011,36950,1877,11364,37135,68287],"tags":[1,18,27,268435464,536871262,536871602,536871882,536871971,536872475,536872847,536872961,536875054,536875074,536875088,536875209,536875241,536875291,536875292,536875590,536876331,536876694,536877135,536878572,536880312],"developers":[483],"publishers":[197],"category":0,"game_modes":[1],"keywords":[350,690,970,1059,1563,1935,2049,4142,4162,4176,4297,4329,4379,4380,4678,5419,5782,6223,7660,9400],"themes":[1,18,27],"genres":[8],"first_release_date":749433600000,"platforms":[19,33],"release_dates":[{"category":1,"platform":19,"date":749433600000,"region":2,"human":"1993-Oct","y":1993,"m":10},{"category":1,"platform":33,"date":749433600000,"region":2,"human":"1993-Oct","y":1993,"m":10}],"alternative_names":[{"name":"The Ren and Stimpy Show: Veediots!","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b4kxidhk0d0whxewoe28.jpg","cloudinary_id":"b4kxidhk0d0whxewoe28","width":250,"height":166}}