{"id":12770,"name":"Space Hulk","slug":"space-hulk","url":"https:\/\/www.igdb.com\/games\/space-hulk","created_at":1442652617708,"updated_at":1513004771257,"summary":"\"WE ARE THE VANGUARD OF HONOUR. THE CUTTING EDGE OF THE BLOOD ANGELS. WE BRING DEATH.\" \n \nThe legendary Space Hulk returns to Windows PC, Mac and Linux in this epic turn based strategy game. Set in the Warhammer 40,000 universe, an intriguing story of legendary battles and heroic actions unfolds. Play as a small squad of fearless Space Marine Terminators who attempt to reclaim their honor by mounting an assault on a derelict space hulk infested by hordes of vicious tyranid Genestealers. \n \nTake control of the Adeptus Astartes of the Blood Angel chapter and guide them towards glory, while battling fierce Xenos and uncovering ancient relics in the infested confines of the massive Space Hulk named “Sin of Damnation”. \n \nThe game is a 3D digital turn based strategy game that recreates the classic claustrophobic board game experience in both singleplayer and multiplayer. \n \nCustomers purchasing Space Hulk will receive a free copy of the Deathwing Terminator DLC for Warhammer 40,000: Storm of Vengeance by EutechnyxKey Features:The first Space Hulk computer game in 17 years! Available on multiple platforms. \nSet in the hugely popular Warhammer 40,000 universe! Official license of the legendary boardgame from Games Workshop. \nTurn-based tactical strategy game! Based on the popular and iconic board game mechanics. \nBlood Angel Terminators! Fight the ferocious Genestealers with heroes of the mighty Blood Angels. \nFearsome Genestealers with challenging AI! Meet unforgiving hordes of Genestealers! \nThematic 3D environment! Experience the dark labyrinth of a Space Hulk as never before.. \nSingle player campaign based on the \"Sin of Damnation\" space hulk! Take on the Sin of Damnation campaign, which includes 3 brand new prequel missions and the 12 missions from the classic board game. \nMultiplayer head-to-head recreating the board game experience against a friend! Get in the hot seat and battle it out with a friend. \nCross platform multiplayer between Windows PC, Mac, Linux and iOS! Play asynchronous against friends and foes on multiple platforms. \nNow with online Co-op mode!","collection":947,"franchise":6,"franchises":[6],"popularity":1.666666666666667,"aggregated_rating":52.5,"aggregated_rating_count":4,"total_rating":52.5,"total_rating_count":4,"games":[68287,36950,27314,28029,25311,19301,64204,76731,25300,8773],"tags":[1,18,39,268435461,268435471,536871882,536872272,536874182,536874694,536875075,536877034,536877263,536877713,536878202,536883382,1073741825],"developers":[1],"publishers":[1],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[970,1360,3270,3782,4163,6122,6351,6801,7290,12470],"themes":[1,18,39],"genres":[5,15],"first_release_date":757296000000,"platforms":[13,16],"release_dates":[{"category":2,"platform":13,"date":757296000000,"human":"1993","y":1993,"m":12},{"category":2,"platform":16,"date":757296000000,"human":"1993","y":1993,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bxngzwncgmnowdtklwp4.jpg","cloudinary_id":"bxngzwncgmnowdtklwp4","width":600,"height":336},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tptqbrudke2zvk4iz60k.jpg","cloudinary_id":"tptqbrudke2zvk4iz60k","width":600,"height":313}],"videos":[{"name":"Gameplay video","video_id":"OX-J7xa-iLw"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zhvwmz8fzde3f5e09qid.jpg","cloudinary_id":"zhvwmz8fzde3f5e09qid","width":640,"height":816},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Space_Hulk_%281993_video_game%29"}]}