{"id":270,"name":"Age of Conan: Hyborian Adventures","slug":"age-of-conan-hyborian-adventures","url":"https:\/\/www.igdb.com\/games\/age-of-conan-hyborian-adventures","created_at":1300350651000,"updated_at":1545693383576,"summary":"Based on the events and characters of Robert E. Howard's Conan the Cimmerian stories, Age of Conan: Hyborian Adventures is a fantasy themed massively-multiplayer online role-playing game (MMORPG) that immerses players in a dark, expansive universe filled with ground-breaking brutal combat, dangerously intoxicating magical abilities, and the social and cooperative game features that MMORPG players crave.  \n  \nSet in the later years of Conan's life, after he has famously become king by his own hand, the game centers around the fragile state of Conan's rule in Aquilonia. Surrounded by enemies and hostile nations, Conan's rule hangs by a thread and in the end, it's up to players, either singly or backed by their guilds to turn the tide for or against the embattled king.  \n  \nMassively Multiplayer Gaming for the Adult Player: One of the most highly anticipated MMORPGs in recent years due to the strength and familiarity of the Conan franchise across a variety of major media, Age of Conan: Hyborian Adventures is the first of several releases planned for the franchise, all of which are aimed at an adult audience. Firmly rooted in the savage, bloody, violent and sexy Hyborian universe, players can expect a graphically beautiful game blended with gritty gameplay that is true to both the barbarian hero from Howard?s writings and the Schwarzenegger influenced version from books, movies and comics.  \n  \nAvailable Cultures and Classes: Although Age of Conan contains a wide range of peoples, its playable cultures are currently limited to Aquilonians, Cimmerians, and Stygians. Within each of these players can choose from a selection of archetypal character classes, although available classes and subsequent subclasses are not necessarily the same within each culture. For example, archetypal classes for Aquilonians and Cimmerians are Rogue, Priest and Soldier, while Stygians are represented by Rogue, Priest and Mage. Further differences exist within subclasses for each. See the basic breakdown of all three cultures below:  \n  \nAquilonians: Internally divided, but united against their barbarian neighbors, the Aquilonians live lives on the edge. Their kingdom, with its prosperous cities, enlightened culture and religious freedom, is known as the \"Flower of the West.\" Yet for all this and despite the power of King, Conan I, it is a land where culture clashes and unrest are always a threat.  \n  \nCimmerians: As the Hyborian Age comes to an end the northern barbarian clans of the Cimmerians know that the end of their time is drawing near too. King Conan I of Aquilonia is himself a Cimmerian, though not typical of his people. Although his life has been filled with wanderlust, his Kin care nothing for what occurs outside their clan territories.  \n  \nStygians: Masters of the magical arts and ruled by their consuming worship of the serpent-god Set, the Stygians excel at occult and diabolic lore. They learned long ago that true power lies in knowledge and in pacts with dark powers. This single-mindedness has allowed them become the only culture to harness the secrets of the Mage class and power that comes with it.  \n  \nModes Singleplayer as well as Multiplayer: Unlike most MMORPGs, Age of Conan: Hyborian Adventures includes a significant singleplayer experience as well as deep overarching multiplayer gameplay. This is an atypical MMORPG feature, but one that has a purpose. Players enter the game as a lowly galley slave with no memory of his\/her past, and over the first five to 20 levels of singleplayer action build the skills necessary to survive in the game's multiplayer levels. During this time you will traverse a variety of rich environments including jungles, deserts, mountains, valleys, dungeons and cities packed with NPCs, beasts and monsters, before eventually leveling up and moving back to your chosen culture?s homeland. Because the only character-related choices that players have to make at the game?s opening are their looks, clothing and culture, this singleplayer mode is important in deciding what class and subclass to pursue and thus the level of impact your character will have in greater multiplayer portions of the game.  \n  \nIn-game levels 20 and above are strictly multiplayer. 20-40 introduce players to guilds. 40-60 deal with large scale combat. 60-80 have the player interacting with King Conan and levels 80 and up represent end-game play. Here gameplay changes as social aspects of MMORPG gameplay take over on a large scale.  \n  \nReal-time Combat That Takes Queues from the FPS: Traditionally MMORPGs have utilized a mix of auto and turn-based functionality in their combat systems, but Age of Conan dispenses with that, instead drawing inspiration from FPS\/action games. Firmly rooted in the brutality of the Hyborian universe, game developer Funcom has devised an action-based system that not only provides the sense of actually being in the fight, but also requires the player to participate in it. That means no simple targeted attacks. Players can attack and defend from nearly any position in real-time, whether on the ground or atop a mount, while standing still or on the move. It?s a recipe for carnage and one that fits right into the world of Conan.  \n  \nThe combat system in Age of Conan comes in three forms: drunken brawling, mini games like CTF and massive Player vs. Player battles, which lets you engage in siege combat to defend or attack a city. All are easy to learn, but difficult to master, providing hours worth of play and replay value and are the core of this new cutting edge MMORPG.","collection":123,"franchise":3,"franchises":[3],"rating":70.0461538461538,"popularity":1.333333333333333,"aggregated_rating":76,"aggregated_rating_count":3,"total_rating":73.0230769230769,"total_rating_count":11,"rating_count":8,"games":[603,44,6,1081,125,3126,80,1911,3025,9804],"tags":[1,17,268435468,268435487,536871041,536871044,536871138,536871139,536871148,536871208,536871213,536871283,536871301,536871409,536871470,536871535,536871812,536871931,536872070,536872205,536872245,536872435,536872440,536872647,536872733,536872873,536872898,536873066,536873089,536873224,536873297,536873364,536873384,536873947,536874040,536874343,536874398,536874831,536875042,536875046,536875054,536875095,536875106,536875142,536875169,536875173,536875184,536875214,536875243,536875257,536875271,536875278,536875302,536875304,536875309,536875311,536875331,536875380,536875420,536875453,536875455,536875523,536875543,536875556,536875639,536875679,536875735,536875766,536875791,536875798,536875799,536875804,536875831,536875891,536875896,536875897,536875932,536876027,536876210,536876232,536876266,536876281,536876286,536876355,536876356,536876388,536876413,536876430,536876478,536876503,536876546,536876550,536876551,536876617,536876629,536876694,536876718,536876730,536876748,536876974,536876986,536877032,536877165,536877207,536877208,536877209,536877288,536877422,536877423,536877617,536877628,536877951,536877956,536878073,536878074,536879132,536879898,536880004,536880294,536880383,536880421,536880564,536880624,536880706,536880753,536880871,536881009,536881044,536881122,536881350,536881372,536882285,536883035,536883301,536883995,536884018,536884021,536886997,536886998,536886999,1073741826],"developers":[458],"publishers":[458,4],"game_engines":[436],"category":0,"player_perspectives":[2],"game_modes":[5],"keywords":[129,132,226,227,236,296,301,371,389,497,558,623,900,1019,1158,1293,1333,1523,1528,1735,1821,1961,1986,2154,2177,2312,2385,2452,2472,3035,3128,3431,3486,3919,4130,4134,4142,4183,4194,4230,4257,4261,4272,4302,4331,4345,4359,4366,4390,4392,4397,4399,4419,4468,4508,4541,4543,4611,4631,4644,4727,4767,4823,4854,4879,4886,4887,4892,4919,4979,4984,4985,5020,5115,5298,5320,5354,5369,5374,5443,5444,5476,5501,5518,5566,5591,5634,5638,5639,5705,5717,5782,5806,5818,5836,6062,6074,6120,6253,6295,6296,6297,6376,6510,6511,6705,6716,7039,7044,7161,7162,8220,8986,9092,9382,9471,9509,9652,9712,9794,9841,9959,10097,10132,10210,10438,10460,11373,12123,12389,13083,13106,13109,16085,16086,16087],"themes":[1,17],"genres":[12,31],"first_release_date":1211241600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1211500800000,"region":1,"human":"2008-May-23","y":2008,"m":5},{"category":0,"platform":6,"date":1211241600000,"region":2,"human":"2008-May-20","y":2008,"m":5}],"alternative_names":[{"name":"AoC"},{"name":"Age of Conan"},{"name":"AoC:HA","comment":"Acronym"},{"name":"Age of Conan: Unchained","comment":"Now known as"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/irfqxddpfgvzhvxl9hpl.jpg","cloudinary_id":"irfqxddpfgvzhvxl9hpl","width":800,"height":450},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pbsd2syosaugs0uleinr.jpg","cloudinary_id":"pbsd2syosaugs0uleinr","width":800,"height":450},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f7myp7053cqgvvkkao9m.jpg","cloudinary_id":"f7myp7053cqgvvkkao9m","width":800,"height":450},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lgrgsw3964ea2njb9xct.jpg","cloudinary_id":"lgrgsw3964ea2njb9xct","width":800,"height":450},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iizitfahtpe7i0pmwuke.jpg","cloudinary_id":"iizitfahtpe7i0pmwuke","width":800,"height":450}],"videos":[{"name":"Trailer","video_id":"ne7Bh1ieq7U"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qscq69mfwkfp6mroo1yh.jpg","cloudinary_id":"qscq69mfwkfp6mroo1yh","width":520,"height":739},"esrb":{"synopsis":"Online Interactions Not Rated by the ESRB","rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 18 years and over only.\r\n\r\nIt contains: Extreme violence\r\n\r\nThis game allows the player to interact with other players ONLINE","rating":5},"websites":[{"category":14,"url":"https:\/\/www.reddit.com\/r\/AgeOfConanUC"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/217750"},{"category":9,"url":"https:\/\/www.youtube.com\/user\/funcom"},{"category":6,"url":"https:\/\/www.twitch.tv\/funcom"},{"category":5,"url":"https:\/\/twitter.com\/funcom_conan"},{"category":4,"url":"https:\/\/www.facebook.com\/ageofconanhyborianadventures"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Age_of_Conan"},{"category":2,"url":"http:\/\/aoc.wikia.com\/wiki\/Age_of_Conan_Wiki"},{"category":1,"url":"http:\/\/www.ageofconan.com\/"}]}