{"id":370,"name":"Heroes of Might and Magic V","slug":"heroes-of-might-and-magic-v","url":"https:\/\/www.igdb.com\/games\/heroes-of-might-and-magic-v","created_at":1300380178000,"updated_at":1548028442101,"summary":"Witness the amazing evolution of the genre-defining strategy game as it becomes a next-generation phenomenon, melding classic deep fantasy with next-generation visuals and gameplay. \nIn the renowned Might & Magic universe, demon swarms spread chaos over the land in a relentless assault. The fate of the world is at stake and Heroes from a variety of legendary factions must stand up to defend their causes. Live their fate, lead their forces to victory, and unveil the secret goal of the Demon lords.","storyline":"There are six factions in the game: Haven, Inferno, Necropolis, Dungeon, Sylvan and Academy. \n \nHaven Campaign \nHaven is a faction populated by humans and ruled by religious warlords, the Holy Griffin Empire propagates \"Law and Order\" and faith in Elrath, the Dragon of Light, as their supreme goals. Arising from their military tradition, they have the ability to train their soldiers, promoting them from one level to another. They are the primary protagonists of the game's campaign missions. Their main Heroes are young Queen Isabel and faithful Godric, the king's uncle and the top general for the Griffin Empire. \nAn unexpected demon invasion interrupts the wedding of King Nicolai of the Griffin Empire and Lady Isabel, and soon the forces of the Griffin Empire are at war with the demons of Sheogh. With Nicolai at the front, Isabel is sent, along with the abbess Beatrice, to the Summer Palace, where they are guarded by Godric, the King's uncle. Isabel persuades Godric to let her take part in the war rather than wait. Godric is to go to the Silver Cities to seek help from Archmage Cyrus, while Beatrice will go to Irollan to get help from Elven King Alaron. Eventually, Isabel raises an army, but when Beatrice returns to lead her to meet the Elven reinforcements, Beatrice reveals that she is Biara: a succubus and assistant to a demon lord, Agrael. (In fact, Biara had the original Beatrice killed and took her guise as soon as she learned that Nicolai had sent Isabel to the summer palace.) She obviously hasn't visited King Alaron at all, and the meeting was a trap by Agrael, who captures Isabel. Isabel escapes Agrael with Godric's help (Godric failed to enlist aid from Cyrus, but returns himself), but they are too late to prevent Agrael from killing Nicolai, who, with his dying breath, proclaims Isabel to be Queen in his stead. \n \nInferno Campaign \nA dark kingdom of demons from the underworld known as Sheogh, the Inferno is a faction which uses \"Gating\", a method used to summon additional, though temporary, reinforcements onto the battlefield. Making their infernal abode on blasted lava terrain, the demons are the primary antagonists in the game, led by Urgash, the Dragon of Chaos, and their evil overlord, the Demon Sovereign Kha-Beleth. They are the protagonists of the second act of the campaign, where they are led by ambitious and ruthless Agrael. \nAlthough Nicolai is dead, Agrael has failed in his mission of capturing Isabel, and attempts to flee the wrath of Kha-Beleth, the Demon Sovereign, and raging Godric. Intending to overthrow Kha-Beleth, he decides to capture the Heart of the Griffin, which Nicolai had used in their battle, but the Demon Sovereign sends one of his servants, Veyer. When Agrael reaches the mausoleum and defeats Veyer, he is met by a mysterious Elven apparition, Tieru, who reveals that the Demon Sovereign is attempting to summon an apocalyptic Demon Messiah. He instructs Agrael to meet him in the Dragonmist Islands, which can only be reached through the Elven land of Irollan. After a long march and battles with the Elves, Agrael meets Tieru, who tells him about the War of the Eclipse, where Kha-Beleth was banished, as well as the Demon Messiah's links to Isabel. Agrael admits that he questioned Kha-Beleth's plans because he has fallen for Isabel, and Tieru tells him that he must be purified of demonic corruption with the Rite of True Nature. Agrael agrees, and during the ritual, Biara attempts to steal the Heart, only to be sent back to Sheogh. \n \nNecropolis Campaign \nOnce a secret cult flourishing within the dark underside of the Empire and the Silver Cities, the Necropolis faction resides in Heresh and is ruled by corrupted wizards who worship a twisted spider version of Asha, the Dragon of Order, seeking to find everlasting peace and beauty in death that has been denied to them in life. They can use the dark magic of necromancy to re-animate slain enemies and fill their own ranks with shambling corpses. The Hero for the Necropolis campaign is the shrewd and cunning Markal. \nMeanwhile, in the Griffin Empire, Isabel's position as Queen is challenged by Archbishop Randall and other local lords, who begin a civil war. A mysterious necromancer, Markal, appears and assists Isabel in her fight against the rebels. Markal reveals himself to be the former advisor to Nicolai's mother, Queen Fiona, and offers to help Isabel revive her dead husband with the Vampire's Garment. Although Isabel trusts him and helps him to gather its pieces, Godric is less gullible, warning Isabel that Markal had been banished years ago for his necromancy and treachery. Isabel ignores him, and as she and Markal gather the artifacts, she destroys former alliances with the Elves and the Wizards, whose leader, Cyrus, is killed by Markal for one of the artifacts. When Godric can take it no more, he keeps the last artifact and barricades himself in the Wizard city of Hikm. Markal retaliates by kidnapping his daughter Freyda as blackmail, and later defeats Godric, who is imprisoned. Isabel and Markal then begin their march to the Hall of Heroes. \n \nDungeon Campaign \nHailing from the underground empire of Ygg-Chall, the dark elves Dungeon faction are a group of fallen elves whose society is built around faith in Malassa, the Dragon of Darkness, secrecy, plots, and betrayal. They were once part of the Sylvan faction, but became renegades when they made a pact with the mysterious Faceless (in fact they are falsely accused of Brittiga's burning and the king Arniel's death, and they had to turn to Malassa for their survival). They mastered the ability of Irresistible Magic, which made their spells so powerful that even those who had the strongest resistance to magic have little chance to resist. The hero for the dark elf campaign is Raelag, a mysterious and ambitious warlock. \nIn the Dark Elven nation of Ygg-Chall, Clan Shadowbrand is holding a tournament to choose their new leader. An unknown warlock, Raelag (who is the transformed Agrael, notice that \"Raelag\" is an anagram of \"Agrael\"), participates and wins, becoming the Clanlord, and now seeks to unite the clans into a single state. With the help of another warlock, Shadya, he assimilates the other clans, except Clan Soulscar, who is discovered to be in alliance with the demons. Raelag then discovers that the Demon Sovereign has sent Veyer to capture Queen Isabel. Arriving at the outskirts of Sheogh, Raelag routs Veyer and asks Isabel to follow him to Tieru, where she can be purged of the Sovereign's influence. Markal, however, convinces her otherwise and they continue on to the Hall of Heroes. \n \nSylvan Campaign \nThe old Rampart faction from HoMM III in spirit, the Sylvan faction is more distinctly Elvish this time around, residing in Elven kingdom Irollan which is said to be blessed by Sylanna, the Dragon of Earth. Their heroes focus on archery, and so do their creatures, who can finish off their enemies without touching them. Their racial skill gives entire armies bonuses when fighting certain enemies they have slain previously. They are the counterpart to the Dungeon. The hero for the Sylvan Campaign is Findan, a diplomat and a determined fighter. \nWhen Nicolai is resurrected, Isabel realises to her horror that the spell has damned his soul, leaving him a vampire. Stunned by this revelation, she breaks down and Markal seizes the chance to declare himself ruler of the Griffin Empire. \nWhen the Elven king, Alaron, takes in Griffin refugees, Markal's forces begin to raid Irollan, and the diplomat Findan is sent to stop the raids. He is later tasked to find the Emerald Dragons to turn the tide on the Undead, but returns to find Syris Thalla, the capital, besieged. Alaron dies in the siege, but tells Findan to seek Tieru. After defending the capital, Findan travels to the Dragonmist Islands, but is too late to stop Biara from killing Tieru, although the latter's spirit tells Findan about Kha-Beleth's plan; the Demon Sovereign has placed a mark on Isabel so that she will bear the Demon Messiah. He also instructs Findan to get a scroll back from Biara, which, if used by a powerful mage, will be able to stop Kha-Beleth. The only such mage would be Zehir, the son of Cyrus. \nAfter pursuing Biara and getting the scroll back, Findan returns to Irollan, where the Elves are now on the verge of victory, but now face a terrible foe in Nicolai, who is now a Vampire Lord. With the help of Phoenixes or by destroying all the Spectral Dragons, Findan 'brings the dawn', and puts Nicolai to rest. He then sets off to find Zehir. \n \nAcademy Campaign \nThe Academy faction is a town dominated by wizards and magical creatures since its debut in the second game of the series. Not much has changed besides its location, moving away from snowy mountains of the Tower City in Heroes of Might and Magic III to a vibrant desert scene closer to the original Wizard castle, now filled with middle-eastern dress. Most of its heroes focus on magic, and their army comprises mostly shooters and flyers. Their Dragon is Sar-Elam, also known as the Seventh Dragon and the very first wizard who had so much power so he had become a Dragon and helped to banish the malicious Urgash, the Dragon of Chaos. The hero for the Academy Campaign is young and brash Zehir, the son of the late Arch-mage Cyrus and the new Arch-mage of the Silver Cities. \nWith the Silver Cities shattered by Markal's invasion, the new Archmage Zehir seeks to liberate the Wizard nation from the grip of the necromancers and avenge his father, Cyrus. Swiftly, he rallies his troops and retakes the Silver Cities, before forging an alliance with Findan and Godric. The trio manage to defeat Markal, and burn his body to ensure he cannot return as a lich. Determined to rid Isabel of demonic influence, they ally themselves with Raelag and Shadya and successfully get to Isabel, preparing to do the Rite of True Nature. \nHowever, Shadya then reveals herself to be Biara in disguise and seizes Isabel before fleeing to Sheogh, where the Demon Sovereign waits. The heroes travel there as well, and in an epic battle, they defeat the Demon Sovereign, who escapes with Biara. With Isabel free, they then return to their respective countries. \nAs Godric and Isabel survey the damage in their homeland, Isabel's eyes light red, implying that the demons of Sheogh are not quite defeated yet.","collection":194,"franchise":458,"franchises":[458],"rating":79.2931031992424,"popularity":3.666666666666667,"aggregated_rating":81.6666666666667,"aggregated_rating_count":3,"total_rating":80.47988493295455,"total_rating_count":95,"rating_count":92,"games":[373,364,363,5652,367,14394,324,3155,2933,1593],"tags":[17,268435468,268435471,268435472,536871008,536871041,536871059,536871071,536871139,536871208,536871244,536871327,536871390,536871717,536871865,536871938,536872010,536872070,536872074,536872093,536872146,536872283,536872449,536872471,536872544,536872587,536872798,536872835,536872953,536872957,536872983,536873066,536873120,536873154,536873822,536873906,536873949,536874094,536874343,536874694,536874706,536875011,536875046,536875057,536875142,536875160,536875214,536875263,536875265,536875276,536875304,536875316,536875327,536875331,536875372,536875390,536875453,536875455,536875671,536875709,536875773,536875775,536875778,536875956,536876019,536876036,536876205,536876232,536876263,536876281,536876282,536876299,536876590,536876595,536876598,536876601,536876602,536876847,536876931,536876996,536877144,536877339,536877422,536877566,536877568,536877583,536877616,536877679,536878347,536878352,536878354,536878369,536878373,536878442,536878445,536878452,536878472,536878474,536878494,536878517,536878522,536879021,536879123,536879154,536879774,536880168,536880294,536880428,536880645,536880646,536880744,536880907,536881632,536882128,536882496,536883035,536883220,536883269,536883281,536883373,536883837,536884021,536884507,536885594,536886416,1073741827],"developers":[100],"publishers":[104,101],"game_engines":[286],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[96,129,147,159,227,296,332,415,478,805,953,1026,1098,1158,1162,1181,1234,1371,1537,1559,1632,1675,1886,1923,2041,2045,2071,2154,2208,2242,2910,2994,3037,3182,3431,3782,3794,4099,4134,4145,4230,4248,4302,4351,4353,4364,4392,4404,4415,4419,4460,4478,4541,4543,4759,4797,4861,4863,4866,5044,5107,5124,5293,5320,5351,5369,5370,5387,5678,5683,5686,5689,5690,5935,6019,6084,6232,6427,6510,6654,6656,6671,6704,6767,7435,7440,7442,7457,7461,7530,7533,7540,7560,7562,7582,7605,7610,8109,8211,8242,8862,9256,9382,9516,9733,9734,9832,9995,10720,11216,11584,12123,12308,12357,12369,12461,12925,13109,13595,14682,15504],"themes":[17],"genres":[12,15,16],"expansions":[372,371],"first_release_date":1147737600000,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1147737600000,"region":1,"human":"2006-May-16","y":2006,"m":5},{"category":0,"platform":6,"date":1148428800000,"region":2,"human":"2006-May-24","y":2006,"m":5},{"category":0,"platform":14,"date":1166054400000,"human":"2006-Dec-14","y":2006,"m":12}],"alternative_names":[{"name":"HoMMHeroes of Might and Magic 5","comment":"Other"},{"name":"Heroes of Might and Magic 5: Tribes of the East","comment":"Other"},{"name":"HoMM5","comment":"Acronym"},{"name":"魔法门之英雄无敌5","comment":"Chinese title"},{"name":"Герои Меча и Магии V","comment":"Russian title"},{"name":"Heroes of Might and Magic 5"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wh3lbvbsk7zhljlsb9it.jpg","cloudinary_id":"wh3lbvbsk7zhljlsb9it","width":700,"height":525},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r5mj1g9jf1o180gylcmy.jpg","cloudinary_id":"r5mj1g9jf1o180gylcmy","width":960,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sd4rxtumoa171eirjeh5.jpg","cloudinary_id":"sd4rxtumoa171eirjeh5","width":1280,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wtrqr2t5s3yf4qbpdxaf.jpg","cloudinary_id":"wtrqr2t5s3yf4qbpdxaf","width":1280,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d1gqkjot7uqtzb5qamho.jpg","cloudinary_id":"d1gqkjot7uqtzb5qamho","width":1280,"height":1024}],"videos":[{"name":"Trailer","video_id":"Za_lVdfNBA0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cdpdtxbltwadvr8oqife.jpg","cloudinary_id":"cdpdtxbltwadvr8oqife","width":716,"height":1000},"esrb":{"rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Realistic looking violence towards non human looking characters.","rating":3},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/15170"},{"category":1,"url":"http:\/\/might-and-magic.ubi.com\/universe\/en-GB\/games\/all-games\/might-and-magic-heroes-5\/index.aspx"}],"external":{"steam":"15170"}}