{"id":41470,"name":"Mr. Basic Meets Bits 'N Bytes","slug":"mr-basic-meets-bits-n-bytes","url":"https:\/\/www.igdb.com\/games\/mr-basic-meets-bits-n-bytes","created_at":1498817662946,"updated_at":1500271089845,"summary":"Mr. Basic Meets Bits 'n Bytes is a Basic programming game where three games are selected and then easily modified from within the game. The games themselves are all pedestrian and not worth playing in and of themselves all that much. All of the games are intended to be simple playgrounds for the aspiring Intellivision Basic developer to hone skills and become acquainted with the language. The game includes a spiral-bound manual (the Mattel version, at least) that contains tutorials on each game, with code samples and descriptions of how the game can be modified by the 'player'. Here is a brief rundown of each of the three games. \n \n The Cannon is a rehash of an age-old game - you set the force and angle of a cannon and lob your payload at the enemy. The enemy attempts to do essentially the same thing as you. You can modify various parameters to change the physics of the game world, for example. \n \n In Mr. Basic, your on-screen avatar seems to be compelled to keep a computer server room neat and tidy. You fetch printouts and do other 'menial' tasks. The control is a bit hard, and the game is kind of strange. I seem to remember you fetch flying papers and 'bits' or some such and feed them into the computer in some fashion. Odd, but not really compelling. Again, you can modify the game's variables and such via the Inty Basic language. \n \n The third game is Vampire Bats, in which you defend your building from bats that are eating away the facade. You do this by dropping grenades on them. Hmm. As far as a game goes, it's lame. It may offer you a great way to familiarize yourself w\/ Intellivision Basic, but not much else. \n \nInterestingly, it seems that you can plug the cartridge into any old Intellivision without the ECS hooked up and at least play the games. When doing this, you lose the ability to use BASIC - and therefore can't modify the game behavior from the built-in settings.","popularity":1.333333333333333,"games":[28558,51281,50307,49557,47200,46745,41475,25268,9551,36297],"tags":[33],"category":0,"themes":[33],"first_release_date":412905600000,"platforms":[67],"release_dates":[{"category":0,"platform":67,"date":412905600000,"region":8,"human":"1983-Feb-01","y":1983,"m":2}]}