{"id":50170,"name":"Wing Commander II: Vengeance of the Kilrathi: Special Operations 1","slug":"wing-commander-ii-vengeance-of-the-kilrathi-special-operations-1","url":"https:\/\/www.igdb.com\/games\/wing-commander-ii-vengeance-of-the-kilrathi-special-operations-1","created_at":1500037629698,"updated_at":1513073888160,"summary":"This time the fur really flies... \n \nIf you thought you could snatch a few Zs after that victory at K'Tithrak Mang, you'd better look for another line of work! \n \nThe cats are restless and rebellion is brewing throughout Kilrathi slave worlds. As a show of force, the Emperor plans a brutal assault on the rebel populations. Millions of lives are in jeopardy until you and the Special Operations team can blunt the attack. \n \n...and cat-scratch fever isn't your only concern! \n \nAfter a mutiny aboard the TCS Gettysburg, its crew has turned to pirating the trade lanes and preying on Confederation ships. The felines are tough enough, but now you have to engage hardened joystick jockeys with the same combat training, weapons technology and leading-edge ships that you possess! \n \nBetween the Imperial Kilrathi forces and the pirates aboard the Gettysburg, the balance of power is shifting...and not in the right direction. \n \nStill think you can handle it, flyboy? \n \n  Launch into 20 non-stop missions with the most demanding dogfight scenarios in the award-winning Wing Commander series. \n \n  Pilot the newly commissioned Crossbow, faster and more maneuverable than any other bomber in the Confederation fleet. \n \n  Trade missiles, gunfire and insults as you engage relentless new enemies from Kilrah and the Confederation. \n \n  Meet the brash Lieutenant \"Bear\" Bondarevsky, flying missions with him and other new Confederation pilots on your wing. \n \n  Hear the anger, delight and anguish in transmissions form friendly and enemy pilots, with new digitized speech for the Special Operations (available only with Sound Blaster or 100% compatible sound board). \n \n  Transfer the character you created in Wing Commander II and fly to greater glory. \n \nNot a complete game - you must own Wing Commander II to play Special Operations","popularity":1,"games":[23212,19301,44242,9789,18623,22470,29173,25311,22425,26145],"tags":[18,268435469,536871859,536871882,536872060,536873122,536875804,536880258,536886430],"category":0,"keywords":[947,970,1148,2210,4892,9346,15518],"themes":[18],"genres":[13],"first_release_date":695347200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":695347200000,"region":8,"human":"1992-Jan-14","y":1992,"m":1}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pum9vgrc21qrltmxdzkc.jpg","cloudinary_id":"pum9vgrc21qrltmxdzkc","width":320,"height":200}}