{"id":50770,"name":"Digital Combat Simulator: Black Shark","slug":"digital-combat-simulator-black-shark","url":"https:\/\/www.igdb.com\/games\/digital-combat-simulator-black-shark","created_at":1500053024267,"updated_at":1515750388323,"summary":"DCS: Black Shark is a simulation of the Russian Ka-50 attack helicopter and is the first simulation module of the Digital Combat Simulator series by The Fighter Collection and Eagle Dynamics. \nDCS: Black Shark can be played as the most realistic combat helicopter simulation ever created for the PC with authentic flight dynamics and systems modeling. Black Shark may also be played as a console-style arcade game for the casual gamer. \n \nA detailed and accurate 330,000 sq km depiction of the western Caucasus region serves as the battlefield and includes a broad array of eastern and western air, land and sea units. \n \nEach air, land and sea unit is accurately modeled to include detailed models, weapon systems, movement dynamics and artificial intelligence. Each bullet, rocket, shell or bomb fired is modeled in detail for accurate performance. \n \nPowerful and easy to use Mission and Campaign Editors are provided to allow creation of user-created missions and campaigns. Non-linear campaigns are provided with unlimited replayability. Multiplayer game play is provided to include both cooperative play using the Ka-50 data link and head-to-head. Multiplayer supports up to 16 players. \n \nA set of detailed training missions, single missions and a campaign are included. \n \nKey features: \n \nA highly-detailed six degrees of freedom cockpit allows you to look anywhere in the cockpit using TrackIR®. \nAn unrivalled flight physics system provides the most realistic helicopter flight experience available. Interface with the fully 3D cockpit using a mouse with the option for an English cockpit. \nDetailed modeling and control of engine, fuel, hydraulics, electrical, navigation, radio, fire suppression, sensor, and weapon systems (casual game play modes also available). \nAdvanced weapon physics for missiles, rockets and cannon rounds to include ricochets. \nDetailed simulation of the \"Shkval\" optical targeting system and the \"Vikhr\" anti-tank guided missile system that allows attacks on both ground and air units. \nAccurate emulation of both the \"ABRIS\" moving map navigation system and \"Skosok\" night vision goggles for day and night missions.","collection":3416,"popularity":1,"games":[44242,24491,28465,75579,75275,34919,75102,33603,36962,55888],"tags":[268435469],"category":0,"keywords":[1,21,25,56,594,598,992,1148,1158,1217,1333,1440,1737,1739,1821,2452,2841,3627,3831,4259,4350,4910,5116,5333,5453,5503,5528,5530,5653,5789,5886,6311,6643,6908,8146,8976,9346,9569,10460],"genres":[13],"first_release_date":1241136000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1241136000000,"region":8,"human":"2009-May-01","y":2009,"m":5}],"alternative_names":[{"name":"DCS: Black Shark","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xece1hr1uydoz9o8vw4t.jpg","cloudinary_id":"xece1hr1uydoz9o8vw4t","width":721,"height":1024},"esrb":{"rating":5}}