{"id":87370,"name":"Wheel of Fortune: Show Puzzles","slug":"wheel-of-fortune-show-puzzles","url":"https:\/\/www.igdb.com\/games\/wheel-of-fortune-show-puzzles","created_at":1518701225720,"updated_at":1523426727476,"summary":"Have you ever wanted to buy a vowel? Spin the Wheel with Pat Sajak? Guess letters and watch them appear on the iconic puzzle board? It’s WHEEL...OF...FORTUNE - the popular game show, and now it’s a mobile game! \n\nBe a contestant on Wheel of Fortune! Jump into the Emmy®-winning TV game show you know and love because now it’s an addicting mobile game! You will spin the Wheel, solve new puzzles written by the show’s producers, and win cool, collectible prizes. Challenge your friends and family through Facebook or play with millions of other players from around the world!\t\n\nPat Sajak guides you on a fun-filled trip around the world with new puzzles from the hit TV game show at every stop! Play thousands of other fans, friends and family for a huge prize! The winner of these word puzzles will come out on top with the ultimate jackpot!\t\n\nWheel of Fortune Features:\t\n\nOfficial Puzzles\t\n- Play THOUSANDS of all-new word puzzles created by the producers of the hit TV show! Can you solve these official word puzzles from the minds behind America’s Game? Stay tuned; fresh puzzles are released all the time!\n- Solve word puzzles in Wheel of Fortune games, anytime and anywhere you want. You can finish a game in five minutes or less!\t\n\nAuthentic TV-style Presentation and Gameplay\t\n- Feel like you’re on TV. Your favorite Wheel elements are here, like “Wild Card”. Hit the right wedges to score and win big, but watch out for Bankrupt and Lose a Turn! \n- Choose your other letters wisely to solve the puzzle and win the ultimate prize! Just like on TV, you’ll get a selection of letters to use in the Bonus Round!\n- Enter Vanna’s Showcase to collect letters, spell words and collect prizes like profile frames and protection from bankruptcy!\n\nExciting Online Tournaments & Multiplayer games\t\n- Challenge friends and family alike in Wheel of Fortune! Our online party modes let you compete against players from around the world for huge prizes and unique collectibles!\t\n- With millions of players worldwide there’s no delay when starting a new game! Dive into a social challenge and test your Wheel of Fortune skills instantly with thousands of other fans, friends and family for a huge jackpot prize!\nTravel Around the World\t\n- Discover amazing puzzle themes from cities like New York, Paris, Tokyo and Hollywood to unlock upgrades to bring your own flair to the party.\t\n\nSocial Online Interaction\t\n- Play with friends and family or challenge millions of players from around the world! With plenty of fans ready to join the fun, you’ll have no shortage of friends and rivals to challenge. \n- Create your own puzzles and try to stump your friends and family with Puzzle Maker!\n- Chat, find new friends and send gift boxes to other players\n\nVIP Passes are here! VIP Passes are monthly subscription bundles of in-game items. The VIP All Access Pass includes 10 maximum tickets, no more bankruptcies, no more ads and no more lose a turns and costs 9.99 USD\/month (or local equivalent). \n\nSubscriptions will renew automatically and accounts will be charged for renewal every 30 days unless auto-renew is turned off prior to the 30 day renewal cycle. Payment will be charged to iTunes Account at confirmation of purchase. Renewal costs 9.99 USD\/month (or local equivalent), based on initial subscription purchased. \n\nPrivacy Policy:\nhttp:\/\/scopely.com\/privacy\/\n\nTerms of Service:\nhttp:\/\/scopely.com\/tos\/\n\nLike Wheel of Fortune on Facebook! http:\/\/www.facebook.com\/TheWheelofFortuneGame\/\t\n\nQuestions? Comments? Chat with our Wheel of Fortune support team! wofsupport@scopely.com\t\n\nBy installing this game you agree to the terms of the license agreements.\t\n\nWheel of Fortune ® & © 2017 Califon Productions, Inc. All Rights Reserved. Emmy® is a trademark of ATAS\/NATAS","rating":90,"popularity":2.333333333333333,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[87507,90766,88511,86974,86799,88761,95776,80174,19222,113250],"tags":[268435465,536873278],"category":0,"keywords":[2366],"genres":[9],"first_release_date":1474416000000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1474416000000,"region":8,"human":"2016-Sep-21","y":2016,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p6ptgdtw2rcm2q2hwkun.jpg","cloudinary_id":"p6ptgdtw2rcm2q2hwkun","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gstdvv3tx1wupn7snchl.jpg","cloudinary_id":"gstdvv3tx1wupn7snchl","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xpm1i3sk51ucs6wzqzwp.jpg","cloudinary_id":"xpm1i3sk51ucs6wzqzwp","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/opzbppvcnfy5sqdv9jtq.jpg","cloudinary_id":"opzbppvcnfy5sqdv9jtq","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ec2sdznpdaze85tn8yr9.jpg","cloudinary_id":"ec2sdznpdaze85tn8yr9","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g11geuxtjyugknqc2mq4.jpg","cloudinary_id":"g11geuxtjyugknqc2mq4","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uipxjunu4ely8eybdhlp.jpg","cloudinary_id":"uipxjunu4ely8eybdhlp","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o2be12lnrpgg7yfdyc95.jpg","cloudinary_id":"o2be12lnrpgg7yfdyc95","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eblvl6as5ldqyg3uxfzp.jpg","cloudinary_id":"eblvl6as5ldqyg3uxfzp","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hcdxtkcyvsb0ef2oxoub.jpg","cloudinary_id":"hcdxtkcyvsb0ef2oxoub","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v5twc4ibjwhoz4kgzoat.jpg","cloudinary_id":"v5twc4ibjwhoz4kgzoat","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/wheel-of-fortune-show-puzzles\/id898040123?mt=8&uo=4"}]}