{"id":86702,"name":"US Coin","slug":"us-coin","url":"https:\/\/www.igdb.com\/games\/us-coin","created_at":1518601017053,"updated_at":1518701423496,"summary":"Designed for serious to casual collectors. If you are looking for coin collecting software for Apple Mac's, you've come to the right place. This is a full-featured App, with an extensive Dictionary of US Minted Coins, and it works in conjunction with your iPad or iPhones (purchased separately).\n\nNow supports creating multiple collections. These collections can be shared across iPhone, iPad, and Mac Computers. Perhaps ideal for getting a son or granddaughter interested in coin collecting, Grandpa can setup a collection for them then send it to them via Dropbox (Backup on Grandpa's Computer, Restore on Grandchild's).\n\nMain Features:\n- Coin Dictionary\n- Reports\n- Emailing\n- Excel Integration\n\nCoin Dictionary with the App is extensive:\n\n* Half-Cents, Cents \n* Two and Three Cents \n* Nickels \n* Half-Dimes, Dimes \n* Quarters \n* Half Dollars \n* Dollars \n* Proof and Mint Sets \n* Gold Coins \n* Bullion Coins \n* Early American Colonials \n* Patterns \n* Commemoratives \n* Territorial \n\niPhone, iPad, MacBook, and Windows\nWould you like to be able to use the App on multiple Apple mobile devices? We have a solution for that. The Backup \/ Restore feature allows you to backup a copy of your collection on your iPhone, and then Restore the backup to perhaps your iPad. This makes it easy to sync your collection between your various Apple devices. \n\nEnjoy sharing photo's of your trophies? We offer unlimited photos. Use that high-resolution camera in your iPhone to snap photo's of your coins, then Backup the collection to the Cloud and restore to your iPad and Apple MacBook for viewing. \n\nWonder what it's worth, we show you Heritage Auctions Archives (#1 Coin Auction House in the World) AND EBay auctions for your coin, one at a time.\n \nDid we mention Reports? Yes, we have reports covering basic inventory, buy-lists, detailed financial analysis, and more. Better yet, you can choose between printing or emailing to a friend or maybe your Accountant.\n\nReports:\n-Financial summary\n-Estimated market summary\n-Profit & Loss\n-Coin details\n-Buy list\n-Advanced P & L\n-Insurance Details\n-Physical Inventory \n\nExcel:\nMost recently, we added support for opening your collection to view and edit using Microsoft Excel. Making changes of your collection using an Excel Spreadsheet make it easy to copy settings (Location, Variety, Supplier, etc.) to a large number of coins and doing so very easily. \n\nHas it all, a truly best-in-class product and we are just getting started. Come join the fun. \n\nPlease visit our support site http:\/\/saintsoftware.blogspot.com\/ \n\nIf you buy the product, decide there's a feature you'd really love us to add -- please let us know. Our goal is to delight you, and help make Coin collecting fun and interesting.\n\nEnjoy- \njohn kountz \nchief software architect & president \nsupport@SaintsSoft.com \n\nPS.\nPreview this App before buying, watch our FREE Tutorials on our Support Website.","rating":20,"popularity":1,"total_rating":20,"total_rating_count":0,"rating_count":0,"category":0,"keywords":[1118],"themes":[40],"first_release_date":1369180800000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1369180800000,"region":8,"human":"2013-May-22","y":2013,"m":5}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cx2bxq9dsw4lofut1cbn.jpg","cloudinary_id":"cx2bxq9dsw4lofut1cbn","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d3kzqdkpjdrfvhtxhyuw.jpg","cloudinary_id":"d3kzqdkpjdrfvhtxhyuw","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n92umr8gyukrfaoeptg9.jpg","cloudinary_id":"n92umr8gyukrfaoeptg9","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gvtgv0d1whhqnc4rdpus.jpg","cloudinary_id":"gvtgv0d1whhqnc4rdpus","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gzqtvefxr3m9q2otijge.jpg","cloudinary_id":"gzqtvefxr3m9q2otijge","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r2izdudbbujism9fprzd.jpg","cloudinary_id":"r2izdudbbujism9fprzd","width":512,"height":512}}