{"id":18693,"name":"Sinistar","slug":"sinistar","url":"https:\/\/www.igdb.com\/games\/sinistar","created_at":1460164072432,"updated_at":1517270915903,"summary":"The player pilots a lone spacecraft, and must create \"Sinibombs\" by shooting at drifting planetoids and catching the crystals that are thereby released. Sinibombs are needed to defeat the game boss, Sinistar, an animated spacecraft with a demonic skull face. Sinistar does not exist at the start of the game, and is continuously under construction by enemy worker ships. Though time is crucial, attempting to mine too quickly will destroy a planetoid without releasing any crystals. Enemy worker ships are also gathering crystals (often stealing them from the player) which they use to construct the Sinistar. Enemy warrior ships can directly attack the player's ship. The player is given a head-start before the enemy ships have enough crystals to begin construction. Game ends when the player's ships are all destroyed. \n \nOnce the Sinistar is completely formed, a digitized voice makes various threatening pronouncements, including \"Beware, I live!,\" \"I hunger, coward!,\" \"I am Sinistar!,\" \"Run! Run! Run!,\" \"Beware, coward!\", \"I hunger!,\" \"Run, coward!,\" and a loud roaring sound. The Sinistar has no weapon attacks, but if it contacts the player's ship while it darts about the playfield, the player's ship will be \"eaten\" and destroyed. A total of 13 Sinibombs are required to destroy a fully built Sinistar, although an incomplete Sinistar can be damaged to slow construction. Each short-range Sinibomb automatically targets the Sinistar when fired, but can be intercepted by a collision with an enemy ship, enemy fire, or a planetoid. \n \nThe player moves from one zone to the next each time he defeats the Sinistar. A sequence of four zones repeats continuously after the first zone. Each is named for the most numerous feature of that zone: Worker Zone, Warrior Zone, Planetoid Zone, and Void Zone (the Void Zone is especially difficult because it has very few planetoids). Beginning with the first Worker Zone, a completed but damaged Sinistar can be repaired\/rebuilt by the enemy ships by gathering more crystals, extending its \"lifespan\" if the player is unable to kill it quickly.","collection":2132,"popularity":1.333333333333333,"games":[68287,36950,27314,28029,64204,25300,142,11253,71455,19448],"tags":[1,18,268435461,268435489,536871859,536871882,536871937,536873064,536874745,536875262,536875666,536875691,536875789,536876316,536876718,536876869,536877101,536877141,536878520,1073741826],"developers":[1839,855],"publishers":[1839,9380],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[947,970,1025,2152,3833,4350,4754,4779,4877,5404,5806,5957,6189,6229,7608],"themes":[1,18],"genres":[5,33],"first_release_date":410140800000,"platforms":[52,66,65],"release_dates":[{"category":2,"platform":52,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12},{"category":0,"platform":66,"date":1276560000000,"region":8,"human":"2010-Jun-15","y":2010,"m":6},{"category":0,"platform":65,"date":1276646400000,"region":8,"human":"2010-Jun-16","y":2010,"m":6}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jyclehy5pwj0gfmqmawe.jpg","cloudinary_id":"jyclehy5pwj0gfmqmawe","width":1000,"height":1372}}