{"id":1993,"name":"Actua Soccer 2","slug":"actua-soccer-2","url":"https:\/\/www.igdb.com\/games\/actua-soccer-2","created_at":1364516191162,"updated_at":1513071263809,"summary":"Actua Soccer 2 or sometimes Actua Soccer 98 due to its capitalization on the 1998 FIFA World Cup was one of the many football titles released to capitalize on the 1998 World Cup, and once again included national teams, but a more polished engine (optimized in the PC version for 3D graphics cards), (in some versions) the full Italian Serie A league, and a new \"scenario\" mode assured good sales and mostly positive reviews. It also included a team creator mode, which enabled the player to make up to 128 custom teams. Barry Davies was joined by Trevor Brooking on the commentary, and the game featured England football team captain and striker Alan Shearer not only on the cover, but also providing interviews about the game in the press. Michael Owen and Simon Tracey provided motion capture for the players. The game also featured menu music and a cameo appearance from Welsh rockers, Super Furry Animals, which could only be activated after entering a cheat code. Actua Soccer 2 was also bundled with Creative Technology's Voodoo 2 graphic cards, which helped to achieve widespread distribution and popularity.","collection":369,"popularity":2.666666666666667,"games":[15851,30830,106814,1994,100359,4642,4643,28403,65118,18681],"tags":[268435470,536870938,536870939,536872078,536873274,536873350,536875138,536875433,536875749,536876259,536877432,536878125,1073741826],"developers":[578],"publishers":[578],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[26,27,1166,2362,2438,4226,4521,4837,5347,6520,7213],"genres":[14],"first_release_date":876441600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":876441600000,"region":8,"human":"1997-Oct-10","y":1997,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fht4asbiw8fr3tjchxgd.jpg","cloudinary_id":"fht4asbiw8fr3tjchxgd","width":640,"height":640},"websites":[{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/Actua_Soccer"}]}