{"id":39193,"name":"Blazing Souls Accelate","slug":"blazing-souls-accelate","url":"https:\/\/www.igdb.com\/games\/blazing-souls-accelate","created_at":1498122070864,"updated_at":1534377249937,"summary":"En route for a new exciting Tactical RPG in the world of Neverland! \nStory: \nSeveral decades have passed since the end of the Seven years' war, \nand peace has finally begun to take hold throughout the war-weary world. \nIt is in this time of relative tranquility that Zelos, who makes his living as an independent contractor, \ncomes into possession of a crystal infused with incredible levels of magical energy called a \"Core Elemental\" \nafter being involved in a freak accident. \nAlmost as soon as it fell into his hands, Zelos was besieged by a number of mysterious beings intent on taking the power of the elemental for their own. \nAs Zelos is forced to fight for his life, the mistery surrounding his birth, as well as his past, slowly emerges into the light. \nWhat secrets still wait to be discovered as he comes to the end of his struggle for survival? \n- A new full 100-hour Japanese Tactical RPG for Android \n- Enhanced battle system including special chain skills, break and overkill \n- High level of freedom: explore the world to progress through the story in any order you wish \n- Use various actions to modify the battle field during exploration phases \n- Create over 200 different items and skills \n- Capture monsters and have them fight in your party \n- High resolution graphic assets \n- Support for touch & keyboard with key mapping \n- Xperia Play optimized \n- Compatible with MOGA controllers. \n** IMPORTANT NOTICE PLEASE READ ** \n- You need a SDCARD with at least 1.2GB of free space. - There is a 1.2GB additional data download to complete the installation so WIFI is \"ABSOLUTELY NECESSARY\" and a good dose of patience too, the installation may take from 15mn to 30mn to complete based on your Internet network configuration and\/or our servers congestion, everybody will be served but please be patient. \n- There is an \"in-game\" FAQ in case you have some trouble during the installation so please take the time to read it should you have problems. \n- Game is set, by default, to use the HIGHEST resolution available so please adjust in the option screen should your device be a little \"just\" to support the full hires data. \n- A High-End device is highly recommended for the best gaming experience however the game is fully enjoyable from Nexus1 or similar type of device.","popularity":2.333333333333333,"version_parent":5475,"version_title":"Blazing Souls Accelate","games":[27092,55092,20073,36263,36926,22747,25311,76397,35994,36950],"tags":[1,268435460,268435465,268435468,268435471,268435487,536870990,536871088,536871938,536872509,536874694,536875046,536876240,536888348,536888363,536892862,536892863],"category":0,"keywords":[78,176,1026,1597,3782,4134,5328,17436,17451,21950,21951],"themes":[1],"genres":[4,9,12,15,31],"first_release_date":1248307200000,"platforms":[38],"release_dates":[{"category":0,"platform":38,"date":1338508800000,"region":1,"human":"2012-Jun-01","y":2012,"m":6},{"category":0,"platform":38,"date":1287446400000,"region":2,"human":"2010-Oct-19","y":2010,"m":10},{"category":0,"platform":38,"date":1248307200000,"region":5,"human":"2009-Jul-23","y":2009,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ux4zoezs0s1dlf36ck7c.jpg","cloudinary_id":"ux4zoezs0s1dlf36ck7c","width":809,"height":477}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xhxwapoebadvr3s5ltzn.jpg","cloudinary_id":"xhxwapoebadvr3s5ltzn","width":512,"height":764},"esrb":{"rating":5}}