{"id":47293,"name":"Conquest of the World","slug":"conquest-of-the-world","url":"https:\/\/www.igdb.com\/games\/conquest-of-the-world","created_at":1499864146754,"updated_at":1500285532265,"summary":"CONQUEST OF THE WORLD represents a significant departure from traditional game design. The components have been designed to provide you with a very realistic model of the real world to both electronically and graphically simulate strategic and tactical confrontation between world powers. \n \nElectronic land, sea and air forces can be deployed against each other in any combination and are totally dependent on supplies which are represented by energy units. \n \nThe game board is a true-to-life model of the relationships between countries of the real world in the early 1980's. \n \nForty-three countries have been divided into eleven \"politectonic\" or geo-political zones. Each country has been weighted with a power base figure that reflects its capability to persuade other nations to conform to its wishes - by diplomatic coercion or by direct military force. \n \nThese figures are based on the formula created by Ray S. Cline, formerly Deputy Director of Intelligence for the C.I.A. \n \nPp = (C+E+M)x(S+W) \n \nPERCEIVED POWER = (Critical Mass (Population + Territory) + Economic Capability + Military Capability) x (Strategic Purpose + National Will). \n \nFuture shifts in world power and change in governments will - of course - make changes in these numeric weightings appropriate. Players can feel free to sustain realism by changing the numbers assigned to each country as life goes on. \n \nIf you play other war games such as those published by Avalon Hill and SPI, you will find that the computer cartridge interfaces very effectively with them. The onscreen combats will generate much more excitement and realism than the usual dice provided to resolve conflicts. Onscreen energy units can be programmed into the computer to reflect the relative strength between different forces. The differential between the onscreen energy units at the end of each battle can also be applied to the combat results tables that come with these games. \n \nConquest of the World is the first game of its kind, so be ready for many unusual features. Take the rules one step at a time and you will find it to be a fascinating game of endless challenge - which, once learned, is not at all difficult to explain to others. \n \nTHE OBJECTIVE OF THE GAME is to lead your Homeland to world domination through negotiations, conquests and alliances. Each successful conquest and alliance you make will strengthen your country's power base. The country with the strongest power base at the end of the game is the winner.","popularity":1.333333333333333,"games":[11362,73075,9760,33603,36962,55888,65827,2015,32283,33383],"tags":[268435471],"category":0,"genres":[15],"first_release_date":349833600000,"platforms":[88],"release_dates":[{"category":0,"platform":88,"date":349833600000,"region":8,"human":"1981-Feb-01","y":1981,"m":2}]}