{"id":50793,"name":"Wolfteam","slug":"wolfteam","url":"https:\/\/www.igdb.com\/games\/wolfteam","created_at":1500053235392,"updated_at":1515796241311,"summary":"Wolf Team is a high-octane MMOFPS that features the ability to transform between Humans and Werewolves. Humans have a vast assortment of weapons at their disposal, giving them an advantage at a distance. Wolves have limited ranged attacks but are much faster, stronger, and more durable than their human counterparts. \n \nThe ability to switch between Human and Wolf form at any time adds an element of strategy that is wholly unique to Wolf Team. Players never need worry about running out of ammunition because Wolves have their own distinct advantages – such as running on walls then dropping onto enemies unexpectedly. In certain modes, players can even harness special Wolf mutations, such as Ghost Wolves, which can turn invisible. \n \nVariety is the spice of life; Wolf Team has several addictive game modes to choose from. Just want to engage in an all-out no-holds-barred melee? Fire up a traditional Deathmatch. Interested in joining forces with other players to wage a more cerebral, tactical battle? Try Conquest mode, in which players to work as a team to capture as many bases as possible, or Destruction mode, in which one team tries to demolish the other team's base. Wolf Team also features a large selection of weapons players can acquire as they progress through the game.","popularity":2,"games":[55038,90099,68287,36950,113114,28029,25311,23852,21326,18290],"tags":[1,18,268435461,268435468,536871365,536871882,536875398,1073741825],"category":0,"player_perspectives":[1],"keywords":[453,970,4486],"themes":[1,18],"genres":[5,12],"first_release_date":1191196800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1191196800000,"region":8,"human":"2007-Oct-01","y":2007,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rf2plxnasrdtwkgimwik.jpg","cloudinary_id":"rf2plxnasrdtwkgimwik","width":500,"height":354},"websites":[{"category":1,"url":"http:\/\/wolfteam.aeriagames.com\/"}]}