{"id":64693,"name":"Arbiter","slug":"arbiter","url":"https:\/\/www.igdb.com\/games\/arbiter","created_at":1505174083285,"updated_at":1532033266794,"summary":"\"Arbiter is an action game about transformation. You control Ashe, the new Arbiter, whose job is to hunt down the demonic Ether and Umbra spirits that threaten humanity. Being the opposite type of your enemy will allow you to hurt them, while being the same type will make you immune to their attacks. The game's fast-paced combat and challenging enemies force you to master the art of transformation in order to succeed.\"","storyline":"\"For centuries, the world has been filled with demonic spirits known as Ethers and Umbras -- beings made of pure spiritual energy. These two races have been at war since their inception, with humanity caught in the middle unable to retaliate. \n \nOne day, two spirits known as Dove and Raven chose to help the humans, and gave one of them the power to transform into a spirit himself. This human was known as the Arbiter, and his job was to defeat and seal more dangerous spirits within himself. As a result, the war ended, and the spirits stopped their fighting in fear of being sealed for all eternity... except for some. \n \nThe Greater Spirits were much more intelligent, powerful spirits, and they did not fear the Arbiter's judgement. Their increased power made it much harder for the Arbiter to keep them sealed within his body. As a result, he had to pass down his powers to a successor as he grew older and weak. This went on for six generations until the most recent Arbiter was killed by a spirit known only as The Grey. \n \nWith the last Arbiter's death, the spirits sealed by the Arbiters of the past were released back into the world, free to cause havoc once again. In his final moments, the Arbiter passed his powers onto his successor and apprentice, Ashe, a boy now faced with an impossible task. \n \nWith the help of Dove and Raven, Ashe must now hunt the Greater Spirits that were released and seal them once more, restoring peace to humanity. But throughout his travels, he may find that the world isn't quite as black and white as it seems...\"","popularity":1.333333333333333,"tags":[1073741826],"developers":[13436],"category":0,"player_perspectives":[2],"game_modes":[1,2],"keywords":[426],"themes":[1],"genres":[25,32],"status":4,"pulse_count":1,"platforms":[6],"release_dates":[{"category":7,"platform":6,"region":2,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/w6hdz4j9kuhni7url9zy.jpg","cloudinary_id":"w6hdz4j9kuhni7url9zy","width":1920,"height":1079},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bdt57swm4uviexc3onb6.jpg","cloudinary_id":"bdt57swm4uviexc3onb6","width":1920,"height":1076},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kbdplvnrvh9lrkn95omo.jpg","cloudinary_id":"kbdplvnrvh9lrkn95omo","width":1920,"height":1079},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hoi6gxwkzui3upjjd748.jpg","cloudinary_id":"hoi6gxwkzui3upjjd748","width":1920,"height":1077},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mxsmjlx3qqd7wqkamim3.jpg","cloudinary_id":"mxsmjlx3qqd7wqkamim3","width":1920,"height":1079}],"videos":[{"name":"Gameplay video","video_id":"KdQtVrFvURY"},{"name":"Trailer","video_id":"WJWmkT6NG8E"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jtgqpb5jonrxtdy2ckmr.jpg","cloudinary_id":"jtgqpb5jonrxtdy2ckmr","width":1024,"height":886},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/772220"},{"category":5,"url":"https:\/\/twitter.com\/jordy_j_s"},{"category":4,"url":"https:\/\/www.facebook.com\/arbitergame"},{"category":1,"url":"https:\/\/arbitergame.ca\/"}],"external":{"steam":"772220"}}