{"id":91793,"name":"Ibara Kuro: Black Label","slug":"ibara-kuro-black-label","url":"https:\/\/www.igdb.com\/games\/ibara-kuro-black-label","created_at":1521141338005,"updated_at":1548013449510,"summary":"Ibara is very similar to 8ing\/Raizing's Battle Garegga and Battle Bakraid games.So much so that Ibara could be considered a pseudo-sequel or, at least, a spiritual successor. The similarities are numerous - some are subtle, some are easily spotted. These include combining archaic technology such as biplanes with more advanced machinery; firing and power-up system; and a medal collecting system which drastically increases scoring. The game features a similar method of earning bombs and a delay when launching them as well. \n \nA notable feature of Ibara is the inclusion of a variable, real-time difficulty system by way of the Rank system. The player's rank increases as they acquire more items and cause more damage, increasing the difficulty of the game along with it. The number of enemies does not increase but the number of bullets fired towards the user does, often reaching a ridiculous level of bullet density. \n \nThere are ways of lowering this rank system if the odds appear too much. The only known way of decreasing the player's Rank in Ibara is to die. The more lives you have, the less the rank decreases when you die. \n \nIn this later version, Ibara Kuro: Black Label, Rank can be decreased by cancelling bullets with a bomb, however Rank also increases much faster in this version, potentially increasing from minimum to maximum in a matter of seconds.","storyline":"Ibara Kuro: Black Label takes place in an alternate version of the 20th century. The steam-powered engine has recently been invented, and the Northern European country Edelweiss is at the forefront of the technological and industrial development. However, a great threat appears: the insane Dr. Theresa Rose has decided that the human race is filthy and needs to be exterminated to make place for a beautiful rose garden, and her very first target is none other than Edelweiss. She and her five daughters (Lace, Shasta, Kasumi, and twin sisters Midi and Meidi) wreak havoc across the country under the name Rose Garden, leaving the Emperor with no choice but to send out his finest: the \"negotiators\" Bond and Dyne, to defeat the Rose Garden and save the country.","popularity":4.333333333333334,"games":[113111,103301,103298,41595,103281,105049,42935,27270,76747,91358],"tags":[268435461],"developers":[2958],"publishers":[2958],"category":0,"game_modes":[1,3],"keywords":[844],"genres":[5],"first_release_date":1139529600000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":1139529600000,"region":5,"human":"2006-Feb-10","y":2006,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wu1n1ujtocqsleudmoah.jpg","cloudinary_id":"wu1n1ujtocqsleudmoah","width":240,"height":320}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eimtrtvmouynkuaxtyjr.jpg","cloudinary_id":"eimtrtvmouynkuaxtyjr","width":416,"height":570},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Ibara_(video_game)"}]}