{"id":33965,"name":"Bubsy Two-Fur","slug":"bubsy-two-fur","url":"https:\/\/www.igdb.com\/games\/bubsy-two-fur","created_at":1495783897850,"updated_at":1516653018623,"summary":"Many thought Bubsy was lost to a legacy of shame obscurity after his cat-astrophic venture into 3-D, but he’s been given a new shot at video-game stardom with his first release of this meowllenium: The Bubsy Two-Fur! \n \nThe Bubsy Two-Fur is the official digital download version of Bubsy’s first two games, and the first official Bubsy release since 1997! Relive the games that started the notorious career of Bubsy Bobcat in their original incarnations, and experience for yourself the cat-titude and purr-sonality of the first gaming mascot to have a digitized (and unforgettable) voice, one whose words still resound in the minds of all who played his games: “What could paw-sibly go wrong?” \n \nThe Bubsy Two-Fur features: \n \nFaithful emulation of the SNES version of both games packaged together in a single executable, letting you relive the games in their original glory smoothly on modern machines. \nSave anywhere, any time! 9 available save slots per game means you can make your own checkpoints any place or time you want. No more typing in passwords to restore your progress! \nTwo controllers can be configured for keyboard or game controllers for co-op and competitive local multiplayer in Bubsy II. \n‘Paws’ the emulation at any time to help you save or load the game at the exact frame you want. \nSteam Trading Cards featuring exquisite Bubsy comic book art. \nThe two games included in the Bubsy Two-Fur are:","collection":1056,"popularity":1.666666666666667,"games":[36868,28113,72373,28213,28154,18387,19082,11529,19174,76110],"tags":[27,268435464,536871262,536871872,536872070,536872961,536873405,536875046,536875088,536875209,536875462],"developers":[547],"publishers":[7432],"category":3,"keywords":[350,960,1158,2049,2493,4134,4176,4297,4550],"themes":[27],"genres":[8],"first_release_date":1450310400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1450310400000,"region":2,"human":"2015-Dec-17","y":2015,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/af81vsvkll43cebdxpjy.jpg","cloudinary_id":"af81vsvkll43cebdxpjy","width":268,"height":268},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/426630\/Bubsy_TwoFur"},{"category":1,"url":"http:\/\/retroism.com\/bubsy-two-fur\/"}]}