{"id":37365,"name":"Kinnikuman Nisei: Dream Tag Match","slug":"kinnikuman-nisei-dream-tag-match","url":"https:\/\/www.igdb.com\/games\/kinnikuman-nisei-dream-tag-match","created_at":1497729709729,"updated_at":1515841659058,"summary":"Kinnikuman Nisei: Dream Tag Match is a wrestling game based in the manga\/anime series of the same name. It features the cast of Kinnikuman Nisei (known in the West as \"Kinnikuman: Second Generations\") in a battle to victory. The main story follows Kid Muscle, the prince of Muscle Planet and son of King Muscle (the early protagonist of the series), who fought for peace and justice in the Universe. Kid has now been chosen as King Muscle's predecessor in wrestling history, and must now defeat every opponent that comes his way, stopping total domination by the Demon Manufacturing Plant, an evil wrestling league which wants to take control of the universe, and the loss of his fanbase, which includes the love of his life, Roxanne. \n \nThis game supports up to 2 players and includes 14 characters (which aren't all available from the beginning). Game modes are Story Mode (in which you will fight as Kid Muscle, and will have to defeat all your opponents), Tag Mode (you will have to choose a companion and confront other 10 couples, if you win, you will unlock a character), Classic Mode (this one will be available once you unlock all the characters of the game, and once done, it will let you play a port of the original Kinnikuman NES game).","collection":3781,"popularity":1.333333333333333,"games":[70861,6685,37366,19567,51464,6051,64545,55803,28010,26933],"tags":[268435470,536870990,536871146,536875054],"category":0,"keywords":[78,234,4142],"genres":[14],"first_release_date":1017705600000,"platforms":[123],"release_dates":[{"category":0,"platform":123,"date":1017705600000,"region":8,"human":"2002-Apr-02","y":2002,"m":4}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dmnbim9qblfdjxffbtyq.jpg","cloudinary_id":"dmnbim9qblfdjxffbtyq","width":200,"height":297}}