{"id":44465,"name":"The Peace Keepers","slug":"the-peace-keepers","url":"https:\/\/www.igdb.com\/games\/the-peace-keepers","created_at":1499425255853,"updated_at":1521826568269,"summary":"It's the year 2015 and the most powerful organization of the planet, a company named Deutschland Moldavia, is threatening to take over the world by genetically manipulatin humans into mindless slaves or powerful monsters. \n \n \nThe Peace Keepers is a side-scrolling fighting game similar to games in the Final Fight series. The player can choose from four characters (plus two that become available later in the game) with different strengths and weaknesses. In addition to combinations of standard attacks, jump-, run- and throwing attacks, all characters can also block attacks, perform single heavy attacks, special attacks that consume a certain amount of energy and super attacks. Super attacks damage all enemies on-screen, but can only be used twice per continue. If a character is hit repeatedly, there is a chance that they temporarily switch into \"angry-mode\" during which they are invincible and more powerful. \n \nMost levels offer different paths and exits, and after every level, a different character may be selected. This means that levels may be played through in different orders and that it is not at all necessary to play through all the levels to reach one of several endings.","collection":5087,"popularity":1,"games":[7329,7100,36897,8965,117,19333,21062,10455,37092,4136],"tags":[268435460,536870973,536871213,536871894,536871971,536872098,536872225,536872581,536874398,536875057,536875073,536875081,536875406,536875590,536875610,536875792,536876120,536876283,536876823,536876910,536878211,536878505],"category":0,"keywords":[61,301,982,1059,1186,1313,1669,3486,4145,4161,4169,4494,4678,4698,4880,5208,5371,5911,5998,7299,7593],"genres":[4,25],"first_release_date":760060800000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":760060800000,"region":8,"human":"1994-Feb-01","y":1994,"m":2}],"alternative_names":[{"name":"Rushing Beat Shura","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fmspyy2d96gvkq3sjffm.jpg","cloudinary_id":"fmspyy2d96gvkq3sjffm","width":2100,"height":1534},"esrb":{"rating":1}}