{"id":87265,"name":"DogWorld Premium","slug":"dogworld-premium","url":"https:\/\/www.igdb.com\/games\/dogworld-premium","created_at":1518699541841,"updated_at":1522408627334,"summary":"The absolute cuddle alarm for your iPad or iPhone: Tivola brings the next installment of its 3D animal game series with DogWorld 3D’s cute Dalmatian, Labrador, Shepherd, Rottweiler and Beagle puppies. You’ll have little, faithful companions by your side to share all kinds of crazy adventures with.\n\n\nUNENDING GAME FUN \n\nThe little puppies are always with you and are always delighted when you take care of them, give them treats, or just simply cuddle them. Each puppy reacts to your touch, and you will be amazed by the incredibly adorable animations in amazing 3D graphics. With your finger, you can nudge your new friend slowly out of his dreams so that he happily jumps on the screen or begs on command with a wagging tail. While doing this he is always ready to cuddle or play and he's always in an intoxicatingly good mood. It only takes one look in his faithful little button eyes for you to fall under his spell and to give him attention, which he adores.\n\n\nCLUMSY DANCING\n\nYou thought that you can't really rock out with dogs? You thought wrong: Pump up the stereo system together with your little Dalmatian, Labrador, and Beagle, and you can marvel at their clumsy dance moves. Depending on the mood, you can choose from different songs and decide which funny moves the puppies perform to the rhythm. A good mood is guaranteed!\n\n\nFUNNY CLOTHING\n\nThe little puppies love it when you search for funny accessories in the wardrobe room so that you can dress them up. Hats, shoes, bows and other things are ready so that you can get started with costuming right away. Your fantasies have no limits; decorate your darling according to your imagination. If you are happy with the result, then you can create a photographic memory of the experience. Let your dog pose for the camera and create unforgettable snapshots.\n\n\nCOLLECT STARS TO ENSURE THAT YOU RECEIVE SURPRISES\n\nYou collect stars with every mission. Once you've reached a certain amount, a cool surprise waits for you each time. Cool dog accessories such as treats and toys are hidden in the gift packets for unending game fun with your new friend.\n\nPlay DogWorld 3D now and care for your own cute puppy dogs!\n\nTivola’s premium games offer players endless gaming fun with their favorite animals, without any in-app purchases, annoying ads, or external links. This is why premium games are perfectly suited for even our littlest animal fans. For a set price, you can get all the content and all the objects in the game from the start – just waiting to be played with! What are you waiting for? Let’s start playing!\n\nREVIEWS\n\n\"If your kids are begging for a puppy after watching 101 Dalmatians, you might want to get them this app for fun. [...] Cute and funny! [...] The dog itself and his environment are very realistically presented through 3D animations.\" (smartappsforkids.com)","popularity":1,"category":0,"keywords":[1118],"genres":[13],"first_release_date":1349913600000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1349913600000,"region":8,"human":"2012-Oct-11","y":2012,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iq99inmzsa227xsknpbw.jpg","cloudinary_id":"iq99inmzsa227xsknpbw","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vctoipgifaibswp5oc22.jpg","cloudinary_id":"vctoipgifaibswp5oc22","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/osliavxxn4cgumincimo.jpg","cloudinary_id":"osliavxxn4cgumincimo","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jfqfjpzme8qgmvhgnwnw.jpg","cloudinary_id":"jfqfjpzme8qgmvhgnwnw","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o4dwvq9ydrvq9ocwlrwf.jpg","cloudinary_id":"o4dwvq9ydrvq9ocwlrwf","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gokvndj9co8rqz72naft.jpg","cloudinary_id":"gokvndj9co8rqz72naft","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vvd9c5pn1ucj3fwrx0lp.jpg","cloudinary_id":"vvd9c5pn1ucj3fwrx0lp","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zu7mxyuwnpdrkwhvbxdr.jpg","cloudinary_id":"zu7mxyuwnpdrkwhvbxdr","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vo61vmgizaugezrehigv.jpg","cloudinary_id":"vo61vmgizaugezrehigv","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j6hrrkvbnbb4axlbrqoa.jpg","cloudinary_id":"j6hrrkvbnbb4axlbrqoa","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yfc3iaynfletealsfiwt.jpg","cloudinary_id":"yfc3iaynfletealsfiwt","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/dogworld-premium\/id562184187?mt=8&uo=4"}]}