{"id":109464,"name":"Cities: Skylines - Nintendo Switch Edition","slug":"cities-skylines-nintendo-switch-edition","url":"https:\/\/www.igdb.com\/games\/cities-skylines-nintendo-switch-edition","created_at":1536890322401,"updated_at":1540854163612,"summary":"\"Cities: Skylines is a modern take on a classic city builder. With original gameplay to realize the thrill and hardships of creating and maintaining a real city. Boasting fully realized transport and economy systems, Cities: Skylines is designed to suit any play style - and now, anytime, anywhere. \n \nMore portable than ever, the new Nintendo Switch™ Edition of this best-selling city builder comes complete with reworked UI, designed especially for Switch, along with two of Cities: Skylines’ most popular expansions - After Dark and Snowfall. \n \nMulti-tiered and challenging simulation: Constructing your city from the ground up is easy to learn, but hard to master. Playing as the mayor, you’ll be faced with balancing essential requirements like education, healthcare and much more along with your city’s real economy system. Citizens in your city react fluidly, with gravitas and an air of authenticity to a multitude of gameplay scenarios. \n \nNintendo Switch edition exclusive: Using HD Rumble, a rumble effect helps find the most efficient area to place service buildings in your city. Pro controllers are also supported, and additional tutorials help guide your first playthrough for a better learning experience. \n \nExtensive local traffic simulation: Colossal Order's extensive experience developing the Cities in Motion series is put to work in fully fleshed out, well-crafted transport systems. \n \nDistricts and Policies: Be more than just an administrator from city hall. Designating parts of your city as a district results in the application of policies which results in you rising to the status of Mayor for your own city. \n \nAfter Dark: Focused on leisure and tourist specialization, this expansion's central feature is to utilize the day and night cycle and alter the approach to managing your city. Will you construct a bustling city that lives and breathes at night, or succumb to the perils and misadventures of the dark hours? \n \nSnowfall: The difficulty heats up when the city cools down, thanks to this expansion's added challenges and assets, like snow maps, streetcars, and heating systems. There are in-game temperature readings, cosmetic weather enhancements, extra parks, and infrastructural demands to keep your citizens warm and safe from freezing conditions.\"","rating":86,"popularity":4.333333333333334,"aggregated_rating":76.5,"aggregated_rating_count":2,"total_rating":81.25,"total_rating_count":2,"rating_count":0,"version_parent":9066,"version_title":"Nintendo Switch Edition","games":[79134,44242,33603,65827,55888,17613,36962,98753,87210,31515],"tags":[28,268435469,268435471,1073741827],"developers":[806],"publishers":[517],"category":0,"player_perspectives":[3],"game_modes":[1],"themes":[28],"genres":[13,15],"first_release_date":1536796800000,"pulse_count":9,"platforms":[130],"release_dates":[{"category":0,"platform":130,"date":1536796800000,"region":8,"human":"2018-Sep-13","y":2018,"m":9}],"alternative_names":[{"name":"シティーズ：スカイライン Nintendo Switch Edition ","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a4lqghwwm5r4kw76fd30.jpg","cloudinary_id":"a4lqghwwm5r4kw76fd30","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dxnl5ebfeiieyjfdddi9.jpg","cloudinary_id":"dxnl5ebfeiieyjfdddi9","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wsgpbxonpru9wdxq2lup.jpg","cloudinary_id":"wsgpbxonpru9wdxq2lup","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ar2sgqqf8dgehddvzcqh.jpg","cloudinary_id":"ar2sgqqf8dgehddvzcqh","width":1280,"height":720}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lolaiwwklhippfvbuyv4.jpg","cloudinary_id":"lolaiwwklhippfvbuyv4","width":268,"height":256},"esrb":{"rating":3}}