{"id":12064,"name":"Elvira II: The Jaws of Cerberus","slug":"elvira-ii-the-jaws-of-cerberus","url":"https:\/\/www.igdb.com\/games\/elvira-ii-the-jaws-of-cerberus","created_at":1441129819305,"updated_at":1515627304709,"summary":"Elvira II: The Jaws of Cerberus is an adventure\/RPG first-person game. You begin by choosing one of the four classes for your character (which determines your starting attributes, such as Strength, Intelligence etc.). \n \nFor movement, you click the arrows in the bottom-right corner of the screen. Collecting items can be done via clicking on them in the first-person view window and dragging them into your inventory. (You can also click the \"room\" icon to see all the items that you've found in the room so far.) Should you encounter monsters, you fight by clicking on them. You can choose one of the four tactics (Normal, Defense, Fierce, Berserk) when fighting, and there's a number of different weapons you can find in the game. If you meet someone who doesn't want to murder you (a very rare occurrence) you can talk to him, though conversations are pretty simple and consist mainly of short phrases. \n \nAs you defeat monsters, explore the game world and cast spells (see below), you get experience. Once you have enough experience, you gain a level, and your attributes improve. \n \nThanks to Elvira's spellbook she gave you, you have the ability to create and cast spells. Some spells can be used to heal yourself, protect you in combat or damage your enemies, other are necessary to solve certain puzzles and make progress in the game. Creating a spell requires you to be of high enough level and to have the proper ingredients, different for every spell. The ingredients are usually gone forever once the spell is ready, so beware and don't use up any items vital for completing the game! Casting a spell requires you to use some amount of Power Points (PP), which regenerate automatically but slowly. What's more, you only get a limited number of castings when you prepare a spell, so don't waste them.","collection":1651,"franchise":620,"franchises":[620],"popularity":1.333333333333333,"games":[13189,25300,44076,11296,59516,28289,25646,26145,26914,7329],"tags":[19,21,268435468,268435487,536871938,536871939,536872032,536875081,536875308,536879130,536879765,536880232,536885992,1073741825],"publishers":[547],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[1026,1027,1120,4169,4396,8218,8853,9320,15080],"themes":[19,21],"genres":[12,31],"first_release_date":694137600000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":725760000000,"human":"1992","y":1992,"m":12},{"category":2,"platform":13,"date":694137600000,"human":"1991","y":1991,"m":12}],"alternative_names":[{"name":"Elvira 2: The Jaws of Cerberus","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ose7kx9hi7avvr55cail.jpg","cloudinary_id":"ose7kx9hi7avvr55cail","width":320,"height":200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v3ukthijmdmw1qt3i9kr.jpg","cloudinary_id":"v3ukthijmdmw1qt3i9kr","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gmvp5i8nqn9zymygua1p.jpg","cloudinary_id":"gmvp5i8nqn9zymygua1p","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wg1jm9b67ohgouejulpx.jpg","cloudinary_id":"wg1jm9b67ohgouejulpx","width":640,"height":805}}