{"id":13364,"name":"Heroes Chronicles: The Fiery Moon","slug":"heroes-chronicles-the-fiery-moon","url":"https:\/\/www.igdb.com\/games\/heroes-chronicles-the-fiery-moon","created_at":1444614776127,"updated_at":1517270686520,"summary":"Heroes Chronicles: The Fiery Moon is the sixth episode of the Heroes Chronicles series. Alongside Heroes Chronicles: The World Tree, it was released as a bonus in downloadable format on 3DO's official website between the release of the first four Chronicles and The Final Chapters. \nThe campaign is a direct sequel, concluding the story arc commenced in The World Tree. As Vorr flees Enroth for a deserted, post-apocalyptic world, Tarnum and his Stronghold armies pursue, seeking to free the two remaining Ancestors from their imprisonment and destroy their insane counterpart.","storyline":"In The Fiery Moon, a direct sequel to The World Tree, Tarnum continues his search for Vorr and the other two Ancestors. He is drawn further northeast across an inhospitable desert and into a tall, nameless mountain range. Along the way, he encounters an injured familiar named Skizzik who has fled from Vorr's armies. Skizzik tells Tarnum that the Ancestors are imprisoned on the Fiery Moon, which can only be reached through the Sparkling Bridge. The Sparkling Bridge is an ancient portal capable of instigating travel to any world in the universe. It has been guarded by the elementals since the dawn of time and requires the Ring of the Wayfarer to be operated. \n \nTarnum travels to the Fiery Moon and frees the two remaining sane Ancestors from Xyron, the Jailer. The Ancestors give Tarnum sap from the World Tree which will help him cure their brother, Vorr. However, Tarnum's loses his battle against Vorr's army. Grumba also dies in the battle, but Skizzik survives. After rebuilding his forces, Tarnum is intent on killing Vorr this time, but the other Ancestors convince him to use the sap because if Tarnum kills Vorr, he and the other Ancestors will die and enter Oblivion as well. Tarnum reaches Vorr and gives him the sap which cures his madness. For the first time, Tarnum feels he really can change his cruel barbarian ways.","collection":194,"franchise":458,"franchises":[458],"rating":30.4535310538657,"popularity":1.666666666666667,"total_rating":30.4535310538657,"total_rating_count":4,"rating_count":4,"games":[7615,23183,77597,32510,932,26940,28182,9472,32851,55036],"tags":[17,268435471,268435472,536871138,536871208,536873311,536874694,1073741827],"developers":[97],"publishers":[99],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[226,296,2399,3782],"themes":[17],"genres":[15,16],"first_release_date":974246400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":974246400000,"region":8,"human":"2000-Nov-15","y":2000,"m":11}],"alternative_names":[{"name":"Heroes Chronicles 6: The Fiery Moon"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pmpokpckz8sbc6llch85.jpg","cloudinary_id":"pmpokpckz8sbc6llch85","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s0uirchpbtkzvfob5kdw.jpg","cloudinary_id":"s0uirchpbtkzvfob5kdw","width":800,"height":600}],"videos":[{"name":"Gameplay video","video_id":"fXLuOrM8FIA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ohvn9ymtyb7dvdutzi86.jpg","cloudinary_id":"ohvn9ymtyb7dvdutzi86","width":428,"height":558},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Heroes_Chronicles"},{"category":2,"url":"http:\/\/mightandmagic.wikia.com\/wiki\/Heroes_Chronicles:_The_Fiery_Moon"}]}