{"id":27164,"name":"Touhou 13 Ten Desires","slug":"touhou-13-ten-desires","url":"https:\/\/www.igdb.com\/games\/touhou-13-ten-desires","created_at":1487117681017,"updated_at":1515840224840,"summary":"PROLOGUE \nThe story begins with a peaceful day in Gensokyo, when suddenly an abundance of divine spirits show up. The four heroines, Reimu Hakurei, Marisa Kirisame, Sanae Kochiya and Youmu Konpaku are finding this unusual. Depending on who you choose, one of them goes out to investigate. \n \nMAIN SCENARIO \nThe heroine first investigates in Hakugyokurou and encounters Yuyuko Saigyouji. The heroine accuses Yuyuko of not taking care of the spirits properly. Yuyuko has a small battle with the heroine. Yuyuko is defeated and states that they are actually 'divine spirits', and Yuyuko doesn't know much about them. Yuyuko suggests they may be from the graveyard of the Myouren Temple. \n \nAs the heroine heads to the temple, she runs into Kyouko Kasodani, the guard of the Myouren Temple. Kyouko is quickly defeated and the heroine heads on. \n \nThe heroine heads inside the temple. While investigating, she encounters Kogasa Tatara, who claims to be attempting to scare Byakuren, but is being stopped by a guard. Kogasa asks the heroine to banish the guard, however the heroine attacks Kogasa. Once Kogasa is defeated, the heroine meets the guard, Yoshika Miyako. Yoshika was resurrected to guard the mausoleum. Yoshika is ultimately defeated and the heroine enters the mausoleum. \n \nOnce the heroine made it into the mausoleum, the heroine finds that there are more divine spirits. The heroine encounters Seiga Kaku. It is then revealed that Seiga resurrected Yoshika in order to make sure the mausoleum is guarded. With the assistance of Yoshika, Seiga battles the heroine. The heroine defeats the pair and proceeds further into the mausoleum. \n \nThe heroine goes in further and meets Soga no Tojiko, who attacks the heroine. Tojiko is quickly defeated and the heroine continues investigating. Eventually, the heroine encounters Mononobe no Futo. The heroine fights with Futo and Futo is ultimately defeated. \n \nAt last, the heroine heads into the deepest part of the mausoleum and sees a ton of divine spirits. As the heroine makes her way through, she encounters a holy saint, Toyosatomimi no Miko. Miko had just been resurrected and it turns out that the divine spirits were gathering to witness the resurrection of their holy saint, Miko. The heroine and Miko have a fierce battle. The heroine is victorious.","collection":2093,"popularity":1.666666666666667,"games":[23852,27209,76747,80916,90099,54775,28175,105049,10039,68287],"tags":[1,268435461,536870990,536871078,536871208,536871823,536873476,536873591,536874148,536875304,536875458,536875486,536875622,536877783,536877949,536878105,536880735],"category":0,"game_modes":[1],"keywords":[78,166,296,911,2564,2679,3236,4392,4546,4574,4710,6871,7037,7193,9823],"themes":[1],"genres":[5],"first_release_date":1315872000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1315872000000,"region":8,"human":"2011-Sep-13","y":2011,"m":9}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f39kwq52c6qctckm08wp.jpg","cloudinary_id":"f39kwq52c6qctckm08wp","width":320,"height":240}],"videos":[{"name":"Gameplay video","video_id":"Je-mu6z532E"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mn6hbftdjxj2h2ufekqh.jpg","cloudinary_id":"mn6hbftdjxj2h2ufekqh","width":256,"height":253},"websites":[{"category":3,"url":"https:\/\/en.touhouwiki.net\/wiki\/Ten_Desires"}]}