{"id":45964,"name":"Touhou 04 Lotus Land Story","slug":"touhou-04-lotus-land-story","url":"https:\/\/www.igdb.com\/games\/touhou-04-lotus-land-story","created_at":1499522665866,"updated_at":1535224149079,"summary":"This game features two playable characters to choose from, with two different attack types each. Reimu Hakurei can pepper a wide area of the screen with weaker attacks, while Marisa Kirisame relies on her power to compensate for her narrower attack spread. The bombs also exhibit unique behavior and damage amounts depending upon the character chosen. \n \nLotus Land Story is the first game in the Touhou Project to feature bombs that auto-collect items, graze counting, the ability to move more slowly by holding the shift key, and a non-trivial scoring system that involves the collection of special dream items that boost the player's ultimate scoring potential. The game's scoring system also marks the series' first instance of score bonuses for the elimination of bullets following the defeat of mid-bosses and bosses.","storyline":"Following the events of the previous games, youkai soon began to swarm the Hakurei Shrine, prompting Reimu Hakurei and Marisa Kirisame to seperately head for a lake in the mountains, which appears to be the source of a tremendous power surge. The two reach the gateway underneath the lake, which teleports them to a strange dream world, in which the mansion Reimaden exists, where the mastermind supposedly is. \n \nThe heroine sets off to the lake, but sees a youkai, Orange. Orange wasn't going to fight, but the heroine attacked Orange merely because she was a youkai. The heroine goes off but encounters a vampire, Kurumi. Kurumi attempts to prevent the heroine from reaching the island in the mountain lake but fails. Ironically, Kurumi is not a lake guard or anything. After Kurumi is defeated, the heroine sets off somewhere else and finds the boundary line between the dream world and the real world. However, the heroine encounters Elly, the gatekeeper of the boundary. Elly states that depending on who you're using, either a Shrine Maiden or a Magician had entered the world. Elly is battled and defeated, thus the heroine entering the dream world. After, the heroine explores the dream world, but encounters either Reimu or Marisa, depending on who you are playing as. They are surprised to see each other and then they battle. The heroine wins as usual, forcing the other to leave the dream world. The heroine heads deeper in the dream world, but encounters Yuuka, who had just woken up and is upset that someone is in her mansion at this hour. They fought and the heroine wins. However, Yuuka retreats and runs away. The heroine is forced to chase her, leading to the final stage. Yuuka appears and again and battles the heroine one last time, however Yuuka loses again. \n \nLater on, the heroine sets into another unknown dream world. While exploring the dream world, the heroine encounters Mugetsu, a Maid who claims that this dream world is hers. Mugetsu doesn't seem to know about the tremendous power surge, but still battles the heroine merely because she was bored. Mugetsu is defeated, and asks her older twin sister, Gengetsu for help. Mugetsu leaves and Gengetsu comes into the battlefield. Gengetsu doesn't know what is happening, but knows her job is to defeat the heroine. But of course, the heroine wins and the twin sisters are defeated.","collection":2093,"franchise":780,"franchises":[780],"popularity":1.333333333333333,"games":[27209,23733,22387,47823,68441,18869,55092,28010,28168,45966],"tags":[1,17,268435461,536870990,536871029,536871078,536871208,536872225,536873476,536874259,536874398,536875941,536876634,536879840,536879841,536881922,536881923,536881924,1073741827],"developers":[9378],"publishers":[9378],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[78,117,166,296,1313,2564,3347,3486,5029,5722,8928,8929,11010,11011,11012],"themes":[1,17],"genres":[5],"first_release_date":903052800000,"platforms":[149],"release_dates":[{"category":0,"platform":149,"date":903052800000,"region":5,"human":"1998-Aug-14","y":1998,"m":8}],"alternative_names":[{"name":"LLS","comment":"Acronym"},{"name":"Th04","comment":"Acronym"},{"name":"Touhou Gensoukyou - Lotus Land Story","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cmi87haoyeckidzbtkay.jpg","cloudinary_id":"cmi87haoyeckidzbtkay","width":1280,"height":720}],"videos":[{"name":"Gameplay video","video_id":"xNKyPkQ-_ug"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kd46yt6tsawljxgp79hk.jpg","cloudinary_id":"kd46yt6tsawljxgp79hk","width":483,"height":326},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Touhou_Project#PC-98_predecessor_games"},{"category":2,"url":"http:\/\/touhou.wikia.com\/wiki\/Lotus_Land_Story"},{"category":1,"url":"http:\/\/www16.big.or.jp\/~zun\/top.html"}]}