{"id":57864,"name":"Hidden my game by mom","slug":"hidden-my-game-by-mom","url":"https:\/\/www.igdb.com\/games\/hidden-my-game-by-mom","created_at":1504699434478,"updated_at":1516678474751,"summary":"Overview \n------------- \nHidden my game by mom is an escape-room-style mobile game developed by Japanese developer hap Inc.. set in a minimalist, blue-tinged house. The game was released on iOS and Android on the 8th of August, 2016, and on the New Nintendo 3DS eShop on the 12th of July, 2017. It is an adventure game that is light on puzzles, and is mostly a series of absurd comedic situations. The game also features a somewhat Broken English translation, as may be evident in the title. \n \nGameplay \n-------------- \nThe game is an escape-room-style adventure game with light puzzle elements. The player must find the game console hidden in the room, and avoid other dangers. One constant danger is his mother, who is usually also hiding in the room and will catch the player when found. The player may also pick items up into their inventory, and drag it to use it on other things. \n \nThe game is separated into 30 days, every day is a level of the game. There is also an infinite play mode, which is unlocked after completing all 30 days of the game. The infinite play randomizes the completed levels and also other levels not included in those 30 days.","storyline":"The game starts with the young boy protagonist sitting on the floor of his house, smiling and grunting while obsessively playing a video game on his portable game console (reminiscent of the Nintendo DS). The door behind him opens, revealing his mother, who looks cross. The next day, the young boy looks for his game console in his house to no avail. He exclaims that his mother has hidden his game console. \n \nThe young boy has to overcome increasingly absurd obstacles in order to find his game console in the following days. He succeeds in finding his hidden game console every day for the next thirty days. On the 29th day, he jams the door a baseball bat (which he grabbed from a baseball player), locking his mother out of the room. \n \nA thousand days later, he continues to play his game console every single day, as trash pile up in the room. The boy (now older and larger) finally unblocks the door and opens it. It is revealed that his mother and the rest of his family has been waiting patiently outside his room. They hug, and the camera zooms into the opened game console. It turns on and reads, \"Escape the room success!\" \n \nA short video linked to at the end of the game shows an extra (\"omake\") ending. Someone is shown grunting and playing the video game console once again. The mother tracks it down to find out that it was actually the grandfather, hiding in a closet with the game console.","popularity":1.333333333333333,"category":0,"first_release_date":1470614400000,"platforms":[34,39],"release_dates":[{"category":0,"platform":39,"date":1470614400000,"region":8,"human":"2016-Aug-08","y":2016,"m":8},{"category":0,"platform":34,"date":1470614400000,"region":8,"human":"2016-Aug-08","y":2016,"m":8}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u3qh0znlvyckf56yc4mf.jpg","cloudinary_id":"u3qh0znlvyckf56yc4mf","width":320,"height":318}}