{"id":22918,"name":"Duke Nukem Forever: The Doctor Who Cloned Me","slug":"duke-nukem-forever-the-doctor-who-cloned-me","url":"https:\/\/www.igdb.com\/games\/duke-nukem-forever-the-doctor-who-cloned-me","created_at":1472030589666,"updated_at":1513101358795,"summary":"Duke Nukem Forever’s new Add-On Content, Duke Nukem: The Doctor Who Cloned Me is bursting with all of the over-the-top Duke goodness fans love. Deep in the heart of Area 51, Dr Proton has been hatching his evil plan. Fueled by new ego boosts, Duke is ready to take on evil clones, aliens queens and anything else that comes his way in order to save the world and his babes! \nThis full new single player campaign includes brand new weapons, all-new enemy types and bosses, more Achievements, and brand new interactive items within the world. Additionally, The Doctor Who Cloned Me adds four new multiplayer maps to the mix: \nSky-High: The alien-infested corporate offices of Pooty, Inc. near the center of Las Vegas. This map includes three indoor floors taken over by the aliens and two rooftops, jump pads, stairwells, and building-to-building combat. \nCommand: EDF command center with an imprisoned BattleLord at its core! A two-level map featuring winding stairs, straightaway corridors, and jump pads. \nDrop Zone: Rooftop of Duke’s Lady Killer Casino featuring indoor and outdoor combat and stairwells for platforming, an EDF dropship on landing pad, and a bottomless pit. \nBiohazard: Fight in the Breston Plant Nuclear Power facilities and compete across multiple floors in locker rooms, restrooms with showers, control rooms, and the nuclear waste storage room. \n*Maps support all retail games modes. Players who own the first add-on content, Hail to the Icons Parody Pack, will also be able to play Freeze Tag, Hot Potato, Hail to the King Free For All and Predator.","collection":64,"popularity":1.666666666666667,"aggregated_rating":50,"aggregated_rating_count":1,"total_rating":50,"total_rating_count":1,"tags":[1073741825],"category":1,"player_perspectives":[1],"game_modes":[1,2],"keywords":[466],"themes":[1],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sen5fnnxqwyhegcqsndh.jpg","cloudinary_id":"sen5fnnxqwyhegcqsndh","width":960,"height":567}}