{"id":26718,"name":"Sol Source Online","slug":"sol-source-online","url":"https:\/\/www.igdb.com\/games\/sol-source-online","created_at":1483911038549,"updated_at":1517270889735,"summary":"Sol Source Online is a free to play text browser based strategy\/casual game that throws the player into a galaxy filled with chaos. \r\n\r\nEach new player takes control of an empire destined for greatness and fights their way through the ranks of other players to reach the ultimate goal of absolute power within Sol.\r\n\r\nBuild massive fleets, ground armies, upgrade your base, research new technologies, the list really goes on.  \r\n\r\nCheck us out today and be a part of a beta-release game that stayed true to the original browser gaming roots.","storyline":"Sol Source Online has always been a dream of mine to accomplish ever since my early days of browser based gaming.  Growing up on AOL and The earlier versions of DSL I didn't have the connection I really needed to play some of the more advanced games that had come out so I found myself coming home from school every day to listen to the dial tone boot up the internet and would get on my favorite site to immerse myself in worlds that I never knew existed.  I studied PHP\/MySQL\/CSS\/HTML\/Javascript for a majority of my younger years and worked on my little gem here as a starting project which I eventually (15 years later) completed.  Welcome to my imagination and I hope you enjoy it.\r\n\r","popularity":1.333333333333333,"games":[9760,21642,55029,11362,33603,36962,55888,73075,12982,65827],"tags":[39,268435471,1073741829],"category":0,"player_perspectives":[5],"game_modes":[2,5],"themes":[39],"genres":[15],"first_release_date":1483833600000,"status":3,"platforms":[82],"release_dates":[{"category":0,"platform":82,"date":1483833600000,"region":8,"human":"2017-Jan-08","y":2017,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qnklkb8fp2ekrzkkazk6.jpg","cloudinary_id":"qnklkb8fp2ekrzkkazk6","width":640,"height":400}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jufwhv6vrle9azipwlxj.jpg","cloudinary_id":"jufwhv6vrle9azipwlxj","width":640,"height":400},"esrb":{"rating":3},"pegi":{"rating":1},"websites":[{"category":1,"url":"http:\/\/solsourcegame.com"}]}