{"id":40618,"name":"Tax Avoiders","slug":"tax-avoiders","url":"https:\/\/www.igdb.com\/games\/tax-avoiders","created_at":1498481931923,"updated_at":1513070490231,"summary":"You are John Q and you want to be rich. \n \nIn this game, you start out on the income screen where you try to collect the money (dollar signs) while avoiding the governmental red tape (look like red snakes). You have only one year to get your money and invest it. Each second, a day goes by. My, how time flies. \n \nOnce a season, you are sent to the investment\/tax shelter screen, where you must collect an icon representing an investment and then grab your portfolio (briefcase). Investments have a 50\/50 chance of making or losing money. Also on this screen is a character whose color changes. \n \nWhat color he is determines who he is: \nBlack=Eggie, the IRS agent. If he catches you, he will audit you. In these audits, you always lose. You are then taxed at 50% of your income and sent back to the income screen.There are no appeals to tax court. \nPink=Waggie, the CPA. If he catches you (or you go to him), he will charge you $1,000.00 but whatever tax sheltered investment you have, he will put you in a better one. \nGreen=Toodles, the registered investment adviser. If you two meet, he will put you in the best tax sheltered investment available, thus making you the most profit. \n \nAfter each season, you are taxed to an amount determined by your tax shelter. The object is to have $1,000,000.00 at the end of the year after taxes.","popularity":1.333333333333333,"games":[19934,55678,44076,17001,34919,72373,16468,18387,36608,36897],"tags":[1,536871906,536872581,536875081,536875151,536875325,536875356,536875538,536875666,536876008,536876953],"category":0,"keywords":[994,1669,4169,4239,4413,4444,4626,4754,5096,6041],"themes":[1],"first_release_date":381369600000,"platforms":[59],"release_dates":[{"category":0,"platform":59,"date":381369600000,"region":8,"human":"1982-Feb-01","y":1982,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xyk0br2qayfhi5jfiryv.jpg","cloudinary_id":"xyk0br2qayfhi5jfiryv","width":450,"height":648}}