{"id":48218,"name":"Quattro Adventure","slug":"quattro-adventure","url":"https:\/\/www.igdb.com\/games\/quattro-adventure","created_at":1499959453977,"updated_at":1515664174926,"summary":"BOOMERANG KID: Amazing gameplay starring the Boomerang Kid and a host of weird creatures - snapping alligators, cute koalas, knights in armor, Toby the dog, plus castles, secret switches, crumbling platforms, hidden caves and world warps. The fun never stops! SUPER ROBIN HOOD: Adventure through Nottingham castle conquering troll guards, patrolling dwarves, vampire bats, fanged spiders, fire breathing gargoyles, spiked cannonballs and more. Discover keys, secret passages, dungeons, torture chambers and collect stolen treasures including chests, crowns, diamonds, shields, goblets and rubies. All the action of the famous legend successfully captured in this amazing game. TREASURE ISLAND DIZZY: Dizzy's cartoon adventure on Treasure Island. Explore the mysterious island's treehouse, village, fabulous gold mines and dragon's lairs. Find secret treasure maps, encounter strange magicians, wizards, trolls, pirates and many other weird and wonderful creatures. LINUS SPACEHEAD: \"Planet Earth!? I hope the natives are friendly!\" thought Linus Spacehead as his spacecar spiralled out of control toward the strange planet - and what a strange place \"Planet Earth\" turns out to be! Weird and wonderful \"aliens,\" frantic platform action and some of the zaniest gameplay ever seen takes Linus through an escape plan that is out of this world!","collection":4890,"popularity":1.333333333333333,"games":[27314,25300,36950,19448,25311,68287,71455,26766,51485,26848],"tags":[1,18,268435464,268435487,536871872,536871882,536871939],"category":0,"keywords":[960,970,1027],"themes":[1,18],"genres":[8,31],"first_release_date":665366400000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":665366400000,"region":8,"human":"1991-Feb-01","y":1991,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bxcrgnggyzzbvxgbyiwk.jpg","cloudinary_id":"bxcrgnggyzzbvxgbyiwk","width":1524,"height":2100}}