{"id":9118,"name":"Darkstar: The Interactive Movie","slug":"darkstar-the-interactive-movie","url":"https:\/\/www.igdb.com\/games\/darkstar-the-interactive-movie","created_at":1424422053260,"updated_at":1515825254866,"summary":"In this tale of murder and deception with nothing less than the fate of humanity at stake, you awaken inside a cryogenic sleep chamber aboard the drifting starship, Westwick. As Captain John O'Neil, you are physically unharmed, but suffer from a complete and permanent loss of memory. Beside you are three other sleep chambers. One is empty. In another lies a beautiful woman, still in hibernation. The final chamber contains a 300-year old corpse. The ship's computer, Westwick Main, has also had much of her memory deleted by someone unknown. Your wits are your greatest weapon in this story of suspense and interplanetary intrigue. Nothing is as it seems and despite the icy, cold silence... you're not alone.","popularity":1.333333333333333,"games":[13189,25222,27314,19448,26766,25300,36950,17469,70396,25311],"tags":[18,268435458,268435487,536871128,536871882,536871939,536875426,1073741825],"developers":[4828],"publishers":[4828,1117],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[216,970,1027,4514],"themes":[18],"genres":[2,31],"first_release_date":1288915200000,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1289174400000,"region":2,"human":"2010-Nov-08","y":2010,"m":11},{"category":0,"platform":6,"date":1323993600000,"region":1,"human":"2011-Dec-16","y":2011,"m":12},{"category":0,"platform":14,"date":1288915200000,"region":2,"human":"2010-Nov-05","y":2010,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cggbr30v0dhflevpqodc.jpg","cloudinary_id":"cggbr30v0dhflevpqodc","width":640,"height":906},"esrb":{"synopsis":"This is a 'point-and-click' adventure game in which players assume the role of a spaceship commander who must solve a mystery to rescue Earth. Players search for clues in futuristic environments and interact with various crew members via full-motion video clips. Individual deaths are portrayed in a number of different sequences: the central character is eaten by an aquatic alien beast, resulting in a pool of red water; a man is burned alive inside an incinerator; a character emits splashes of blood after being shot with a laser pistol. One cutscene depicts a dead man with a gaping hole in his face; insects crawl in and out of the corpse's eye sockets. Behind-the-scenes video footage contains language such as 'f**k,' 'sh*t,' and 'a*shole.'","rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\nIt contains: Realistic looking violence","rating":4},"websites":[{"category":1,"url":"http:\/\/www.darkstar.gs\/home.htm"}]}