{"id":106984,"name":"Little Medusa","slug":"little-medusa","url":"https:\/\/www.igdb.com\/games\/little-medusa","created_at":1533855739476,"updated_at":1533856057121,"summary":"The game is only available through the company's website in a physical cartridge for the listed platforms. \n \n\"Become a diety with a very bad hair day in this action puzzler. The Titans have escaped their eternal prisons and transformed Artemiza, a young goddess, into a gorgon. Now she must petrify enemies, create paths, and dodge traps in her battle to save Mount Olympus. \n \n- 5 worlds of puzzling petrification! \n- Clash with cenaturs, fallen heroes, and the Titans themselves! \n- Challenging obstacles found in each new area! \n- Solve the puzzles fast enough and unlock a secret world, complete with a new ending to the story!\"","storyline":"\"For centuries, the Olympian gods have ruled the Cosmos with harmony and prosperity, after overthrowing the reign of the Titans, an older race of spiteful deities. While the Olympians hold court and control the fate of mortals, the Titans fester in their prisons deep underground. Now, A new generation of Olympians is coming into their own. The children of Zeus, Hera, Apollo, Athena, Poseidon, and others have begun to take up the duties of their sires. \n \nOne little goddess in particular, Artemiza, is the darling of Mount Olympus, and is destined to rule after Zeus ends his reign. She is intelligent, beautiful, and resourceful, but also quite aware that she is the favorite of the gods, and this has made her quite haughty and vain. \n \nFiora, a goddess of strife and magic, is angered by the smug Olympians doting on their precious Artemiza. Her husband, Kronus was the lord of the Titans, and has been long-imprisoned in another realm. Their separation has stripped Fiora of the chance to have a family of her own. To wreak her revenge, she devises a cruel plan. \n \nShe replaces Artemiza’s mirror with a Gorgon Glass - a Titan artifact which transforms whoever looks through it into a terrifying Medusa! Knowing that Artemiza cannot help but gaze upon her own beauty, it does not take long before the little goddess has a snake problem. \n \nFearing that she has gone missing, the Olympian gods begin to search all of the Cosmos for their darling Artemiza. While they race about, Fiora frees the Titans and their lackeys from their prisons, captures the other little gods and goddesses, and takes the throne of Mount Olympus for her own! Can Artemiza fight her way to the top and reclaim Mount Olympus, or is she destined to have a bad hair day for all eternity?\"","popularity":1,"tags":[1073741827],"developers":[15416],"publishers":[15416],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[35,126,2951,2991,7467,9539],"themes":[1,22],"genres":[9],"first_release_date":1533600000000,"platforms":[29,19,18],"release_dates":[{"category":0,"platform":29,"date":1533600000000,"region":8,"human":"2018-Aug-07","y":2018,"m":8},{"category":0,"platform":19,"date":1533600000000,"region":8,"human":"2018-Aug-07","y":2018,"m":8},{"category":0,"platform":18,"date":1533600000000,"region":8,"human":"2018-Aug-07","y":2018,"m":8}],"videos":[{"name":"Trailer","video_id":"O4l5W8yCrMw"},{"name":"Trailer","video_id":"eDKu2SPGoac"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uesxxajlraqsarukkapv.jpg","cloudinary_id":"uesxxajlraqsarukkapv","width":385,"height":625},"websites":[{"category":1,"url":"http:\/\/games.megacatstudios.com\/little-medusa\/"}]}