{"id":18784,"name":"Clean Sweep","slug":"clean-sweep--1","url":"https:\/\/www.igdb.com\/games\/clean-sweep--1","created_at":1460776809649,"updated_at":1517270918540,"summary":"The player moves a vacuum through a maze in order to suck up dollar bills that are strewn throughout the screen. After several bills are vacuumed up, the vacuum will increase in size. After several size increases, the vacuum will become full and will not be able to vacuum up any more bills, so the money must be deposited in the vault in the center of the screen before the vacuum can start gathering up money again. \n \nRobbers (which look like the player's blaster in the Tempest arcade game) begin appearing, entering via the two escape tunnels (as opposed to Pac-Man's one) that run vertically and horizontally in the maze. If a robber catches the player they will lose a life; run out of lives and the game will end. \n \nAlong with using the escape tunnels (which will warp the vacuum to the opposite end of the maze [i. e. entering an escape tunnel from the bottom will cause the player to reappear at the tunnel entrance at the top of the screen]), there are four special rooms -- one in each corner of the maze -- that the player can enter in order to be able to vacuum up the robbers for a brief time. The robbers will re-emerge from an escape tunnel seconds later though, and any remaining robbers that the player was not able to vacuum up will start blinking, indicating that they are about to return to their previous, dangerous form. \n \nThe difficulty level increases by having the vacuum fill up quicker, causing the player to make multiple trips to the vault during a level.","popularity":1.333333333333333,"games":[25646,51485,36794,34919,36608,37094,23934,16468,27266,40971],"tags":[1,268435465,268435489,536872911,536873246,536880437,1073741827],"developers":[9539],"publishers":[9539],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[1999,2334,9525],"themes":[1],"genres":[9,33],"first_release_date":410140800000,"platforms":[70],"release_dates":[{"category":2,"platform":70,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mikttyrex1ozejz9tw9r.jpg","cloudinary_id":"mikttyrex1ozejz9tw9r","width":1000,"height":1248}}