{"id":28484,"name":"Time Trax","slug":"time-trax","url":"https:\/\/www.igdb.com\/games\/time-trax","created_at":1494188577341,"updated_at":1517270951845,"summary":"Time Trax is an unreleased Sega Mega Drive action game developed by Malibu Interactive and set to be published by Black Perl Software, based on the Time Trax TV series. The Mega Drive version of the game was not widely covered and was largely unheard of until the title screen music by Tim Follin, was released online. Some years later, development documents were acquired and a prototype ROM was released to the general public in July 2013. [1] \n \nIt is not known why the Mega Drive version of the game was cancelled - a Super Nintendo version was released in North America and Europe in early 1994, suggesting the Mega Drive version was originally set to be released around this period. Malibu would be sold to GameTek in the coming months which may explain its disappearance. A different Time Trax was released for the Commodore 64 and ZX Spectrum in 1986. \n \nThe game is notable for its use of a relatively advanced sound driver designed by Dean Belfield for Follin - one which was never used in any other Mega Drive games neither before or since. The SNES version uses an entirely different soundtrack.","popularity":1.333333333333333,"games":[28029,68287,29525,36950,76722,76246,19341,306,64204,17522],"tags":[1,18,268435461,268435465,1073741828],"developers":[11778],"publishers":[11613],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[1,18],"genres":[5,9],"first_release_date":536371200000,"platforms":[15,26,25,27],"release_dates":[{"category":2,"platform":26,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":27,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":15,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12},{"category":2,"platform":25,"date":536371200000,"region":1,"human":"1986","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kyjrq8d7ssffyxvrbpeh.jpg","cloudinary_id":"kyjrq8d7ssffyxvrbpeh","width":1000,"height":1554}}