{"id":42484,"name":"Mystic Ark","slug":"mystic-ark","url":"https:\/\/www.igdb.com\/games\/mystic-ark","created_at":1499074051703,"updated_at":1513086966160,"summary":"Seven heroes from seven different Worlds. Seven heroes who were brought to a mysterious temple on a remote island and transformed into statues. Seven heroes who are chosen to bring harmony back to the universe: Miriene the witch (wizard), Lux the tetsujin (a race of iron people), Reeshina the grappler (monk), Tokio the ninja, Kamio the ogre, and Mesia the priestess. The seventh hero is you, the protagonist of the game - the knight Remeer or the female warrior Ferris. Your first task will be to release your companions from the statues they are locked in. You must travel to the Cat World and to retrieve an important artifact. But your main objective is to visit all the seven Worlds and to find seven mystic arks - the items that will re-unite those Worlds and bring peace to them. \n \n\"Mystic Ark\" is a RPG closely connected to 7th Saga. You travel on overworld map, visit towns, buy equipment, and descend into dungeons. The combat is turn-based and viewed from a third-person \"over-the-shoulder\" perspective. The battles are not random: the enemies can be seen as white dots on your radar, and if you don't want to fight, you can sometimes outrun or avoid them. The game also contains elements of pure adventure: often you must investigate objects closely and use items from your inventory on them.","collection":4765,"popularity":1,"games":[26766,11567,25300,7202,36926,18822,36534,27314,19448,47823],"tags":[17,18,22,268435468,268435487,536870916,536871063,536871076,536871208,536871327,536871878,536871882,536871938,536871939,536872114,536872201,536873111,536874745,536874810,536874830,536874943,536875067,536875075,536875242,536875308,536875380,536875453,536875455,536875472,536875766,536875822,536875934,536876011,536876105,536876232,536876233,536877451,536877554,536878488,536880755,536880968,536885019,536885539],"category":0,"keywords":[4,151,164,296,415,966,970,1026,1027,1202,1289,2199,3833,3898,3918,4031,4155,4163,4330,4396,4468,4541,4543,4560,4854,4910,5022,5099,5193,5320,5321,6539,6642,7576,9843,10056,14107,14627],"themes":[17,18,22],"genres":[12,31],"first_release_date":808358400000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":808358400000,"region":8,"human":"1995-Aug-14","y":1995,"m":8}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b4zv3luohfamcygb8ne7.jpg","cloudinary_id":"b4zv3luohfamcygb8ne7","width":640,"height":1192}}