{"id":13874,"name":"Heart of Africa","slug":"heart-of-africa","url":"https:\/\/www.igdb.com\/games\/heart-of-africa","created_at":1445285670692,"updated_at":1520022307541,"summary":"In Heart of Africa, the unofficial follow-up to The Seven Cities of Gold, you play the part of an adventurer who is to continue a quest started by another explorer, Hiram Primm whose expedition has been reported missing while looking for the lost tomb of Pharaoh Ahnk Ahnk. Find the tomb and you will stand to be the sole beneficiary to Primm’s estate. The only information that you have to go by is Primm’s unpublished paper on the legend of Ahnk-Ahnk and his African diary. \n \nThe quest begins near a large port town and here you can find stores which will allow you to purchase items which are necessary like ropes and shovels. You start the quest with only $250. Use the map provided to find important landmarks and locations which the natives may name when giving you directions. The natives hold the key to your success. Not all natives behave the same to strangers. Offer them gold, copper, or other gifts to win their friendship. But be careful, not all natives see your offering as a sign of friendship. They each have their own cultures. Presenting them with the wrong gift may hinder your attempts to get needed information. \n \nUse the joystick to move about, press the fire button when you are standing still to move control to the four icons to the left of the exploration window. Click these icons for further options. The diary icon lets you page through your diary to review the clues that you get from the native chiefs. The map icon lets you see what you have explored so far. The options icon offers three choices. Two let you check on your location and condition. The third lets you drop things off to form a cache. The hand icon lets you select what you have in your hand and it lets you use items from your backpack. If you are delirious, your joystick control will become uncertain, reversed or randomized. \n \nGo to a pub in a port city to save your game. You can save up to 10 different games at once on a single disk. Each time that you start a new game, the location of the tomb and other valuables is subject to change.","popularity":1.333333333333333,"games":[28289,19301,11423,59516,13189,76731,29173,25222,36543,25311],"tags":[21,31,268435471,268435480,268435487,536871939,536874694,536875142,1073741827],"developers":[5125],"publishers":[1],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[1027,3782,4230],"themes":[21,31],"genres":[15,24,31],"first_release_date":504835200000,"platforms":[15],"release_dates":[{"category":2,"platform":15,"date":504835200000,"region":2,"human":"1985","y":1985,"m":12}],"videos":[{"name":"Gameplay video","video_id":"9Zov6Ir76DI"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tfq7o4kcoosdfa2c3zte.jpg","cloudinary_id":"tfq7o4kcoosdfa2c3zte","width":1000,"height":972}}