{"id":1774,"name":"Rockman EXE Operate Shooting Star","slug":"rockman-exe-operate-shooting-star","url":"https:\/\/www.igdb.com\/games\/rockman-exe-operate-shooting-star","created_at":1352061085490,"updated_at":1543290642272,"summary":"Rockman.EXE Operate Shooting Star is a game released on November 12, 2009 for the Nintendo DS in Japan. It is an advanced port of the first Mega Man Battle Network game with some extras, including a crossover with the Mega Man Star Force series.\nCapcom currently has no plans for a release outside of Japan.","storyline":"The game has the same story of the original, the only difference being the addition of two events related to the Mega Man Star Force series:\n\nIn the prologue, Harp Note is kidnapped by ClockMan.EXE (a NetNavi able to travel through time by creating warp holes), who escapes to the Mega Man Battle Network era 200 years in the past. Dr. Goodall prepares a warp hole to allow the Star Force Mega Man to follow them, and warns him that he can only return to his time if he finds ClockMan.\n\nAfter the battle against ElecMan.EXE, ClockMan captures Roll.EXE, and MegaMan.EXE searches for her in the Internet after hearing that a strange blue Navi was around the area at the time. When he sees the Star Force Mega Man, MegaMan.EXE believes he is the one who captured Roll and fights against him, but later realize that he is innocent and the two join forces to fight against ClockMan. After defeating ClockMan, Mega Man (SF) and Harp Note return to their time, and Mega Man (SF) gives MegaMan.EXE a program that allows the player to use him and his Battle Chip.\n\nAn additional scene was added during the credits showing the Star Force Mega Man and Harp Note successfully return to their timeline where they are greeted by their friends although Luna was not too fond to see the two of them together.","collection":340,"franchise":38,"franchises":[38],"popularity":1.666666666666667,"games":[49414,25636,109463,103303,51213,90099,103337,25311,15452,104236],"tags":[18,268435468],"developers":[37],"publishers":[37],"category":0,"themes":[18],"genres":[12],"first_release_date":1257984000000,"platforms":[20],"release_dates":[{"category":0,"platform":20,"date":1257984000000,"region":5,"human":"2009-Nov-12","y":2009,"m":11}],"alternative_names":[{"name":"ロックマンエグゼ オペレート シューティングスター"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kfviftvl6dprcsnaqnv2.jpg","cloudinary_id":"kfviftvl6dprcsnaqnv2","width":256,"height":384},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tjaqncyghlscmcjqm2ij.jpg","cloudinary_id":"tjaqncyghlscmcjqm2ij","width":259,"height":388}],"videos":[{"name":"Gameplay video","video_id":"E_vyHFWf0cA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/logvyroyxiuxqfp7a2eu.jpg","cloudinary_id":"logvyroyxiuxqfp7a2eu","width":533,"height":480},"websites":[{"category":2,"url":"http:\/\/megaman.wikia.com\/wiki\/Rockman.EXE_Operate_Shooting_Star"}]}