{"id":2474,"name":"Claw","slug":"claw","url":"https:\/\/www.igdb.com\/games\/claw","created_at":1373054946123,"updated_at":1548025921749,"summary":"Join forces with Captain Claw, the greatest cat pirate ever to challenge the Cocker Spaniard Armada! Embark on an epic quest to recover the lost gems of the Amulet of Nine Lives. Uncover hidden treasure, navigate tricky terrain, and engage in armed combat to defeat the enemies of the courageous and legendary Captain Nathaniel J. Claw.","storyline":"The story is similar to many pirate films, games and other sources: a famous cat pirate, Captain Nathaniel Joseph Claw, is imprisoned by the Cocker-Spaniards (a dog species, a pun on Cocker Spaniel) after they attack and sink his ship. In the prison cell, waiting for his execution, he finds a note and a map hidden in the wall, signed as Edward Tobin, in which he learns about the Amulet of Nine Lives—a mystical artifact that grants its wearer near-immortality. Breaking out of his cell, Claw sets out to collect all 9 gems of the amulet and retrieve it for himself.  \nThe game begins with Claw outside his cell. As he progresses through the prison, he eventually gets to the outer wall and escapes to the forest before defeating the warden, LaRauxe. In the forest, he encounters a gang of thieves, headed by his former love interest, Katherine. He manages to defeat them and finds his way out of the forest, and into the nearby port town, where he is hunted down by the mayor, Wolvington, and the city guard.  \nAfter running through the city, escaping the guards, and defeating Wolvington himself, the Captain stumbles into a bar and overhears a conversation between two of the crew of Captain Red Tail, a tiger who is Claw's arch enemy. He learns from them that Red Tail is looking for the gems of the amulet as well, and that Red Tail's first mate, Gabriel, has one of them in his possession. He also hears Red Tail himself might have more.  \nClaw quickly makes his way through the port and jumps on Red Tail's ship, where he defeats the seamen (Gabriel among them) and hides in the ship until it sets port near the Pirate's Cove. Claw goes through the ancient temples of the pirate cove, defeating the pirates and their leader, a Pirate who used to be a close friend of Claw, Marrow, before descending into the caverns, where he meets his old crew (presumed dead after the attack on his ship).  \nClaw finds that they were given three gems by a merchant in a Tavern, two of which were taken by Red Tail who already set sail to the legendary Tiger Island. The crew also shows claw a piece of map the merchant gave them, showing a path to the Island through a labyrinth of underwater caverns.  \nThe Captain decides to descend down the caverns, where he finds a race of mermaids and mermen, who fight him in order to defend their queen, a giant frog-like creature called Aquatis. He manages to defeat Aquatis with explosives.  \nClaw resurfaces to face Red Tail and his crew on tiger Island. After managing to bring Red Tail down and acquiring the final two gems, Claw goes to the Tiger Temple at the heart of the island, to find the amulet. There he fights the well-trained tiger guards, avoids the many death traps in the lava-filled temple, and defeats Omar, the captain of the tiger guard, who holds the last (and largest) gem.  \nClaw places the gems on a pedestal. They rearrange themselves and the ghost of a princess comes and gives him the amulet, granting him 9 lives, after summarising his adventure. The final scene shows him leaving on his ship with the amulet, his crew, and Omar with him.","collection":815,"rating":84.590716302775,"popularity":2.333333333333333,"aggregated_rating":60,"aggregated_rating_count":1,"total_rating":72.29535815138749,"total_rating_count":21,"rating_count":20,"games":[43165,35371,9243,24426,26553,55038,29032,2040,68441,35994],"tags":[1,17,22,268435464,268435469,268435487,536870916,536870990,536871138,536871139,536871906,536871938,536872060,536872257,536872847,536872961,536875042,536875058,536875059,536875130,536875241,536875282,536875305,536875311,536875572,536875792,536876261,536879950,536880423,536880568,1073741828],"developers":[863],"publishers":[407,215],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[4,78,226,227,994,1026,1148,1345,1935,2049,4130,4146,4147,4218,4329,4370,4393,4399,4660,4880,5349,9038,9511,9656],"themes":[1,17,22],"genres":[8,13,31],"first_release_date":875577600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":875577600000,"human":"1997-Sep-30","y":1997,"m":9}],"alternative_names":[{"name":"Captain Claw"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uhwpmbfulgf0vqtxoia8.jpg","cloudinary_id":"uhwpmbfulgf0vqtxoia8","width":496,"height":372},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tjsib47lxphxgxazwe69.jpg","cloudinary_id":"tjsib47lxphxgxazwe69","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ggbeta5qdujoyaebaanp.jpg","cloudinary_id":"ggbeta5qdujoyaebaanp","width":640,"height":480}],"videos":[{"name":"Gameplay video","video_id":"nsY3Lt5vJwk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/urcbxd1uzsbrzz1wkpw7.jpg","cloudinary_id":"urcbxd1uzsbrzz1wkpw7","width":256,"height":308},"esrb":{"synopsis":"","rating":3},"websites":[{"category":1,"url":"http:\/\/www.lith.com\/Games\/Captain-Claw"}]}