{"id":25574,"name":"Motor Mania","slug":"motor-mania","url":"https:\/\/www.igdb.com\/games\/motor-mania","created_at":1478139695385,"updated_at":1517270864011,"summary":"Motor Mania is a top view driving game where the screen scrolls vertically upwards as you try to drive your racing car for as many miles as you can. Starting at a gas station you are able to control your speed up to 80mph, brake and move left or right as you avoid other drivers and various obstacles. There are three types of roads to drive on and they are motorway, b-road and dirt and you must avoid hitting the sides and drivers or you lose one of five lives. On the side of the playing area are various dials and these are speedometer, fuel which decreases as you drive, and generator which shows your battery power and decreases if you don't drive full speed. You can also see your mileage driven, lives and if you have your spare tyre. \n \nObstacles you encounter affect different aspects of your car and these are potholes which cause your steering to be erratic, road patches which slow you down, avalanches which means hitting a boulder loses you a life, and you will also encounter crossroads with vehicles moving across the screen which need avoiding. Broken glass means you will stop and your tyre will have to be changed with only one spare tyre, and logs will damage your radiator causing your car to overheat. Gas Stations appear occasionally and here you can refuel, fix your radiator and increase your battery power.","popularity":1.333333333333333,"games":[28856,36608,40470,55192,34919,78315,77742,76119,74758,74016],"tags":[1,268435466,536875069,1073741827],"developers":[10894],"publishers":[1292],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[4157],"themes":[1],"genres":[10],"first_release_date":410140800000,"platforms":[15],"release_dates":[{"category":2,"platform":15,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c13yrsbwmukxutwpedxo.jpg","cloudinary_id":"c13yrsbwmukxutwpedxo","width":1000,"height":1307}}