{"id":26274,"name":"Sanctum: Map Pack 1","slug":"sanctum-map-pack-1","url":"https:\/\/www.igdb.com\/games\/sanctum-map-pack-1","created_at":1481121786080,"updated_at":1481125133611,"summary":"This DLC adds four additional maps for Sanctum. The maps included are: Aftermath, Aftershock, Cavern and Slums.","storyline":"Aftermath\r\nThings haven't gone quite as planned. What begun as a minor annoyance has since blossomed into a full-fledged threat. In spite of the military's questionable (Four soldiers? Really? Was there a budget cut?) efforts, Elysion One has been swarmed over by the mysterious aliens that Skye first encounters. Fortunately, however, the aliens have yet to discover that the terrified bipedal creatures running about underfoot are edible. \r\n\r\nYet.. It's the aftermath of the alien invasion but there's still time. Skye and her friends must keep what remains of Elysion One safe while reconstruction begins in earnest. Can you survive the Aftermath or will the extra-terrestrials finally discover that the populace is crunchy and tastes good with ketchup?\r\n\r\nAftershock\r\nIn spite of the military's best, under-funded efforts, Elysion One has been overrun. Things couldn't possibly get any worse, right? Wrong. For the first time in recorded history, Elysion One was hit by an earthquake, an unfortunate catastrophe that left reclamation efforts at a stand-still. But that's not what has everyone worried. It's the aftershocks. They're happening with surprising regularity. More disturbingly, they seem to be getting more intense. Will this build into another earthquake? Some say yes while others claim that it might be something else entirely.. But that's not important to Skye and her friends. What matters is that monthly paycheque and the swarm of aliens that have discovered the underground facilities. Can you keep them at bay while they cut down the bridges? Will you be Elysion One's Horatius at the bridge?\r\n\r\nCavern\r\nAfter the initial onslaught, a decision was made to take the subterranean rescue efforts, to somewhere free of the alien infestation. Scientists had recently discovered that the strange lifeforms that had been assaulting Elysion One would only venture so far into the earth. While this is good and all, there remains one small problem: someone has to keep them at bay while the operation is moved deeper into the earth. Guess who will be part of the lucky battalion?\r\n\r\nSlums\r\nElysion One was not the first city on this planet. Built on the bones of the original settlement, Elysion One was a soaring white and turquoise edifice constructed in defiance of the elements. As you might have noted, 'was' is the operative word here. Besieged by aliens, some of the residents have taken to a ship moored in the distant quarters of the Slums. Unfortunately, it seems that the enemies have followed. Can you keep them at bay while the civilians evacuate?","popularity":1,"game":3183,"tags":[1073741825],"developers":[999],"publishers":[999],"game_engines":[351],"category":1,"player_perspectives":[1],"game_modes":[1,2,3],"themes":[18],"genres":[5,15,32],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jhombtodpqbl2mxfspux.jpg","cloudinary_id":"jhombtodpqbl2mxfspux","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/txutvdy0v1d6ouv7l9a6.jpg","cloudinary_id":"txutvdy0v1d6ouv7l9a6","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zqty12yyqgjraysqxsks.jpg","cloudinary_id":"zqty12yyqgjraysqxsks","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kmhoguvx6rqor0ktqmjs.jpg","cloudinary_id":"kmhoguvx6rqor0ktqmjs","width":1920,"height":1080}],"websites":[{"category":1,"url":"http:\/\/www.coffeestainstudios.com\/games\/sanctum\/"}]}