{"id":28474,"name":"Gribbly's Day Out","slug":"gribblys-day-out","url":"https:\/\/www.igdb.com\/games\/gribblys-day-out","created_at":1494168251085,"updated_at":1517270951317,"summary":"Blabgorians possess the gift of psychic ability which allow them to levitate and move items with their minds, as a result they evolved without hands (who needs them?), a single foot (good for bouncing) and an oversized head (handy for containing large quantities of psychic energy). Gribbly Grobbly is your typical Blabgorian, and is tasked with the safety of the 'gribblets'. 'Gribblets' are infant Blabgorians; they have an armoured shell to protect them, but when flipped on their backs they expose their vulnerable belly and are unable to right themselves. They also have an annoying tendency to leave the safety of home in search of adventure. Unfortunately Blabgor is not a safe place; there are hordes of beasts roaming the landscape, eagerly searching for vulnerable Gribblets. \n \nThe basic premise for the game required the player to control Gribbly and navigate him through each of the 16 surreal 8-way scrolling landscapes in an attempt to locate and rescue eight baby Gribblets and returning them to the safety of the home cave. Gribbly can hop and levitate around each of the levels and can blow bubbles to defend himself. Once a Gribblet is located, Gribbly can pick up the hapless offspring and carry it to safety. Once only a single Gribblet remains on a level, the energy web fails, freeing Seon. This usually results in a mad rush to get the remaining Gribblet to safety before succumbing to his attacks. Once all the Gribblets are either saved or killed, the level ends and Gribbly is transported to the next level.","popularity":1.333333333333333,"games":[10039,51485,1070,28029,76246,19341,24199,1073,76229,32902],"tags":[1,268435461,268435464,268435489,1073741828],"developers":[8107],"publishers":[3715],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[1],"genres":[5,8,33],"first_release_date":504835200000,"platforms":[15],"release_dates":[{"category":2,"platform":15,"date":504835200000,"region":1,"human":"1985","y":1985,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cwqxrgc2scmq9o3rfjdx.jpg","cloudinary_id":"cwqxrgc2scmq9o3rfjdx","width":1000,"height":1574}}