{"id":51274,"name":"Nuclear Strike","slug":"nuclear-strike","url":"https:\/\/www.igdb.com\/games\/nuclear-strike","created_at":1500063188630,"updated_at":1548757633773,"summary":"Nuclear Strike is a shooter video game developed and published by Electronic Arts for the PlayStation in 1997. The game is the sequel to Soviet Strike and the fifth instalment in the Strike series, which began with Desert Strike on the Sega Genesis. The Soviet Strike development team also created Nuclear Strike. EA released a PC port the same year; THQ developed and in 1999 published a Nintendo 64 version called Nuclear Strike 64. \n \nNuclear Strike is a helicopter-based game, with strategy elements added to the action gameplay. The plot concerns an elite special force - the player's allies - pursuing a nuclear-armed rogue spy through a fictionalised Asian setting. It retained the earlier game's engine but added several modifications to improve graphical performance and make the game more accessible. The game features 15 playable vehicles, a large increase from previous games. In addition to the main fictionalised Apache, there are secondary helicopters, jets, armour and a hovercraft. The player also commands ground troops in occasional real-time strategy sections. \n \nThe game received positive, negative and mixed reviews. Critics noted a weak storyline, though GameSpot dismissed this is as unimportant in an action game. GameSpot called the graphics - which made use of specialised hardware such as 3Dfx Voodoo video cards and the N64 Expansion Pak - \"about as good as it gets\", while Allgame said they are \"decent\" and Daily Radar called them \"horrible\". Critics praised the full motion video as well as the music and sound effects. Reviewers enjoyed the straightforward gameplay but several complained of a close similarity to its predecessor Soviet Strike and questioned the game's value as a result.","collection":5029,"popularity":1,"games":[14758,8422,28751,18088,68106,14206,77956,64311,13524,649],"tags":[1,536870913,536870933,536870937,536871213,536873999,536874539,536874743,536875171,536875309,536875361,536875426,536875688,536876378,536876412,536876990,536878439,536880233,536880441,536881200,536883622,536883633,536884031,536884033],"category":0,"keywords":[1,21,25,301,3087,3627,3831,4259,4397,4449,4514,4776,5466,5500,6078,7527,9321,9529,10288,12710,12721,13119,13121],"themes":[1],"first_release_date":880934400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":880934400000,"region":8,"human":"1997-Dec-01","y":1997,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1iyp.jpg","cloudinary_id":"co1iyp","width":800,"height":996},"esrb":{"rating":5}}