{"id":674,"name":"Dungeons & Dragons: Dragonshard","slug":"dungeons-dragons-dragonshard","url":"https:\/\/www.igdb.com\/games\/dungeons-dragons-dragonshard","created_at":1317748799000,"updated_at":1547940090145,"summary":"Dungeons & Dragons: Dragonshard is a real-time strategy role-playing video game, developed for Microsoft Windows by Liquid Entertainment, and published by Atari in 2005. It takes place in Eberron, one of the official Dungeons & Dragons campaign settings. The game combines elements of traditional real-time strategy gameplay with role-playing elements such as hero units, and questing. Dragonshard includes two single-player campaigns, single-player skirmish maps, and multiplayer support. The single-player campaign follows the struggles of three competing factions to gain control of a magical artifact known as the Heart of Siberys. \n \nAlthough Dragonshard was billed by Atari as \"the first Dungeons & Dragons real-time strategy experience,\"[2] Stronghold (1993) precedes it by over a decade.[3]","storyline":"Dragonshard takes place in the world of Eberron. In the creation myth of Eberron, the dragon Khyber warred with his sister Siberys and shattered her body to pieces. In his anger, Khyber's brother Eberron wrapped him in his coils, trapping Khyber. The bodies of the three dragons became the three parts of Eberron's world: the surface Eberron, the Ring of Siberys that encircles Eberron, and the underworld of Khyber. The three world parts produce dragonshards, crystal and rock fragments imbued with magic power.\n\nThe Heart of Siberys is the largest dragonshard in Eberron. When it fell from the Ring of Siberys to the continent of Xen'drik, it created a storm-swept mountain range known as the Ring of Storms and caused a city to sink into the earth. Its immense magical force caused the natural creatures of the Ring of Storm to evolve into the Lizardfolk. To this day, the Heart draws factions into conflict over control of its power.\n\nIn addition to the playable races, Eberron is populated by a number of neutral non-player factions and creatures, including the illithids, longtime foes of the Umbragen, a host of golems constructed by an extinct elven race, ettins, and thri-kreen.\n\nDragonshard is the first video game set in the D&D campaign setting of Eberron. Eberron's creator Keith Baker wrote the storyline for Dragonshard. However, some discrepancies exist between the game and the canonical Eberron Campaign Setting. Siberys dragonshards should be gold in color, but they are blue in the game. Building new warforged is forbidden under the Treaty of Thronehold that ended the Last War — the only sources for new warforged are Merrix d'Cannith's illegal forge in Sharn and the Lord of Blades' forge in the Mournland. In the game, however, the Order faction can build Warforged Titans.","collection":830,"franchise":43,"franchises":[43],"popularity":2,"aggregated_rating":70,"aggregated_rating_count":1,"total_rating":70,"total_rating_count":1,"games":[7615,27092,28182,26553,19404,9472,14394,25921,18398,26940],"tags":[17,268435468,268435471,536871139,536871208,536871938,536872074,536874694,536875265,536875525,536875531,536875778,536875803,536875887,536876301,536878355,536878494,536883035,536884022,1073741827],"developers":[474],"publishers":[82],"category":0,"player_perspectives":[3],"game_modes":[1,2,3],"keywords":[227,296,1026,1162,3782,4353,4613,4619,4866,4891,4975,5389,7443,7582,12123,13110],"themes":[17],"genres":[12,15],"first_release_date":1127260800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1127260800000,"human":"2005-Sep-21","y":2005,"m":9}],"videos":[{"name":"Gameplay video","video_id":"R3tPdGvPDi8"},{"name":"Trailer","video_id":"9oX0jhJh3t4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pvtwiizyorxanowndgyy.jpg","cloudinary_id":"pvtwiizyorxanowndgyy","width":701,"height":940},"esrb":{"rating":5},"websites":[{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/Dungeons_%26_Dragons:_Dragonshard"}]}