{"id":84774,"name":"B.O.B.","slug":"bob--1","url":"https:\/\/www.igdb.com\/games\/bob--1","created_at":1517339927694,"updated_at":1536936477490,"summary":"B.O.B. (known in Japan as Space Funky B.O.B.) is a video game that was released in 1993. It is a side-scrolling game, a 2D shooter and a platform game.","storyline":"When B.O.B. crashes his dad's space car on the way to pick up his date, he finds himself stranded on a hostile asteroid filled with enemies. By collecting power ups and using fast reflexes, B.O.B. tries to find his way off the asteroid and to his date. B.O.B. fights his way through three strange worlds in total, encountering several particularly enormous or swift enemies (bosses) along the way, and participating in several cart-race levels. There were several different types of setting for each level, including domed space colony cities, large alien hive-type areas, strange biomechanical facilities, ancient (and apparently haunted) temples and cavernous magma chambers. Some of these settings only appeared on certain worlds. \n \nAt the end of each world, B.O.B manages to discover a new space-car to allow him to continue on his journey. The first two both fail him under comical circumstances, resulting in him becoming trapped on an entirely new alien world. With the final car, B.O.B. is at last able to meet up with his date, who is revealed to be a large, blue female robot with a huge mouth, who harshly berates B.O.B. for his tardiness. As she is yelling at him, a slender red female robot flies past them on a space surfboard. B.O.B., frustrated with his obnoxious date, declares \"That's the girl for me!\" and drives off in pursuit of the red female. The game ends with a shot of B.O.B. and his new date sitting on a small asteroid together, staring out at the beauty of the cosmos in silence. Behind them, B.O.B.'s car (in the backseat of which his date had stashed her surfboard) stalls and drifts off into space, presumably leaving them stranded together but neither of the lovers seem to notice.","hypes":1,"popularity":1.666666666666667,"games":[28029,306,103298,95340,10039,90099,105269,68287,103281,55038],"tags":[1,18,268435461,268435464,1073741828],"developers":[483,15300],"publishers":[1],"category":0,"player_perspectives":[4],"game_modes":[1],"themes":[1,18],"genres":[5,8],"first_release_date":757296000000,"platforms":[19],"release_dates":[{"category":2,"platform":19,"date":757296000000,"human":"1993","y":1993,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lxofptan0b0ejbrde4zq.jpg","cloudinary_id":"lxofptan0b0ejbrde4zq","width":236,"height":218}],"videos":[{"name":"Gameplay video","video_id":"fH99DKf0zNk"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ziguilkz6wbcmlrgowyp.jpg","cloudinary_id":"ziguilkz6wbcmlrgowyp","width":245,"height":179},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/B.O.B._(video_game)"}]}