{"id":87574,"name":"FarmVille: Tropic Escape","slug":"farmville-tropic-escape","url":"https:\/\/www.igdb.com\/games\/farmville-tropic-escape","created_at":1518801618128,"updated_at":1521144758390,"summary":"Escape to an island getaway filled with adventure, mystery, and fun new mini games from the makers of FarmVille, the number one farming franchise! Play this colorful free-to-play game, now available for iPhone, iPad, and iMessage app.\n\nBuild your very own beachside inn complete with island workshops, tropical crops, and exotic animals. Farm island fruits like pineapples, coconuts, and mangos to delight your guests. Craft delicious recipes and rare goods like piña coladas, grilled fish, and flower leis. \n\nCatch fish with Capri the dolphin and explore with Odney the playful monkey! Feed tasty treats to the cute, playful animals on your island to get unique photo ops for your guests. Story-based quests help you explore uncharted areas, learn more about your island and find rare items and goods. \n\nAdventure unfolds all around your island! \n\nESCAPE TO THE TROPICS \n- Seek adventures on your very own tropical island \n- Farm unique fruits and veggies, craft fun drinks and meet adorable animals \n- Discover all of the tropical crops and exotic animals that call your island home \n- Run a beachside inn and start a new life in paradise \n- Play mini games and have fun with new characters like Ting \n\nUNCOVER MYSTERY, SECRETS AND TREASURES \n- Complete story-based quests with island guides like the archaeologist and surfing expert \n- Explore the bubbling volcano and ancient monkey temple \n- Discover hidden treasures and rare goods in the secret chamber \n- Investigate uncharted areas to find even more island secrets \n\nBUILD AMENITIES FOR YOUR GUESTS \n- Fix up island workshops and create your own personal paradise \n- Buy a Tiki Bar, Sushi Stand, Artisan Workshop and more \n- Expand your inn and hire guides to help your guests enjoy the island \n\nDISCOVER AND PHOTOGRAPH ADORABLE ANIMALS FOR REWARDS \n- Build a Wildlife Center on your island with the help of Ting, the wildlife guide\n- Attract rare and exotic animals to your island like the colorful Iguana by feeding them treats \n- Earn rewards by snapping photos of the animals as souvenirs for your guests \n\nTRADE WITH OTHER ISLANDS \n- Trade with other players using the trade boat \n- Short on eggs? Buy the goods you need from neighboring islands \n- Have too many pineapples? Name your price and sell off extra crops and crafts \n- The more coins you have, the more you can do on your island \n\nEscape to a shimmering world of sunshine, adventure and fun in FarmVille: Tropic Escape! Download today and start building your island paradise! \n\nADDITIONAL DISCLOSURES\n• For specific information about how Zynga collects and uses personal or other data, please read our privacy policy at http:\/\/www.zynga.com\/privacy\/policy.• This game does permit a user to connect to social networks, such as Facebook, and as such players may come into contact with other people when playing this game. Social Networking Service terms may also apply.• The game is free to play, however in-app purchases are available for additional content and premium currency. In-app purchases range from $0.99 to $99.99.• You will be given the opportunity to participate in special offers, events, and programs from Zynga Inc and its partners. Use of this application is governed by the Zynga Terms of Service, found at http:\/\/m.zynga.com\/legal\/terms-of-service. Collection and use of personal data are subject to Zynga’s Privacy Policy, found at http:\/\/www.zynga.com\/privacy\/policy.","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[44242,28465,34919,33603,36962,55888,65827,75102,43130,28277],"tags":[268435469,536872030],"category":0,"keywords":[1118],"genres":[13],"first_release_date":1471996800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1471996800000,"region":8,"human":"2016-Aug-24","y":2016,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hveksk34kevlxq6hhvrz.jpg","cloudinary_id":"hveksk34kevlxq6hhvrz","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvfbrmy06dcrw8ctf8wx.jpg","cloudinary_id":"yvfbrmy06dcrw8ctf8wx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qchdn7gbf9h7hxbgqwjq.jpg","cloudinary_id":"qchdn7gbf9h7hxbgqwjq","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwu8zuxbumydujtydt5h.jpg","cloudinary_id":"vwu8zuxbumydujtydt5h","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mcrsgfhhi6de7c3ysspp.jpg","cloudinary_id":"mcrsgfhhi6de7c3ysspp","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lmonpwimp0vrja2dgzs2.jpg","cloudinary_id":"lmonpwimp0vrja2dgzs2","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gyy02aihids2azswndav.jpg","cloudinary_id":"gyy02aihids2azswndav","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c1hf6wktjjeddc9ecxpc.jpg","cloudinary_id":"c1hf6wktjjeddc9ecxpc","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kwyzfvjhlcorycqauiwt.jpg","cloudinary_id":"kwyzfvjhlcorycqauiwt","width":405,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nadm9iab1y8ofw1ihjv8.jpg","cloudinary_id":"nadm9iab1y8ofw1ihjv8","width":405,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/voncfar7h0sc8nujfrl8.jpg","cloudinary_id":"voncfar7h0sc8nujfrl8","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/farmville-tropic-escape\/id1085899628?mt=8&uo=4"}]}