{"id":13079,"name":"Sleepwalker","slug":"sleepwalker","url":"https:\/\/www.igdb.com\/games\/sleepwalker","created_at":1443296413916,"updated_at":1516161820719,"summary":"The game centres on a boy called Lee and his faithful dog Ralph. We're introduced to Lee from the dog's perspective after waking up to find his owner sleepwalking through his bedroom window. Ralph leaps after him and the player then takes control of what happens next. \nThroughout the game Lee will relentlessly walk in the direction he is facing, the problem is there are objects and pitfalls in his path that can ultimately wake him up or even kill him. The player can monitor Lee's sleep level with a bar at the top of the screen. If the bar reaches zero, Lee wakes up and the player loses a life. If this happens three (or five depending on settings) times the game is lost. \nThe player controls Ralph the dog in order to manipulate either Lee, or the objects he is likely to walk into, to see him safely to the end of a level. The frequency of these pitfalls increases as each level progresses and, as it does, the player has to spend more time strategically neutralising threats, far in advance of Lee's actual position in the level. \nAlthough it is possible for Lee to die, resulting in a loss of life and restart of the level for the player, Ralph is invincible, surviving otherwise fatal incidents with comedic effect. \nIf all the levels are successfully completed Lee finally returns to his bed and crawls back in.","popularity":1.333333333333333,"games":[24426,20342,55173,56033,103339,14741,19001,28070,90113,19241],"tags":[27,268435464,268435465,536871049,536871262,536872257,536872961,536875050,536875073,536875075,536875439,536875688,536876120,536878596,536882660,1073741828],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[137,350,1345,2049,4138,4161,4163,4527,4776,5208,7684,11748],"themes":[27],"genres":[8,9],"first_release_date":757296000000,"platforms":[114,16,15],"release_dates":[{"category":2,"platform":16,"date":757296000000,"human":"1993","y":1993,"m":12},{"category":2,"platform":114,"date":757296000000,"human":"1993","y":1993,"m":12},{"category":7,"platform":15,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nl4ci3tuoel4xyefu0lq.jpg","cloudinary_id":"nl4ci3tuoel4xyefu0lq","width":620,"height":326}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fzf636qsxtyxan2wkqum.jpg","cloudinary_id":"fzf636qsxtyxan2wkqum","width":640,"height":813}}