{"id":40179,"name":"Hard Head","slug":"hard-head","url":"https:\/\/www.igdb.com\/games\/hard-head","created_at":1498475707792,"updated_at":1516701230222,"summary":"Although the official Title Hard Head was the same in every region, SunA's second game used to be known in Korea as \"Jjanggu Baksa\" (Dr. Bulgehead)3. It is incredible how many elements from other games are squeezed into a surprisingly fun melange platformer. Hard Head (and his twin in 2-player mode) carries a bubble gun that encloses enemies into bubbles, which can then be used as trampoline, just like in Bubble Bobble. Similar to Super Mario Bros, items are gained from blocks by jumping at them with the hero's head, while enemies are defeated by stepping on theirs. Then there's passages where one has to break through walls by using a hammer, which is very reminiscent of Wrecking Crew. \n \nHowever, other than with contemporary titles of home entertainment companies like Clover and Zemina, the designer (who sadly isn't credited at all) had also a few quite unique ideas, like working musical instruments used as platforms, a football that can be found in every stage and kicked through a goal at the level end for extra points. There even is a day\/night change hinted at through pallette rotation of the mostly monocoloured background. The game has a time limit, but rather than just killing the player off when it runs out, more and more evil suns come attacking the player already when only little time is left. \n \nThe game can be enjoyed by two players simultaneously, who can use each other's head as a springboard to reach higher places without relying on nearby enemies. Only in the second half the game tends to get a bit tedious, as there's almost no new elements introduced after the middle, and those from the early stages grow old fast because of their steady repetition. Less interesting is also the music, which is mostly snatched together from various classical pieces.","collection":3067,"popularity":1.666666666666667,"games":[55752,10039,1070,36868,19174,51485,26848,1073,26761,34919],"tags":[1,268435464,536872961,536875072,536875073,536875131,536875433,536876952,1073741828],"developers":[13570],"publishers":[13570],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[2049,4160,4161,4219,4521,6040],"themes":[1],"genres":[8],"first_release_date":570672000000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":570672000000,"region":2,"human":"1988-Feb-01","y":1988,"m":2}]}