{"id":42079,"name":"1943: Kai","slug":"1943-kai","url":"https:\/\/www.igdb.com\/games\/1943-kai","created_at":1499068170871,"updated_at":1516670856706,"summary":"Developed and released alongside the Family Computer version, 1943 Kai: Midway Kaisen is an arcade game, an \"alternate\" version of the original 1943, released in 1987[3] only in Japan. Most of the graphics and sounds have been reworked, and the game has been made more \"extreme\" (laser-firing WWII planes and ships that run on ground). Further, the trademark P-38 has been replaced with a Boeing Stearman E75 N68828. \n \nIn 1991, this version was converted to the PC Engine as simply 1943 Kai, again Japan-only; this version itself contains many additional levels and original music. \n \nThe game is set in the Pacific theater of World War II, off the coast of the Midway Atoll. The goal is to attack the Japanese air fleet that bombed the American aircraft carrier, pursue all Japanese air and sea forces, fly through the 16 stages of play, and make their way to the Japanese battleship Yamato and destroy her. 11 of these stages consist of an air-to-sea battle (with a huge battleship or an aircraft carrier as the stage boss), while 5 stages consist of an all-aerial battle against a squadron of Japanese bombers with a mother bomber at the end. \n \nAs in 1942, players pilot a P-38 Lightning. Controls are also similar: button 1 fires main weapons, and button two performs two special actions: a loop maneuver like in 1942, or one of three special attacks in exchange for some of the player's fuel. Indeed, players now have only one life, in the form of a large \"fuel\" meter; constantly depleting, but refillable by collecting various powerups (chiefly \"Pow\" icons). In 2-player mode, when both players overlap their planes on screen, the energy bar can be transferred from the player with more fuel to the player with less. Destroying a complete formation of red enemy planes will result in a power-up, such as a health boost or a new main weapon. \n \nThere are cheat codes, different for every stage, ranging from holding down a fire button or pointing the joystick in certain direction, player(s) are rewarded with fully upgraded weapons.","popularity":1.333333333333333,"games":[26766,68287,36950,46611,27314,64204,28029,11253,25300,10209],"tags":[18,268435461,536871078,536871882,536872617,536873064,536874398,536874743,536874745,536875075,536875151,536875822,536876008,536876016,536876120,536876506,536876634,536876872],"category":0,"keywords":[166,970,1705,2152,3486,3831,3833,4163,4239,4910,5096,5104,5208,5594,5722,5960],"themes":[18],"genres":[5],"first_release_date":539136000000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":539136000000,"region":8,"human":"1987-Feb-01","y":1987,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i5snzbnk3t3aqdvjfz9c.jpg","cloudinary_id":"i5snzbnk3t3aqdvjfz9c","width":256,"height":192}}