{"id":42579,"name":"Ultraman: Towards the Future","slug":"ultraman-towards-the-future","url":"https:\/\/www.igdb.com\/games\/ultraman-towards-the-future","created_at":1499075466760,"updated_at":1515724225390,"summary":"In the future, Earth must protect itself from alien invaders, a task handled by the Science Special Search Party. However, they are not alone in this endeavor. After crashing his ship on Earth while in pursuit of the evil alien Bemular, the super-being Ultraman is here to help whenever the attacking aliens prove too much for humanity alone to handle. Standing hundreds of feet tall with incredible strength and amazing abilities, he can only remain on Earth for a few minutes, and so must defeat his foes before his power drains completely. \n \nBased on the popular television show from 1967, Ultraman directly follows the story of its source material. Cast in the role of the titular Ultraman, the player must defeat many of the same monsters that appeared in the original series. Taking the appearance of a 1-on-1 fighting game, Ultraman can punch, kick, and grapple his opponent, as well as use a variety of various special moves that must be charged. However, in order to actually defeat his opponent, Ultraman must deplete their continually-recharging life bar, and at that moment hit with his most powerful special attack: the Specium Beam. As the game continues, different enemies may even find ways to avoid this most formidable attack, and Ultraman must adapt... Each stage has a time limit of only three minutes, and there are three lives and no continues.","collection":3046,"popularity":1,"games":[72608,14763,44858,44428,43864,43863,23113,2558,42399,25181],"tags":[268435460,536870926,536871019,536871972,536873299,536875054,536875289,536875291,536876694],"category":0,"keywords":[14,107,1060,2387,4142,4377,4379,5782],"genres":[4],"first_release_date":688953600000,"platforms":[19],"release_dates":[{"category":0,"platform":19,"date":688953600000,"region":8,"human":"1991-Nov-01","y":1991,"m":11}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xsppaxtjdecdnmwv9fpc.jpg","cloudinary_id":"xsppaxtjdecdnmwv9fpc","width":2100,"height":1551}}