{"id":4679,"name":"Arctic Tale","slug":"arctic-tale","url":"https:\/\/www.igdb.com\/games\/arctic-tale","created_at":1391048049060,"updated_at":1512988273012,"summary":"The onset of global warming and the resultant changes in the world?s climate is having a devastating effect on the Arctic and the animals that live there. Based on the follow up to March of the Penguins, Arctic Tale follows the story of two of these amazing creatures as they face their daily battle to survive in the ever changing surroundings of the Arctic Circle. Control a polar bear and a walrus in a changing 3D environment. Each animal has varying attributes such as speed, stamina, strength and hunger that will change depending upon their condition and surroundings. \n\nEach of the animals has their own episode to play through, both of which consist of 12 stages taking you over snowy mountains, turbulent ice sheets and vast frozen oceans. Mini games help the animal to survive as they hunt for food, fight off predators and adapt to their environment. \n\nFeatures National Geographic information and presentation style which is not only educational, but will help you to work through the game. Throughout the game, situations events, warnings and educational information will be presented by the game's narrator. Uses the intuitive Nintendo Wii control schemes to immerse you in the game experience.","franchise":270,"franchises":[270],"popularity":1,"aggregated_rating":40,"aggregated_rating_count":1,"total_rating":40,"total_rating_count":1,"games":[13189,55803,25222,41895,22425,14605,70396,29730,11296,43130],"tags":[268435487,536871939,1073741826],"developers":[1984],"publishers":[354,355],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[1027],"genres":[31],"first_release_date":1193270400000,"platforms":[24,20,5],"release_dates":[{"category":0,"platform":5,"date":1193270400000,"human":"2007-Oct-25","y":2007,"m":10},{"category":0,"platform":20,"date":1193270400000,"human":"2007-Oct-25","y":2007,"m":10},{"category":0,"platform":24,"date":1193270400000,"human":"2007-Oct-25","y":2007,"m":10}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l7ai2oy17ubryna0gxpi.jpg","cloudinary_id":"l7ai2oy17ubryna0gxpi","width":256,"height":360},"esrb":{"rating":3}}