{"id":87479,"name":"WarFriends: PvP Army Shooter","slug":"warfriends-pvp-army-shooter","url":"https:\/\/www.igdb.com\/games\/warfriends-pvp-army-shooter","created_at":1518796314979,"updated_at":1519364177547,"summary":"Battle it out against friends and real-world opponents in WarFriends, the action packed real-time PvP multiplayer shooter game that has fans and critics going wild!   \n\n“It’s easy to understand why so many mobile gamers have been raving about WarFriends.” – Gamezebo \n\n“The time you spend with it will be spent with a bang-bang shooty grin on your face.” – Pocket Gamer\n\nWhat’s a little war between friends? Go head-to-head with real opponents and duke it out online in thrilling, fast-paced PvP battles, or team up to climb the leaderboards. Build the world’s best army in this unique PvP shooter game from the makers of Mega Dead Pixel. Dodge bullets, dive for cover, and take out invading enemy forces by any means necessary!\n\nRAISE AN ARMY \nRecruit shotgunners, drones, and jet-pack troopers to create an unstoppable army. Strategically deploy your soldiers in the heat of battle to take out rivals. Collect WarCards as you play and stack your deck for game-changing perks. Use them in online PvP shooter battles to slow your opponent, boost weapons, inflate enemy heads for improved targeting, and much more.\n\nTAKE YOUR WAR ONLINE \nEnlist friends to fight alongside you in ranked PvP death-matches when you join or create a squad. Battle to the top of the leaderboards for world-wide bragging rights and plan your next attack in squad chat. Dive into the WarPath game mode for frenetic co-op play with friends or squad members and earn extraordinary rewards.\n\nUNLEASH INCREDIBLE FIREPOWER \nCollect a full arsenal of weapons, ranging from pistols and sniper rifles, to shotguns and anti-tank bazookas. Easily hone in on opponents in battle, switch between weapons as you reload, and dodge incoming grenades with intuitive touch controls. Customize your arsenal to enhance your strategy and prepare for all-out war with online challengers.\n\nStay up to date on the latest WarFriends news: http:\/\/www.facebook.com\/warfriendsgame\n\nImportant Consumer Information. This app: Requires acceptance of EA’s Privacy & Cookie Policy and User Agreement.Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy & Cookie Policy for details). Requires a persistent Internet connection (network fees may apply). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications. To disable see the settings in-game. \n\nWarFriends offers a paid subscription card, subscribers receive reduced upgrade timers, no winstreak timers, faster DogTag refresh and instant WarCard crafting.\n\nThe subscription card lasts one month and auto-renews. The monthly subscription is priced at $11.99 \/ Month. Payment will be charged to iTunes Account at confirmation of purchase. The subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Your account will be charged $11.99 for renewal within 24-hours prior to the end of the current period.\n\nSubscriptions may be managed by the user and auto-renewal may be turned off by going to Account Settings after purchase.\n\nUser Agreement : http:\/\/terms.ea.com\/en\nPrivacy & Cookie Policy : http:\/\/privacy.ea.com\/en\nVisit http:\/\/www.chillingo.com\/about\/game-faqs\/ for assistance or inquiries.\n\nEA may retire online features and services after 30 days notice posted on www.ea.com\/1\/service-updates","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[25640,25311,36608,34919,11362,9760,33603,36962,40524,55888],"tags":[1,268435471],"category":0,"themes":[1],"genres":[15],"first_release_date":1484611200000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1484611200000,"region":8,"human":"2017-Jan-17","y":2017,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zzq2ntsoxol1w1dtop0r.jpg","cloudinary_id":"zzq2ntsoxol1w1dtop0r","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/exw5yrnmjdei8yf1ixgb.jpg","cloudinary_id":"exw5yrnmjdei8yf1ixgb","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ranmmvgwhhay865vm1he.jpg","cloudinary_id":"ranmmvgwhhay865vm1he","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f4g53mdun5pqzykcy0ly.jpg","cloudinary_id":"f4g53mdun5pqzykcy0ly","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rrwa0up3nkzjcnuz1upr.jpg","cloudinary_id":"rrwa0up3nkzjcnuz1upr","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ngpubqaicboujj66deth.jpg","cloudinary_id":"ngpubqaicboujj66deth","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/izgegkadsjdvhcl515nq.jpg","cloudinary_id":"izgegkadsjdvhcl515nq","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gpqduaxbuf1oxl71hwwz.jpg","cloudinary_id":"gpqduaxbuf1oxl71hwwz","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y8bx3siuncvcyi2vuseb.jpg","cloudinary_id":"y8bx3siuncvcyi2vuseb","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hjlaaq8sm7ot7umrxb72.jpg","cloudinary_id":"hjlaaq8sm7ot7umrxb72","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/st0lu0gwfennsuxxqnwq.jpg","cloudinary_id":"st0lu0gwfennsuxxqnwq","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/warfriends-pvp-army-shooter\/id979873043?mt=8&uo=4"}]}