{"id":9979,"name":"Aliens versus Predator","slug":"aliens-versus-predator","url":"https:\/\/www.igdb.com\/games\/aliens-versus-predator","created_at":1430255704436,"updated_at":1547110576547,"summary":"Aliens versus Predator offers three separate campaigns, each playable as a separate species: Alien, Predator, or human Colonial Marine. Each player character has different objectives, abilities, and weapons. The single-player campaign presents the player with a conventional series of levels to progress through that are designed around the abilities of each character.\n\nAs the Colonial Marine the player uses a number of weapons to combat Aliens and Predators. The marine wears armor for protection and uses an image intensifier and flares to improve visibility in dark areas.\n\nWhen playing as the Predator the player uses a variety of weapons from the Predator films such as wrist blades, a throwing disc, and shoulder-mounted energy weapons. The Predator is the most durable of the three player characters and can survive falls from greater heights than the human. The player can use a cloaking device to become invisible and several different modes of vision to detect enemies, including an infrared vision mode and a mode sensitive to electrical systems.\n\nAs an Alien the player can explore most of the game's environments freely, even climbing across walls and ceilings. The Alien has no weapons, however, using its claws, tail, and jaws to attack enemies. The screen is distorted into a fish eye lens effect to reflect the Alien's field of view. The player can also use a form of echolocation in dark areas and can detect pheromones to discern human or Predator enemies. The Alien can drop from any height without injury and is the fastest of the three player characters.\n\nSeveral bonus levels allow each player character access to portions of the missions of the other characters. To allow the marine and Predator characters to traverse through the areas of the Alien missions, the player is supplied with a jet pack for the marine and a grappling hook for the Predator.","storyline":"The storylines of the three player characters are independent of one another. As an Alien the player must defend the Alien hive from human marines, then stow away on an evacuating spacecraft and reach the marines' ship, the Ferarco. When the Ferarco's self-destruct system is activated, the player must reach the escape shuttle, which takes them to Gateway Station. Here the player explores the station and battles more marines, reaching a ship departing for Earth. Before boarding the ship the player battles two Predators, after which the Alien enters the Earth-bound shuttle.\n\nWhen playing as the Colonial Marine, the player begins at a research station on LV-426 built to study the derelict spacecraft where the Nostromo crew first encountered the Alien eggs in the film Alien (1979). Aliens attack and the player must fight their way through the research facility, the derelict ship, and an adjoining colony. Next the player explores the atmosphere processing station and shuts down its cooling valves in order to cause an explosion which will wipe out the Aliens. The player character escapes in a drop ship and travels to Odobenus Station in orbit above the planetoid, where they battle more Aliens, Predators, facehuggers, and cybernetically-enhanced Aliens until reaching the spaceship Tyrargo. Aboard the ship the player battles more enemies including an Alien\/Predator hybrid and \"praetorian\" Aliens. The player then battles an Alien queen, defeating it by expelling it through the airlock.\n\nThe Predator character's storyline visits three different planets, beginning with the player hunting marines in order to recover a captured Predator ship and its occupant from a human military base. Aliens are accidentally released in the base and the player discovers that the humans have created an Alien\/Predator hybrid by implanting the captured Predator with an Alien embryo. The player defeats the hybrid, triggers the facility's self-destruct mechanism, and escapes in the Predator ship. The player next visits Fiorina \"Fury\" 161, the prison planet that is the setting of Alien 3 (1992), where more Aliens and marines are battled. Finally the player visits a marine-controlled Alien habitat, battling cybernetically-enhanced Aliens, \"praetorian\" Aliens, and finally the Alien Queen.","collection":126,"franchise":464,"franchises":[464,23,507],"rating":79.9818664247649,"popularity":1.666666666666667,"total_rating":79.9818664247649,"total_rating_count":21,"rating_count":21,"games":[8634,36950,19686,4754,560,68287,55038,37016,7350,8477],"tags":[1,18,19,268435461,536870915,536871041,536871078,536871365,536871516,536871882,536872032,536872070,536873122,536874115,536875054,536875065,536875242,536875329,536875358,536875426,536875495,536875693,536875814,536875905,536876322,536876333,536876446,536876569,536876694,536876726,536876857,536876927,536877172,536877620,536878032,536878301,536878326,536878505,536879049,536879053,536879878,536880344,536880625,536880709,536881457,536881544,536883035,536883091,536884013,536884032,536884160,536884161,536884162,536884163,536885041,1073741825],"developers":[318],"publishers":[461],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[3,129,166,453,604,970,1120,1158,2210,3203,4142,4153,4330,4417,4446,4514,4583,4781,4902,4993,5410,5421,5534,5657,5782,5814,5945,6015,6260,6708,7120,7389,7414,7593,8137,8141,8966,9432,9713,9797,10545,10632,12123,12179,13101,13120,13248,13249,13250,13251,14129],"themes":[1,18,19],"genres":[5],"expansions":[80035],"first_release_date":925430400000,"platforms":[6,92,14],"release_dates":[{"category":0,"platform":6,"date":925430400000,"region":2,"human":"1999-Apr-30","y":1999,"m":4},{"category":0,"platform":6,"date":927590400000,"region":1,"human":"1999-May-25","y":1999,"m":5},{"category":0,"platform":14,"date":925430400000,"region":2,"human":"1999-Apr-30","y":1999,"m":4},{"category":0,"platform":14,"date":927590400000,"human":"1999-May-25","y":1999,"m":5},{"category":0,"platform":14,"date":1263513600000,"region":8,"human":"2010-Jan-15","y":2010,"m":1},{"category":0,"platform":92,"date":1263513600000,"region":8,"human":"2010-Jan-15","y":2010,"m":1}],"alternative_names":[{"name":"Aliens vs Predator","comment":"Other"},{"name":"AVP1","comment":"Other"},{"name":"AVP","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nw2frgoykclhwcg0o7ql.jpg","cloudinary_id":"nw2frgoykclhwcg0o7ql","width":1152,"height":864},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jvgxkqs8t98zxgqfju5j.jpg","cloudinary_id":"jvgxkqs8t98zxgqfju5j","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v7bosktnse9vyixyaqix.jpg","cloudinary_id":"v7bosktnse9vyixyaqix","width":800,"height":600}],"videos":[{"name":"Trailer","video_id":"ygMWMIv0qPs"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rpsk4unnkitw0bkgvsj1.jpg","cloudinary_id":"rpsk4unnkitw0bkgvsj1","width":800,"height":1026},"esrb":{"rating":6}}