{"id":107175,"name":"Broken Lines","slug":"broken-lines","url":"https:\/\/www.igdb.com\/games\/broken-lines","created_at":1534498609995,"updated_at":1538639778049,"summary":"“Cooper, are you sure this is a good plan?” “It’s perfectly safe, Avery. Don’t whine about it!” \nAvery follows orders and runs along the road, only to be cut down by machine gun fire. \n- leaving Cooper visible shaken by the consequences of his failed plan. \nWill another of the men step in to plan the assault or is it time to cut the losses and avoid this confrontation, before you lose anymore of your men? \n \nBroken Lines is a war-game with a serious story, told from the perspective of the individual soldiers. A game for people who likes real-time tactics and strategy games, but are too slow to play them. Give orders to you men, while in pause - and total control. Then see the execution in real time - sometimes resulting in catastrophic failure. \n \n \nYou control a squad of mismatched soldiers, fighting for survival in Eastern Europe, during WW2. A squad with both disillusioned and brutal veterans and civilized, but mostly ineffective recruits. Who can work together, who will you sacrifice and who will survive to the end? \n \nPlay the campaign with randomized missions and non-linear stories. Select and equip your squad. Train them in unique combat skills and perks. Plan your turn in pause mode and see it play out in real time. Use cover and flanking to overcome the opposition. Rewind the level to avoid casualties and achieve better loot. Manage resources and survive until you either find your way out of the valley or lose your way and your conscience in the process.","storyline":"Dusk. An army transport plane crosses the red evening sky. Motor humming. Plane cargo hold, only light is a lazy wall mounted bulb. A team of soldiers are fast asleep despite the bumpy ride. Heads bounce on their shoulders. \nSuddenly the light turns off, everything is darkness. And then all motors give out. The plane silently drops. Soldiers, weapons, papers are thrown around in the cabin as everything turns vertical. The machine disappears behind treetops and a huge explosion follows. \n \nThe few surviving soldiers wake up in the scattered, burning wreckages. As the soldiers gather, it turns out all superior officers are dead, with the mission plans presumably destroyed in the fire. \nOnly eight soldiers have survived. Four rookies and four veterans. They argue over who should lead, who should eat, who are expendable and who should survive, but decide to stay together for now. The squad begins an uneasy trek towards a nearby village, but are soon hunted by the local enemy forces, who aggressively aim to terminate the intruders.  \nFear creeps in as the squad slowly realizes they are stranded with no allies, no supplies, no clear orders, and no purpose. There are two main approaches the squad can decide to take. Try to continue the original mission - or save themselves. \n \nThe Rookies are convinced there is something sinister going on with the fog and the enemies in the valley. They want to solve the mystery, destroy the potential threat and go home as heroes. The veterans simply want to gather resources, to enable them to survive and escape - no matter the cost. \n \nBroken lines It is a game about a group of soldiers being caught in a bad situation and about how they react to increasing pressure and stress. Some soldiers are more affected than others, creating a bigger rift within the squad. The soldiers’ lack of any clear leadership and plans make conflicts arise within the squad. The player decides which direction the soldiers should head. Do they try to find out what their mission is, or simply just survive and escape their situation. What is acceptable during war-time and which lines should never be broken, even if your life depends on it?","popularity":1.333333333333333,"tags":[1073741827],"developers":[16305],"game_engines":[13],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[415,493,3786,5455],"themes":[22,31,39,43],"genres":[24],"first_release_date":1577750400000,"platforms":[6,11,7,130],"release_dates":[{"category":6,"platform":130,"date":1577750400000,"region":8,"human":"2019-Q4","y":2019,"m":12},{"category":6,"platform":7,"date":1577750400000,"region":8,"human":"2019-Q4","y":2019,"m":12},{"category":6,"platform":11,"date":1577750400000,"region":8,"human":"2019-Q4","y":2019,"m":12},{"category":6,"platform":6,"date":1577750400000,"region":8,"human":"2019-Q4","y":2019,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/snkbrers07ejkspiz11b.jpg","cloudinary_id":"snkbrers07ejkspiz11b","width":2048,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fwohkxqnbumt5e3ztids.jpg","cloudinary_id":"fwohkxqnbumt5e3ztids","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e7dks0hbvf69lzpznhcn.jpg","cloudinary_id":"e7dks0hbvf69lzpznhcn","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/g48akzcoaxtgvh632d4o.jpg","cloudinary_id":"g48akzcoaxtgvh632d4o","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xlg9inix1umcawoswk4g.jpg","cloudinary_id":"xlg9inix1umcawoswk4g","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/onaxeglotkhgwrkepqpk.jpg","cloudinary_id":"onaxeglotkhgwrkepqpk","width":3463,"height":1932},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/od6y4cuoqmn1ixtvo1ki.jpg","cloudinary_id":"od6y4cuoqmn1ixtvo1ki","width":3457,"height":1943},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dpv4u2zvfjybmts7pl6u.jpg","cloudinary_id":"dpv4u2zvfjybmts7pl6u","width":2303,"height":1299},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/b57kxqhbgwbpw1vtnqmc.jpg","cloudinary_id":"b57kxqhbgwbpw1vtnqmc","width":2048,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zigj3suwscuvdzrof39w.jpg","cloudinary_id":"zigj3suwscuvdzrof39w","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/si6kxwgulo7j44fqeffw.jpg","cloudinary_id":"si6kxwgulo7j44fqeffw","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/stifblbkhlxjajrzjhy2.jpg","cloudinary_id":"stifblbkhlxjajrzjhy2","width":2048,"height":1080}],"videos":[{"name":"Teaser","video_id":"jpJjXNcQRGU"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u2bipkencdrzsivexkmp.jpg","cloudinary_id":"u2bipkencdrzsivexkmp","width":2000,"height":1351},"esrb":{"rating":3},"pegi":{"rating":3},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/playlist"},{"category":5,"url":"https:\/\/twitter.com\/brokenlinesgame"},{"category":4,"url":"https:\/\/www.facebook.com\/brokenlinesgame"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Broken_lines"},{"category":1,"url":"https:\/\/www.indiedb.com\/games\/broken-lines"}]}