{"id":10975,"name":"The Kings Crusade: Arabian Nights","slug":"the-kings-crusade-arabian-nights","url":"https:\/\/www.igdb.com\/games\/the-kings-crusade-arabian-nights","created_at":1433490155544,"updated_at":1536329101261,"summary":"Welcome to the magical world of the Arabian fables. Many secrets lie buried in these sands but now it is time to rise up. Use the relics of the past to wage ware against the infidel King. Explore our hidden valleys, unearth majestic artifacts, meet cunning sorcerers, recruit efreets and call forth legendary heroes to aid you in your battle for the Holy Land! \n \nNew units and new heroes: \nAli Baba and the forty thieves – Ali Baba was an ordinary man who by chance stumbled upon the lair of the forty thieves. He learned the magic words to open the mysterious cave and rob it of it’s treasures. After his death he was doomed to spend the afterlife with the thieves he had robbed. \nJaffar – Jaffar, the evil and cunning sorcerer of a time long ago, meddled in the darker arts of wizardry, and finally achieved life after his death — if you can call his wretched existence life at all. \nSinbad – Sinbad was a legendary sailor from Baghdad, whose voyages took him to wonderful places where he fought monsters and gathered precious treasures. He was called the “ever restless” — which might explain how he turned up here and now, hundreds of years after his supposed death. \nGenii and “The Prince of Sands” – The genii are creatures made of fire. Besides their numerous magical abilities they are capable of disappearing into thin air and reappearing elsewhere — a talent that makes them ideal soldiers in battle. \nEfreets and “The Efreet Sultan” – These legendary beings are ruthless sprits that walk the Saracen lands. They are strange creatures, but not necessarily evil or sinister. Sometimes they participate in the raging conflict for Saladin’s kingdom. \nNumerous new abilities, spells, artifacts: \nBlazing Rain, Dancing Blades, Dust Devil, Genie Door, Immortality, Invisibility, Sandstorm, Summon Efreet, Summon Genie, Cloak of Invisibility, Magic Lamp and Sword of Sindbad \nFive unique events in the Saracen Campaign also spice the gameplay in this mysterious land.","collection":1469,"popularity":1.333333333333333,"game":2039,"developers":[1243],"publishers":[517],"category":1,"websites":[{"category":1,"url":"https:\/\/neocoregames.com\/en\/games\/crusaders-kings-crusade\/dlc"}]}