{"id":14175,"name":"Sui Generis","slug":"sui-generis","url":"https:\/\/www.igdb.com\/games\/sui-generis","created_at":1445546376118,"updated_at":1516748564838,"summary":"An original open world RPG for the PC featuring dynamic story and physics based gameplay.\n\n*Believable Fiction. Carefully crafted and researched so it feels authentic down to the smallest detail, the world of Sui Generis will draw you in and captivate you with its depth and complexity.\n*Reactive Characters. All characters and creatures are driven by their own goals and unique perception of the world. All have complex behaviours and react to every circumstance.\n*Deep Character Customisation. Don't just choose a class but create your own unique build and develop your own play style. The paths to success are almost limitless.\n*Non Linear Story. Write your own story. Create your own character and then interact with the world and events as you see fit. Who knows what might happen? It's not written, it's up to you.\n*Physics Driven Combat. Whether swinging your weapon, shooting an arrow or manipulating the world with your mind, you can expect spectacular and always unique results.\n*Interactive Environment. Nothing is bolted down or fake, the environment is fully interactive and can play an important tactical role, as well as just provide lots of fun.","storyline":"On a treacherous world with a tortured history the meagre remnants of humanity live in awe of a misconceived past, haunted by forgotten gods and fearful of the very ground they tread. A vast sprawling underworld ever present below their feet, baleful demons lying in wait. Thaumaturges, people with powerful psychic abilities, have abandoned their once benevolent nature turning to cruel and dark activities in their quest for ultimate power. Awoken by impending threats, an abandoned and damaged being gives rise to its ancient weapons who now walk amongst the people again.","hypes":1,"popularity":1.333333333333333,"games":[12632,17583,47823,16468,36926,26769,27092,36534,27209,25311],"tags":[1,17,268435468,268435471,536871208,536871338,536871938,536874694,536875361,536875830,536875869,1073741830],"developers":[7102],"category":0,"player_perspectives":[6],"keywords":[296,426,1026,3782,4449,4918,4957],"themes":[1,17],"genres":[12,15],"videos":[{"name":"Gameplay video","video_id":"BuOzmyED5qA"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vrmijqq8bo7jy3qq8dk8.jpg","cloudinary_id":"vrmijqq8bo7jy3qq8dk8","width":543,"height":125},"websites":[{"category":1,"url":"http:\/\/www.baremettle.com\/games\/"}]}