{"id":1675,"name":"DoDonPachi DaiOuJou","slug":"dodonpachi-daioujou","url":"https:\/\/www.igdb.com\/games\/dodonpachi-daioujou","created_at":1351453653764,"updated_at":1545037357906,"summary":"The fourth game in the Donpachi series and the first to be ported to the PS2, courtesy of Arika.","storyline":"Centuries have passed since the catastrophic war that almost cost the human race its complete annihilation at the hands of the deranged commander of the DonPachi Corps, a military squad of starfighter pilots known for their combat prowess and emotional detachment (as a result of the inhuman training they are subjected to - the first game being a prime example of it, with the trainee actually slaughtering comrades posing as the enemy); whatever remained of his genocidal army was gathered, transported to the Moon and sealed within a network of caves, left to rot away as the nightmares faded into legend. \n \nThe human race flourished again, to the point of colonizing the Moon itself, the megacity of Lunapolis being the hub of human activity on lunar soil. However, as time passed, the dormant machines reawakened, rebuilt, evolved: the underground caverns of the planet swarmed with all sorts of advanced warmachines, and automated production facilities, at their core a heavily guarded platform where the ultimate fighting machine of the past, the mechanical bee Hibachi (this time named 緋蜂, lit. \"scarlet bee\"), was slowly being rebuilt. Still following their original programming, the machines broke the seal, invading the surface and quickly seizing control of the almost defenseless Lunapolis, its streets and facilities now completely overtaken and littered with heavy artillery emplacements. \n \nWith little time to spare, the DonPachi Corps are reactivated, with enough time to build only two fighters; nevertheless, to each was bestowed the assistance of an Element Doll, highly evolved sentient droids (apparently widespread in human society by then, and treated as little more than slaves) capable of providing tactical data and enhancing the craft's own capabilities. Knowing that the mission is plausibly suicidal, the two attack ships are deployed on the Moon surface, just outside Lunapolis, alone against a ruthless army of machines with a single objective; killing.","collection":330,"popularity":1.333333333333333,"games":[55038,36950,68287,1676,109627,10209,1877,26202,17130,18954],"tags":[18,268435461,268435489,536871015,536871078,536871756,536871823,536871882,536871904,536875056,536875083,536875158,536875198,536875201,536875245,536875258,536875870,536875879,536875904,536875934,536876296,536876878,536878104,536878192,536878199,536879840,1073741827],"developers":[2433],"publishers":[803,2517],"category":0,"player_perspectives":[3],"game_modes":[1,3],"keywords":[103,166,844,911,970,992,4144,4171,4246,4286,4289,4333,4346,4958,4967,4992,5022,5384,5966,7192,7280,7287,8928],"themes":[18],"genres":[5,33],"first_release_date":1019001600000,"platforms":[52,8],"release_dates":[{"category":0,"platform":52,"date":1019001600000,"human":"2002-Apr-17","y":2002,"m":4},{"category":0,"platform":8,"date":1049932800000,"human":"2003-Apr-10","y":2003,"m":4}],"alternative_names":[{"name":"怒首領蜂 大往生"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dcxoodgtquz3guazkaap.jpg","cloudinary_id":"dcxoodgtquz3guazkaap","width":850,"height":1168},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/DoDonPachi_DaiOuJou"},{"category":1,"url":"http:\/\/www.arika.co.jp\/product\/daiojyo\/index.html"}]}