{"id":51075,"name":"Go Play Circus Star","slug":"go-play-circus-star","url":"https:\/\/www.igdb.com\/games\/go-play-circus-star","created_at":1500059932951,"updated_at":1515760837804,"summary":"The circus is in town, and you’re the star! \n \nThe circus is in town, and you’re the star! Go Play Circus Star lets you step into the shoes of a circus performer whose job is to wow the crowd with death defying stunts, animal tricks and sleight of hand. As part of Majesco’s new Go Play line, Circus Star delivers a motion-based experience that the entire family can enjoy together! \n \nFeatures \n \n• Master 15 authentic mini games that offer unique controls and performance opportunities: Human Cannonball, Big Cat Taming, Juggling Excitement, Starry Magic, Trampoline Acrobatics, Tightrope Walking, Rola Bola, The Amazing Silks, Knife Throwing, Pie Dodging, Elephant Balancing, Pony Dancing, Mile-High Stunt Diver, Unicycle Rider and Trapeze \n• Unlock four different venues from the Park to the Big Top to the Arena and Las Vegas Stadium. Each venue is a different difficulty level. \n• Compete against up to 3 other players to determine who is the biggest star. \n• Wii Balance Board compatible with a majority of events. \n• Fill up your trick meter to pull off a series of more daring and death defying feats. The more impressive the trick, the more fans you will gain and the more money you earn. \n• Use earnings to unlock additional events and progress in your circus career. \n• Interactive crowd system responds to the quality of your performance. Big stars will get them roaring whereas novice performers can expect tomatoes in the face. \n• Animal events let you control the action while increasing the danger. \n• Choose from 6 unique stars, each with 5 fabulous costumes. \n• Earn encouragement from The Ringmaster who guides you through your career.","collection":4531,"popularity":1,"games":[36608,34919,70906,16468,23175,28113,40524,59516,74390,28029],"tags":[1,536871186,536875089,536875240,536881611],"category":0,"keywords":[274,4177,4328,10699],"themes":[1],"first_release_date":1247097600000,"platforms":[5],"release_dates":[{"category":0,"platform":5,"date":1247097600000,"region":8,"human":"2009-Jul-09","y":2009,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/v0kkaq6dx61ekbwstvmo.jpg","cloudinary_id":"v0kkaq6dx61ekbwstvmo","width":356,"height":500},"esrb":{"rating":4}}