{"id":88875,"name":"My Talking Hank","slug":"my-talking-hank","url":"https:\/\/www.igdb.com\/games\/my-talking-hank","created_at":1519333043262,"updated_at":1523428133221,"summary":"With over 5 BILLION downloads and worldwide hits like My Talking Tom and My Talking Angela, Talking Tom and Friends now has a BRAND NEW free app. Introducing My Talking Hank! Help Hank pursue his love of photography and take pictures of all the animals on the tropical islands of Hawaii. He’s ready for adventure and off to explore. Hank needs your <3!\n\nTAKE CARE OF YOUR PUPPY\nAdopt your very own puppy, little cute baby Hank. He is one of a kind. A puppy so sweet you can’t look away! Take care of Hank, your new favorite virtual pet. Feed him delicious food, take him to the toilet and swing him to sleep on a hammock under a starry sky.\n\nHELP HANK COLLECT ALL THE ANIMALS\nHank loves photography! He wants to take picture of every wild animal living on the island. And there are plenty of them to discover - from a fluffy White Bunny, to a silly Flamingo, gangster Hip Hop Hippo and many more. Travel through different zones of the island. Place toys and food for the animals. Wait for them to show up and… CLICK! ... collect their photos.\n\nFUN BEYOND FUN\nTalking Hank will not only repeat everything you say with a hilarious voice, Hank takes fun to the next level! Laugh out loud at his constant adventures, his toilet shenanigans and much, much more! If you enjoy tamagotchi-style apps and kitty collector game mechanics you will fall in love with My Talking Hank.\n\nFEATURES\nWelcome to Hawaii: Check out your wonderful island home! It looks cool night and day!\nRaise Hank: Hank needs you to take care of him, from feeding to visiting the toilet!\nTake Photos: Help Hank complete his photo album by taking pictures of wild, exotic animals.\nAttract animals: Some of them are scared of Hank, you’ll need food and toys to lure them out!\nKeep playing: There are more features to discover in My Talking Hank, so keep exploring!\n\n“My Talking Hank” offers users an exclusive premium membership with additional exclusive gameplay features as an optional in-app purchase.\n\nThe premium membership is available on a monthly basis and priced at $4.99 per month. Payment will be charged to the user’s iTunes Account upon confirmation of purchase. The subscription will automatically renew every month unless auto-renew is turned off at least 24 hours before the end of the current payment period. If auto-renew remains active during that time, the user’s account will be charged.\n\nSubscriptions can be managed by the user; auto-renewal can be turned off in the user’s iTunes Account Settings after purchase. However, no cancellation of the subscription will be possible during an active subscription period.\n\nThis app contains:\n- Promotion of Outfit7's products and advertising\n- Links that direct customers to our websites and other Outfit7 apps\n- Personalization of content to entice users to play the app again\n- Watching videos of Outfit7's animated characters via YouTube integration\n- The option to make in-app purchases\n- Items are available for different prices in virtual currency, depending on the current level reached by the player\n- Alternative options to access all functionalities of the app without making any in-app purchases using real money (level progress, in-game functionalities) \n\nTerms of use: http:\/\/outfit7.com\/eula\/\nPrivacy policy: http:\/\/outfit7.com\/privacy-policy\/","rating":90,"popularity":1,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[44242,28465,34919,33603,36962,55888,65827,75102,43130,28277],"tags":[268435469,536872030],"category":0,"keywords":[1118],"genres":[13],"first_release_date":1484092800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1484092800000,"region":8,"human":"2017-Jan-11","y":2017,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ef2nk7suj0uvr9akorwt.jpg","cloudinary_id":"ef2nk7suj0uvr9akorwt","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/s7jmq7zikowkr9ry2mho.jpg","cloudinary_id":"s7jmq7zikowkr9ry2mho","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j0bgfmkwazjm9dojsr9a.jpg","cloudinary_id":"j0bgfmkwazjm9dojsr9a","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/stnytbban4he5gmb9f7l.jpg","cloudinary_id":"stnytbban4he5gmb9f7l","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n8g2kgqjt9wpwbf17lf1.jpg","cloudinary_id":"n8g2kgqjt9wpwbf17lf1","width":576,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tv7ynbl2kjns7zvgh9bf.jpg","cloudinary_id":"tv7ynbl2kjns7zvgh9bf","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zycikm1frebswdup9cwb.jpg","cloudinary_id":"zycikm1frebswdup9cwb","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/etjrnymbleagmc9iseze.jpg","cloudinary_id":"etjrnymbleagmc9iseze","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uaherlfx2nf8c5rszq1l.jpg","cloudinary_id":"uaherlfx2nf8c5rszq1l","width":392,"height":696},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bl6a4tqnrzvpyteuibwa.jpg","cloudinary_id":"bl6a4tqnrzvpyteuibwa","width":392,"height":696}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ldj7tgglenu9zpqebyfn.jpg","cloudinary_id":"ldj7tgglenu9zpqebyfn","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/my-talking-hank\/id1135907647?mt=8&uo=4"}]}