{"id":99675,"name":"Trapped","slug":"trapped","url":"https:\/\/www.igdb.com\/games\/trapped","created_at":1524985735506,"updated_at":1534160118140,"summary":"Welcome to Estate de’ Sukari. Home to Aki, a young lady who happens to live inside of the manor. She awakens one fateful evening to a horrific dream of her death. as she considers the possibility of sleep, a loud shriek fills the air leaving her with a question: Should she investigate or should she go back to bed? About this Game:As Aki, you'll find that you are trapped in a manor filled with undead and other creepy monsters. As you won't have a weapon of any kind, you will need to run from the monsters until your safe (in some rare cases they are very fast). Investigate EverythingYou'll find that not everything is as it seems, and often even the simplest solution will yield great results. Even the kitty cats can be helpful form time to time, be sure to talk to them often about saving your game and possibly other hints through out the game. 5 Unique WingsThere are currently 5 unique area's of the manor The second floor with Aki's and her Father's room. A ballroom, an Art gallery, a dining hall, and a library For the player to explore. Oh and a garden maze thing. So that would be 6 areas, not 5.","popularity":1,"games":[80916,37419,55289,25311,81249,78632,16468,78149,47823,101608],"tags":[1,268435468,268435487,268435488],"category":0,"game_modes":[1],"themes":[1],"genres":[12,31,32],"status":4,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/chrn8uxpjvpmu5rrgpah.jpg","cloudinary_id":"chrn8uxpjvpmu5rrgpah","width":817,"height":622},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sf7a6nougmswhuwaz3rj.jpg","cloudinary_id":"sf7a6nougmswhuwaz3rj","width":815,"height":625},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oj29mylg6syaz9aajlj6.jpg","cloudinary_id":"oj29mylg6syaz9aajlj6","width":711,"height":581},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/coajt3q7drg0fszjy2st.jpg","cloudinary_id":"coajt3q7drg0fszjy2st","width":756,"height":407}],"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/847460"}],"external":{"steam":"847460"}}