{"id":15906,"name":"Dual Orb","slug":"dual-orb","url":"https:\/\/www.igdb.com\/games\/dual-orb","created_at":1452599761480,"updated_at":1513086816701,"summary":"In an alternate reality, in a parallel world, there are humans just like in the universe we dwell in. Those humans used to co-exist peacefully with animals, fairies, and dragons - other inhabitants of the world. The dragons were the wisest, most ancient, and most powerful race of all. But humans feared their wisdom and their strength, and lost contact to them, destroying the balance in the world. Now, only a few dragons remained, and their whereabouts are shrouded in mystery... \n \nYou control Ralph, a young fighter apprentice who lives with his old master in a small house near a village. It is the day of your graduation, and the master sends you to meet a very important person. When you arrive at this person's hut, you are spoken to by the spirit of a mighty dragon, the creator of the universe! You, the young adventurer, is chosen to stop an evil spirit who tries to destroy the universe, and as a token you receive a magic Orb, which contains the soul of the great dragon. And there your adventure begins... \n \nDual Orb is a traditional Japanese-style RPG with turn-based combat viewed from first-person perspective. As Ralph ventures further on his journey, he discovers companions who will help him on his quest, and join his party.","collection":1996,"popularity":1.333333333333333,"games":[12632,26766,18398,36926,19698,36534,64061,68393,49414,47823],"tags":[268435468,536871208,536871818,536871938,1073741827],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[296,906,1026],"genres":[12],"first_release_date":734918400000,"platforms":[58],"release_dates":[{"category":0,"platform":58,"date":734918400000,"region":5,"human":"1993-Apr-16","y":1993,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ylqzrmsowf5nfpd8snou.jpg","cloudinary_id":"ylqzrmsowf5nfpd8snou","width":500,"height":438}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/phusckulwxrjqsumhpqp.jpg","cloudinary_id":"phusckulwxrjqsumhpqp","width":100,"height":183}}