{"id":27006,"name":"Kikai","slug":"kikai","url":"https:\/\/www.igdb.com\/games\/kikai","created_at":1485856040744,"updated_at":1485878010369,"summary":"Kikai is a dark-themed mystery game with great focus on story and AI","storyline":"During his gradual recovery from a chronic disease, a musician and luthier had traveled to a beautiful foreign land. Just to get away, relax in scenic beauty, and maybe find some musical inspiration. He left the crowded, distracting cities to travel all the way to a border town so he could enjoy the best sceneries there were.   \n   \nThen the war broke out.   \n   \nEveryone lost their minds and chaos ruled. In the midst of all this, he found a boy with a broken leg, crawling against the stream of people running away from the fighting.   \n   \nHe couldn’t just leave the poor boy. He tried to pull him away from danger, but the kid showed him a picture of a girl and pointed deeper into town. With haste, he helped the boy get to where he wanted to go: a large laboratory. There was screaming coming from the inside.   \n   \nThey followed the sounds deeper into the building until they encountered a small girl stabbing a female scientist to death.   \n   \nThe girl passed out and the boy crawled to her immediately. There were three corpses at the scene, two in white lab coats. A picture on the wall showed the dead people and the two kids, all happy and smiling.   \n   \nThe musician was still shell-shocked, but with the war outside, dangers were already on the doorstep again. He took it upon himself to protect the kids from the war. The boy’s name was Kai and the girl’s was Kira. They showed him the few underground lab rooms that they had access to, and the three of them made it their home while the war raged on outside.","collection":2603,"franchise":953,"franchises":[953],"popularity":1.333333333333333,"games":[29525,25646,25311,27266,25300,51978,28148,26223,55289,25222],"tags":[1,18,39,43,268435465,268435487,268435488,536871109,536871195,536872352,536872609,1073741826,1073741827],"game_engines":[6],"category":0,"player_perspectives":[2,3],"game_modes":[1],"keywords":[197,283,1440,1697],"themes":[1,18,39,43],"genres":[9,31,32],"status":2,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r9rxgctimdv8sz3zndwf.jpg","cloudinary_id":"r9rxgctimdv8sz3zndwf","width":1600,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mfelb0rmpe1oqm4xhfhd.jpg","cloudinary_id":"mfelb0rmpe1oqm4xhfhd","width":1600,"height":900},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mhcet5oqkhiwsajzizzm.jpg","cloudinary_id":"mhcet5oqkhiwsajzizzm","width":1600,"height":900}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qn9v14xfqbkw6ow0rvtu.jpg","cloudinary_id":"qn9v14xfqbkw6ow0rvtu","width":1000,"height":1414},"esrb":{"rating":5},"websites":[{"category":4,"url":"https:\/\/www.facebook.com\/teamkikai\/"}]}