{"id":41706,"name":"Gandhara","slug":"gandhara","url":"https:\/\/www.igdb.com\/games\/gandhara","created_at":1498829357374,"updated_at":1516679611438,"summary":"Gandhara refers to the capital of the Kushan Empire, (today's Pakistan and Afghanistan), founded in 1st century BC, whose rulers were Buddhists; it was one of the most flourishing Buddhist states in history. The story of the game, however, is based on pure mythology, featuring Buddhist deities in their distinctly Japanese incarnations. The protagonist is contacted by the bodhisattva Akasagarbha (known as Kokūzō in Japan, from the Chinese Xukongzang), who tells him that the world is in danger: the king of demons is trying to locate and neutralize the holy Ashes of Buddha, whose power protects the eight worlds. The hero's task is to find the ashes and defeat whomever the king of demons might send to stop him. \n \nOne of Enix's works that were unreleased outside of Japan, Gandhara is an action RPG with rather simple gameplay mechanics. The player navigates the hero through hostile top-down areas, fighting constantly respawning enemies with sword or magical spells. Rations must be bought in order to keep the hero alive. Defeated enemies grant the protagonist experience points; once a certain amount of those is accumulated, the hero levels up and grows stronger.","popularity":1.333333333333333,"games":[47823,36926,25300,11567,55092,37088,12632,36534,26766,11169],"tags":[1,17,22,268435468,268435487,536871139,536871208,536871301,536871938,536871939,536871945,536872014,536875067,536875258,536875372,536875464,536875622,536875830,536875832,536876054,536876528,536878007,536880742],"category":0,"keywords":[227,296,389,1026,1027,1033,1102,4155,4346,4460,4552,4710,4918,4920,5142,5616,7095,9830],"themes":[1,17,22],"genres":[12,31],"first_release_date":570672000000,"platforms":[27],"release_dates":[{"category":0,"platform":27,"date":570672000000,"region":8,"human":"1988-Feb-01","y":1988,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wixjkki71bdmmqyry2ud.jpg","cloudinary_id":"wixjkki71bdmmqyry2ud","width":280,"height":384}}