{"id":5106,"name":"Fatal Frame","slug":"fatal-frame","url":"https:\/\/www.igdb.com\/games\/fatal-frame","created_at":1391847249327,"updated_at":1541375446424,"summary":"Fatal Frame is the first game of the Fatal Frame series, introducing the franchise's unique premise of fighting ghosts with a special camera.\n\nFatal Frame was the first to introduce the innovative use of an old-style camera as the primary weapon. In addition to navigating the main characters around the mansion grounds, players are able to enter Viewfinder Mode, where the camera is raised and the view changes to that of the camera's frame. In viewfinder mode the player is able to snap photographs of ghosts, both violent and benign, which is the main method of progressing through the game. Items are also available, some being consumable and most being key items needed to unlock doors, complete tasks or solve puzzles. Puzzles are encountered frequently in the game, some being based on the same concept but becoming progressively more difficult. The varying difficulty settings of the game (Easy, Normal, Hard, Nightmare, or Fatal (Xbox only)) determine the amount of consumable items scattered throughout the mansion and how formidable the enemies are.\n\nThe main horror aspect of the game is, undoubtedly, the ghosts. The mechanics programmed for the ghosts allow them to float ethereally through the air, walls and floors, and even teleport, allowing them many ways to attack the player. The ghosts' appearances are usually inspired by their deaths or by Japanese stigmas of horror, which, some argue, are particularily chilling.\n\nThe game, depending on which console it is played on, offers two endings. Upon completion of the game, a ranking is given based on total time taken, points accumulated and other categories. The player is also given rewards and unlockables, such as alternate costumes and camera functions, depending on what difficulty was beaten, how much of the Ghost List was completed and other criteria. Beating the game also unlocks Battle Mode, where the player is faced with fighting specific ghosts, and is rewarded with points towards purchasing unlockables. An option is also given where the game can be replayed with all equipment, upgrades and unlockables carried over.","storyline":"Set in 1986. The story begin with an aspiring folklorist, Mafuyu Hinasaki decides one night to investigate the Himuro Mansion, a place that is said to be haunted, in search of renown folklorist Junsei Takamine. He brings with him a special hand-me-down, a special camera that has the power to \"expose things the normal eyes can't see\". Mafuyu enters the mansion and encounters its only inhabitants, ghosts of the people who were killed there. After fending off a violent ghost and seeing the power of the camera for himself, Mafuyu decides to continue his search. On his way, however, a dark presence surrounds him, and Mafuyu's fate is unknown.\n\nTwo weeks later, Mafuyu's sister, Miku, arrives before the mansion. Fearing the worst may have happened to her brother, she takes it upon herself to enter the mansion and find him. Inside she finds the camera that Mafuyu brought with him, and, continuing his investigation, finds out the truth about the folklorist who went missing. Takamine came to the mansion to document the grisly events that occurred there long ago. In his progress, he uncovers the mysterious Strangling Ritual that took place in the mansion, but before he and his assistants could leave the haunted grounds, they were set upon by the spirits that were killed in the aftermath of the failed ritual. Miku continues deeper into the mansion, determined to find the truth and her missing brother. The story gets worse and worse by every room Miku enters, when later on she finds out that the Shrine Maiden (who is dead) looks for Mafuyu too.","collection":755,"rating":70.1049841841881,"popularity":2.333333333333333,"aggregated_rating":80.5,"aggregated_rating_count":2,"total_rating":75.30249209209404,"total_rating_count":21,"rating_count":19,"games":[5105,5107,15830,19686,26658,17479,18020,13210,19561,51524],"tags":[19,21,268435487,536870928,536871088,536871183,536871213,536871251,536871470,536871945,536872032,536872225,536872746,536872748,536872822,536873712,536874398,536875057,536875178,536875249,536875265,536875553,536875833,536876087,536876088,536876090,536876121,536876169,536876187,536876235,536876538,536876631,536876836,536877230,536877237,536877641,536878097,536878512,536879895,536879905,536880712,536880805,536882438,536884207,536888127,536891502,536891503,1073741825,1073741826],"developers":[2020],"publishers":[2040,53,907,2020],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[16,176,271,301,339,558,1033,1120,1313,1834,1836,1910,2800,3486,4145,4266,4337,4353,4641,4921,5175,5176,5178,5209,5257,5275,5323,5626,5719,5924,6318,6325,6729,7185,7600,8983,8993,9800,9893,11526,13295,17215,20590,20591],"themes":[19,21],"genres":[31],"first_release_date":1008201600000,"platforms":[45,11,8],"release_dates":[{"category":0,"platform":8,"date":1008201600000,"region":5,"human":"2001-Dec-13","y":2001,"m":12},{"category":0,"platform":11,"date":1037923200000,"region":2,"human":"2002-Nov-22","y":2002,"m":11},{"category":0,"platform":45,"date":1365465600000,"region":2,"human":"2013-Apr-09","y":2013,"m":4},{"category":0,"platform":8,"date":1015200000000,"region":2,"human":"2002-Mar-04","y":2002,"m":3},{"category":0,"platform":8,"date":1030665600000,"region":1,"human":"2002-Aug-30","y":2002,"m":8},{"category":0,"platform":11,"date":1044489600000,"region":5,"human":"2003-Feb-06","y":2003,"m":2},{"category":0,"platform":11,"date":1051833600000,"region":1,"human":"2003-May-02","y":2003,"m":5}],"alternative_names":[{"name":"Project Zero","comment":"Other"},{"name":"零 (Zero)","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ob1y8y5q51ld2ah4dg3u.jpg","cloudinary_id":"ob1y8y5q51ld2ah4dg3u","width":614,"height":345},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zyoebaeck5uctyza9ciq.jpg","cloudinary_id":"zyoebaeck5uctyza9ciq","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ebjptgc56lzvgugxjadc.jpg","cloudinary_id":"ebjptgc56lzvgugxjadc","width":640,"height":480}],"artworks":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/c4ftcr4u5dcurzoqpd0e.jpg","cloudinary_id":"c4ftcr4u5dcurzoqpd0e","width":900,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/av0wqa54zxplvln1qvdm.jpg","cloudinary_id":"av0wqa54zxplvln1qvdm","width":900,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rtwuiip2hbe0hp5gefyx.jpg","cloudinary_id":"rtwuiip2hbe0hp5gefyx","width":900,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lee7qkbgxjvav2wop4nv.jpg","cloudinary_id":"lee7qkbgxjvav2wop4nv","width":900,"height":720}],"videos":[{"name":"Trailer","video_id":"BTEEsY8lMx0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/svsaeq9ufsxmke7h64pa.jpg","cloudinary_id":"svsaeq9ufsxmke7h64pa","width":256,"height":363},"esrb":{"rating":5},"websites":[{"category":2,"url":"http:\/\/fatalframe.wikia.com\/wiki\/Fatal_Frame"}]}