{"id":16937,"name":"Cypress Inheritance: The Beginning","slug":"cypress-inheritance-the-beginning","url":"https:\/\/www.igdb.com\/games\/cypress-inheritance-the-beginning","created_at":1453810201383,"updated_at":1523261922353,"summary":"Lorna Ritten, has learned of Alfred Cypress, her grandfather whom she has never known. She has always wanted to find out more about her family but it has been somewhat of a mystery. But she also learns of what she has inherited, of which she has no idea of just how important this actually is to her and others.  Wanting to know more, this leads her into the beginning of a very unique situation. Regardless of what she is facing, she must continue forward to achieve what is needed for herself, and so much more!.\n\nArriving at a secluded island, the setting is somewhat overwhelming. But, even with the vastness and mystery of the Island, she wants to find the answers to questions she has had for so long. While knowing very little about Alfred Cypress, it is very obvious he has an eccentric nature, as well as brilliance in him. The technology discovered conveys all this in many ways. There is so much to do, not a lot of time, and the realization of the need to be extremely careful.\n\nCypress Inheritance: The Beginning will give you a unique gaming experience to enjoy.  We intended for this game to enable the player to have options, as well as objectives in an environment with an AI that is defending the area. Cypress Inheritance: The Beginning delivers a true-to-life, stealthy gaming experience set in multiple open worlds. As you experience our true cause and effect system while on the path to achieving your goals, the strategy you use will have consequences and those decisions will ultimately determine your success or failure. \n\nCypress Inheritance: The Beginning includes Chapters I and II, with Chapter III. Chapters II and III continue the story, giving more to encounter and discover. These three chapters together conclude this first game.","popularity":1,"games":[55289,16468,25311,72412,37022,59516,47823,36608,25646,25300],"tags":[1,268435468,268435487,268435488,1073741831],"developers":[8420],"publishers":[8420],"category":0,"player_perspectives":[7],"game_modes":[1],"themes":[1],"genres":[12,31,32],"first_release_date":1391212800000,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1391212800000,"human":"2014-Feb-01","y":2014,"m":2},{"category":0,"platform":14,"date":1391212800000,"human":"2014-Feb-01","y":2014,"m":2}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zzdfkmgggtqqjqrtpvhz.jpg","cloudinary_id":"zzdfkmgggtqqjqrtpvhz","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gad6xdmwnd9ftirukzzc.jpg","cloudinary_id":"gad6xdmwnd9ftirukzzc","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tmxqbvh2p4rurux2w3wv.jpg","cloudinary_id":"tmxqbvh2p4rurux2w3wv","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/acigmrnsuw3fex90ckwj.jpg","cloudinary_id":"acigmrnsuw3fex90ckwj","width":1280,"height":720},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gmvmzicgorfi4nfosxpi.jpg","cloudinary_id":"gmvmzicgorfi4nfosxpi","width":1280,"height":720}],"websites":[{"category":1,"url":"https:\/\/cypressinheritance.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/270430"}],"external":{"steam":"270430"}}