{"id":39237,"name":"Rolie, Polie,Olie Legends 2","slug":"rolie-polie-olie-legends-2","url":"https:\/\/www.igdb.com\/games\/rolie-polie-olie-legends-2","created_at":1498122682807,"updated_at":1500214504882,"summary":"The Rolie,Polie,Olie are back in the sequel to the biggest mobile game and PC of all time! Rolie,Polie,Olie Legends 2 starts a new era of Level Gameplay with super stunning graphics, challenging multi-stage levels, scheming boss M2 Kids! and even more destruction. \n \nCHOOSE YOUR BOTS! \n \nIt’s the ultimate Level strategy – YOU choose which Bots to fling next! “But that makes it easier, right?” WRONG! You’ll need to choose wisely if you’re going to stop those b&g from getting scrambled. Plus, destroy blocks to fill up the Destruct-O-Meter and earn extra bots! \n \nNEW MULTI-STAGE LEVELS! \n \nYou’ve never seen M2 Cily like this – jaw-droppingly stunning levels brimming with exotic plants, quirky details and plenty of peril. And because those naughty porkies are building their teetering towers right under your beak, many levels have multiple stages. Uh oh. \n \nSPECTACULAR SPELLS! \nBlizzards, Hot Chilis, Golden Ducks and other outrageous spells give you an added advantage against those swindling swine. And when you need some serious help, guess who’s at hand to make a-boy&dee-smashing cameo? That’s right, it’s the sardine loving Space Boy. Oh yeah! \n \nCHALLENGE OTHER PLAYERS! \nChallenge players from across the world in the Arena to see who’s the most hardcore Bots flinger of them all. Play new tournaments every day, earn feathers to level up your bots and face off against the toughest competition on the planet. Game face! \nDEFEAT BOSS M2! \n \nThere’s some serious bad guys on M2 Cily, and your Level \nskills are needed to take them down. More.. Boss and the infamous Lacsika will stop at nothing to keep your b&p . Are you gonna let ‘em get away with that? It’s time to teach the Boy&g a lesson.","popularity":1,"games":[59516,55289,25646,10039,25311,36608,37094,37088,47823,16468],"tags":[1,268435460,268435464,268435465,268435468,268435487],"category":0,"themes":[1],"genres":[4,8,9,12,31],"first_release_date":1454025600000,"platforms":[34],"release_dates":[{"category":0,"platform":34,"date":1454025600000,"region":8,"human":"2016-Jan-29","y":2016,"m":1}]}