{"id":45137,"name":"The Legend of Zelda: Breath of the Wild - Master Edition","slug":"the-legend-of-zelda-breath-of-the-wild-master-edition","url":"https:\/\/www.igdb.com\/games\/the-legend-of-zelda-breath-of-the-wild-master-edition","created_at":1499454547322,"updated_at":1523658293750,"summary":"Woken from a 100-year slumber, Link must explore the wilds to regain his lost memories and save Hyrule. This bundle includes the game, a Nintendo Switch Sheikah Slate Carrying Case, a Sheikah Eye Collectible Coin, the Relic of Hyrule: Calamity Ganon Tapestry and Weather-Worn Map, a Sound Selection CD, and the Master Sword of Resurrection statue. \n \nThe wilds of Hyrule make for a puzzling game of survival. Climb cliffs to scope out a destination; then cross great distances with the Paraglider or the horses you’ve tamed. You’ll discover items for crafting, beasts to hunt, and plants to forage. So scavenge weapons and armor…or claim them from enemies! From hammers to helmets, many items come with unique stats, resistances, effects, and levels of durability. Use everything at your disposal to find and conquer more than 100 Shrines. Luckily, the in-game Sheikah Slate can project Runes that manipulate objects and enemies in clever ways. It’s time to forget everything you know about the Legend of Zelda series.","collection":106,"hypes":1,"popularity":2,"version_parent":7346,"version_title":"Master Edition","games":[37088,26163,16468,1221,59516,47823,55289,25300,20048,36792],"tags":[1,17,38,268435468,268435470,268435487],"category":0,"themes":[1,17,38],"genres":[12,14,31],"pulse_count":1,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fqw7hzku7ghvksk0qxos.jpg","cloudinary_id":"fqw7hzku7ghvksk0qxos","width":1500,"height":970}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zcwo8y1wwnho56icycyb.jpg","cloudinary_id":"zcwo8y1wwnho56icycyb","width":420,"height":536},"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}