{"id":77337,"name":"End State","slug":"end-state","url":"https:\/\/www.igdb.com\/games\/end-state","created_at":1513055460355,"updated_at":1542920803161,"summary":"End State is a game made by a team of turn-based tactics enthusiasts. It has (almost) everything we’ve ever wanted to experience in a game like this – a non-linear campaign, deep tactical gameplay, resource management, destructible environment and a sh*tload of different weapons. The only thing we are sparing for the future (when we have moar moneys) will be role-playing and a dynamic open ended campaign. \n \nTurn-based strategy is a thinking man’s game. You analyze your enemy for weak spots, think your moves ahead and execute them. No matter what is happening, you’ll have the time to think about your next move. Maybe it’s because we are too old to master Counter Strike, or because we suck at quick time events, but nevertheless, we think that this is the way it should be. \n \nEnd State has been under development as a hobbyist project already for a decade and has seen multiple revisions, each being more advanced and more fun than the previous one. While we are targeting a more hardcore audience, the game should still be accessible enough for anyone to learn. We sincerely hope that you’ll enjoy playing it as much as we do. \n \nGAMEPLAY \n \nTake command of a ragtag mercenary team with multiple characters with custom skill sets and weapons, facing a variety of enemies with different capabilities and weaknesses. Plan your moves in variable terrain that forces you to consider about character positioning. Directional facing matters and characters can peek around the corners. This is important because the “fog of war” only shows what the units actually see. \n \nUse cover for your benefit and aim your shots at specific body parts for different results. Face varying missions with different objectives ranging from planting a tracking device to releasing hostages and the enemy AI will, of course, act according to their separate motives. \n \nManage your team through a non-linear campaign. Recruit mercs, equip them and upgrade their skills as they gain more experience. The campaign is not linear, and in one playthrough you’ll never see everything the game has to offer. We aim to develop a future classic you can enjoy for years to come.","storyline":"THE STORY \n \n \nSomewhere in the Eastern Europe \nThe events of the End State take place in a former Soviet country with a turbulent past. Soon after its first truly democratic elections there have been several terrorist attacks in administrative buildings around the country. The government decides to seek help from foreign anti-terrorist experts and hire your ragtag private military company, not knowing that it’s actually your first assignment since retirement from the army. \n \nSomething fishy \nIt doesn’t take a genius to figure out that you were hired because someone didn’t actually look for the most effective force to counter their plans. Soon you find your company and yourself entangled in a web of conspiracies involving foreign powers, mafia bosses, corrupt politicians, and power mongering lunatics. Will you be able to protect the citizens and stop the heinous plans to overthrow the legally elected government?","hypes":3,"popularity":1.333333333333333,"games":[25311,80916,78550,75813,28182,35994,75848,106562,9472,26145],"tags":[1,39,268435468,268435471,268435472,268435488],"developers":[14018],"category":0,"game_modes":[1],"themes":[1,39],"genres":[12,15,16,32],"status":4,"pulse_count":1,"platforms":[6],"release_dates":[{"category":7,"platform":6,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/llzlujyxgpbpmpx7alol.jpg","cloudinary_id":"llzlujyxgpbpmpx7alol","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wwjf0li9trcax3vsgdaf.jpg","cloudinary_id":"wwjf0li9trcax3vsgdaf","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/neca6fel5stntm8uisfq.jpg","cloudinary_id":"neca6fel5stntm8uisfq","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dlezyxbt5xf2wgeo9sxk.jpg","cloudinary_id":"dlezyxbt5xf2wgeo9sxk","width":357,"height":515},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UCGNEA9q_oCVq190i9ezO4_A"},{"category":5,"url":"https:\/\/twitter.com\/endstategame"},{"category":4,"url":"https:\/\/www.facebook.com\/EndStateGame"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/580640"},{"category":1,"url":"http:\/\/www.endstategame.com"}],"external":{"steam":"580640"}}