{"id":9537,"name":"Agricultural Simulator 2011","slug":"agricultural-simulator-2011","url":"https:\/\/www.igdb.com\/games\/agricultural-simulator-2011","created_at":1428758288363,"updated_at":1517270892554,"summary":"In a charming mountain area, you take the role of a classic farmer with all the necessary tasks like cattle breeding, growing grain and other resources, and dealing with products from your farm. Your fields can be cultivated with machines from CLAAS and even your animals have to be taken care of. \nThe complete Agricultural Simulator allows you to ride many genuine CLAAS tractors. Choose between many different models of tractors, combines, extensions and hangers. Sell your products and invest in better equipment. More powerful machines will help you farm bigger areas. \nAs striving farmer, you have to invest carefully to maximize the crop. Don’t kick over the traces or you won’t be able to upgrade your farm and buy more land. Choose the right seed from different types of grains like barley, rye, or wheat or decide to grow canola or corn. The harvest can be used as animal food, new seed as well as product to be sold on the market. Always have an eye on the market prices so you don’t come out with losses after all the work. \nGet another main pillar and breed cattle: cows, horses, sheep, hen, and geese. You may even have game animals on your farm and sell them profitably as food. If everything works well, the animals will prosper and you can sell their offspring on the market. Take care of proper feeding, daily care of the stables, and your animals well-being. Hire workers to balance your workload and invest in their further education. \nThe career mode in Agricultural Simulator guarantees a lot of fun. Playing cooperative mode allows you to manage your farm either online or offline with your friends.","franchise":539,"franchises":[539],"popularity":1.333333333333333,"games":[29173,55590,55689,54524,44242,54789,40470,11679,18623,22470],"tags":[33,268435469,536871906,536872015,536872024,536872060,536872070,536875047,536875151,1073741825,1073741826],"developers":[5109],"category":0,"player_perspectives":[1,2],"game_modes":[1,2,3],"keywords":[994,1103,1112,1148,1158,4135,4239],"themes":[33],"genres":[13],"first_release_date":1298419200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1298419200000,"region":1,"human":"2011-Feb-23","y":2011,"m":2}],"videos":[{"name":"Trailer","video_id":"bi7eCxfmjFQ"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/puw5pwtxoss1phngbbau.jpg","cloudinary_id":"puw5pwtxoss1phngbbau","width":1524,"height":1998},"esrb":{"synopsis":"This is a collection of realistic agricultural simulation games in which players can manage virtual farms. Players must keep track of their fuel, machinery, and resources in order to make a profit. ","rating":3},"pegi":{"rating":1}}