{"id":25226,"name":"Cipher Complex","slug":"cipher-complex","url":"https:\/\/www.igdb.com\/games\/cipher-complex","created_at":1477406337604,"updated_at":1515717524623,"summary":"Cipher Complex is an unreleased stealth action video game that was being developed for the Microsoft Windows, PlayStation 3 and Xbox 360 systems by Edge of Reality. The game was first announced in June 2006, by which time it was reported to already have been in production and self-funded for two years; the title was then signed with Sega in 2007, but in July 2009 it was revealed that the game had been cancelled by the publisher earlier that year after over half a decade of work, as noted in the LinkedIn profile of a former internal producer at the studio. Further details surrounding the cancellation and the game's fate in their entirety remain unclear to this day, as no official announcement regarding its status has been made by either Sega or Edge of Reality, however, more recently, a U.S. federal trademark registration was filed on September 11, 2009, which as of October 19, 2011, has been granted a third extension. While confirming nothing else, this does indicate that Edge of Reality has retained the intellectual property rights to the game.\n\nAlthough the game was widely believed to be permanently cancelled by Sega, game designer Phil Fogerite (who worked as level designer on the project from March 2008 to April 2009) has most recently stated that Edge of Reality itself had in fact decided to put the game on indefinite hold.","popularity":1.333333333333333,"games":[36813,313,3201,26192,15536,7350,1905,19441,1011,21429],"tags":[1,23,536871044,536871139,536872131,536872205,536872578,536875157,536875229,536875249,536875420,536875464,536875483,536875572,536875621,536875624,536875804,536875822,536876221,536876363,536876687,536876853,536876911,536877204,536877264,536877312,536877950,536879881,536883995],"category":0,"keywords":[132,227,1219,1293,1666,4245,4317,4337,4508,4552,4571,4660,4709,4712,4892,4910,5309,5451,5775,5941,5999,6292,6352,6400,7038,8969,13083],"themes":[1,23],"status":6,"videos":[{"name":"Trailer","video_id":"th_dd_0hhzs"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/siwtwgdczl52swdod5pt.jpg","cloudinary_id":"siwtwgdczl52swdod5pt","width":264,"height":264}}