{"id":26726,"name":"Panic Mansion","slug":"panic-mansion","url":"https:\/\/www.igdb.com\/games\/panic-mansion","created_at":1483998152254,"updated_at":1484050818526,"summary":"Panic Mansion is a combination of a trivia game and an action-rpg. You must find your way through the Panic Mansion (like a panic room but a whole mansion) by completing quests, answering questions and defeating bosses at the end of each level.","storyline":"Although you are a very intelligent person, you obviously didn't take high school as serious as you should have. Being a slacker seemed cool for the past four years but all good things must come to an end.\r\n\r\nHowever, upon learning of this terrible news, you speak to your school administrator, Tony York. Mr. York informs you that he knows you are a good kid, smart, and only missed out on graduating by one class (Physical Education) so he makes a strange offer to you. Tony says that he and his family have turned their entire house into a huge panic room - or in this case, a panic house. If you can make it through his panic house adventure, and find him at the end, he will pull some strings and make sure you graduate with your class. But if you fail to complete the adventure, there will be no graduation for you and summer school awaits.","popularity":1.333333333333333,"games":[26766,12632,25300,36926,36534,18398,49414,22436,36608,19448],"tags":[32,268435468,536871446,536871938,536871939,536871991,536873513,1073741829],"category":0,"player_perspectives":[5],"game_modes":[1],"keywords":[534,1026,1027,1079,2601],"themes":[32],"genres":[12],"first_release_date":1483920000000,"platforms":[82],"release_dates":[{"category":0,"platform":82,"date":1483920000000,"region":8,"human":"2017-Jan-09","y":2017,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pzhcftoxmudkumm544ng.jpg","cloudinary_id":"pzhcftoxmudkumm544ng","width":1366,"height":768}],"esrb":{"rating":4},"websites":[{"category":1,"url":"http:\/\/philome.la\/beatlesfan317\/panic-mansion"}]}