{"id":26,"name":"X-COM: Apocalypse","slug":"x-com-apocalypse","url":"https:\/\/www.igdb.com\/games\/x-com-apocalypse","created_at":1297688760000,"updated_at":1546840932434,"summary":"Your mission, as X-COM Commander, is to combat alien aggression and uncover their deadly intentions. But Beware! Alien infiltration into the city and its politics could see you under fire from criminal gangs, religious sects, and even the police! Alien fleets fill the skies, creatures terrorise the city, chaos reigns... Welcome to the war, welcome to the Apocalypse.","storyline":"Half a century after the end of the second X-COM campaign, the last battle of T'leth has severely damaged Earth's biosphere. As a result, several self-contained Megalopolis-type cities were proposed to provide habitation for humanity. The game follows Mega-Primus, the first of these cities, built over the ruins of Toronto, Canada. Meanwhile, the off-world colony of Mars is exploited by the Elerium mining corporation, Solmine, and oppressed by MarSec (MARs SECurity). \n \nThe alien threat in the game is presented by a new race of organic, extradimensional aliens that initially seem to have no relation to the aliens of the previous two games, though later missions set in the aliens' home dimension reveal they have enslaved Sectoid survivors. These new aliens attack the city through tetrahedron-shaped teleport gates. The player must find out how to send their own aircraft, along with X-COM agents, through these gates without being destroyed and take the war to the aliens. Apocalypse has 14 races of alien beings including Anthropods, Brainsuckers, Hyperworms, Megaspawns, and Micronoids. Each race has various strengths and weaknesses, and some races are dependent on other races. The \"alien life cycle\" plays a crucial role in the game. \n \nThe player is exposed to this \"alien life cycle\" through research and more importantly the lower level alien attacks during specimen gathering combat. Primarily the attack of the weaponized alien the Brain-Sucker which attacks individuals after landing from a pod launcher utilized by alien foot soldiers. The Brain-Sucker hatches and attacks the nearest individual by jumping on their head and seemingly injecting something into them through the mouth and dying immediately after the attempt. \n \nThe life cycle later takes a mysterious turn as it shows no connection between the lower alien forms and higher alien forms. Eventually, however, it is found the leaders of the invasion are the Micronoids, a race of sapient single-celled organisms that live in the bloodstreams of the other aliens; the ultimate goal of the invasion is to inject Micronoids into the bloodstreams of important figures, allowing them to control Mega-Primus through psionic domination of their hosts. The player is eventually tasked with invading the aliens' homeworld and destroying their side of the gate as the only way to stop the Micronoid infestation.","collection":14,"rating":67.0510026806057,"popularity":2,"total_rating":67.0510026806057,"total_rating_count":6,"rating_count":6,"games":[9789,30229,13200,18435,22387,17130,8773,33153,17111,16935],"tags":[1,18,19,39,268435467,268435471,268435472,268435480,536870915,536871327,536871644,536871859,536871882,536872019,536872032,536872070,536872647,536872817,536872898,536873874,536874694,536875046,536875151,536875160,536875356,536875358,536875361,536875531,536875763,536876365,536876366,536878296,536880294,536880356,536881001,1073741827],"developers":[180],"publishers":[152],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[3,415,732,947,970,1107,1120,1158,1735,1905,1986,2962,3782,4134,4239,4248,4444,4446,4449,4619,4851,5453,5454,7384,9382,9444,10089],"themes":[1,18,19,39],"genres":[11,15,16,24],"first_release_date":867628800000,"platforms":[6,13],"release_dates":[{"category":0,"platform":6,"date":867628800000,"human":"1997-Jun-30","y":1997,"m":6},{"category":0,"platform":13,"date":867628800000,"human":"1997-Jun-30","y":1997,"m":6}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ggvj5opippax5sr1vhh7.jpg","cloudinary_id":"ggvj5opippax5sr1vhh7","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lo5fkvdcxe7ctst0fkok.jpg","cloudinary_id":"lo5fkvdcxe7ctst0fkok","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eoiphehvzilx9trrixbx.jpg","cloudinary_id":"eoiphehvzilx9trrixbx","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/whoufh6fizmi5lvr6nfv.jpg","cloudinary_id":"whoufh6fizmi5lvr6nfv","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ge9p4ayjsruufxoczyni.jpg","cloudinary_id":"ge9p4ayjsruufxoczyni","width":640,"height":480}],"videos":[{"name":"Trailer","video_id":"PWKDNX_heak"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oco64svvadgbvqnxz8he.jpg","cloudinary_id":"oco64svvadgbvqnxz8he","width":528,"height":650},"external":{"steam":"7660"}}