{"id":72826,"name":"Detective Evangelion","slug":"detective-evangelion","url":"https:\/\/www.igdb.com\/games\/detective-evangelion","created_at":1507134672209,"updated_at":1515724882252,"summary":"Detective Evangelion (Meitantei Evangelion), an adventure\/strategy PS2 game published by Broccoli, follows Shinji Ikari, a detective hired by Nerv, as he attempts to uncover the truths behind a series of murders. The game was released in Japan on Jan 17, 2007 and include voices from all the original Seiyū. There were 2 editions of the game: a standard edition which included a Nerv magnifying glass\/key chain if you pre-ordered; and the premium edition (about 26,040円) which included a multi-face analog watch. \n \nYou play as Shinji the detective in an adventure style gameplay, talking to the Nerv personel and other people in the environment in order to pick up clues within the conversations. The game starts as Shinji emerges from an outdoor stall with sirens blaring in the background. He then finds Rei Ayanami being attacked by a teenager with tentacles. Shinji must then fight the teenager in order to free Rei. From this point on, you pick locations and explore, the ultimate goal being to discover the identity of the killer that's committing murders all over Nerv and Tokyo-3. At each of the locations, you can interact with the people there, with the occasional action sequence or mini game. All of Shinji's friends, Gendo and Misato all appear in the game.","collection":4077,"franchise":866,"franchises":[866],"popularity":1,"games":[27314,19448,55803,26766,25300,36950,29730,13189,11567,22482],"tags":[18,268435487,536870981,536870990,536871882,536871939,536875053,536875318,536878455,536878502,536879752,536880918],"developers":[12367],"publishers":[6307],"category":0,"keywords":[69,78,970,1027,4141,4406,7543,7590,8840,10006],"themes":[18],"genres":[31],"first_release_date":1169078400000,"platforms":[8],"release_dates":[{"category":0,"platform":8,"date":1169078400000,"region":5,"human":"2007-Jan-18","y":2007,"m":1}],"alternative_names":[{"name":"Meitantei Evangelion","comment":"Japanese title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wzti95rkd3fcgxl0lm3e.jpg","cloudinary_id":"wzti95rkd3fcgxl0lm3e","width":500,"height":714}}