{"id":113,"name":"OnLive Game System","logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ejztsio37tpgpgd8i1kq.jpg","cloudinary_id":"ejztsio37tpgpgd8i1kq","width":590,"height":320},"slug":"onlive-game-system","url":"https:\/\/www.igdb.com\/platforms\/onlive-game-system","created_at":1439410567751,"updated_at":1439684932777,"website":"http:\/\/onlive.com","versions":[{"name":"Initial version","slug":"initial-version","url":"https:\/\/www.igdb.com\/platforms\/onlive-game-system\/version\/initial-version","summary":"OnLive was a Mountain View, California-based provider of cloud visualization technologies. OnLive's flagship product was its cloud gaming service, which allowed subscribers to rent or demo computer games without installing them on their device. Games were delivered to OnLive's client software as streaming video rendered by the service's servers, rather than rendered locally by the device. This setup allowed the games to run on computers and devices that would normally be unable to run them due to insufficient hardware, and also enabled other features, such as the ability for players to record and spectate gameplay. The service was available through clients for personal computers and mobile devices, as well as through smart TVs and a dedicated video game console-styled device known as the OnLive Game System. OnLive also expanded into the cloud desktop market with a sister product, OnLive Desktop—a subscription service offering a cloud-based instance of Windows Server 2008 R2 accessible via tablets.\n\nThe OnLive service received mixed reception. Critics noted that the video quality and amount of input lag varied on a game-by-game basis, and did not consider OnLive to be a complete substitute to owning games and playing them on local hardware due to these inconsistencies and other factors that prospective users may consider, such as the overall cost of the service as opposed to simply upgrading their existing computers. Critics praised the service for allowing users to demo games without the need to install them, along with its built-in spectator mode.\n\nOn April 2, 2015, it was announced that Sony Computer Entertainment had acquired OnLive's patents, and that all OnLive services would be discontinued on April 30, 2015. Sony operates PlayStation Now, a similar service built using the infrastructure of Gaikai, a former competitor to OnLive.","logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ejztsio37tpgpgd8i1kq.png","cloudinary_id":"ejztsio37tpgpgd8i1kq","width":590,"height":320},"release_dates":[{"date":1276732800000,"region":2}]}]}