{"id":133,"name":"Philips Videopac G7000","logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fqwnmmpanb5se6ebccm3.jpg","cloudinary_id":"fqwnmmpanb5se6ebccm3","width":4272,"height":2560},"slug":"philips-videopac-g7000","url":"https:\/\/www.igdb.com\/platforms\/philips-videopac-g7000","created_at":1477304835844,"updated_at":1477304845656,"alternative_name":"Magnavox Odyssey²","versions":[{"name":"Initial version","slug":"initial-version","url":"https:\/\/www.igdb.com\/platforms\/philips-videopac-g7000\/version\/initial-version","summary":"The Videopac used the standard joystick design of the 1970s and early 1980s: the original console had a moderately-sized silver controller, held in one hand, with a square housing for its eight-direction stick that was manipulated with the other hand. Later releases had a similar black controller, with an 8-pointed star-shaped housing for its eight-direction joystick. In the upper corner of the joystick was a single 'Action' button, silver on the original controllers and red on the black controllers. The games, graphics and packaging were designed by Ron Bradford and Steve Lehner.\n\nOne other difference in these controllers is that the earliest releases of the silver joystick were removable. They could be plugged and unplugged from the back of the unit, while all later silver and all black controllers were hardwired into the rear of the unit itself (although the joysticks still can be easily replaced, but not without dismounting the cover deck).\n\nOne of the strongest points of the system was its speech synthesis unit, which was released as an add-on for speech, music, and sound effects enhancement. The area that the Odyssey² may be best remembered for was its pioneering fusion of board and video games: The Master Strategy Series. The first game released was Quest for the Rings!, with gameplay somewhat similar to Dungeons &amp; Dragons, and a storyline reminiscent of J. R. R. Tolkien's The Lord of the Rings. Later, two other games were released in this series, Conquest of the World and The Great Wall Street Fortune Hunt, each with its own gameboard.\n\nIts graphics and few color choices, compared to its biggest competitors at the time—the Atari 2600, Mattel's Intellivision and the Bally Astrocade—were its \"weakest point\". Of these systems, the Odyssey² was listed by Jeff Rovin as being the third in total of sales, and one of the seven major video game suppliers.","manufacturers":[{"company":11383,"comment":"US-market"},{"company":11384,"comment":"European market"}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fqwnmmpanb5se6ebccm3.png","cloudinary_id":"fqwnmmpanb5se6ebccm3","width":4272,"height":2560},"release_dates":[{"date":281318400000,"region":1},{"date":315446400000,"region":2}]}]}