{"id":14,"name":"Mac","logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jl4t4o64uv2gizj2dxsy.jpg","cloudinary_id":"jl4t4o64uv2gizj2dxsy","width":1024,"height":1024},"slug":"mac","url":"https:\/\/www.igdb.com\/platforms\/mac","created_at":1297678396000,"updated_at":1394314490381,"website":"https:\/\/www.apple.com\/osx\/","alternative_name":"Mac OS","versions":[{"name":"Panther","slug":"panther","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/panther","summary":"Mac OS X Panther (version 10.3) is the fourth major release of Mac OS X, Apple’s desktop and server operating system. It had features such as a refined brushed metal interface, fast user switching, Exposé tool for window management, built-in X11 support and on-the-fly user home folder encryption and decryption.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lgboqvrjxbhm9crh0gmk.png","cloudinary_id":"lgboqvrjxbhm9crh0gmk","width":79,"height":89},"release_dates":[{"date":1066953600000,"region":8}]},{"name":"Puma","slug":"puma","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/puma","summary":"Mac OS X version 10.1, code named Puma, is the second major release of Mac OS X, Apple's desktop and server operating system. Version 10.1 was released as a free update for Mac OS X 10.0 users. The operating system was better received than Mac OS X 10.0, although critics claimed that the operating system was still lacking some features and was plagued with bugs.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/luxugq3uspac6qqbvqwk.png","cloudinary_id":"luxugq3uspac6qqbvqwk","width":70,"height":95},"release_dates":[{"date":1001376000000,"region":8}]},{"name":"Tiger","slug":"tiger","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/tiger","summary":"Mac OS X v10.4 Tiger is the fifth major release of Mac OS X, Apple's desktop and server operating system for Mac computers. Some of the new features included a fast searching system called Spotlight, a new version of the Safari web browser, Dashboard, a new ‘Unified’ theme, and improved support for 64-bit addressing on Power Mac G5s. Tiger shocked executives at Microsoft by offering a number of features, such as fast file searching and improved graphics processing, that Microsoft had spent several years struggling to add to Windows with acceptable performance. Apple announced a transition to Intel x86 processors during Tiger's lifetime, making it the first Apple operating system to work on Apple–Intel architecture machines.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jp06zemqemczisfaxsgl.png","cloudinary_id":"jp06zemqemczisfaxsgl","width":89,"height":104},"release_dates":[{"date":1114732800000,"region":8}]},{"name":"Jaguar","slug":"jaguar","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/jaguar","summary":"Mac OS X version 10.2 Jaguar is the third major release of Mac OS X, Apple's desktop and server operating system. The operating system was generally well received by most Mac users as a large step forward in the areas of stability, general speed enhancements, compatibility with other flavors of Unix and the lineup of both graphical and terminal applications available; however, many critics still claimed that significant user interface speed issues existed and that the operating system was still a big step down from Mac OS 9. Jaguar was the first Mac OS X release to publicly use its code name in marketing and advertisements, a practice that has continued in subsequent releases of the operating system.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fua8zdpguizpoyzfvkou.png","cloudinary_id":"fua8zdpguizpoyzfvkou","width":70,"height":99},"release_dates":[{"date":1030060800000,"region":1}]},{"name":"Mavericks","slug":"mavericks","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/mavericks","summary":"OS X Mavericks (version 10.9) is the tenth major release of OS X, Apple Inc.'s desktop and server operating system for Macintosh computers. It was released as a free update. The update emphasized battery life, Finder improvements, other improvements for power users, and continued iCloud integration, as well as bringing more of Apple's iOS apps to OS X. Mavericks, which was named for the surfing location in California, was the first in the series of OS X releases named for places in Apple's home state; earlier releases used the names of big cats.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lsyardp2tldsqglhscqh.png","cloudinary_id":"lsyardp2tldsqglhscqh","width":316,"height":316},"release_dates":[{"date":1382400000000,"region":8}]},{"name":"Mountain Lion","slug":"mountain-lion","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/mountain-lion","summary":"OS X Mountain Lion (version 10.8) is the ninth major release of OS X (formerly called Mac OS X), Apple Inc.'s desktop and server operating system for Macintosh computers. Named to signify its status as a refinement of the previous OS X version, Lion, Apple's stated aims in developing Mountain Lion were to allow users to more easily manage and synchronise content between multiple Apple devices and to make the operating system more familiar. The operating system gained the new malware-blocking system Gatekeeper and integration with Apple's online Game Center and iCloud services, while the Safari web browser was updated to version 6. As on iOS, Notes and Reminders became full applications, separate from Mail and Calendar, while the iChat application was replaced with a version of iOS's Messages. Mountain Lion also added a version of iOS's Notification Center, which groups updates from different applications in one place.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vpprk3kkeloztxesyoiv.png","cloudinary_id":"vpprk3kkeloztxesyoiv","width":300,"height":300},"release_dates":[{"date":1343174400000,"region":8}]},{"name":"Lion","slug":"lion","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/lion","summary":"Mac OS X Lion (version 10.7), marketed as OS X Lion, is the eighth major release of Mac OS X, Apple's desktop and server operating system for Macintosh computers. It brings many developments made in Apple's iOS, such as an easily navigable display of installed applications, to the Mac, and includes support for the Mac App Store, as introduced in Mac OS X Snow Leopard.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yaguodfpr4ucdiakputb.png","cloudinary_id":"yaguodfpr4ucdiakputb","width":200,"height":206},"release_dates":[{"date":1311120000000,"region":8}]},{"name":"El Capitan","slug":"el-capitan","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/el-capitan","summary":"OS X El Capitan (version 10.11) is the upcoming twelfth major release of OS X, Apple Inc.'s desktop and server operating system for Macintosh computers. It is the successor of OS X Yosemite and focuses mainly on performance, stability and security. It will be available as a free update.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jl4t4o64uv2gizj2dxsy.png","cloudinary_id":"jl4t4o64uv2gizj2dxsy","width":1024,"height":1024},"release_dates":[{"date":1451520000000,"region":8}]},{"name":"Cheetah","slug":"cheetah","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/cheetah","summary":"Mac OS X version 10.0, code named Cheetah, is the first major release of Mac OS X, Apple’s desktop and server operating system. Mac OS X v10.0 was a radical departure from the previous classic Macintosh operating system (Mac OS) and was Apple’s long awaited answer for a next generation Macintosh operating system. It introduced a brand new code base completely separate from Mac OS 9's, as well as all previous Apple operating systems. Mac OS X introduced the new Darwin Unix-like core and a completely new system of memory management. Cheetah proved to be a rocky start to the Mac OS X line, plagued with missing features and performance issues, although it was praised for being a good start to an operating system still in its infancy, in terms of completeness and overall operating system stability. Unlike later releases of Mac OS X, the cat-themed code name was not used in marketing the new operating system.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/eatvxlflfq0lk8p8sp2c.png","cloudinary_id":"eatvxlflfq0lk8p8sp2c","width":70,"height":95},"release_dates":[{"date":985392000000,"region":8}]},{"name":"Snow Leopard","slug":"snow-leopard","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/snow-leopard","summary":"Mac OS X Snow Leopard (version 10.6) is the seventh major release of Mac OS X, Apple's desktop and server operating system for Macintosh computers. Unlike those of previous versions of Mac OS X, the goals of Snow Leopard were improved performance, greater efficiency and the reduction of its overall memory footprint. Much of the software in Mac OS X was extensively rewritten for this release in order to take advantage fully of modern Macintosh hardware. New programming frameworks, such as OpenCL, were created, allowing software developers to use graphics cards in their applications. This is also the first Mac OS release since System 7.1.1 that does not support Macs using PowerPC processors, as Apple now intends to focus on its current line of Intel-based products. As support for Rosetta was dropped in OS X Lion, Snow Leopard is the last version of Mac OS X that is able to run PowerPC-only applications. Snow Leopard is the last release of Mac OS X to support the 32-bit Intel Core Solo and Intel Core Duo CPUs.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jiy43xitvtxfi16wcdyd.png","cloudinary_id":"jiy43xitvtxfi16wcdyd","width":850,"height":1024},"release_dates":[{"date":1251417600000,"region":8}]},{"name":"Yosemite","slug":"yosemite","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/yosemite","summary":"OS X Yosemite (version 10.10) is the eleventh major release of OS X, Apple Inc.'s desktop and server operating system for Macintosh computers. Yosemite introduced a major overhaul of OS X's user interface. Its graphics replaced skeuomorphism with flat graphic design and blurred translucency effects, following the aesthetic introduced with iOS 7. Many of Yosemite's new features focus on the theme of continuity, increasing its integration with other Apple services and platforms such as iOS and iCloud.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/df1raex6oqgcp56leff4.png","cloudinary_id":"df1raex6oqgcp56leff4","width":316,"height":314},"release_dates":[{"date":1413417600000,"region":8}]},{"name":"Leopard","slug":"leopard","url":"https:\/\/www.igdb.com\/platforms\/mac\/version\/leopard","summary":"Mac OS X Leopard (version 10.5) is the sixth major release of Mac OS X, Apple's desktop and server operating system for Macintosh computers. Leopard is the final version of Mac OS X to support the PowerPC architecture as Snow Leopard functions solely on Intel based Macs. According to Apple, Leopard contains over 300 changes and enhancements over its predecessor, Mac OS X Tiger, covering core operating system components as well as included applications and developer tools. Leopard introduces a significantly revised desktop, with a redesigned Dock, Stacks, a semitransparent menu bar, and an updated Finder that incorporates the Cover Flow visual navigation interface first seen in iTunes. Other notable features include support for writing 64-bit graphical user interface applications, an automated backup utility called Time Machine, support for Spotlight searches across multiple machines, and the inclusion of Front Row and Photo Booth, which were previously included with only some Mac models.","developers":[{"company":2407}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/db0qv9ovisi8e0isgkby.png","cloudinary_id":"db0qv9ovisi8e0isgkby","width":850,"height":1024},"release_dates":[{"date":1193356800000,"region":8}]}]}