{"id":16,"name":"Amiga","slug":"amiga","url":"https:\/\/www.igdb.com\/platforms\/amiga","created_at":1297880654000,"updated_at":1417446692452,"versions":[{"name":"Amiga A 3000T","slug":"amiga-a-3000t","url":"https:\/\/www.igdb.com\/platforms\/amiga\/version\/amiga-a-3000t"},{"name":"Amiga A 500","slug":"amiga-a-500","url":"https:\/\/www.igdb.com\/platforms\/amiga\/version\/amiga-a-500","summary":"In 1982, the Amiga Corporation developed \"Lorraine\" a computer that was named after the wife of the company's president. Amiga incorporated a 16-bit 68000 chip as Lorraine's CPU. Lorraine featured two dedicated graphics and sound chips.\n\nBy the time Lorraine was introduced at the Consumer Electronics Show on January 4, 1984, the developmental costs that Amiga had devoted to it had exceeded its resources. After Atari showed interest in purchasing the company, Commodore stepped in to outbid the console giant and renamed the system the Amiga.\n\nCommodore made some slight modifications to the Amiga. The system's memory was upgraded to 256KB and the console was redesigned to accommodate keyboard storage underneath it. Commodore finally released the Amiga 1000 in July 1985 at a retail price of $1,295. It was compatible with home television sets and could be utilized for video editing. It featured a palette of 4,096 colors and was capable of 320 x 200 resolution. The system also featured a 3.5 inch floppy disk drive that could externally store up to 880KB.\n\nThe \"Paula\" sound chip enabled programs to be heard in stereo. The system featured two mouse\/controller ports. Such peripherals as joysticks, light pens or game paddles could be used with the system. Even in its early stages of release, Commodore chose to promote the Amiga as a game machine.\n\nThe \"kickstart\" was a small part of the operating system that was contained in the ROM. The Amiga performed a kickstart or initiated the loading of the operating system itself every time the computer was activated. To fully load the operating system a 3.5 inch AmigaDos disk needed to be inserted into the external drive. Every time the computer was shut off, the operating system was lost from memory and needed to be reloaded.\n\nThe Amiga 1000 was capable of \"multitasking.\" A concept similar to Windows 95, multitasking allowed users to keep two or more programs open at one time and instantly switch between them. The \"Workbench\" was the Amiga's file manager. Workbench allowed users to open windows and run programs.\n\nIn 1987, Commodore released the Amiga 500 and the Amiga 2000. The Amiga 500 was a compact system that became the best selling computer in the Amiga line. Among the improvements Commodore incorporated into the Amiga 500 were an updated operating system (AmigaDOS 1.2), 512KB RAM and a bigger keyboard. The Amiga 2000 featured a new computer case design, expansion slots and a CPU slot for future processor upgrades. It was powered by a 68000 microprocessor.\n\nThe Amiga 3000 improved on the Amiga 2000 by offering new Zorro III expansion slots, an integrated SCSI interface and a built-in hard drive. It used a 68030 32-bit microprocessor and a new version of Workbench.\n\nIn 1992 Commodore released the Amiga 600. Commodore promoted the system as a video game console with a keyboard. It quickly vanished from store shelves. Later that year Commodore released the Amiga 4000 and the Amiga 1200. The 4000 featured the speedy 68040 processor. It could display up to 256,000 colors on-screen at once. The 1200 was a compact system that combined the CPU, keyboard and disk drive into a single unit. It was similar in design to the Amiga 500. It utilized the 68020 processor and could run at 14.28MHz.\n\nIn October 1993 Commodore introduced the Amiga CD 32. This 32-bit CD-ROM based add-on featured a palette of 17 million colors. It retailed for $400 and had a built-in catalog of software because it was compatible with game titles for the failed Commodore CDTV multimedia system. Timing for the CD 32's release was not perfect. Several other CD-ROM based gaming consoles, like the 3DO and Sega CD, were released at the same time and flooded the market. The Amiga CD 32 system never gained a following.\n\nUnfortunately, software developers rarely released programs that displayed the full potential of the Amiga's impressive graphics. The system was much more technologically advanced than its competitors. Ultimately the Amiga was viewed as an expensive gaming console, and as software support dwindled, so did sales. On April 29, 1994 Commodore announced that it was in the process of closing the company.","os":"AmigaOS v1.2 - 1.3","cpu":"Motorola 68000 @ 7.16 MHz (NTSC) 7.09 MHz (PAL)","memory":"512 kB (9 MB maximum)","sound":"4× 8-bit channels PCM at max 28 kHz with 6-bit volume in stereo","media":"880 kB floppy disks","resolutions":"736x567i 4-bpp PAL (736x483i 4 bpp NTSC), 368x567i 6 bpp PAL (368x483i 6 bpp NTSC)","release_dates":[{"date":560044800000}]},{"name":"Amiga A 1000","slug":"amiga-a-1000","url":"https:\/\/www.igdb.com\/platforms\/amiga\/version\/amiga-a-1000"},{"name":"Amiga A 2000","slug":"amiga-a-2000","url":"https:\/\/www.igdb.com\/platforms\/amiga\/version\/amiga-a-2000"},{"name":"Amiga A 3000","slug":"amiga-a-3000","url":"https:\/\/www.igdb.com\/platforms\/amiga\/version\/amiga-a-3000"},{"name":"Amiga A 600","slug":"amiga-a-600","url":"https:\/\/www.igdb.com\/platforms\/amiga\/version\/amiga-a-600","summary":"Codenamed \"June Bug\" this was the successor to Amiga's A500 model.","os":"AmigaOS 2.0","cpu":"Motorola 68000","storage":"20MB 2.5\" Disk Drive","memory":"1MB","manufacturers":[{"company":4639}],"release_dates":[{"date":699408000000,"region":8}]}]}