{"id":6,"name":"PC (Microsoft Windows)","logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xtlhtldurl2s6r9t7lxz.jpg","cloudinary_id":"xtlhtldurl2s6r9t7lxz","width":2000,"height":2000},"slug":"win","url":"https:\/\/www.igdb.com\/platforms\/win","created_at":1297639288000,"updated_at":1470063140518,"website":"http:\/\/windows.microsoft.com\/","alternative_name":"mswin","versions":[{"name":"Windows Vista","slug":"windows-vista","url":"https:\/\/www.igdb.com\/platforms\/win\/version\/windows-vista","summary":"New features of Windows Vista include an updated graphical user interface and visual style dubbed Aero, a new search component called Windows Search, redesigned networking, audio, print and display sub-systems, and new multimedia tools including Windows DVD Maker","developers":[{"company":128}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gir4etc99vows85ip0bj.png","cloudinary_id":"gir4etc99vows85ip0bj","width":1034,"height":1034},"release_dates":[{"date":1170115200000,"region":8}]},{"name":"Windows 7","slug":"windows-7","url":"https:\/\/www.igdb.com\/platforms\/win\/version\/windows-7","summary":"Unlike Windows Vista's many new features, Windows 7 was an incremental upgrade designed to work with Vista-compatible applications and hardware. Presentations given by Microsoft in 2008 focused on multi-touch support, an updated Windows shell with a new taskbar, referred to internally as the Superbar, a home networking system called HomeGroup, and performance improvements.","developers":[{"company":128}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ns0leed0esdoc4oevjhg.png","cloudinary_id":"ns0leed0esdoc4oevjhg","width":1034,"height":1034},"release_dates":[{"date":1256169600000,"region":8}]},{"name":"Windows 8","slug":"windows-8","url":"https:\/\/www.igdb.com\/platforms\/win\/version\/windows-8","summary":"Windows 8 introduced major changes to the operating system's platform and user interface to improve its user experience on tablets, where Windows was now competing with mobile operating systems, including Android and iOS.","developers":[{"company":128}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rfepydpgvd2y6zwx7kiu.png","cloudinary_id":"rfepydpgvd2y6zwx7kiu","width":2000,"height":2000},"release_dates":[{"date":1351209600000,"region":8}]},{"name":"Windows XP","slug":"windows-xp","url":"https:\/\/www.igdb.com\/platforms\/win\/version\/windows-xp","summary":"Windows XP, the successor to Windows 2000 and Windows ME, was the first consumer-oriented operating system produced by Microsoft to be built on the Windows NT kernel. Windows XP was released worldwide for retail sale on October 25, 2001, and over 400 million copies were in use in January 2006","developers":[{"company":128},{"company":128}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wiqjpwf8ilpslqvd2mdf.png","cloudinary_id":"wiqjpwf8ilpslqvd2mdf","width":1158,"height":1158},"release_dates":[{"date":1003968000000,"region":8}]},{"name":"Windows 10","slug":"windows-10","url":"https:\/\/www.igdb.com\/platforms\/win\/version\/windows-10","summary":"Windows 10 (codenamed Threshold) is an operating system developed by Microsoft as part of the Windows NT family of operating systems. To encourage its adoption, Microsoft announced that during its first year of availability, Windows 10 would be made available free of charge to users of genuine copies of eligible editions of Windows 7 or Windows 8.1.\n\nWindows 10 introduces what Microsoft described as a \"universal\" application architecture; expanding on Metro-style apps, these apps can be designed to run across multiple Microsoft product families with nearly identical code—including PCs, tablets, smartphones, embedded systems, Xbox One, Surface Hub and HoloLens. Windows 10's user interface was revised to handle transitions between a mouse-oriented interface and a touchscreen-optimized interface based on available input devices—particularly on laplets; both interfaces include an updated Start menu that comprises a design similar to Windows 7 with 8's tiles. Windows 10 also introduces Task View, a virtual desktop system, the Microsoft Edge web browser and other new or updated applications, integrated support for fingerprint and face recognition login, new security features for enterprise environments, DirectX 12 and WDDM 2.0 to improve the operating system's graphics capabilities for games.","developers":[{"company":128}],"logo":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xtlhtldurl2s6r9t7lxz.png","cloudinary_id":"xtlhtldurl2s6r9t7lxz","width":2000,"height":2000},"release_dates":[{"date":1438128000000,"region":8}]}]}