{"id":11972,"name":"Blue Max: Aces of the Great War","slug":"blue-max-aces-of-the-great-war","url":"https:\/\/www.igdb.com\/games\/blue-max-aces-of-the-great-war","created_at":1441093798222,"updated_at":1515587927758,"summary":"1914- the peaceful, blue skies over France are shattered forever by the machine guns of mankind's first fighting aircraft.\n\nThe medal \"Pour le merite\"- the British called it \"the Blue Max\"- was awarded to the best German pilots of World War I. To flyers of both sides it symbolized the utmost in daring, courage and honor during a time that will never be repeated in the story of aviation.\n\nFame was rated daily on the numbers of planes shot down; rapid advances were made in flying technology and techniques; men prepared them selves to die at the word of a leader. And out of it all grew the desire to fly and win that pushed pilots, airplanes, and the newborn aviation industry to the limits.\n\nIn Blue Max, Aces of the Great War, begin by choosing sides and one of eight fighters. Action is immediate and relentless, as you fly the most famous aircraft of the time- Fokker, Spad, Nieuport, Sopwith, Albatros- with the best of the best, including Richthofen, Fonck, Mannock, and Rickenbacker. Learn the characteristics of each plane, and the different tricks and techniques of each ace.\n\nDifferent playing modes let one or two players fly solo, as a team, or against each other using the same computer. Fly in full-action dogfights, undertake missions to destroy bridges and observation balloons, or work out strategies one segment at a time in detail.","collection":1784,"popularity":1,"games":[18623,29173,23345,55590,19934,21642,55036,9199,19376,55689],"tags":[22,39,268435469,268435471,536870941,536870948,536870968,536871904,536872060,536874694,1073741825],"publishers":[7186,489],"category":0,"player_perspectives":[1],"game_modes":[1,2,4],"keywords":[29,36,56,992,1148,3782],"themes":[22,39],"genres":[13,15],"first_release_date":694137600000,"platforms":[13,16],"release_dates":[{"category":2,"platform":16,"date":694137600000,"human":"1991","y":1991,"m":12},{"category":7,"platform":13,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vcjrnveakbczscj5xvva.jpg","cloudinary_id":"vcjrnveakbczscj5xvva","width":320,"height":256},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rtjxieyhnpm8occaxhzs.jpg","cloudinary_id":"rtjxieyhnpm8occaxhzs","width":320,"height":256}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cirnm2vvut8i8oeilenx.jpg","cloudinary_id":"cirnm2vvut8i8oeilenx","width":747,"height":887}}