{"id":15872,"name":"Championship Golf","slug":"championship-golf","url":"https:\/\/www.igdb.com\/games\/championship-golf","created_at":1452468364355,"updated_at":1540412367074,"summary":"Volume One: Pebble Beach \n \nAmong the great courses of the world, few can match it. Even among the great golfers of all time, none will claim to have tamed it. \n \nPebble Beach. \n \nChampionship Golf puts you there, in a simulation so real, you'll feel the crack of the ball as it sails off your driver... and the sand in your shoes as you blast out of a deep bunker. \n \nSo go ahead. Tee it up on Number 1. It's only 6,600 yards to the 18th green. And Pebble Beach will make you work every inch. \n \nYou are there. The 18th tee at Pebble Beach. You look out over one of the most spectacular and challenging pieces of real estate in the world. Your decisions and skill will mean the difference between an electrifying birdie or a humbling bogey. \n \nHole after hole, shot after shot, Championship Golf challenges you to play the same 18 holes that the pros consider to be some of the most beautiful and toughest in the world. All 18 holes are completely and authentically recreated. You'll even have to compensate for the wind off the ocean. \n \nYou control all aspects of your game. Carry a bag of fourteen clubs. Determine which club to use, foot positioning, wrist and body action, and type of swing. You can warm up on the driving range or the putting green. \n \nWhatever your handicap, Championship Golf gives you the chance to play one of the world's great courses - all for less than the cost of a round at Pebble Beach. \n \nTee it up!","popularity":1.333333333333333,"games":[102805,31920,81145,100887,100359,109446,104819,103218,106814,103275],"tags":[268435470],"category":0,"genres":[14],"first_release_date":536371200000,"platforms":[16],"release_dates":[{"category":2,"platform":16,"date":536371200000,"human":"1986","y":1986,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aplpvvoiru8slt4ruc02.jpg","cloudinary_id":"aplpvvoiru8slt4ruc02","width":564,"height":714}}