{"id":19372,"name":"Space Wars","slug":"space-wars","url":"https:\/\/www.igdb.com\/games\/space-wars","created_at":1464628826715,"updated_at":1517270846008,"summary":"Space Wars is an early vector graphics arcade game. It is based on Spacewar!, a PDP-1 program. It was ported to the Vectrex in 1982. \nSpace Wars was the brainchild of Larry Rosenthal, an MIT graduate who was fascinated with the original Spacewar! and developed his own custom hardware and software so that he could play the game. Cinematronics worked with Rosenthal to produce the Space Wars system. \nTwo players controlled different ships. One button rotated the ship left, another rotated the ship right, one engaged thrust, one fired a shell, and one entered hyperspace (which causes the ship to disappear and reappear elsewhere on the playfield at random). \nThe game offered a number of gameplay options, including the presence or absence of a star in the middle of the playfield (which exerted a positive or negative gravitational pull), whether the edges of the playfield \"wrapped around\" to their opposite sides, and whether shells bounced. Three other fascinating features were unique to this game. First, the game could not be played in \"one player\" mode; a human opponent was required. Second, the player's ship could take a glancing hit without dying, but would suffer damage; a cloud of loose ship fragments would break off and float away, after which the ship would be visibly damaged on screen and would turn and accelerate more slowly. Third and most memorable was that the duration of play for any contest was solely governed by the amount of money deposited; each quarter bought a minute and a half of play. A dollar bought six minutes, and for a ten dollar roll of quarters two players could play non-stop for an hour.","popularity":2,"games":[68287,36950,28029,27314,64204,142,71455,25300,27523,11253],"tags":[1,18,268435461,268435489,536871859,536871882,536871886,536871937,536873246,536880437,1073741826],"developers":[1139],"publishers":[1139,9539],"category":0,"player_perspectives":[2],"game_modes":[2],"keywords":[947,970,974,1025,2334,9525],"themes":[1,18],"genres":[5,33],"first_release_date":252374400000,"platforms":[70,95],"release_dates":[{"category":2,"platform":95,"date":252374400000,"region":2,"human":"1977","y":1977,"m":12},{"category":2,"platform":70,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wpzvwncozsmaq67dox7k.jpg","cloudinary_id":"wpzvwncozsmaq67dox7k","width":347,"height":591}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ro6gdqia5z66dhgqb2v7.jpg","cloudinary_id":"ro6gdqia5z66dhgqb2v7","width":640,"height":480},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Space_Wars"}]}