{"id":372,"name":"Heroes of Might and Magic V: Tribes of the East","slug":"heroes-of-might-and-magic-v-tribes-of-the-east","url":"https:\/\/www.igdb.com\/games\/heroes-of-might-and-magic-v-tribes-of-the-east","created_at":1300380202000,"updated_at":1538726150922,"summary":"Tribes of the East is the second expansion pack to the turn-based strategy game Heroes of Might and Magic V. \nFor the first time, play as the Orc faction and recruit heroes, build armies and manage cities as you explore and conquer legendary lands. Use tactics, skills and magic to outsmart fantasy armies while developing your heroes and unveiling the dark plot that threatens to tear the world of Ashan apart.","storyline":"Rage of the Tribes \nThe story begins after a Griffin Empire raid that results in the capture of several Orcs which causes the character Quroq, an Orc chief, to conquer a renegade Haven city, which rouses the attention of the false Queen Isabel. The queen sends forth her most trusted servant, the zealous Archbishop Alaric to ward off the Orc invasion. The events that happen between this and the next time we see the Orcs are unknown, though Quroq is killed by Alaric at some point. \n \nThe Will of Asha \nMeanwhile, the Necromancer Arantir is driven by his master, the Goddess Asha, to fight against the demonic corruption in the Haven cities. He meets up with a novice Dark Knight named Ornella, introduced to him by Giovanni the vampire. With Ornella, now turned into a Necromancer, at his side, Arantir sets out towards the city of Flammschrein, the holy city which has been desecrated by the demon Orlando. After killing Orlando, Arantir visits the graves of Flammschrein where he frees a fragment of the true Queen Isabel's soul. Upon doing so, the succubus impostor who had been taking the place of the queen is revealed and she is forced to change plans and take over the capital with brute force. \nArantir however learns of the Demon Messiah and leaves to attempt to stop the prophecy, leading to his appearance in Dark Messiah of Might and Magic. He does not appaear in the final campaign. \n \nTo Honor Our Fathers \nAt the same time (as it is revealed later), the young Orc Gotai takes lead of the Orcs and hopes to crush the demons. In order to do so, however, he must brave many trials, the first of which is to gather the support of various tribes. To do so, Gotai sends Kujin, who manages to assemble an army of Orcs. Gotai then chooses to respect the soul of Kunyak, the greatest of the Orcs who lead them to freedom, by going to his burial place in a wizard city. After doing so, he avenges the death of Quroq by killing Alaric. After the false queen was revealed as the Succubus Biara, Alaric had actually gone mad and hoped to kill all the Orcs believing that it was all just an illusion and he still was to follow the wishes of his master. Though Gotai offers Alaric the chance to die honourably, Alaric shows no sign of sanity in his final moments. \nDuring Kujins travels, it is also revealed that Biara had killed the heir of the Griffin Empire to corrupt the Heart of the Griffin, an artifact used to repel demons. It now summons demons to bolster Biara's ranks. \n \nFlying to the Rescue \nAfter the death of Alaric, Gotai and Kujin arrange a meeting with Zehir, with whom they ally for their common causes. Zehir begins by searching for Raelag, who he considers the best source to ask about the rumors surrounding Queen Isabel. While he never finds him, he allies himself with Ylaya to deal with the renegade Soulscar Clan. He then travels to the duchies of the Griffin Empire, where he must help Duncan and Freyda fight off the demonic influence. He does not participate in the fight directly, but he performs a rite that reveals the demons disguised as humans. After this event, the followers of the false queen realize their mistake and instead join Zehir. After Freyda and Duncan manage to fight off the demons, they agree to help Zehir in the final battle. \nZehir then travels to the dwarven mines to ensure the aid of Wulfstan, but the Dwarves who are in constant feud refuse to aid Zehir. Wulfstan, however, tells Zehir that if he manages to find Arkath, the fire god of the Dwarves, then maybe the Dwarves can ally and aid Zehir. After finding the portal to Arkath, Zehir is intercepted by Wulfstan's brother Rolf, who is determined not to let anyone pass until he is declared king. Rolf attacks Zehir but is defeated. After this victory, Zehir, Wulfstan and Hangvul, the spiritual leader of the Dwarves and Wulfstans remaining enemy, confront Arkath. Arkath announces that Wulfstan is to be king and that Hangvul must compensate for betraying him. With the dispute settled, the Dwarves prepare to drive the demons out of the Griffin Empire. \nZehir then travels to Talonguard, the capitol city of the Griffin Empire, now overrun by demons. While he makes his way past the guards that defend the way to the city, Zehir's allies destroy the surrounding Inferno towns and blockade Biara, who has escaped on multiple occasions already. After all other Inferno towns are destroyed, Zehir besieges Talonguard and finally confronts Biara, when the true Queen Isabel appears to finally kill Biara. While the Empire has been damaged heavily by her work, the demons have also taken major losses through the work of the protagonists, losing their cults not only in the Empire, but the Silver Cities and Ygg-Chall, home of the Dark Elves, as well. Isabel, tired of the events, then passes the crown to Freyda, proclaiming the end of the Griffin Empire, and the beginning of the Unicorn empire.","collection":194,"franchise":458,"franchises":[458],"rating":81.53306244821509,"popularity":1.333333333333333,"aggregated_rating":60,"aggregated_rating_count":2,"total_rating":70.76653122410755,"total_rating_count":21,"rating_count":19,"game":370,"games":[14394,370,5652,22387,28182,7615,8802,8335,26553,27092],"tags":[17,268435468,268435471,268435472,536871008,536871041,536871059,536871139,536871208,536871327,536871390,536871717,536871865,536871938,536872074,536872449,536872460,536872544,536873066,536873120,536874694,536875214,536875265,536875316,536875331,536875372,536875709,536875773,536875775,536875778,536875956,536876019,536876595,536876602,536877679,536878452,536878472,536878474,536878522,536879154,536879774,536880294,536880646,536880744,536880907,536882128,536882496,536883035,536883220,536883281,536883837,536886416,1073741827],"developers":[100],"publishers":[104],"game_engines":[286],"category":2,"player_perspectives":[3],"game_modes":[1,2],"keywords":[96,129,147,227,296,415,478,805,953,1026,1162,1537,1548,1632,2154,2208,3782,4302,4353,4404,4419,4460,4797,4861,4863,4866,5044,5107,5683,5690,6767,7540,7560,7562,7610,8242,8862,9382,9734,9832,9995,11216,11584,12123,12308,12369,12925,15504],"themes":[17],"genres":[12,15,16],"first_release_date":1192060800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1192147200000,"region":1,"human":"2007-Oct-12","y":2007,"m":10},{"category":0,"platform":6,"date":1192665600000,"region":2,"human":"2007-Oct-18","y":2007,"m":10},{"category":0,"platform":6,"date":1192060800000,"region":3,"human":"2007-Oct-11","y":2007,"m":10},{"category":0,"platform":6,"date":1223596800000,"region":8,"human":"2008-Oct-10","y":2008,"m":10}],"alternative_names":[{"name":"Heroes of Might and Magic 5: Tribes of the East","comment":"Other"},{"name":"英雄無敵5: 東方王朝 (資料片)","comment":"Chinese title"},{"name":"Heroes of Might & Magic V: Dzikie Hordy","comment":"Polish title"},{"name":"Heroes of Might and Magic V: Повелители Орды","comment":"Russian title"},{"name":"Герои Меча и Магии V: Повелители Орды","comment":"Russian title"},{"name":"HoMM V: Tribes of the East"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ndx3vngur3hpiixb6kqg.jpg","cloudinary_id":"ndx3vngur3hpiixb6kqg","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yvlxwwcx8dvnfaav7k0e.jpg","cloudinary_id":"yvlxwwcx8dvnfaav7k0e","width":1280,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rkz19pbvt4ce1bksvlo8.jpg","cloudinary_id":"rkz19pbvt4ce1bksvlo8","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hntgvyx8fbspjfpqrsr4.jpg","cloudinary_id":"hntgvyx8fbspjfpqrsr4","width":1280,"height":1024},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gvv0nihgy05xq6p2h5yw.jpg","cloudinary_id":"gvv0nihgy05xq6p2h5yw","width":1024,"height":819}],"videos":[{"name":"Trailer","video_id":"VF21Gl34tpM"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vgnzwgzke8glusodxlpe.jpg","cloudinary_id":"vgnzwgzke8glusodxlpe","width":520,"height":728},"esrb":{"rating":5},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\nIt contains: Realistic looking violence towards non human looking characters - Non realistic looking violence towards human characters.","rating":3},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/15370"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Heroes_of_Might_and_Magic_V:_Tribes_of_the_East"}],"external":{"steam":"15370"}}