{"id":38872,"name":"Vex Blocks","slug":"vex-blocks","url":"https:\/\/www.igdb.com\/games\/vex-blocks","created_at":1498056347163,"updated_at":1500211614653,"summary":"Electrify your mobile device with this futuristic, block-blasting puzzler! \n \n“Vex Blocks” is the easy-to-play, exciting and addictive block game. Match up blocks by symbol and\/or color to draw the longest chain of lightning possible. Draw lightning chains on your screen to surround and neutralize bomb blocks before they explode or to capture power-ups and increase your coin count. Collect coins to unlock new game modes or to gear up with unique power-ups like the Black Hole, X-Block or Nuke to help you along the way. Challenge your friends to beat your score and earn more coins, or team up and take on our score trials together! \n \nAre you up to the challenge? Download now! \nAvailable on Google Play: https:\/\/play.google.com\/store\/apps\/details?id=com.itzyinteractive.vexblocksfull \n \nGame Features: \n \n—————————————————– \n \nFOUR WAYS TO PLAY \n \n* FREEPLAY: Relax with a screen full of blocks just waiting to be ELECTRIFIED AND EXPLODED! BOO YAH! \n \n* TIMED: How long can you keep playing? Rack up as many points as you can while earning precious seconds with each lightning chain as you race the clock in the timed mode. \n \n* ARCADE: Use your lightning or power-ups to destroy blocks and reach your level goal, but don’t let the falling blocks fill the screen as the difficulty increases with each level. \n \n* PUZZLE: 80+ puzzles. Can you clear the blocks in the fewest moves possible? Challenge each unique puzzle level and clear all blocks without using up all your moves. \n—————————————————– \n \nPLAY WITH FRIENDS \nConnect to Facebook and challenge your Android and iOS friends to earn a higher score, or play cooperatively to beat score trials and earn even more coins. \n \nCONTROL GRAVITY \nRotate your device to alter gravity and change the block configuration, or use gravity to help you surround and capture Mystery Block power-ups or to neutralize Bomb Blocks before they deaden the blocks around them! \n \nCROSS PLATFORM PLAY \nPlay Vex Blocks on your phone while on-the-go, then connect to Facebook and access your power-up arsenal and view existing friend challenges on your tablet at home and continue the action across devices and operating systems. \n \nEARN UNIQUE POWER-UPS \nCapture Mystery blocks in game to add to your power-up arsenal or earn\/purchase coins to select each strategic power-up for later use.","popularity":1.333333333333333,"games":[19222,41348,10225,27266,14246,60044,236,27725,101980,101976],"tags":[268435465],"category":0,"genres":[9],"first_release_date":1365552000000,"platforms":[34],"release_dates":[{"category":0,"platform":34,"date":1365552000000,"region":8,"human":"2013-Apr-10","y":2013,"m":4}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/su0t4lcryctiw2ptyqwi.jpg","cloudinary_id":"su0t4lcryctiw2ptyqwi","width":1280,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sbzvefjng7o73regwycl.jpg","cloudinary_id":"sbzvefjng7o73regwycl","width":1280,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yokdclk33j89jew5ojre.jpg","cloudinary_id":"yokdclk33j89jew5ojre","width":1280,"height":800},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/h8ppe28nn2d6kuvyslnd.jpg","cloudinary_id":"h8ppe28nn2d6kuvyslnd","width":1280,"height":800}]}