{"id":41472,"name":"Number Jumble","slug":"number-jumble","url":"https:\/\/www.igdb.com\/games\/number-jumble","created_at":1498817667534,"updated_at":1500285512883,"summary":"[Unreleased 1984 ECS] Cut across fire in a Time Sailer, cruise under water in a Submarine, fly through thin air in a Zeppelin, or roll across the Earth in a Tank -- but never stop firing at the dreadful creatures that beset you! Shoot them down with the fireballs you control and they'll turn into black numbers. When you shoot enough creatures, you get a chance to solve exciting mathematical equations...and score big points! Hurry, for every second counts! Have fun! \n \n 1 or 2 players. 1 little man under your control when the game starts, 4 more in reserve. 4 different environments to choose from! \n Simple to more complex equations. Both \"scratch pad\" and \"solution\" areas to work on. Choose from 48 skill levels. \n Transport Houses found in every environment to give you bonus multipliers. Progressive scoring setup, according to your skill level and speed in solving equations. \n Automatic transfer to a higher level once you've mastered the one you're on! \n \nPRODUCTION HISTORY \nEarly in 1983, Mattel Electronics created an Educational Products department to develop educational game ideas, primarily for the Entertainment Computer System. \n \nNumber Jumble was one of the ideas that came out of that department. Others that went into production were Jetsons' Ways With Words and Flintstones Keyboard Fun. \n \nThe game was completed late in 1983. Packaging reached the black & white mockup stage, but Mattel Electronics was closed before the game could be released. \n \nAlthough designed for the Entertainment Computer System, the game was played with the hand controllers. The ECS keyboard was only used if the player needed to do scratchpad calculations before entering answers.","popularity":1,"games":[19222,41348,10225,27266,14246,60044,236,27725,101980,101976],"tags":[268435465],"category":0,"genres":[9],"first_release_date":917740800000,"platforms":[67],"release_dates":[{"category":0,"platform":67,"date":917740800000,"region":8,"human":"1999-Jan-31","y":1999,"m":1}]}