{"id":7472,"name":"Operation Neptune","slug":"operation-neptune","url":"https:\/\/www.igdb.com\/games\/operation-neptune","created_at":1404164072737,"updated_at":1515673104021,"summary":"Operation Neptune is an educational computer game produced in 1991 by The Learning Company. The goal of the game is to guide a small submarine through a variety of undersea caverns, collecting pieces of a ruined space capsule. Like other games by The Learning Company, Operation Neptune is educational and was intended for players age nine to fourteen (grades five through nine). It was released as part of the Super Solvers series for a time","storyline":"The back story of the game is as follows: A team of astronauts and scientists have begun a secret research project on a distant planet. The research team's results were sent back to Earth on the \"Galaxy space capsule\", which malfunctioned, crashed into the ocean, and broke into many pieces. The capsule included several data canisters, each of which contains small snippets of the scientists' story, which is revealed to the player as the game progresses and data canisters are found. The capsule also contained some toxic chemicals, which have begun to leak out and threaten the health of the world's sea life. A recovery mission, codenamed Operation Neptune, is sent to recover the pieces of the capsule.\nThe game is divided into five zones: Dragon Reef, Fossil Trench, Limestone Ridge, Sea Forest, and Hammerhead. Each zone contains three \"levels\", called sectors (although the hammerhead zone also has a \"final\" sector, where there are no maths problems, but one hit from a sea creature will send the player back to the start). At the end of each sector, the submarine approaches an undersea supply station. There are two completely unique sets of levels, Voyager and Expert, each with a different story that is recovered along the way.\nThe player pilots the submarine, named the Neptune. Throughout the game, elementary school-level mathematics problems are posed, in the form of scientific situations that might concern a submarine pilot in real life. (For example, the sub's ballast may need adjusting, and this becomes an arithmetic problem.) In each sector the player will face three randomly placed math problems, as well as one problem to open that sector's data canister, and another to open the combination lock on the supply station.The box cover illustration rendered by Marc Ericksen envisions the Neptune submarine recovery vehicle hovering above the basin of Fossil Trench recovering glowing toxic data capsules.","collection":4881,"popularity":1.333333333333333,"games":[34218,23175,19561,15605,41436,47823,25300,66092,58883,58881],"tags":[34,268435489,536871315,536871446,536871751,536871830,536871878,536871945,536872216,536875822,536875852,536875909,536876737,1073741828],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[403,534,839,918,966,1033,1304,4910,4940,4997,5825],"themes":[34],"genres":[33],"first_release_date":662688000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":662688000000,"region":8,"human":"1991-Jan-01","y":1991,"m":1}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u5wfoaqtjtobf2zzmb3j.jpg","cloudinary_id":"u5wfoaqtjtobf2zzmb3j","width":640,"height":400}],"videos":[{"name":"Gameplay video","video_id":"3yYE2ZDIIu0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lgezige2cnehsm9qmgko.jpg","cloudinary_id":"lgezige2cnehsm9qmgko","width":626,"height":640}}