{"id":89872,"name":"Assassin's Creed IV: Black Flag - Buccaneer Edition","slug":"assassins-creed-iv-black-flag-buccaneer-edition","url":"https:\/\/www.igdb.com\/games\/assassins-creed-iv-black-flag-buccaneer-edition","created_at":1519998188778,"updated_at":1525470712041,"summary":"Welcome to the Golden Age of Piracy. The year is 1715. Pirates rule the Caribbean and have established their own lawless Republic where corruption, greediness and cruelty are commonplace. Among these outlaws is a brash young captain named Edward Kenway. His fight for glory has earned him the respect of legends like Blackbeard, but also drawn him into the ancient war between Assassins and Templars, a war that may destroy everything the pirates have built. \n \n A Brash Rebel Assassin: Become Edward Kenway, a charismatic yet brutal pirate captain, trained by Assassins. Edward can effortlessly switch between the Hidden Blade of the Assassin’s Order and all new weaponry including four flintlock pistols and dual cutlass swords. \n \nThe Assassin’s Creed IV Black Flag Buccaneer Edition includes: \n \nA 45cm figurine of Captain Edward Kenway. \n \nCollector’s box. \n \nA high quality artbook including artworks that inspired the game. \n \nThe Official Game Soundtrack. \n \n2 lithographs in a protective envelope. \n \nUnlockable bonus content: 3 additional solo missions for an extra 45 minutes of gameplay: \n \nBlack Island: Captain Morgan’s favourite ship has sunken off the coast with a full load of legendary sailing equipment. Explore the Black Island and retrieve these items Pirates have desperately been looking for. \n \nHidden Mystery: Follow Stede Bonnet’s path and find the secrets of his adventures on the beautiful island of St Lucia. \n \nSacrificed Secrets: Recover Captain Drake’s lost treasures, including golden flintlocks and cutlass when exploring the exotic island of Sacrifices. \n \nAdditional Single & Multiplayer items: Captain Kenway’s Legacy.","popularity":1,"version_parent":1970,"version_title":"Buccaneer Edition","category":0,"first_release_date":1383004800000,"platforms":[6,41,9,12],"release_dates":[{"category":0,"platform":6,"date":1383004800000,"human":"2013-Oct-29","y":2013,"m":10},{"category":0,"platform":41,"date":1383004800000,"human":"2013-Oct-29","y":2013,"m":10},{"category":0,"platform":12,"date":1383004800000,"human":"2013-Oct-29","y":2013,"m":10},{"category":0,"platform":9,"date":1383004800000,"human":"2013-Oct-29","y":2013,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/utnqyretttfv1fspm8il.jpg","cloudinary_id":"utnqyretttfv1fspm8il","width":1500,"height":845}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xikmo3dtfrxbyxjtoeiz.jpg","cloudinary_id":"xikmo3dtfrxbyxjtoeiz","width":1079,"height":1078}}