{"id":11308,"name":"Ring","slug":"ring","url":"https:\/\/www.igdb.com\/games\/ring","created_at":1436167065913,"updated_at":1517270757843,"summary":"Ring: The Legend of the Nibelungen is a point-and-click adventure video. The game is based on Richard Wagner's four opera cycle Der Ring des Nibelungen, and features music from various performances of the Vienna Symphony conducted by Georg Solti during the 1950s and 1960s. French comic-book artist Philippe Druillet also worked on the game, providing much of the artwork. \n \nThe game makes a significant departure from the source material by binding the stories behind the four parts of the cycle with a surrealist science fiction background; the main plot involves a being by the name of ISH, who is guided by the voice of Erda, and who discovers the story of the Nibelungen.","storyline":"Set in the 40th century, the game begins with the introduction of ISH, one of the last surviving humans. Humanity has been enslaved by an alien race that destroyed Earth millennia ago, and took away all creativity and creative expression, meaning humanity slowly lost all sense of its cultural history. However, ISH is given the chance to save humanity by the aliens. They present to him the story of the Nibelungen, and have him embody each of the four main characters in the hopes that his experiences will lead him to lust for power, which is what led to the downfall of humanity in the first place However, the goddess Erda believes she can help ISH by guiding him towards rejecting the desire for power. The four characters are Alberich (a cruel and sadistic dwarf king), Loge (a fire spirit), Siegmund (the son of the god Wotan), and Brünnhilde (a Valkyrie warrior). \n \nThe story begins with Alberich arriving back in his kingdom to discover that he has very little left, nothing in the kingdom works, and his workers have formed a union and gone on strike. In order to break up the strike, Alberich must find something to satisfy the disgruntled workers, and with this aim in mind, he sets off to procure the gold of the Rhinemaidens. \n \nThe second part has the player in control of Loge. His story intertwines somewhat with that of Alberich's - in the employ of the gods, he is charged by Wotan with retrieving the Nibelungen ring and the magic crown of Wotan from Alberich. \n \nThe third section tells the story of Siegmund, son of Wotan, as he attempts to unravel the circumstances surrounding the death of his mother and sister. \n \nThe fourth section tells the story of Brünnhilde, Siegmund's half-sister, who saves him at the end of the third chapter. Her act enrages Wotan, and she is forced to flee to Valhalla where she can obtain a magic artifact to bring back to the asteroid on which the story begins - thus completing the titular \"ring\".","popularity":2,"games":[13189,25222,25311,17469,236,27725,26239,26766,25300,36950],"tags":[18,268435458,268435487,536871275,536872083,536872553,536872562,536872563,1073741825,1073741826],"developers":[5994],"publishers":[234,607],"category":0,"player_perspectives":[1,2],"game_modes":[1],"keywords":[363,1171,1641,1650,1651],"themes":[18],"genres":[2,31],"first_release_date":931132800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":931132800000,"region":1,"human":"1999-Jul-05","y":1999,"m":7},{"category":0,"platform":6,"date":931132800000,"region":2,"human":"1999-Jul-05","y":1999,"m":7}],"alternative_names":[{"name":"The Legend of the Nibelungen"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bvxdtr5jj4hzmwzm0rtg.jpg","cloudinary_id":"bvxdtr5jj4hzmwzm0rtg","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gty9xwbyvaj4oviniiq5.jpg","cloudinary_id":"gty9xwbyvaj4oviniiq5","width":640,"height":448},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aobktihitgxh5wudeaig.jpg","cloudinary_id":"aobktihitgxh5wudeaig","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/konxi9plzn47pef2q9hj.jpg","cloudinary_id":"konxi9plzn47pef2q9hj","width":640,"height":480}],"videos":[{"name":"Game intro","video_id":"iFtyybi6cgg"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lxncyrfn05ftxqdzhrxa.jpg","cloudinary_id":"lxncyrfn05ftxqdzhrxa","width":398,"height":482},"esrb":{"rating":3}}