{"id":2908,"name":"Leisure Suit Larry III: Passionate Patti in Pursuit of the Pulsating Pectoral","slug":"leisure-suit-larry-iii-passionate-patti-in-pursuit-of-the-pulsating-pectoral","url":"https:\/\/www.igdb.com\/games\/leisure-suit-larry-iii-passionate-patti-in-pursuit-of-the-pulsating-pectoral","created_at":1376833389795,"updated_at":1528972647521,"summary":"Passionate Patti in Pursuit of the Pulsating Pectorals! is the third game in Al Lowe's Leisure Suit Larry series. Larry Laffer has finally found the woman of his dreams, and can happily live with her together on the beautiful tropical island... until he gets thrown out of the house by his wife. His boss, who happens to be his (now ex-) father-in-law, fires him. Larry is all alone, without a woman, without a job, on an island that has long ceased to be a \"tropical paradise\" and is exploited by entertainers, lawyers, and alike. But never despair! Dressed in his irresistible leisure suit, Larry is about to conquer the world (or at least its female population) anew. Watch out, fairer sex, because Larry is back to his swinging self!","storyline":"The story begins five years after the events of Leisure Suit Larry Goes Looking for Love (in Several Wrong Places). Following Larry's victory over Dr. Nonookee, the tropical island of Nontoonyt has become a resort reminiscent of Honolulu, Hawaii. Larry has settled into a high-paying job in \"Natives Inc.\" and lives in a luxurious house with his wife, Kalalau (the daughter of the tribal chief from the previous game). Larry's current boss is Kalalau's father (now a development mogul, who changed his name from \"Chief Keneewauwau\" to \"Chairman Kenneth\"). After years of marital bliss, Larry's union comes to an abrupt end when Kalalau dumps him—for another woman—and soon finds himself out of a job as well. With this news, Larry retreats into a phone booth (a nod to Superman) and swaps his aloha shirt for his signature white suit, firmly announcing his return to the swinger lifestyle. \n \nThe female characters include Tawni, a topless sunbather who is more interested in souvenirs than dating Larry; Cherri Tart, a showgirl who performs at the casino; Suzi, a lesbian attorney of law firm \"Dewey, Cheatem & Howe\" willing to finalize Larry's divorce proceedings; Bambi, an aerobics instructor; and Passionate Patti, a jazz pianist in the hotel (the character appeared in the previous game under the name \"Polyester Patty\"). Larry's attempts to seduce each of these women are, in typical Larry fashion, doomed to failure—until he meets Patti, who can be won over if Larry collects the right items and performs the right actions based on his encounters with the others. \n \nUltimately, Larry and Patti spend the night together, but after a round of passionate lovemaking, Larry hears Patti mumble her previous partner's name (who she intends to leave) as she drifts to sleep. Dejected, Larry abandons his new lover, eventually becoming lost in the uncharted jungle surrounding the resort area. It is at this point, the game shifts perspectives; the player now controls Patti, who must navigate the hostile terrain and assorted perils of the jungle (usually by removing parts of her clothing in the process) to find Larry and resolve the misunderstanding. \n \nThe final act of the game sees Larry and Patti get captured by lesbian cannibals. In an example of breaking the fourth wall, the pair escapes captivity through the use of a \"magic marker\"... only to end up at Sierra's Coarsegold, California headquarters (realized in-game as a literal movie studio), where they must make their way through various set pieces from other Sierra games, including Police Quest and Space Quest II. Finally, they come across Roberta Williams directing Princess Rosella in a scene from King's Quest IV, and Larry is offered a job at Sierra. The game ends with Larry and Patti living in a California log cabin, and Larry writing an aptly titled series of computer games based on his adventures.","collection":539,"rating":70.2960291188871,"popularity":1.333333333333333,"total_rating":70.2960291188871,"total_rating_count":7,"rating_count":7,"games":[2912,22422,22425,25222,13189,29730,22423,22490,41895,19453],"tags":[27,42,268435458,268435487,536871262,536871270,536871939,536872098,536872617,536872626,536872647,536872666,536872873,536873516,536875531,536876326,536876642,536877295,536879186,536879191,536879693,536879765,536886353,1073741828],"developers":[32],"publishers":[32],"game_engines":[534],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[350,358,1027,1186,1705,1714,1735,1754,1961,2604,4619,5414,5730,6383,8274,8279,8781,8853,15441],"themes":[27,42],"genres":[2,31],"first_release_date":625881600000,"platforms":[63,13,16],"release_dates":[{"category":1,"platform":13,"date":625881600000,"human":"1989-Nov","y":1989,"m":11},{"category":1,"platform":16,"date":625881600000,"human":"1989-Nov","y":1989,"m":11},{"category":1,"platform":63,"date":625881600000,"human":"1989-Nov","y":1989,"m":11}],"alternative_names":[{"name":"Leisure Suit Larry 3: Passionate Patti in Pursuit of the Pulsating Pectorals!","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ounchrrbl7kw8huk1ds8.jpg","cloudinary_id":"ounchrrbl7kw8huk1ds8","width":320,"height":200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tmdcuawc0d0iz1ldamch.jpg","cloudinary_id":"tmdcuawc0d0iz1ldamch","width":320,"height":200}],"videos":[{"name":"Gameplay video","video_id":"VE5MLWxItLo"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ph5e5vkwkgolng8ule8s.jpg","cloudinary_id":"ph5e5vkwkgolng8ule8s","width":1419,"height":1789},"esrb":{"rating":6},"pegi":{"rating":5},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/765850"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Leisure_Suit_Larry_III:_Passionate_Patti_in_Pursuit_of_the_Pulsating_Pectorals"}],"external":{"steam":"765850"}}