{"id":42308,"name":"BS The Legend of Zelda: Ancient Stone Tablets","slug":"bs-the-legend-of-zelda-ancient-stone-tablets","url":"https:\/\/www.igdb.com\/games\/bs-the-legend-of-zelda-ancient-stone-tablets","created_at":1499071719679,"updated_at":1531969743223,"summary":"Ancient Stone Tablets was a Japan-Only release for the Legend of Zelda: A Link to the Past. It was an add on made for Stellaview, a system that takes radio broadcasts and processes them into games live. The game came in four weekly broadcasts and made new additions to the original, such as weather, many new dungeons, and a new story. \nThe game was much like a Second Quest or Master Quest of A Link to the Past, sharing a very similar overworld with slight changes and entirely new dungeons. Unlike a Second Quest however, it has an entirely new story. Various actions earned the player points, and these points could later be traded in to Nintendo for different prizes. \n \nAncient Stone Tablets is different from most other Zelda games as the game's central heroes are actually the avatars of the player's ID for the BS-X Broadcasting System (Super Famicon), drawn into Hyrule, which is also true for BS The Legend of Zelda. The difference being that this time the player does not take the place of Link, but takes part in a new tale set after the events of A Link to the Past. The male character wears a green tunic (though others are later available) and a backwards baseball cap. The female character has long red hair and is otherwise almost exactly the same as the male.","storyline":"The Hero of Light - Week 1 \nThe events of Ancient Stone Tablets occur a mere six years after the destruction of Ganon by the hero, Link in A Link to the Past.[6] Hyrule is enjoying a time of peace and tranquility, but Princess Zelda suffers from a dark, recurring dream showing a shadow over a temple; a premonition of evil to come. One day, she witnesses a mysterious and brilliant light in the sky to the east. Aginah, the younger brother of the wise man Sahasrahla and now living in his old hideout near the Eastern Palace also witnesses such a light, and travels to investigate. There he finds a strange youth lying on the ground. Zelda, also following the light, meets up with Aginah, and they both carry the child to rest in Sahasrahla's hideout. Confused by the youth's unusual clothes, they believe the child not to hail from Kakariko Village. Speaking to Aginah while the youngster sleeps, Zelda learns that his brother Sahasrahla had also sensed danger surrounding Hyrule and had left the land to find the hero, Link. While Link has not yet returned, Zelda senses that if this new youth was endowed with courage, he or she may be the Hero of Light. \n \nThe Monsters Return - Week 2 \nSome time after Zelda sets off to return to Hyrule Castle, a Soldier who guards the Eastern Palace appears before Aginah, claiming that a horde of monsters had appeared, killing the other guards protecting the temple. As the sole survivor, he passes this information on to Aginah despite his injuries. Aginah remains with the youth, hoping Zelda's belief in him or her is true. When the child awakens, Aginah informs the youngster of the monsters that are attacking their land, and explains that it is dangerous to go alone without a weapon. He states that a Sword and Shield can be found in the Eastern Palace, but he himself is too old to go there. He lends the youth an Ocarina and a Bug-Catching Net belonging to Saharshala, and also a Bottle containing a magical Golden Bee. He informs the child that the bee will attack monsters, but flee from anyone who holds a blade, and that the ocarina can be used to return to the entrance of a dungeon. With that, the new hero embarks on his or her journey. \n \nThe Tablets - Week 3 \nAfter obtaining weaponry and exploring the Eastern Palace and a dark dungeon hidden behind the Waterfall of Wishing, the hero obtains two mysterious tablets from the Dungeon Masters, the Armos Knights and Moldorm. The hero also rescues Zelda from a monster attack and escorts her to Hyrule Castle. After the hero's quests in the dungeons are completed, he or she and Aginah meet up with Zelda in the castle and proceed to study the unusual tablets. Aginah concludes that they should travel to his elder brother's house in Kakariko Village to search for clues to deciphering the markings. Unfortunately, Aginah fails to discover anything important about them, so implores the hero to travel forth and collect more of them from the dungeon monsters. After obtaining two more tablets, Zelda suggests they travel instead to Link's House to obtain the Book of Mudora, which may be able to translate the text. While Aginah searches the house, Zelda calls for the Fortune Teller to divine the location of the book, while the hero continues to search for the tablets. Aginah does eventually locate the book, upon which point he and the hero meet with Zelda at the castle. \n \nThe Silver Arrows and the Demon King - Week 4 \nThe translated text of the tablets, written in the language of ancient Hyrule states that a sealed power, the Silver Arrows, is buried on the mountain. Aginah and the hero travel to the Sanctuary at the foot of the mountain, but Zelda follows, claiming she had another prophetic dream, this time of her holding the Book of Mudora on top of Death Mountain. Zelda insists on traveling with the hero to the summit of the mountain, as she is the only one who can read the Book of Mudora. During their quest to obtain the final two tablets and reach the summit, the Fortune Teller sees the King of Evil in a vision. Ganon's malice had kept his spirit alive despite the destruction of his body. It was this lingering evil power that had drawn the Hero of Light into the land of Hyrule, and upon the summit the hero travels once more into another world to engage in a desperate final battle with the Demon King in a new version of Ganon's Tower. Ganon desires the power of the Hero of Light to be fully reborn, but is finally destroyed using the Silver Arrows once more.","collection":106,"franchise":596,"franchises":[596],"popularity":1.333333333333333,"tags":[1073741830],"developers":[70],"publishers":[70],"category":0,"player_perspectives":[6],"themes":[1,17],"genres":[9,12,31],"first_release_date":859680000000,"platforms":[58],"release_dates":[{"category":0,"platform":58,"date":861494400000,"region":5,"human":"1997-Apr-20","y":1997,"m":4},{"category":0,"platform":58,"date":860889600000,"region":5,"human":"1997-Apr-13","y":1997,"m":4},{"category":0,"platform":58,"date":860284800000,"region":5,"human":"1997-Apr-06","y":1997,"m":4},{"category":0,"platform":58,"date":859680000000,"region":5,"human":"1997-Mar-30","y":1997,"m":3}],"alternative_names":[{"name":"BS Zeruda no Densetsu: Inishie no Sekiban","comment":"Japanese title"},{"name":"BS ゼルダの伝説 古代の石盤","comment":"Japanese title"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rx7fwi5gzh5yrx6wv7on.jpg","cloudinary_id":"rx7fwi5gzh5yrx6wv7on","width":800,"height":700},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yasw8aai2etlohrhkjr1.jpg","cloudinary_id":"yasw8aai2etlohrhkjr1","width":800,"height":700}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/clqtol8qofnovlnc4s02.jpg","cloudinary_id":"clqtol8qofnovlnc4s02","width":1920,"height":1080},"websites":[{"category":14,"url":"https:\/\/www.reddit.com\/r\/miniSNESmods\/comments\/76257n\/legend_of_zelda_ancient_stone_tablets_how_to_play"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Satellaview_games_from_The_Legend_of_Zelda_series#BS_Zelda_no_Densetsu:_Inishie_no_Sekiban"},{"category":2,"url":"https:\/\/zelda.gamepedia.com\/BS_The_Legend_of_Zelda:_Ancient_Stone_Tablets"},{"category":1,"url":"http:\/\/bszelda.zeldalegends.net\/bszelda.shtml"}]}