{"id":44108,"name":"Diplomata The Game","slug":"diplomata-the-game","url":"https:\/\/www.igdb.com\/games\/diplomata-the-game","created_at":1499322091690,"updated_at":1499332594566,"summary":"Do you ever wonder how it would be to be a diplomat in a really challenging era? Do you agree that everything is fair in love and war? Would you like to take a chance with a new, refreshing indie strategy game? If your answer to these questions is yes, then I’m happy to introduce Diplomata the game to you!   \nThis cross platform multiplayer browser based strategy game is really worth giving it a try! Diplomata takes place in the end of the 21st century, after the collapse of the human civilization we know.   \nThe boundaries of the once-existed states have stayed the same, but some countries became more powerful than others. A player has to strive to build a country that’s wealthier than others, knowing that other players will try to achieve the same goal. So, it’s up to a player to use everything from diplomacy to war to develop the most powerful country. This is a turn-based game and a player gets 3 turns in every minutes (300 turns is maximum, though). Turns are made for developing of the country (improving industry, agriculture or building objects) and for interaction with allies and enemies (sending help, attacking, secret service actions etc.).   \nEvery player has enough time to analyze, think and plan before they make a turn. Plus, having equal number of turns enables equal game. Diplomata is also played in rounds with every round lasting one month and first day in the next month every player starts from zero, which gives all players opportunity to plan new round from the very beginning and, of course, to take revenge on enemies. If you like games that require both social and strategy skills and allow players to team up with other players or compete against them, Diplomata might be an ideal strategy game for you. With hundreds (and counting) players from all around the globe, this game promises a rewarding gaming experience. It’s perfect for those players who don’t fancy downloading or installing anything in order to play games, since it’s fully browser based.","storyline":"Diplomata takes place in the end of the 21st century, after the collapse of the human civilization we know. The boundaries of the once-existed states have stayed the same, but some countries became more powerful than others. A player has to strive to build a country that’s wealthier than others, knowing that other players will try to achieve the same goal. So, it’s up to a player to use everything from diplomacy to war to develop the most powerful country.","popularity":2.333333333333333,"tags":[1073741829],"developers":[13085],"publishers":[13085],"category":0,"player_perspectives":[5],"game_modes":[5],"keywords":[599,1471],"themes":[41],"genres":[12],"first_release_date":1477958400000,"status":2,"platforms":[82],"release_dates":[{"category":0,"platform":82,"date":1477958400000,"region":1,"human":"2016-Nov-01","y":2016,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bi71ec7yo8emhjgbu8rx.jpg","cloudinary_id":"bi71ec7yo8emhjgbu8rx","width":1316,"height":839}],"videos":[{"name":"Game intro","video_id":"dYE7HnfqLL4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jjlmuzywloxcjwxslpgz.jpg","cloudinary_id":"jjlmuzywloxcjwxslpgz","width":799,"height":421},"esrb":{"rating":4},"pegi":{"rating":2},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/channel\/UC2HnZBSunUs7Di89_CQqLpg"},{"category":4,"url":"https:\/\/www.facebook.com\/diplomataorg"},{"category":1,"url":"http:\/\/www.diplomata.org"}]}