{"id":86808,"name":"Cheerleader Champion Dance Off","slug":"cheerleader-champion-dance-off","url":"https:\/\/www.igdb.com\/games\/cheerleader-champion-dance-off","created_at":1518603399080,"updated_at":1523428240524,"summary":"~~> You’re the new girl in school, and you’ve decided to try out for the cheerleading squad!\n~~> Join the squad and show ‘em what you got! Your dance skills will help you become a cheerleader pro, and maybe even captain!\n~~> Help your squad win first prize in the big cheerleading dance off! \n\nYou just joined a cool new school, where being a cheerleader is like being a celebrity! You’ve just got to join the cheerleading squad! The squad will thank you for teaching them all your great dance moves! You’ll even get to choreograph the cheerleading routines! Help your squad win the trophy and beat all those other squads in the big cheerleading dance-off event of the year!\n\nFeatures:\n> Try out for the cheerleading squad at your new school – they’ll be begging you to join them!\n> Become a cheerleading superstar! Your new bestie is the cheerleading captain, and the captain of the basketball team is SO cute! Will he notice you?!\n> Get ready for the cheerleading dance-off event of the year! Get a killer makeover and a beautiful hairstyle!\n> Work out at the gym to build up your cheerleader muscles!\n> Oh no! You got a cheerleading injury! Go to the doctor and get better before the competition!\n> Getting a little nervous? Relax at the spa before the cheerleading competition!\n> Dress up in the coolest cheerleader outfits ever!\n> Decorate the stage for the big cheerleading dance off contest!\n> Choreograph your squad’s cheerleading dance routine – they’ll love it! But will the snobby judge?\n> Keep your eyes on the 1st place prize, and cheer your way to the top!\n> Dance ‘til you drop with a dance minigame! \n \n\nABOUT Coco Play\nCoco Play Limited is China-based developer of creative and unique apps for kids. Founded in 2013, Coco Play provides rich 3D simulation-based games for the whole family. Coco Play is a subsidiary of TabTale, a leading, global creator of innovative games, interactive books and educational apps.\nVisit us: http:\/\/www.tabtale.com\/ \nLike us: http:\/\/www.facebook.com\/TabTale\nFollow us:@TabTale\nWatch us: http:\/\/www.youtube.com\/Tabtale\n\nCONTACT US \nLet us know what you think! Questions? Suggestions? Technical Support? Contact us 24\/7 at WeCare@TabTale.com\n\n\nFOR PARENTS \nThe app is free to play but certain in-game items may require payment. You may restrict in-app purchases by disabling them on this device. The app may include advertising for TabTale and certain third parties which will redirect users to our sites, apps or third-party sites.\nPrivacy is important to us. The app may enable collection of limited user data by TabTale or its carefully selected providers (e.g. ad networks and analytics) for limited legal purposes described in our Privacy Policy (e.g. respond to support queries; enable, analyze and improve the app’s features and services; serve contextual ads). The app includes certain features only accessible behind an age-gate to protect children (e.g. restrict behavioral ads; social networks links to connect with others while playing; option to accept push notifications to inform of exciting news e.g. updates). By downloading or using the app you accept our Privacy Policy: http:\/\/tabtale.com\/privacy-policy\/ and Terms of Use: http:\/\/tabtale.com\/terms-of-use\/ and permit such uses for users of your device.","rating":90,"popularity":1.333333333333333,"total_rating":90,"total_rating_count":0,"rating_count":0,"games":[49414,25636,103303,35737,51213,103337,89828,99118,75851,104236],"tags":[268435468,536872030],"category":0,"keywords":[1118],"genres":[12],"first_release_date":1490140800000,"platforms":[39],"release_dates":[{"category":0,"platform":39,"date":1490140800000,"region":8,"human":"2017-Mar-22","y":2017,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kuqxy0rimtbzjqpjzrsh.jpg","cloudinary_id":"kuqxy0rimtbzjqpjzrsh","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d5ehb5xjhoqqdqhovykl.jpg","cloudinary_id":"d5ehb5xjhoqqdqhovykl","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pwgly5y1isqgjxqoyzjx.jpg","cloudinary_id":"pwgly5y1isqgjxqoyzjx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l449lgxizod5vd3sksgx.jpg","cloudinary_id":"l449lgxizod5vd3sksgx","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ytzrbtgrcmeernly18vl.jpg","cloudinary_id":"ytzrbtgrcmeernly18vl","width":552,"height":414},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kxi1xmc80ssvfy6rgbng.jpg","cloudinary_id":"kxi1xmc80ssvfy6rgbng","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sjovl4xqiiupevhz9krw.jpg","cloudinary_id":"sjovl4xqiiupevhz9krw","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mkqk4udnpetb59ukkp9t.jpg","cloudinary_id":"mkqk4udnpetb59ukkp9t","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jncwqvl4ji1kq3xznlpc.jpg","cloudinary_id":"jncwqvl4ji1kq3xznlpc","width":406,"height":228},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dhyd7u8t3axhnx6pxdai.jpg","cloudinary_id":"dhyd7u8t3axhnx6pxdai","width":406,"height":228}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bklib9tf1sow0s6xjscz.jpg","cloudinary_id":"bklib9tf1sow0s6xjscz","width":512,"height":512},"websites":[{"category":10,"url":"https:\/\/itunes.apple.com\/us\/app\/cheerleader-champion-dance-off\/id1202163586?mt=8&uo=4"}]}