{"attributes":{"content-rating":{"content-descriptors":[],"contentInteractiveElement":[],"rating-system":"ESRB","url":"https:\/\/cdn-a.sonyentertainmentnetwork.com\/grc\/images\/ratings\/hd\/esrb\/e.png"},"content-type":"1","default-sku-id":"","dob-required":false,"file-size":{"unit":"","value":null},"game-content-type":"PSN Game","genres":["Sports"],"is-igc-upsell":false,"is-multiplayer-upsell":false,"kamaji-relationship":"extras","legal-text":"","long-description":"Feel the excitement of the NFL with a fun, fast-paced, 5-on-5 football experience. Madden NFL Arcade brings the 10 best players from each of the 32 NFL teams on offense and defense together to battle it out on the gridiron. No penalties, no clock, just pure adrenaline, as each team has four downs to march 60 yards downfield for the score. Catch your opponent off-guard with Game Changers that allow you to break the game wide open in a single play! Play with 1-4 players on a single console, or take your game online with ranked\/unranked matches, lobbies, leaderboards, and more. Madden NFL Arcade takes everything you love about your favorite NFL stars and stadiums and brings them to life in a fun, high-scoring gridiron battle!\r\n<br><br>\r\n© 2009 Electronic Arts Inc. The mark 'John Madden' and the name, likeness and other attributes of John Madden reproduced on this product are trademarks or other intellectual property of Red Bear, Inc. or John Madden, are subject to license to Electronic Arts Inc., and may not be otherwise used in whole or in part without the prior written consent of Red Bear or John Madden. © 2009 NFL Properties LLC. Team names\/logos are trademarks of the teams indicated. All other NFL-related trademarks are trademarks of the National Football League. Officially Licensed Product of NFL PLAYERS. Visit WWW.NFLPLAYERS.COM. All other trademarks are the property of their respective owners.\r\n<br><br>\r\nPurchase or use of this item is subject to the PlayStation®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\r\n","macross-brain-context":"game","media-list":{"preview":[],"promo":{"images":[],"videos":[]},"screenshots":[]},"name":"Madden NFL Arcade","nsx-confirm-message":"","parent":null,"platforms":["PS3"],"primary-classification":"DOWNLOADABLE_GAME","provider-name":"Electronic Arts Inc","ps-camera-compatibility":"incompatible","ps-move-compatibility":"incompatible","ps-vr-compatibility":"incompatible","release-date":"2009-11-24T00:00:00Z","secondary-classification":"GAME","star-rating":{"score":4.02,"total":1413},"subtitle-language-codes":[],"tertiary-classification":"NA","thumbnail-url-base":"https:\/\/store.playstation.com\/store\/api\/chihiro\/00_09_000\/container\/US\/en\/999\/UP0006-NPUB30134_00-MADDENNFLARCADE0\/1543907008000\/image","top-category":"downloadable_game","voice-language-codes":[]},"id":"UP0006-NPUB30134_00-MADDENNFLARCADE0","relationships":{"children":{"data":[]},"legacy-skus":{"data":[]}},"type":"game"}