{"attributes":{"content-rating":{"content-descriptors":[],"contentInteractiveElement":[],"rating-system":"ESRB","url":"https:\/\/cdn-a.sonyentertainmentnetwork.com\/grc\/images\/ratings\/hd\/esrb\/e.png"},"content-type":"1","default-sku-id":"","dob-required":false,"file-size":{"unit":"","value":null},"game-content-type":"Full Game","genres":["Simulation","Sports"],"is-igc-upsell":false,"is-multiplayer-upsell":false,"kamaji-relationship":"extras","legal-text":"","long-description":"Brought to you by EA SPORTS™, NFL Head Coach 09 is a unique and complete NFL experience that gives you the power to make the decisions that will define your career and the ultimate success of your favorite franchise. Now you can download the entire game to your PLAYSTATION®3 computer entertainment system. Once the game is downloaded, you can rule the sidelines by calling the right plays, making adjustments and tweaking your game plan in real time. Games are not just won on game day, so you must set up your team strategically to position them for success. You can scout players, draft players, sign free agents, chose game plans, create plays, hire assistant coaches and make all the critical calls to build your favorite franchise into a perennial champion. If you think you have what it takes, download NFL Head Coach 09 now and begin your trek to a championship.<br>\r\n<br>\r\n© 2008 Electronic Arts Inc. EA, EA SPORTS and the EA SPORTS logo are trademarks or registered trademarks of Electronic Arts Inc. in the U.S. and\/or other countries. All Rights Reserved. Team names\/logos are trademarks of the teams indicated.  All other NFL-related trademarks are of the National Football League.  Officially Licensed Product of NFL PLAYERS.  Visit WWW.NFLPLAYERS.COM. All other trademarks are the property of their respective owners. <br>\r\n<br>\r\nPurchase or use of this item is subject to the PLAYSTATION®Network Terms of Service and User Agreement. This item has been sublicensed to you by Sony Computer Entertainment America.\r\n","macross-brain-context":"game","media-list":{"preview":[],"promo":{"images":[],"videos":[]},"screenshots":[]},"name":"NFL Head Coach 09","nsx-confirm-message":"","parent":null,"platforms":["PS3"],"primary-classification":"PREMIUM_GAME","provider-name":"Electronic Arts Inc","ps-camera-compatibility":"incompatible","ps-move-compatibility":"incompatible","ps-vr-compatibility":"incompatible","release-date":"2008-09-04T00:00:00Z","secondary-classification":"GAME","star-rating":{"score":3.42,"total":73},"subtitle-language-codes":[],"tertiary-classification":"NA","thumbnail-url-base":"https:\/\/store.playstation.com\/store\/api\/chihiro\/00_09_000\/container\/US\/en\/999\/UP0006-NPUB30029_00-NFLHEADCOACH0900\/1520397307000\/image","top-category":"downloadable_game","voice-language-codes":[]},"id":"UP0006-NPUB30029_00-NFLHEADCOACH0900","relationships":{"children":{"data":[]},"legacy-skus":{"data":[]}},"type":"game"}