{"id":19991,"name":"Samurai Shodown 64: Warriors Rage","slug":"samurai-shodown-64-warriors-rage","url":"https:\/\/www.igdb.com\/games\/samurai-shodown-64-warriors-rage","created_at":1467976685150,"updated_at":1515744035634,"summary":"\"This sequel to SAMURAI SHODOWN drew a wild variety of favorable responses upon its release. This second 3-D Samurai title included additions and alterations throughout the game system bringing it closer to SAMURAI SHODOWN 4 than the original \"SAMURAI SHODOWN.\" As far as characters go, the distinction between Chivalry and Treachery is now clearer than ever.\"","storyline":"\"In an unknown land an eerie disturbance disrupts the sky, leading a dark mass to the land. \nIt is the ultimate evil-it is the reincarnation of Yuga the Destroyer. \nThe objective of this being who once more alights to earth is the unification of this world and the Netherworld using the hermaphrodite male and female-that is, the construction of a utopia to become the foundation for the resurrection of the Dark God. \nAs he resumes his search for the hermaphrodites, those turned into puppets by Yuga's magic unleash their carnage to gather the sacrifices necessary for the ritual of utopian construction. \nThese puppets then employ various means to increase the dead and provide sacrifices. Some, for example, become leaders of the Shogunate to carry out ruthless policies, some became common murderers, and still others deliberately incite revolt against the government. \nThrough the influence of the devilish reincarnation, outbreaks of famine and plagues further increase the dead, providing the evil with yet more strength and delight. \nThe mountain of dead gathered by these means is subsequently heaped up on the altar of the Netherworld and fashioned into two pillars in which the hermaphroditic male and female are to be subsequently imprisoned. \nAt this time one man returns to the Netherworld. The name of this warrior who stands directly before these literal pillars of the dead in the darkness is Asura. Master of magic, he is the dark swordsman appearing in this realm to wreak his revenge on Yuga. \nRegardless, his enemy steadily proceeds with the construction of his utopia. \nThe curtain now rises on this drama of revenge that will engulf both our world and the land of the dead.\"","collection":2223,"popularity":1.333333333333333,"games":[47823,12632,36911,19990,27209,16468,19333,41828,36831,10039],"tags":[1,17,268435460,536870973,536871019,536871208,536871969,536873064,536873370,536874535,536875481,536877696,536880996,536882677,1073741828],"developers":[1474],"publishers":[1474],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[61,107,296,1057,2152,2458,3623,4569,6784,10084,11765],"themes":[1,17],"genres":[4],"first_release_date":908496000000,"platforms":[135],"release_dates":[{"category":0,"platform":135,"date":908496000000,"region":2,"human":"1998-Oct-16","y":1998,"m":10},{"category":0,"platform":135,"date":908496000000,"region":5,"human":"1998-Oct-16","y":1998,"m":10}],"alternative_names":[{"name":"Samurai Spirits 2: Asura Zanmaden","comment":"Other"},{"name":"SAMURAI SPIRITS 2 アスラ斬魔伝","comment":"Japanese title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dmf67nlg2edg19b62z2y.jpg","cloudinary_id":"dmf67nlg2edg19b62z2y","width":600,"height":567},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Samurai_Shodown_64:_Warriors_Rage"},{"category":2,"url":"http:\/\/snk.wikia.com\/wiki\/Samurai_Shodown_64:_Warriors_Rage"},{"category":1,"url":"http:\/\/samuraianiv.snk-corp.co.jp\/english\/title\/samurai-shodown6\/index.php"}]}