{"id":20691,"name":"Steel Horizon","slug":"steel-horizon","url":"https:\/\/www.igdb.com\/games\/steel-horizon","created_at":1468850610528,"updated_at":1515716208654,"summary":"Steel Horizon delivers both turn-based and real-time strategy gameplay, offering players complete control of a naval armada outfitted with battleships, submarines, fighter planes and artillery. As the American captain of one of three super-secret navy vessels, the player fights the Axis powers and a sinister organization operating in the shadows of the great powers in 20 compelling missions, in both the Atlantic and Pacific theatres. Build and command a powerful WW2 naval fleet, comprised of battleships, submarines, aircraft carriers and many other types of ships. Customize one of three unique flagships and decide how you want to play. Each weapon has its own effects, from the mighty 18\" main batteries of a battleship to a submarine's torpedos. Dynamic camera angles, damage states and impressive effects highlight the action. Combine the best of turn-based strategy and real-time action games: strategically position your fleets and engage in real-time 3D combat. Fight the Axis powers and a sinister organization operating in the shadows of the great powers in 20 compelling missions, in both the Atlantic and Pacific theatres. Challenge your friend wirelessly in a variety of multiplayer battles.","popularity":1,"aggregated_rating":60,"aggregated_rating_count":1,"total_rating":60,"total_rating_count":1,"games":[22399,26391,25311,19301,23345,68287,26769,16513,76731,25300],"tags":[1,17,18,22,268435471,536870931,536871327,536871882,536872649,536874694,536875067,536875137,536875830,536876737,536879058,536884018],"category":0,"keywords":[19,415,970,1737,3782,4155,4225,4918,5825,8146,13106],"themes":[1,17,18,22],"genres":[15],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hxvqw2wdjy1mgmlfa0id.jpg","cloudinary_id":"hxvqw2wdjy1mgmlfa0id","width":480,"height":266}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x3xu46y11xjhvbz6qsoh.jpg","cloudinary_id":"x3xu46y11xjhvbz6qsoh","width":446,"height":694}}