{"id":26791,"name":"Shrouded","slug":"shrouded","url":"https:\/\/www.igdb.com\/games\/shrouded","created_at":1484423331857,"updated_at":1484595705279,"summary":"Shrouded is a survival-horror Role-Playing Game in which the player must unravel the mystery behind a series of disappearances at an abandoned library and survive against the malevolent forces of a bloodthirsty entity with every intention of destroying them.","storyline":"There's always been something odd about that Library, hasn't there?\r\r\n\r\r\nYou know about it: the public library in the sleepy little town of Greenhaven that once served as a grand landmark for the townspeople to be proud of. Though since the year 1978? That reality has faded away with time. Nowadays, the library is but a shadow of its former self; with most of its corridors and sections locked away from the prying eyes of the public. What could have instigated this proverbial 'closure'? Perhaps it has something to do with all of those mysterious disappearances you've heard so much about - twenty-seven individuals whom vanished without a trace many years ago, right here, in this cryptic library. Police investigations into the disappearances had spanned over the course of two decades - but... years later, the case has gone dark. That's why you've come to see Greenhaven Library for yourself: in fact, those very disappearances are the topic of your college assignment.\r\r\n\r\r\nBut where some say college work will kill you? It might be in a more literal manner than you may think.\r\r\n\r\r\nStudying for a report about this case is you, Carmen - a young University student with an avid passion for local history. And what better place to conduct such research than at the Library in question? Of course, having a feisty little brother to keep in check whilst doing so isn't exactly your idea of a peaceful study.\r\r\n\r\r\nBut... that's too simple surely. Greenhaven Library? It holds all manner of sinister secrets behind closed doors. Secrets that should remain shrouded - if Carmen has any concern for her personal safety that is. Soon that college assignment becomes an afterthought; suddenly, your very life is on the line. How will you escape? How far will you go to shed light upon the forgotten crimes of the disappearances of '78?\r\r\n\r\r\n*Solve a myriad of puzzles hidden within the depths of a huge, cryptic Library as you push to survive.\r\r\n*Gather and utilize a wide variety of items to help you find your way through winding pathways, looming halls and dark corridors.\r\r\n*Find clues hidden within the many books of the Library to help you overcome a wealth of tricky situations.\r\r\n*Survive the ever-prominent threat of being chased by a mysterious, insane fiend. Hide, run, or set traps. Either way? Don't become a victim.","collection":2585,"popularity":1.333333333333333,"games":[26710,12632,36534,7329,13189,25646,44076,14760,54699,26766],"tags":[19,268435468,536871029,536871043,536871251,536871390,536871433,536871938,536872032,536872748,536873850,1073741826],"game_engines":[79],"category":0,"player_perspectives":[2],"game_modes":[1],"keywords":[117,131,339,478,521,1026,1120,1836,2938],"themes":[19],"genres":[12],"status":3,"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cd3tkq8daweqh326eu71.jpg","cloudinary_id":"cd3tkq8daweqh326eu71","width":800,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jdaagk1u2alne9ieihls.jpg","cloudinary_id":"jdaagk1u2alne9ieihls","width":800,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uxfexhu957m7c5pf8st1.jpg","cloudinary_id":"uxfexhu957m7c5pf8st1","width":800,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i9kjywjfuckaewdgv1hp.jpg","cloudinary_id":"i9kjywjfuckaewdgv1hp","width":800,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wx0lficht3cmnhk4cvaa.jpg","cloudinary_id":"wx0lficht3cmnhk4cvaa","width":800,"height":480}],"videos":[{"name":"Trailer","video_id":"VG7i27Eh0M0"},{"name":"Trailer","video_id":"JA3TtxYH_-A"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jzrfh7pdnhyi0lqoqzyc.jpg","cloudinary_id":"jzrfh7pdnhyi0lqoqzyc","width":762,"height":1134},"pegi":{"rating":4},"websites":[{"category":1,"url":"http:\/\/gamejolt.com\/games\/shrouded\/53069"}]}