{"id":39291,"name":"Daytona USA 2","slug":"daytona-usa-2","url":"https:\/\/www.igdb.com\/games\/daytona-usa-2","created_at":1498123688321,"updated_at":1515725079810,"summary":"Daytona USA 2: Battle on the Edge is an arcade racing game released by Sega in 1998 as a follow-up to the extremely successful Daytona USA. The game featured vastly superior graphics, utilizing the Sega Model 3 hardware. The majority of Daytona USA 2 cabinets were released as deluxe models (with far fewer Twin Cabinets), which could be linked together for up to four players. A notable change from the original is the ability to select a car and corresponding driver, each with varying capabilities for varying levels of player experience. Just like before, the game has three courses – a Beginner course with 8 laps, an Advanced course with 4 laps, and a long Expert course with 2 laps. The 'time lap' mode also returns, and is accessed in the same manner – by holding down start at the transmission select screen. Like the original game, mirrored versions of the tracks can also be played by holding down the Start button when selecting the course. It is recommended, however, that the player has had mastery of the course beforehand. By request, an arcade operator could put the game on Grand Prix or Endurance mode to increase the number of laps in a game. Finishing a race in the top 3 in any course allows the player to view an \"ending\" and see the game credits.","collection":3364,"popularity":1.333333333333333,"games":[40470,28856,72770,45500,54789,73482,36662,19419,54790,49274],"tags":[268435466,536872590,536872695,536874907,536875069,536875128,536875870,536875955,536876816,536876818,536879182,536879963,536882168,536882291],"category":0,"keywords":[1678,1783,3995,4157,4216,4958,5043,5904,5906,8270,9051,11256,11379],"genres":[10],"first_release_date":899251200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":899251200000,"region":8,"human":"1998-Jul-01","y":1998,"m":7}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/govy28dv26dazgux1cz9.jpg","cloudinary_id":"govy28dv26dazgux1cz9","width":850,"height":1098}}