{"id":39891,"name":"Ganryu","slug":"ganryu","url":"https:\/\/www.igdb.com\/games\/ganryu","created_at":1498464322392,"updated_at":1542316428651,"summary":"Musashi Ganryuki, (武蔵厳流記), known outside Japan as Ganryu, is a platformer and hack and slash video game developed by Visco Corporation and published by SNK in 1999 on Neo Geo MVS. It is loosely based on Miyamoto Musashi's fight with Sasaki Kojirō. Sasaki went by the fighting name of Ganryū, hence the game's name \"Ganryu Musashi\". \n \nThe game's selectable characters are the samurai swordsman Miyamoto Musashi and his female kunoichi counterpart Suzume. The mission of the game is to rescue Musashi's love Otsu from a clan of evil ninja led by Kojiro Sasaki. Players are armed with a sword (katana for Musashi\/kaiken for Suzume) and a grappling claw. The claw serves as a long-range weapon, and can act as a grapnel in certain settings to reach higher ground or ascend over chasms. A powerful projectile attack can also be achieved by holding down the attack button, although this takes time to charge. Additional temporary weapons can be found throughout the game, such as shuriken for Musashi, kunai for Suzume, and an \"energy ball\" weapon. Upon rescuing hostages, rewards are given to the player in form of food (onigiri, takoyaki), which can restore health, or ryo coins for extra points.","popularity":1.333333333333333,"games":[33269,20342,24426,18285,36044,56033,29032,25222,13189,22917],"tags":[268435464,268435487,536871244,536871939,536872617,536875054,536875075,536875081,536875151],"category":0,"keywords":[332,1027,1705,4142,4163,4169,4239],"genres":[8,31],"first_release_date":915148800000,"platforms":[80,52,79],"release_dates":[{"category":0,"platform":79,"date":915148800000,"region":2,"human":"1999-Jan-01","y":1999,"m":1},{"category":0,"platform":80,"date":946684800000,"region":2,"human":"2000-Jan-01","y":2000,"m":1},{"category":0,"platform":79,"date":915148800000,"region":5,"human":"1999-Jan-01","y":1999,"m":1},{"category":0,"platform":52,"date":917827200000,"region":8,"human":"1999-Feb-01","y":1999,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/syjxojnda6h4lamw7abm.jpg","cloudinary_id":"syjxojnda6h4lamw7abm","width":850,"height":1138}}