{"id":53891,"name":"Warhammer 40,000: Armageddon - Golgotha","slug":"warhammer-40000-armageddon-golgotha","url":"https:\/\/www.igdb.com\/games\/warhammer-40000-armageddon-golgotha","created_at":1501617632712,"updated_at":1537069381608,"summary":"The Ork forces were ultimately defeated in the 2nd War for Armageddon, but amongst the billions of dead Orks one body was not to be found, that of Ghazghkull Mag Uruk Thraka. \n \nFew in the Imperium heeded the warnings of Commissar Yarrick that he must be hunted down, foolishly believing that Thraka was just another Xeno who would surely be relegated to history. For Thraka though, the whole invasion of Armageddon was merely a way to test the waters – an experiment to learn how the Imperium would react against a massive invasion. \n \nNow he is regrouping and building a new WAAAGH! on the isolated world of Golgotha. However, the venerable Yarrick has tracked him down and plans to launch a surprise strike on the world with the express aim of destroying Thraka at any cost! \n \nGolgotha is an expansion of Warhammer 40,000: Armageddon, set 50 years after the end of the Second War for Armageddon, it is the last great battle of the cycle. \n \nJoin the Imperial forces under Yarrick’s command as they secure a footing on the Ork infested world before striking forth at Thraka’s army. \n \nAlthough Yarrick has brought elements of the Steel Legion in the form of the 117th Armageddon Mechanised Infantry, the player’s core force is focused on the unwavering regiments of the 66th Mordian Infantry. \n \nThe Mordian Iron Guard are the bulk of the new units in this expansion, but the player will also eventually gain command of Yarrick himself atop the pulpit of his personal Baneblade tank, the Fortress of Arrogance.","popularity":1.333333333333333,"game":17609,"category":1,"first_release_date":1457568000000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1457568000000,"region":8,"human":"2016-Mar-10","y":2016,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aaroz01orshze4tta4jg.jpg","cloudinary_id":"aaroz01orshze4tta4jg","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jl8hkvxa95scenuvvxxe.jpg","cloudinary_id":"jl8hkvxa95scenuvvxxe","width":1728,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/n9li9uwv2bgr3om0aevm.jpg","cloudinary_id":"n9li9uwv2bgr3om0aevm","width":1728,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/pkuolr43esh8sz2up4w6.jpg","cloudinary_id":"pkuolr43esh8sz2up4w6","width":460,"height":215},"websites":[{"category":13,"url":"https:\/\/store.steampowered.com\/app\/437140\/Warhammer_40000_Armageddon__Golgotha"}]}