{"id":6791,"name":"Dragon Breed","slug":"dragon-breed","url":"https:\/\/www.igdb.com\/games\/dragon-breed","created_at":1400055573141,"updated_at":1515675074488,"summary":"The player's character is a human who rides a large, green, flying Chinese-style dragon. The dragon is invincible, capable of blocking most enemy projectiles and damaging enemies on contact; the human, however, is not, but is armed with a forward-firing crossbow.\n\nThe dragon's body is flexible and responds to the player's movement, enabling the player to use the dragon as a mobile shield or as a whip-like weapon. You can also circle the tail around a group of enemies to kill them. The tail of the yellow or blue dragon can be coiled around the player to offer almost complete invulnerability for a limited time.\n\nThe dragon can also spit fireballs. By holding the fire button down, the dragon will build up fire in its mouth; the longer the button is held down, the more powerful the fireball will be. There are four levels of fireball power; at its strongest, the fireball resembles a dragon's head. The game also contains some platforming elements - the human is able to dismount on horizontal platforms.\n\nPower-ups can be acquired by shooting small green dragons that appear intermittently throughout the levels, or they can be collected from the ground on foot. There are four different power-ups, each of which provides a different weapon to the dragon. Collecting multiple power-ups of the same colour makes that weapon more powerful. The dragon changes colour depending upon which power-up has been collected. Red enables the dragon to breathe a flame. The flame gets longer if more power-ups are collected. Yellow enables the dragon's body to fire crescents in all directions. White enables the dragon to produce up to four miniature dragons, which home in on enemies. Blue enables the dragon to fire downward bolts of electricity from its underside.","popularity":1.333333333333333,"games":[68287,36950,28029,64204,142,27314,71455,25300,27523,11253],"tags":[1,18,268435461,268435489,536871882,536871937,536871971,536872211,1073741828],"developers":[1287],"publishers":[66],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[970,1025,1059,1299],"themes":[1,18],"genres":[5,33],"first_release_date":631065600000,"platforms":[52,63,16,15,26,25],"release_dates":[{"category":2,"platform":52,"date":631065600000,"human":"1989","y":1989,"m":12},{"category":2,"platform":25,"date":631065600000,"human":"1989","y":1989,"m":12},{"category":2,"platform":15,"date":631065600000,"human":"1989","y":1989,"m":12},{"category":2,"platform":26,"date":631065600000,"human":"1989","y":1989,"m":12},{"category":2,"platform":16,"date":662601600000,"human":"1990","y":1990,"m":12},{"category":2,"platform":63,"date":631065600000,"human":"1989","y":1989,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vjbvkuo0jxpxozu3gyhp.jpg","cloudinary_id":"vjbvkuo0jxpxozu3gyhp","width":1024,"height":640}],"videos":[{"name":"Gameplay video","video_id":"Anx0c28zGZ0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zdfqgpihib0falexwzqv.jpg","cloudinary_id":"zdfqgpihib0falexwzqv","width":630,"height":769},"websites":[{"category":2,"url":"http:\/\/en.wikipedia.org\/wiki\/Dragon_Breed"}]}