{"id":9291,"name":"eXceed 2nd - Vampire REX","slug":"exceed-2nd-vampire-rex","url":"https:\/\/www.igdb.com\/games\/exceed-2nd-vampire-rex","created_at":1427835753652,"updated_at":1523272929393,"summary":"The human powers-that-be called for the purification of mankind and the eradication of vampires and ‘deviants bloodlines’ – those born of a mix of human and vampire. And so began massive purges of the deviants that were reminiscent of the “witch hunts” of centuries earlier. Leading the genocide was the exorcist corps the “Gun Bullet Children”. \n \nAs the overwhelmingly large human armies began to obliterate every vampire and deviant community across the world, the opposing deviant armies sought to gather allies and rally back. Lia Fyle is a half-human, half-vampire girl fighting on the side of the deviants as they embark upon a turnaround strategy, the “Siege on the Holy Land’. Their plan: to lay siege upon the humans’ “Holy Land” and to destroy the Holy Lady Anhel who was the source of the human military power. This is a battle in which defeat is an option for neither army. \n \nFeaturing an addictive dual-polarity gameplay system, this amazing vertical shmup is sure to please any shooter fan. The polarity and color of your character can be changed to absorb enemy bullets of the same polarity while charging the special weapon in the process and doing double damage to enemies of the opposite polarity. Every bullet absorbed charges your special weapon for total destruction. With awesome music, beautiful art, and challenging stages, this is the game that put the eXceed series on the map and has everything you would want from a shmup.","collection":1253,"rating":80,"popularity":1.333333333333333,"total_rating":80,"total_rating_count":1,"rating_count":1,"games":[6732,16468,76110,10039,3277,47823,11423,72373,12632,28010],"tags":[1,17,268435461,268435488,268435489,536870990,536871078,536871123,536871200,536871823,536871971,536872070,536872147,536872406,536872591,536875046,1073741828],"developers":[7085],"publishers":[7086,5752],"category":0,"player_perspectives":[4],"game_modes":[1],"keywords":[78,166,211,288,911,1059,1158,1235,1494,1679,4134],"themes":[1,17],"genres":[5,32,33],"first_release_date":1199059200000,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":1199059200000,"region":5,"human":"2007","y":2007,"m":12},{"category":0,"platform":6,"date":1332979200000,"region":8,"human":"2012-Mar-29","y":2012,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kpovkunqbzrzbixwlrj3.jpg","cloudinary_id":"kpovkunqbzrzbixwlrj3","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ymlu64irwb11g6atoddb.jpg","cloudinary_id":"ymlu64irwb11g6atoddb","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gxhcsweyxsu2n0uscuo8.jpg","cloudinary_id":"gxhcsweyxsu2n0uscuo8","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/y8ghtmwj706nkbalwx6h.jpg","cloudinary_id":"y8ghtmwj706nkbalwx6h","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yjliuv5pjp54br2baluk.jpg","cloudinary_id":"yjliuv5pjp54br2baluk","width":640,"height":480}],"videos":[{"name":"Trailer","video_id":"BKCo5PJzF1A"},{"name":"Trailer","video_id":"6_4ooEhyou8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ikqknldtzzo6osp3kox9.jpg","cloudinary_id":"ikqknldtzzo6osp3kox9","width":327,"height":465},"esrb":{"synopsis":"This is an action game in which players guide a flying vampire-like character through vertically scrolling levels. As players navigate across the screen, they fire magical projectiles at human-like enemies and larger bosses. The frenetic combat is accompanied by battle cries, colorful explosions, and violent references (e.g., “Can't we just kill her?” and “We'll cut off your arms and legs . . .”); enemies disappear when defeated. A handful of female characters are dressed in form-fitting outfits; one woman's costume (i.e., multiple strips of cloth) exposes portions of her chest and pelvic region. The word “damn” appears in the dialogue.","rating":4},"pegi":{"synopsis":"The content of this game is suitable for persons aged 12 years and over only.\r\r\nIt contains: Violence in a sporting context - Mild bad language","rating":3},"external":{"steam":"207380"}}