{"id":10709,"name":"Police Force","slug":"police-force","url":"https:\/\/www.igdb.com\/games\/police-force","created_at":1432762938076,"updated_at":1516741724183,"summary":"Police Force offers the opportunity to experience law enforcement like never before! Battle on the front line of crime as you take command of the policing for a thriving city. Emergency calls come thick and fast, dynamically generated to put your organisational skills to the test.\n\nDispatch units in civilian clothes and organise uniform patrols to keep the city safe, in a huge open world, complete with night and day scenarios and changing weather.\n\nYour traffic officers will need your guidance to deal with serious accidents, setting up radar speed traps, or hunting for car thieves. Whilst the routine of city life continues, your specialist teams will come to the fore, dealing with everything from bank robberies, to a hostage crisis, to murder!\n\nAs in any large city, public order is of paramount importance and your officers will be called to deal with outbreaks of disorder where your decision making skills are critical to keeping the peace as you hold the thin blue line!\n\nYour police teams are fully equipped with the latest in modern equipment, including handcuffs, high speed response vehicles, radios and firearms. Yet, the greatest aid is the quick thinking of a resourceful commander!\n\nYour successes will be rewarded with promotion as you climb the ladder of over 40 ranks and strive to receive 15 special honours in a custom career mode where only the finest officers will make the grade!","collection":1423,"popularity":1,"games":[44242,18623,22470,29173,55689,11419,23867,26145,55590,22406],"tags":[268435469,536872060],"category":0,"keywords":[1148],"genres":[13],"first_release_date":1324771200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1324771200000,"region":8,"human":"2011-Dec-25","y":2011,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dfcp38gum6xpijs2pbhd.jpg","cloudinary_id":"dfcp38gum6xpijs2pbhd","width":319,"height":458}}