{"id":15309,"name":"Minimum","slug":"minimum","url":"https:\/\/www.igdb.com\/games\/minimum","created_at":1449924720769,"updated_at":1523271832688,"summary":"Minimum focuses on fast-paced shooting fun and a robust system of in-match crafting, team objectives and customizable roles to create a rich and rewarding PvP experience. You'll find a bunch of interesting weapons to collect and customize, armor sets to mix and match, a solid core game mode known at TITAN MODE and more all wrapped up in a unique, minimalist artistic style that's more than the sum of its parts. Some of our coolest features include: \n\nCustomizable Weapons: Craft dozens of lethal weapons with unique abilities and roles to best fit your personal playstyles. Each weapon has 5 power levels that are activate during kill streaks, increasing your power making you a force to be feared. Be careful though: weapon power levels are lost upon death, so with great power comes great risk. \n\nBlueprint Crafting System: Gather materials from fallen foes and defeated objectives to craft and upgrade armor sets over the course of a match. Each set of armor has different benefits and weaknesses that can emphasize your favorite playstyle or counter what your enemies are trying to do.\n\nTitan Mode: Battle in epic matches centered on the your team's Titan, a giant, destructive robot that confronts the enemy's Titan. Players can power up their Titan by performing tasks in-game, can defend their mammoth ally by killing enemy players, and can attack enemy Titans directly. The teams compete until one side's Titan reaches the enemy base and destroys it!\n\n5v5 Competitive Gameplay: Create cunning strategies with your teammates and define your unique role on the team by combining different weapons, armor and devices. Support your teammates weapons that increase drop rates for materials and powerups, defend your Titan with armor that grants additional health and survivability, scout enemy positions with weapon and armor that increase speed and allow for double or triple jumps, or simply go glass cannon and dish out as much damage as you can.","rating":50,"popularity":1.666666666666667,"total_rating":50,"total_rating_count":1,"rating_count":1,"games":[68287,55038,36950,28029,90099,103020,78770,105269,37066,27398],"tags":[1,18,268435461,536871029,536871507,536871882,536871937,536872406,536873591,536874916,536875187,536875271,536875437,536875822],"developers":[82,7627],"publishers":[413],"category":0,"game_modes":[2],"keywords":[117,595,970,1025,1494,2679,4004,4275,4359,4525,4910],"themes":[1,18],"genres":[5],"first_release_date":1407024000000,"pulse_count":1,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1407024000000,"human":"2014-Aug-03","y":2014,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tpfzz1ztwndvcsht9kkc.jpg","cloudinary_id":"tpfzz1ztwndvcsht9kkc","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t5urgq8jnnrby8rrvr1c.jpg","cloudinary_id":"t5urgq8jnnrby8rrvr1c","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bdwuq01qkpav6ftxftdt.jpg","cloudinary_id":"bdwuq01qkpav6ftxftdt","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rtoajlkrc3ysajqazcrs.jpg","cloudinary_id":"rtoajlkrc3ysajqazcrs","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/i8slakxf3ow7goildzz6.jpg","cloudinary_id":"i8slakxf3ow7goildzz6","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ssn5fnesmoixaugen49y.jpg","cloudinary_id":"ssn5fnesmoixaugen49y","width":1417,"height":674},"websites":[{"category":1,"url":"http:\/\/www.playminimum.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/214190"}],"external":{"steam":"214190"}}