{"id":20709,"name":"Zero Divide","slug":"zero-divide","url":"https:\/\/www.igdb.com\/games\/zero-divide","created_at":1468867484579,"updated_at":1516167994539,"summary":"Zero Divide: An unrecoverable program error causing a potential system crash. \n \nYou are the error. Set in a virtual world inside a computer system hijacked by a group called XTAL, Zero Divide puts you against mysterious mercenary \"units\", each with a unique fighting style and the ability to pulverize you in an instant. You must \"delete\" the mercenaries, crash the system and eliminate XTAL before time runs out. \n \nThe first truly complete 3D, 360 degree fighting game. \n \nSuperbly detailed graphics, unprecedented fighter control, high quality soundtrack, awesome depth and challenge are all combined to give you the most complete fighting game experience available. \n \n- 10 ruthless fighters (including two hidden bosses) that feature never before seen fighting styles, weapons and projectile attacks \n- Unleash an arsenal of deadly moves and killer combos - Hyper Headbutt, Blind Man Slash, Tomo Vortex Throw, and Bloody Pack. For the first time in any 3D fighter - jumping attack in combos \n- Select four completely different camera angles, including an innovative perspective from the fighters viewpoint and a rotating 360 degree view \n- Zero Divide's unique Ring Edge allows skillful fighters to grab onto the rim of the ring and pull themselves back into fight \n- With a memory card, save and relive your entire round... replays can be slowed down, paused, zoomed, rotated, or viewed from any angle \n- On-screen diagram shows progressive damage to fighter body parts and allows players to strategically plan their attacks for maximum destruction","collection":4331,"popularity":1.333333333333333,"aggregated_rating":50,"aggregated_rating_count":1,"total_rating":50,"total_rating_count":1,"games":[45399,68287,26766,25300,71455,36950,142,43808,27314,64204],"tags":[18,268435460,536870979,536871019,536871487,536871882,536872862,536874994,536875284,536876199],"category":0,"keywords":[67,107,575,970,1950,4082,4372,5287],"themes":[18],"genres":[4],"first_release_date":811900800000,"platforms":[7],"release_dates":[{"category":0,"platform":7,"date":811900800000,"region":8,"human":"1995-Sep-24","y":1995,"m":9}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/awnu3lhjy9ekcf5zp8dn.jpg","cloudinary_id":"awnu3lhjy9ekcf5zp8dn","width":255,"height":255}}