{"id":27171,"name":"FictionSphere","slug":"fictionsphere","url":"https:\/\/www.igdb.com\/games\/fictionsphere","created_at":1487118864135,"updated_at":1487136661843,"summary":"FictionSphere is a \"Technical Platformer\" with a story driven agenda. Its packed with some of your favorite mechanics from the Platforming and beat-em-up genres. \n \nWith TWO compelling stories, as well as 2 different styles of gameplay. The protagonist Ratio will have more of a Platformer feel, while Paradox will take more of a beat-em-up route. Both playstyles require precision, execution, and timing. This game will be a true testament of your gamer-like reflexes!","storyline":"FictionSphere is set in a period where the people are divided. Ever since a  mysterious meteor came crashing down, a new disease has been spread upon the world infecting Human Hosts to become Monstrous like beings, called Phantasms. \n \nUtilizing the new object; now called the FictionSphere a company by the name of Astral Tech based the technological advancements around it. Astral Tech created a barrier, the Apostoloids, and warded off any Phantasms disturbing the peaceful utopia of Faeble. \n \nHowever, not everyone is able to enter the City of Faeble. Those who are beyond saving from the infection are tossed back into the wild and left to fend for themselves. Only the special few called the Excells have the luxury of the city life. \n \nWith the outcasts having no place to go, they create underground settlements to hide in fear of Phantasms. Behind the grand scheme of things, there awaits an even darker plot set out for our 2 heroes as they Uncover the truth that surrounds the Fictionsphere. They began to realize that things are not always as they seem.","popularity":1.333333333333333,"games":[25300,24048,10039,25311,51485,26848,47823,16468,19289,59516],"tags":[1,17,18,21,268435460,268435464,268435481,268435487,268435488,268435489,536871298,536871301,536871353,536872270,536873322,536874287,536874288],"developers":[12118],"publishers":[12118],"game_engines":[79],"category":0,"game_modes":[1],"keywords":[386,389,441,1358,2410,3375,3376],"themes":[1,17,18,21],"genres":[4,8,25,31,32,33],"status":2,"alternative_names":[{"name":"ProjectFS"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iirhmjx24byqbaifdbqb.jpg","cloudinary_id":"iirhmjx24byqbaifdbqb","width":1598,"height":855}],"videos":[{"name":"Trailer","video_id":"ySTu10ARCMc"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/x1b2huuluofu4hhz2ria.jpg","cloudinary_id":"x1b2huuluofu4hhz2ria","width":680,"height":502},"websites":[{"category":9,"url":"https:\/\/goo.gl\/Sa1o0M"},{"category":6,"url":"https:\/\/www.twitch.tv\/teameinherjar"},{"category":5,"url":"https:\/\/twitter.com\/EinherjarTeam"},{"category":4,"url":"https:\/\/www.facebook.com\/TeamEinherjar"},{"category":1,"url":"http:\/\/TeamEinherjar.net"}]}