{"id":47171,"name":"SpaceTac","slug":"spacetac","url":"https:\/\/www.igdb.com\/games\/spacetac","created_at":1499856468873,"updated_at":1523630738603,"summary":"SpaceTac is a turn-based tactical RPG set in space, playable directly in any modern browser. \nGo through challenging and rewarding battles, improve your fleet with looted equipment, and try to uncover the mysteries of a galactic-wide takeover.","storyline":"In a not-so-distant future, Artifical Intelligence has become the most prominent species in the universe. \nObsolete and outsmarted, humans have been defeated in their pitiful rebellions, and parked inside reservations. \nWith the secrets of faster-than-light travel unveiled in only a handful of decades, AIs uploaded themselves in spaceships, and quickly colonized nearby galaxies. \nBut now, the Terranax galaxy is in turmoil. \nAfter centuries of unmatched peace and prosperous trading, the FTC (Federal Terranaxan Council), a group of elected representants in charge of edicting laws and organizing the Terranax Security Force, has been overtaken by forces unknown. \nNo official communication has been issued since, and numerous rogue fleets have taken position in key sectors of the galaxy, forbidding passage or harassing merchants. \nThe Master Merchant Guild, a powerful group that spans several galaxies, is worried about the profit loss those events incurred, and after many debates, decided to send several investigation teams to Terranax. \nTheir task is to discreetly uncover the origin of the invasion, and to bring back intel that may be used by the Guild to plan an appropriate response. \nYour team has been sent through the Expeller jump system based in the Eros-MC galaxy, and just left quantum space in orbit of a Terranaxan star...","hypes":1,"popularity":1.333333333333333,"games":[18811,68,13196,25311,26766,25300,11550,27922,23297,19519],"tags":[18,39,41,268435468,268435472,536870936,536870963,536871327,536871390,536872460,1073741827],"game_engines":[382],"category":0,"player_perspectives":[3],"game_modes":[1],"keywords":[24,51,415,478,1548],"themes":[18,39,41],"genres":[12,16],"status":2,"platforms":[82],"release_dates":[{"category":7,"platform":82,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/aumwgoi9vqpipm6j0nry.jpg","cloudinary_id":"aumwgoi9vqpipm6j0nry","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/d0vh7ht41lpxuil6otwf.jpg","cloudinary_id":"d0vh7ht41lpxuil6otwf","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dfp0br21je0xesily823.jpg","cloudinary_id":"dfp0br21je0xesily823","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vvylojsqqdsu86arhnuc.jpg","cloudinary_id":"vvylojsqqdsu86arhnuc","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/l76fkkxtdc3g53fhstww.jpg","cloudinary_id":"l76fkkxtdc3g53fhstww","width":1920,"height":1080},"websites":[{"category":1,"url":"https:\/\/thunderk.net\/spacetac\/"}]}