{"id":50371,"name":"Fate by Numbers","slug":"fate-by-numbers","url":"https:\/\/www.igdb.com\/games\/fate-by-numbers","created_at":1500040216614,"updated_at":1515651674567,"summary":"Set in a futuristic city, the protagonist Alice Sanger, an ex-cop whose career and marriage went down when she tried to uncover corruption in her bureau, now a private detective gets a new assignment from an anonymous client. Her task is to get a briefcase. While trying to get that briefcase at the Sainsbury Station, she met her presumed dead ex-husband again, who is now working for the other side. To make matters worse, she also get shot by a sniper. Now Alice has to find out what's about the briefcase, what her ex-husband has to do with it and who shot her. \n \nFate by Numbers is a film-noir Interactive Movie mixed with a point&click Adventure system. \n \nAfter the intro you start in your office. Like all other places in the game, the locations are \"static\" - you have animations here and there, but you can't walk around. Alice always stands on the same place. But of course you can interact with the environment on fixed locations, including looking at, using it, talking to or using any equipped stuff. If the action is not possible (i.e. talking to the computer), Alice will say so. Otherwise, almost all other actions resulting in full motion video-sequences - leaving a building, \"driving\" with your car, speaking with people, breaking in buildings, hacking in computers etc. An exception for example is analyzing photos in your computer, there you must manually looking for clues by zooming parts of the photos. \n \nWhen leaving places, you are presented with a city map showing the current places you can visit. The places grow over time, but a few are only there briefly (i.e. breaking in the surveillance centers server room).","popularity":1.333333333333333,"games":[25222,41895,25311,26145,22425,74378,43130,27266,43097,28277],"tags":[268435465,268435468,268435469,268435487,536871939],"category":0,"keywords":[1027],"genres":[9,12,13,31],"first_release_date":1187827200000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1187827200000,"region":8,"human":"2007-Aug-23","y":2007,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/cojirelz4m1s0bd75l6f.jpg","cloudinary_id":"cojirelz4m1s0bd75l6f","width":1024,"height":592},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/r0s6humbk4vndeysyrak.jpg","cloudinary_id":"r0s6humbk4vndeysyrak","width":1024,"height":568},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/digawxnro5duj10eorzq.jpg","cloudinary_id":"digawxnro5duj10eorzq","width":1024,"height":580},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sloyocybezpmti6pcrxn.jpg","cloudinary_id":"sloyocybezpmti6pcrxn","width":1024,"height":574},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/xctjmsbw7cuj22dz5mi3.jpg","cloudinary_id":"xctjmsbw7cuj22dz5mi3","width":1920,"height":1080}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mtdqhcnheii5hkl7ufgk.jpg","cloudinary_id":"mtdqhcnheii5hkl7ufgk","width":1920,"height":1920}}