{"id":25836,"name":"Penetrator","slug":"penetrator","url":"https:\/\/www.igdb.com\/games\/penetrator","created_at":1479299355793,"updated_at":1517270868818,"summary":"Penetrator is an early Sinclair ZX Spectrum game made by Melbourne House programmers Philip Mitchell and Veronika Megler, one of the early hits. It was released in 1982 as a clone of the Scramble arcade game. \n \nIn Penetrator, the gamer flies a ship, which can shoot forwards and drop bombs beneath the ship. The first level is on open air, with just mountains to dodge, missiles which try to hit the ship, and animated radars. From the second level onwards, the game is inside increasingly complex caverns, so the ceiling is also a danger, as well as new enemies - the missiles are now sometimes replaced with skulls that can move up and down, blocking the path. \n \nThe levels change with no pause, only the screen colour changes. After four levels there is a short fifth level where a base needs to be destroyed by dropping a bomb precisely, and then there is a firework animation as a reward. After all levels are finished, the ship goes back through inversed levels, with backward turned landscape. \n \nReviews at the time said that graphics and the game were impressive, even stunning.[1] \n \nThere is an edit mode for designing levels, and a training mode with infinite number of lives in which one can start from any level. Also, there is a simultaneous two-player mode. The game's sound consisted of a characteristic uplifting theme before ship launch, while in-game there were simultaneous shooting\/explosion effects, which was relatively advanced use of the limited one channel Spectrum beeper system at the time. \n \nLater, versions for Commodore 64 and TRS-80 appeared.","popularity":1.333333333333333,"games":[68287,36950,28029,27314,64204,142,71455,25300,27523,11253],"tags":[1,18,268435461,536871859,536871882,536871937,536871971,536875262,536876028,536876578,1073741828],"developers":[804],"publishers":[1985],"category":0,"player_perspectives":[4],"game_modes":[1,2],"keywords":[947,970,1025,1059,4350,5116,5666],"themes":[1,18],"genres":[5],"first_release_date":410140800000,"platforms":[126,15,26],"release_dates":[{"category":2,"platform":15,"date":473299200000,"region":2,"human":"1984","y":1984,"m":12},{"category":2,"platform":126,"date":410140800000,"region":2,"human":"1982","y":1982,"m":12},{"category":2,"platform":26,"date":410140800000,"region":1,"human":"1982","y":1982,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/yhm91tx7rlikcqfrc1th.jpg","cloudinary_id":"yhm91tx7rlikcqfrc1th","width":1000,"height":1448}}