{"id":38336,"name":"Run Of Mydan","slug":"run-of-mydan","url":"https:\/\/www.igdb.com\/games\/run-of-mydan","created_at":1497961449285,"updated_at":1532173625321,"summary":"A VR action-packed adventure in which you take control of a mysterious entity, flustered and perturbed by a deceived past as it struggles to break free from the shackles restraining its path.  \nWith only meager power left at your disposal, fight to regain strength, recompose all memories, and unfold the truth. Your hands, layered with sublime potency are capable of forming substance, raising mass and warping gravity.  \nConverge focus, sharpen your reflexes, unleash fury and watch your back. Your preys lie under the aegis of their guardians, the entrails of order hinder your merciless vengeance.  \nBreak open the gates that have long constrained you in your sleep, unfold the secrecies, bend the bars of your prison, what lies beyond the haze obstructing remembrance is for you to discover.  \nGame description  \n  \nIn Run of Mydan, VR physics interaction is at the core of the gameplay mechanics, requiring players to master accuracy in throwing, aiming and anticipating.  \nSwiftness, agility and dexterity are crucial to success, forget standing still, in order to survive it is inevitable to duck, dodge and block.  \nEnhance your skill with different weapons\/powers. You'll start off by throwing energy spheres, but you'll soon find yourself using javelins, morning stars, boomerangs, etc...  \nThe action takes place in all directions, so make sure to watch your back as you master your ability in flying.  \nCoordinate and cooperate with friends in your quest for vengeance throughout the story mode, or test your abilities as a team in horde mode.  \nConfront other players in multiple game modes, such as classic deathmatch, capture the flag, king of the hill, races, etc...  \n  \nList of what you can do  \n  \n - Generate weapons with your hand (spheres, javelin, gun, etc...)  \n - Defend yourself using the power shield  \n - Learn to fly using your whole body  \n - Complete an immersive and mysterious story mode   \n - Challenge players online in highly competitive gameplay mechanics  \n - Lots of new weapons that exploit VR capabilities  \n - Complex Boss fights  \n - Wide variety of enemies  \n - Steamworks integration  \n - Additional levels and environments  \n - Character customization and progress  \n  \nWhat is in the demo  \n  \nThe demo contains a very small part of the story mode in a reduced form in order to showcase two of the initial themes\/environments that will be part of the story. Therefore, both levels were cut and reduced.  \nThe only available weapon is the energy sphere. This weapon has the property of altering gravity based on the amount of charged applied before it is thrown. Manipulating the environment through gravity alteration will be an important aspect of the game, when it comes to solving puzzles, disabling traps, etc...  \nThe demo also contains a very early version of the arena mode with the possibility to play in multiplayer. In the arena mode you can start getting in touch with the flight\/hover mechanics and the feeling of full control over your movement.  \nAll the content in this demo is at a very early stage of development. We are aware of many of its issues and bugs but decided to release this initial build to give you a taste of what we are working on rather than leaving it only to words.  \nTo the community  \n  \nYour feedback is of immense importance to us, and we want to rely extensively on the community to shape the game in the best way possible. We want to make this product for you and with you!","storyline":"With only meager power left at your disposal, fight to regain strength, recompose all memories, and unfold the truth. Your hands, layered with sublime potency are capable of forming substance, raising mass and warping gravity. \nConverge focus, sharpen your reflexes, unleash fury and watch your back. Your preys lie under the aegis of their guardians, the entrails of order hinder your merciless vengeance. \nBreak open the gates that have long constrained you in your sleep, unfold the secrecies, bend the bars of your prison, what lies beyond the haze obstructing remembrance is for you to discover.","hypes":1,"rating":70,"popularity":1.333333333333333,"total_rating":70,"total_rating_count":0,"rating_count":0,"games":[103294,37419,103312,103329,78632,86477,81249,103501,75540,96437],"tags":[1,268435487],"developers":[12990],"publishers":[12990],"game_engines":[439],"category":0,"game_modes":[1,2,3],"themes":[1],"genres":[31],"first_release_date":1498867200000,"status":4,"platforms":[6],"release_dates":[{"category":1,"platform":6,"date":1498867200000,"region":8,"human":"2017-Jul","y":2017,"m":7}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rphguhcnkqhelt7rx0nm.jpg","cloudinary_id":"rphguhcnkqhelt7rx0nm","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hzdt7bxvdhr9bqxodgru.jpg","cloudinary_id":"hzdt7bxvdhr9bqxodgru","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uujlka1wnwwcasv12ylc.jpg","cloudinary_id":"uujlka1wnwwcasv12ylc","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/bv39uooy3qi9yo0otex5.jpg","cloudinary_id":"bv39uooy3qi9yo0otex5","width":3840,"height":2080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f64iux32ryoighsizlhq.jpg","cloudinary_id":"f64iux32ryoighsizlhq","width":1815,"height":957}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ydjz3si37yiwzlddvwl1.jpg","cloudinary_id":"ydjz3si37yiwzlddvwl1","width":1200,"height":1698},"websites":[{"category":1,"url":"http:\/\/www.virtew.it\/run-of-mydan\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/640300"}],"external":{"steam":"640300"}}