{"id":40836,"name":"Bubble Trouble","slug":"bubble-trouble","url":"https:\/\/www.igdb.com\/games\/bubble-trouble","created_at":1498488913346,"updated_at":1517082502112,"summary":"You are Travis, a scientist doing experiments with dense matter for the creation of artificial black holes for interstellar travel. While testing a piece of equipment, you are transported into a bubble world. Fortunately, a friendly denizen decides to help you. You must locate the correct type of radioactive particles to move from world to world and finally home, before the hostile denizens of these worlds burst your bubble. \n \nYou move your bubble by pushing in the desired direction. Be advised that you do not stop easily and can bounce out of control if you are not careful. Pushing the A button fires a bubble shot that will ricochet around. You can use this action to bounce shots at enemies that are around a corner. Pressing B drops a bubble bomb straight down. Pressing Option 1 switches options on the screen, including the suicidal \"Burst!!!\", that are then activated by pressing Option 2. The one you will use most is \"Use scanner\". This will bring up the scanner that looks like a radar screen and will show you the approximate location of your needed particles. Once you locate and gather all the particles needed in the level, you move on to the next level. After you finish five levels, you win the game.","popularity":1,"games":[25222,25646,60044,14047,36608,26223,34919,56292,16468,27266],"tags":[1,268435465,536873787,536875489],"category":0,"keywords":[2875,4577],"themes":[1],"genres":[9],"first_release_date":757296000000,"platforms":[61],"release_dates":[{"category":2,"platform":61,"date":757296000000,"human":"1993","y":1993,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uyxur8j3o3m4bkc0cws7.jpg","cloudinary_id":"uyxur8j3o3m4bkc0cws7","width":338,"height":294},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Bubble_Trouble_(1993_video_game)"}]}