{"id":42836,"name":"Mahou Shoujo Lyrical Nanoha A's Portable: The Battle of Aces","slug":"mahou-shoujo-lyrical-nanoha-as-portable-the-battle-of-aces","url":"https:\/\/www.igdb.com\/games\/mahou-shoujo-lyrical-nanoha-as-portable-the-battle-of-aces","created_at":1499081832005,"updated_at":1516768231618,"summary":"After the final Book of Darkness crisis, Nanoha Takamachi and Fate Testarossa refuse to send Reinforce away to ensure that the Book's regeneration program won't harm anyone again. However, this means that the remains of the Book of Darkness (闇の書の残滓 Yami no Sho no zansai) soon return and Nanoha and her friends are forced to fight them. These remnants take form of twisted, dark copies of real people called \"dark fragments\" (闇の欠片 yami no kakera). In addition to Nanoha, Fate, and Hayate's own dark copies, they soon have to face the three much more powerful and dangerous clones of themselves known as \"Material\", as well. Every playable character must face and defeat the clones of their own friends to advance their storylines. \n \nAll of the playable characters except the Materials have their own different story route in the game. Every route has the same basic structure: the player must first pass a training session, then defeat the dark clones of two of their best friends, defeat one Material boss, defeat the clones of two more freinds, then lastly defeat a Material boss version of themselves.","collection":4350,"popularity":1.333333333333333,"games":[56987,70861,19658,1235,41828,81336,80282,73018,70905,66025],"tags":[268435460,536870990,536871019,536875209],"category":0,"keywords":[78,107,4297],"genres":[4],"first_release_date":1264982400000,"platforms":[38],"release_dates":[{"category":0,"platform":38,"date":1264982400000,"region":8,"human":"2010-Feb-01","y":2010,"m":2}],"alternative_names":[{"name":"魔法少女リリカルなのはA's PORTABLE THE BATTLE OF ACES","comment":"Other"},{"name":"Mahou Shoujo Lyrical Nanoha A's Portable: The Battle of Aces","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vwb2vf6fqpxqatqma29l.jpg","cloudinary_id":"vwb2vf6fqpxqatqma29l","width":359,"height":600}}