{"id":46636,"name":"Wizard and the Princess","slug":"wizard-and-the-princess","url":"https:\/\/www.igdb.com\/games\/wizard-and-the-princess","created_at":1499641518202,"updated_at":1515578546886,"summary":"Wizard and the Princess (1980), also known as Adventure in Serenia (1982), is an adventure game by On-Line Systems for the Apple II, Apple II Plus, and Commodore 64. It was the second title released in On-Line Systems' Hi-Res Adventures series after Mystery House. \n \nWizard and the Princess is a prelude to the King's Quest series in both story and concept (though chronologically set several years before King's Quest V). It was also the first adventure game released with full color graphics. \n \nhe game (according to the backcover (box\/folder\/manual) of the Atari 400\/800 and Apple II original and rerelease versions) takes place in the land of Serenia where King George's daughter Princess Priscilla has been kidnapped by an evil wizard named Harlin. Harlin has held her inside his castle far in the mountains. The King has offered half of his kingdom to anyone brave enough to travel to the Wizard's castle, defeat him and return his daughter. The player assumes the role of a happy wanderer who answers this challenge. \n \nThe re-releases (on Apple II, Atari 400\/800, and the C64 port) contained additional plot added to the manual explaining how the wanderer made it to Serenia in the first place; some time long into the future after Harlin had been defeated by the Wanderer, he challenged the player to again repeat the actions leading to his defeat. He boasted of using his magic to change the world creating obstacles for anyone who would challenge him (he moved the desert around the village of Daventry, the northern sea splitting Serenia in two, and Great Mountains in the North on his half of the continent). He turned back the sands of time leaving the adventurer in the desert just outside the village of Serenia. He mocks the hero telling him that he may have been defeated once, but he couldn't be defeated a second time. The princess gives the hero some words of advice and a computer to help him defeat Harlin, and tells him he has become the wanderer (grandfather paradox & bootstrap paradox). The manual story as reprinted was also included with the Roberta Williams Collection (a compilation of games from Roberta Williams) and the King's Quest Collection Series (one of the compilations of King's Quest games). \n \nThe introduction for Adventure of Serenia, explained that the adventurer, with the help of a computer, had magically transported to Serenia to save the Princess.","collection":5085,"popularity":1.333333333333333,"games":[13189,22425,36926,25222,26766,41895,47823,25211,12198,55803],"tags":[268435487,536871059,536871208,536871931,536871939,536871958,536872140,536872293,536872419,536872668,536873192,536873308,536873400,536873454,536875172,536875442,536875699,536876082,536876274,536877593,536879818,536883320],"category":0,"keywords":[147,296,1019,1027,1046,1228,1381,1507,1756,2280,2396,2488,2542,4260,4530,4787,5170,5362,6681,8906,12408],"genres":[31],"first_release_date":381369600000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":381369600000,"region":8,"human":"1982-Feb-01","y":1982,"m":2}],"alternative_names":[{"name":"Adventure in Serenia","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/a5knlylzu3e7ttegyapz.jpg","cloudinary_id":"a5knlylzu3e7ttegyapz","width":410,"height":480},"esrb":{"rating":5}}