{"id":13680,"name":"Aliens","slug":"aliens","url":"https:\/\/www.igdb.com\/games\/aliens","created_at":1445241539419,"updated_at":1545968720258,"summary":"Electric Dreams' game based on the 1986 film Aliens is a first-person strategy game somewhat similar to Space Hulk. The player controls six characters from a remote terminal, guiding them through a 255-room complex in search of the Alien Queen. Each character has a helmet camera and a smart gun, each controlled by the player acting in the role of overall operational commander. \n \nThe player can switch to any character at any time, and must consider coordinating their movements and finding a safe location before switching to the next character. Characters occupy one room at a time, and can pan their view a full 360-degrees inside each room. Doors can be locked to halt Alien progress, or blasted open to get through (at the cost of permanently destroying the door). Alien bio-mass must also be destroyed before it spawns facehuggers, and the Aliens themselves leave lethal puddles of acid when killed (and so shouldn't be killed in front of doors!). \n \nAliens prowl the complex and are attracted to gunfire. They will home in on nearby characters and attack, requiring the player to aim that character's gun to defend against the rushing Alien (a headshot kills instantly, while three to the body do the same). If an Alien attacks a character the player is not controlling, they will \"capture\" that character (indicated by a yellow status light). The player must guide another character to the position of the hostage and kill the guarding Alien to rescue them. If not, the captured character will be lost. \n \nAmmunition for all characters is limited, and refilled only by making a trip to the complex's armory. Similarly, a medical bay can replenish any damage. Characters also have limited stamina, used up with every move made. When stamina is low, the player must find a safe spot for that character to rest up. The complex also houses a generator controlling the lights, which the Aliens can destroy, or the Marines can then repair.","franchise":23,"franchises":[23],"rating":79.9355275451657,"popularity":1.333333333333333,"total_rating":79.9355275451657,"total_rating_count":5,"rating_count":5,"games":[25311,55038,105269,68287,95340,28029,36950,78770,90099,109463],"tags":[1,18,268435461,268435471,268435487,268435489,536871783,536871937,1073741828,1073741826],"category":0,"player_perspectives":[2,4],"game_modes":[1,2],"keywords":[871,1025],"themes":[1,18],"genres":[5,15,31,33],"first_release_date":662601600000,"pulse_count":1,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":662601600000,"human":"1990","y":1990,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qc9l8q2jpjsbjllgytez.jpg","cloudinary_id":"qc9l8q2jpjsbjllgytez","width":540,"height":315},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dqvaedirigh8njdfhety.jpg","cloudinary_id":"dqvaedirigh8njdfhety","width":1440,"height":1120}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/e89bybhxxxucfe0vb0ey.jpg","cloudinary_id":"e89bybhxxxucfe0vb0ey","width":468,"height":626}}