{"id":40080,"name":"M.I.A. Missing in Action","slug":"mia-missing-in-action","url":"https:\/\/www.igdb.com\/games\/mia-missing-in-action","created_at":1498469964465,"updated_at":1517270848337,"summary":"The player takes on the role of a US Army special operations soldier infiltrating enemy POW camps in Vietnam to find prisoners of wars and lead them to freedom. Like its predecessor, there are a total of six levels in the game: war-torn field, jungle, airstrip, rail-yard, POW camp, and escaping POW camp. M.I.A. can be played by up to two players, with Player 1 in green and Player 2 in blue. \n \nThroughout most of the game, the player's main weapon is a knife, which is capable of destroying any enemy in the game. By killing the red enemy soldiers, the player can acquire additional weapons. The available weapons consist of an assault rifle (12 rounds), a flamethrower (2 rounds), a bazooka (3 rounds), and grenades (3 rounds). Unlike Green Beret, the player can carry more than one weapon and switch between them at will. If the player loses a life, then only their currently equipped weapon will be lost. \n \nAt the end of each level, an assorted amount of troops on fixed machine gun positions (usually four) that must be eliminated. On the last mission of the game, the freed hostages are susceptible to being slain by enemies; if all the POW's get killed then \"MISSION FAILED\" flashes on the screen and the game is permanently over.","collection":4171,"hypes":1,"popularity":1.333333333333333,"games":[76253,26820,1070,87728,1073,10039,29032,108082,23852,103316],"tags":[1,268435464,268435481,268435489,1073741828],"developers":[129],"publishers":[129],"category":0,"player_perspectives":[4],"game_modes":[1,2],"themes":[1],"genres":[8,25,33],"first_release_date":631065600000,"platforms":[52],"release_dates":[{"category":2,"platform":52,"date":631065600000,"region":2,"human":"1989","y":1989,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jzvxuluglomi7uft3kwg.jpg","cloudinary_id":"jzvxuluglomi7uft3kwg","width":850,"height":1204}}