{"id":42080,"name":"Valkyrie no Densetsu","slug":"valkyrie-no-densetsu","url":"https:\/\/www.igdb.com\/games\/valkyrie-no-densetsu","created_at":1499068174028,"updated_at":1511564439294,"summary":"Valkyrie no Densetsu (translated as: \"Legend of Valkyrie\") is a platform\/shooter arcade game that was released by Namco in 1989 only in Japan. It is a sequel to a 1986 Family Computer title titled Valkyrie no Bōken: Toki no Kagi Densetsu, also released exclusively in Japan. \n \nThe first player controls the eponymous Valkyrie who is not an actual Valkyrie from Norse mythology, but a warrior maiden from the heavens who happens to be named after them, while the second player controls Kurino Sandra, a green lizard who, despite his name, is actually male. \n \nThey must fight their way through eight multi-scrolling stages by firing shots from their sword (Valkyrie) and trident (Sandra) - and most of the enemies will leave gold coins or magic bubbles behind when killed, which can be exchanged for special items with Babasama and Zoul. \n \nTo answer the Nazonazo Phantom and Sphinmoth's questions on the fourth and seventh stages, a knowledge of the two Japanese syllabic writing systems (Hiragana and Katakana) is also essential; if a player does not know, they can only guess. \n \nAlso, if a player wants Babasama to teach them the \"Chameleon\" spell on the fifth stage, they shall have to walk up to a woman in one of the previous stage's interior areas, and speak to her so that she will give them a letter - without it, they cannot give it to Babasama, and he will not teach them the spell as a result. The clock tower at the end of the first stage also looks like a miniature Big Ben.","franchise":1161,"franchises":[1161],"popularity":5.333333333333333,"games":[23175,37022,55289,59516,44191,12579,25646,25311,1221,36608],"tags":[1,268435487],"developers":[263],"publishers":[263],"category":0,"themes":[1],"genres":[31],"first_release_date":652838400000,"platforms":[86],"release_dates":[{"category":0,"platform":86,"date":652838400000,"region":8,"human":"1990-Sep-09","y":1990,"m":9}],"alternative_names":[{"name":"Legend of Valkyrie","comment":"Acronym"},{"name":"Warukyūre no Densetsu","comment":"Japanese title"},{"name":"ワルキューレの伝説","comment":"Japanese title"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jqrmlgvn5z8h6bbm4fnv.jpg","cloudinary_id":"jqrmlgvn5z8h6bbm4fnv","width":637,"height":640}}