{"id":5680,"name":"Dr Kawashima's Devilish Brain Training","slug":"dr-kawashima-s-devilish-brain-training","url":"https:\/\/www.igdb.com\/games\/dr-kawashima-s-devilish-brain-training","created_at":1396206047356,"updated_at":1509491608571,"summary":"Planned for release in 2013 close to the North American release date, the game was put on hold after being localized with no reason given. It was finally released on July 28th 2017, 5 years after the original Japanese release date. \n \nDeveloped in cooperation with neuroscientist Dr Ryuta Kawashima, the idea behind Devilish Brain Training - the third game in a franchise which has sold more than 15 million copies across Europe to date - is to train your grey matter by completing a series of challenging exercises. \nThe gameplay puts emphasis on concentration skills and training your working memory - an important brain function based around the temporary storage of information for manipulation. \nThrough playing each exercise for a few minutes per day over the course of several weeks, you will be able to monitor the improvements in your focus \n \nDevilish Brain Training offers 30 exercises and minigames, including 18 which are brand new, with the core exercises dynamically adapting to create tailored training programmes. For example, Devilish Calculations challenges you to recall the answer to a previous mathematical problem while paying attention to the next one in line. The questions come thick and fast and you have to concentrate hard while remembering specific information to make sure you don’t make any mistakes. \nAnother minigame, Devilish Mice challenges you to simultaneously track the path of several mice while they are being chased by cats. It sounds simple, but the exercise requires much concentration! \nIf you struggle with the exercise, the game will dynamically adjust the difficulty level based on your real-time results. By offering a stiff challenge and shifting the difficulty to match your performance, Devilish Brain Training will constantly push you to stay focused and access short-term memories. \n \nThe game will be available as a download on Nintendo eShop,","collection":882,"hypes":1,"popularity":1.666666666666667,"aggregated_rating":66,"aggregated_rating_count":1,"total_rating":66,"total_rating_count":1,"version_parent":20884,"version_title":"Dr Kawashima's Devilish Brain Training","games":[27266,48799,46937,40905,40903,40897,40887,40647,19222,25222],"tags":[34,268435465,536871115,536871446,536871826,1073741829],"developers":[2935],"publishers":[4034],"category":0,"player_perspectives":[5],"game_modes":[1],"keywords":[203,534,914],"themes":[34],"genres":[9],"first_release_date":1501200000000,"platforms":[37],"release_dates":[{"category":0,"platform":37,"date":1501286400000,"region":3,"human":"2017-Jul-29","y":2017,"m":7},{"category":0,"platform":37,"date":1501200000000,"region":1,"human":"2017-Jul-28","y":2017,"m":7}],"alternative_names":[{"name":"Dr Kawashima's Devilish Brain Training: Can you stay focused?","comment":"Other"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hke2fyqfatzmgnmbequd.jpg","cloudinary_id":"hke2fyqfatzmgnmbequd","width":618,"height":362}],"videos":[{"name":"Gameplay video","video_id":"r1edTgRERP4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tsb2m3izj5svta4eoxti.jpg","cloudinary_id":"tsb2m3izj5svta4eoxti","width":332,"height":302},"pegi":{"synopsis":"The content of this game is suitable for all persons.","rating":1},"websites":[{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Brain_Age:_Concentration_Training"},{"category":1,"url":"http:\/\/www.nintendo.co.uk\/Games\/Nintendo-3DS\/Dr-Kawashima-s-Devilish-Brain-Training-Can-you-stay-focused--723315.html"}]}