{"id":780,"name":"Magic Carpet 2: The Netherworlds","slug":"magic-carpet-2-the-netherworlds","url":"https:\/\/www.igdb.com\/games\/magic-carpet-2-the-netherworlds","created_at":1317749092000,"updated_at":1523861550461,"summary":"Magic Carpet 2: The Netherworlds was the follow-up of the successful yet underrated game, Magic Carpet. It fixed many of the design complaints present in the first Magic Carpet. The basic concept of the game remains the same as Magic Carpet, with the player being able to build a castle, collect mana, destroy creatures for their mana and battle rival sorcerers.\n\nIt featured the addition of night-time levels, and underground levels, which not only helped alleviate the repetitiveness of the preceding game, but also accompanied the storyline progression, which was mapped out before each level. Underground levels, however, do not have rival wizards. There are also several secret entrances to reach hidden levels, where the player can gain more spells and experience.\n\nAlso unlike its predecessor, the game proceeded by completing various missions such as reaching checkpoints and destroying specific buildings\/monsters, rather than just simple accumulation of mana.","storyline":"The apprentice's master, who died after unleashing his deadly spell, was being spied upon by the Netherworld's ruler, Vissiluth, who is now intent on conquering the world of the living. It's once again up to this apprentice to stop him, by battling this demon.\n\nThe NPC wizards are now considered to be Vissiluth's lackeys. They are all based in a city just before Vissiluth's seat of power. After the enemy wizards are vanquished, the apprentice takes an underground passage to reach Vissiluth's citadel. After the apprentice destroys the citadel, Vissiluth emerges and the two do battle. Upon emerging victorious, a volcano spews out mana in all different colours.","collection":193,"popularity":1.333333333333333,"aggregated_rating":90,"aggregated_rating_count":1,"total_rating":90,"total_rating_count":1,"games":[4415,47823,17583,68287,12632,36781,28751,28552,36718,27314],"tags":[1,17,268435461,536871138,536871208,536871365,536871378,536871865,536871937,536872195,536872817,536873224,536875052,536875083,536875214,536875531,536875753,536876250,536876986,536877724,536878373,536880854,1073741825],"developers":[14],"publishers":[1],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[226,296,453,466,953,1025,1283,1905,2312,4140,4171,4302,4619,4841,5338,6074,6812,7461,9942],"themes":[1,17],"genres":[5],"first_release_date":810518400000,"platforms":[6,14,13],"release_dates":[{"category":0,"platform":13,"date":810518400000,"region":2,"human":"1995-Sep-08","y":1995,"m":9},{"category":1,"platform":13,"date":812505600000,"region":1,"human":"1995-Oct","y":1995,"m":10},{"category":0,"platform":6,"date":1363046400000,"region":8,"human":"2013-Mar-12","y":2013,"m":3},{"category":0,"platform":14,"date":1363046400000,"region":8,"human":"2013-Mar-12","y":2013,"m":3}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ulwex68lfpbdrcycwxpf.jpg","cloudinary_id":"ulwex68lfpbdrcycwxpf","width":640,"height":817},"esrb":{"rating":3},"pegi":{"synopsis":"The content of this game is suitable for persons aged 7 years and over only.\nIt contains: Non realistic looking violence towards fantasy characters - Pictures or sounds likely to be scary to young children - Non realistic looking violence towards characters which although human are not very detailed.","rating":2}}