{"id":12344,"name":"Tomcat: The F-14 Fighter Simulator","slug":"tomcat-the-f-14-fighter-simulator","url":"https:\/\/www.igdb.com\/games\/tomcat-the-f-14-fighter-simulator","created_at":1441469541998,"updated_at":1515695952368,"summary":"Become a F-14 Naval Aviator undergoing seek and destroy missions while dodging and gunning enemy bogeys in deadly dogfights with your 20mm cannon and air-to-air missiles. \n \nYour cockpit comes with state of the art technology, courtesy of the U.S. Air Force: Display and main computer, Bogey Alert Indicator, G-Force Indicator, Electronic Counter Measures, and a Cannon Overheat Indicator (yes, it can overheat!)...and if your feeling up to it, give the ol'bird a boost to Mach 1.0! \n \nThe gameplay like other simulation games consists of taking off, flying, combat and landing. Though most of the gameplay focuses around dogfighting with enemy bogeys (dodging missiles). In addition to that, there are also night-flying missions that add difficulty due to limited vision. \n \nTaking off and landing however, also requires additional skill as your doing it on the USS Enterprise (No relation to Star Trek), not on your standard airstrip. Pay attention to the F.D. officer as your preparing to take off (since he's the boss when it comes to this stuff...and try not to run over him...yet). \n \nYour weaponry consists of a M 61 Machine Gun and 3 different AIM Missiles (AIM 7, 9, 54) each packed with 15 missiles (that's a lot of missiles!). \n \nAfter each mission you will receive a Mission Rating which is based on your flying skill, number of bogey kill and number of weapons fired.","popularity":1.333333333333333,"games":[44242,34919,18623,19934,22470,29173,19341,25311,26145,22425],"tags":[1,39,268435469,536870948,536872060,536872129,1073741825],"developers":[1731],"publishers":[1000],"category":0,"player_perspectives":[1],"game_modes":[1],"keywords":[36,1148,1217],"themes":[1,39],"genres":[13],"first_release_date":631065600000,"platforms":[60],"release_dates":[{"category":2,"platform":60,"date":631065600000,"human":"1989","y":1989,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qtls4fg4vgs1rlfohojn.jpg","cloudinary_id":"qtls4fg4vgs1rlfohojn","width":600,"height":774}}