{"id":51344,"name":"Airline Tycoon Evolution","slug":"airline-tycoon-evolution","url":"https:\/\/www.igdb.com\/games\/airline-tycoon-evolution","created_at":1500065040161,"updated_at":1540033329793,"summary":"With Airline Tycoon Evolution you manage your own airline company and try to get ahead of your nasty adversaries. To help you do this, you have all the means available to a modern airline company at your disposal. \n \nBuy the aircraft which are already on the market or try your hand as an aircraft constructor. Land some orders and plan your fleet of aircraft in such a way that you are also in a position to offer profitable flights on the bitterly contested global routes network. \n \nIn the struggle for your share price you alone must decide whether to build up a cut-price airline or to put all your energy into an airline with luxuriously kitted-out aircraft. The right advertising will not be an insignificant factor in the question of whether you can push through your ticket prices or whether you will have to adapt to what the market dictates. \n \nIf all your efforts are in vain, you should get hold of some information, because knowledge is power. Find out what your passengers think, and hire the right advisers, who will be only too pleased to help you: for a fat reward, that is. \n \nAirline Tycoon Evolution is the continuation of the Airline Tycoon and Airline Tycoon – First Class games, which have been a worldwide success. Features • High-resolution, fun cartoon graphics and highly detailed animation. • User-friendly and entertaining: holds back on too many dry statistics • Level of passenger satisfaction is shown with the help of animation • Contains adventure, building add-ons and infotainment elements • Total of 30 different missions, in addition free play is possible • You can construct your own aircraft and use them in the game • You can exchange your own aircraft with those of other players over the Internet • The new security features mean you can act to prevent sabotage • Networking support for up to 4 players enables players to sabotage one another directly.","popularity":1.333333333333333,"category":0,"genres":[13],"first_release_date":1034812800000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1034812800000,"region":8,"human":"2002-Oct-17","y":2002,"m":10}]}