{"id":90544,"name":"KickBeat: Steam Edition","slug":"kickbeat-steam-edition","url":"https:\/\/www.igdb.com\/games\/kickbeat-steam-edition","created_at":1520949471092,"updated_at":1532448025909,"summary":"Includes songs from Electronic Super JoySix exclusive tracks from the Electronic Super Joy OST, by indie electronic artist enV, have been added to the single player campaign.  If you enjoyed the Kickbeat soundtrack, be sure to check out Electronic Super Joy, by Michael Todd Games.About the GameFrom indie pioneers Zen Studios (makers of Pinball FX2 and CastleStorm) comes KickBeat, an innovative rhythm game with a Kung Fu theme, featuring fully 3D characters and high-energy music! You can use your own music to create custom KickBeat tracks, allowing you ultimate replayability!New Additions for KickBeat Steam Edition:Six exclusive tracks from the Electronic Super Joy OST by indie electronic artist enV have been added to the single player campaign. There are now 24 tracks in the campaign! Advanced difficulty is now available in Free PlayBeat Your Music mode is available much earlier in the campaign, allowing you to create your own custom tracks without having to complete the single player campaignAdjustments have been made to the difficulty progression, helping players adjust to higher levels of play on a better curveEnhanced graphicsCustomizable keyboard controls + full X input controller support.42 Steam AchievementsStream Trading CardsSteam Cloud SupportThe KickBeat Steam Edition Soundtrack features tracks from a diverse lineup of artists from well known bands such as Pendulum and Marilyn Manson, to indie musicians Celldweller and Blue Stahli, to hidden talents like electronic music producer Voicians and Taiwanese rapper Shen Yi. KickBeat Steam Edition SoundtrackPendulum - Self vs. Self, Propane Nightmares (Celldweller Remix)Celldweller – Switchback, I Can’t WaitMarilyn Manson – The Beautiful PeopleShen Yi – War DancePOD – BoomPapa Roach – Last ResortBlue Stahli – Takedown, Scrape, UltranumbSouthpaw Swagger – It’s ShowtimePre-Fight Hype – It’s Goin DownVoicians – Fighters, The ConstructRob Zombie – Scum of the EarthStyles Beyond – Nine Thou (Grant Mohrman “Superstar’ Remix)Pre-Fight Hype & Southpaw Swagger – Tug-O-WarenV – DestinationenV – RPMenV – VeeenV – ShakestopperenV – OCPenV - BloomBeat Your Music mode features a set of tools allowing players to use their own music to create custom KickBeat tracks. Experiment with different types of music to create different types of fights!We got rid of the bars, arrows, button icons, etc. that other music games rely on as action cues and replaced them with fully 3D animated characters. Instead of just seeing characters in the background moving to a preset script as eye candy while the actual gameplay takes place in an abstract 2D interface, you actually control and react to those 3D characters. That means you actually get to focus your attention on what those characters are doing! As you play the game, you're creating your own fight sequence with your button presses. We also let you get rid of all the other interface parts (such as score) if you like, so that there are no distractions from the action.KickBeat features a full length single player campaign with beautifully hand drawn animations and a unique art style.Media Quotes“KickBeat succeeds as both a rhythm game and a fighting one” – JoyStiq“Combining slick combat with finely tuned rhythm-action fare, KickBeat was so frenetic it even managed to stir me from my early-morning half-awake sate.” – Pocket Gamer“The hand-drawn animation really stands out in this regard and I found myself getting absorbed by the hypnotic flow of the figures moving in and out of the combat area.” – Destructoid","rating":50,"popularity":1.333333333333333,"total_rating":50,"total_rating_count":0,"rating_count":0,"version_parent":7683,"version_title":"Steam Edition","developers":[453],"publishers":[453],"category":0,"game_modes":[1],"themes":[1],"genres":[32],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/djexicvfroopuu43ijxh.jpg","cloudinary_id":"djexicvfroopuu43ijxh","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mtqmqyippvdbjqnjongq.jpg","cloudinary_id":"mtqmqyippvdbjqnjongq","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ark5wtv9qjlegbiuhfcv.jpg","cloudinary_id":"ark5wtv9qjlegbiuhfcv","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/j2db3z3igmsol2zpmok6.jpg","cloudinary_id":"j2db3z3igmsol2zpmok6","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/auizdvhxrddhnjmgwkt1.jpg","cloudinary_id":"auizdvhxrddhnjmgwkt1","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ipuvzno97atwj5i5wgzr.jpg","cloudinary_id":"ipuvzno97atwj5i5wgzr","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ep7771bdvfxgx7k8w3zm.jpg","cloudinary_id":"ep7771bdvfxgx7k8w3zm","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/t5mwaksq4p6izvq5s1u8.jpg","cloudinary_id":"t5mwaksq4p6izvq5s1u8","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/anmlrvv32pcb1nban2qq.jpg","cloudinary_id":"anmlrvv32pcb1nban2qq","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/uh3louiz2xfreciqewnc.jpg","cloudinary_id":"uh3louiz2xfreciqewnc","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oi34dsxi8jtuvgfafpnx.jpg","cloudinary_id":"oi34dsxi8jtuvgfafpnx","width":1920,"height":1080},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/f8xivgsvzdxxn6ou1jfp.jpg","cloudinary_id":"f8xivgsvzdxxn6ou1jfp","width":1920,"height":1080}],"websites":[{"category":1,"url":"http:\/\/kickbeat.com\/"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/255370"}],"external":{"steam":"255370"}}