{"id":112083,"name":"Aftermath 1945","slug":"aftermath-1945","url":"https:\/\/www.igdb.com\/games\/aftermath-1945","created_at":1542151195615,"updated_at":1542598947908,"summary":"The second world war has come to an end but yet no peace has been settled for residing civilians and soldiers in a remote battlefield. Nazi scientists have failed to successfully shut down and contain experimental labs. Experiments have broken from constraint and are now wreaking havoc upon the wasteland. Due to high threat levels, outside support cannot manage to intervene without direct notice, it's up to straggling survivors to take survival into their own hands and unravel the mystery of biological and supernatural haunting's. \n \nSurvival is our co-operative open world experience in development that offers both offline single-player and a host-sessioned online multiplayer experience that allows for up to three friends (or random players) to collectivize and work together to scavenge, loot, support the growth of their outpost and fight to protect its walls in the aftermath together. This living world will give the player endless reasons to explore and interact with such as ongoing open world events ranging from hordes, rescues, and bosses. Players will be able to progress their survivor by leveling a tree of skills and beneficial traits. Survival is where the player will have to put their true strategy to the test by building the ultimate outpost and load-out to take on the aftermath. You build your story. \n \nLike survival, all environmental threats and events are still creeping around every corner, however, the player will be able to approach Quarantine solo or accompany up to three other players as a team against other teams bringing their survival strategies into play. All players start off with minimal firepower and are to work their way up the power scale by scavenging or crafting equipment and weapons with materials found throughout the aftermath. Double your resources by looting your player victims to increase your chances of success in your next battle. Players will be able to build their outposts with a few limitations as well as advance its upgrades for all around defense against player attacks. Quarantine brings a nerve wracking experience as players can lose all of their progress in a blink of an eye. Teams that are fully eliminated are removed from the match entirely. Players who are downed may crawl to safety and be picked up freely by allies. However, if eliminated, your team will need a revival syringe to bring you back into the fight which can be found in rare loot drops and\/or crafted from a lengthy recipe of uncommon materials. The last team standing will be notified and rewarded and given an option to opt out of their current match. Winning teams may stay in their current match if desired and continue their battle against the environment itself.","storyline":"The second world war has come to an end but yet no peace has been settled for residing civilians and soldiers in a remote battlefield. Nazi scientists have failed to successfully shut down and contain experimental labs. Experiments have broken from constraint and are now wreaking havoc upon the wasteland. Due to high threat levels, outside support cannot manage to intervene without direct notice, it's up to straggling survivors to take survival into their own hands and unravel the mystery of biological and supernatural hauntings.","hypes":3,"popularity":3,"games":[55029,32283,81141,83728,78550,89152,22399,55036,79134,16497],"tags":[22,39,536870931,536873337,536874428,1073741826,1073741825],"developers":[16909],"game_engines":[439],"category":0,"player_perspectives":[1,2],"keywords":[19,2425,3516],"themes":[22,39],"platforms":[6],"release_dates":[{"category":7,"platform":6,"human":"TBD"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m55.jpg","cloudinary_id":"sc5m55","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m4y.jpg","cloudinary_id":"sc5m4y","width":680,"height":383},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m54.jpg","cloudinary_id":"sc5m54","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m51.jpg","cloudinary_id":"sc5m51","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m56.jpg","cloudinary_id":"sc5m56","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m53.jpg","cloudinary_id":"sc5m53","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m52.jpg","cloudinary_id":"sc5m52","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m50.jpg","cloudinary_id":"sc5m50","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m4z.jpg","cloudinary_id":"sc5m4z","width":680,"height":337},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m4x.jpg","cloudinary_id":"sc5m4x","width":680,"height":322},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5m4w.jpg","cloudinary_id":"sc5m4w","width":680,"height":319}],"videos":[{"name":"Teaser","video_id":"wPp_Y_ZwyAs"},{"name":"Teaser","video_id":"BnF33vF-jTo"},{"name":"Teaser","video_id":"HUB9TrM5bRs"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1hif.jpg","cloudinary_id":"co1hif","width":249,"height":332},"websites":[{"category":8,"url":"https:\/\/www.instagram.com\/wardbstudios"},{"category":5,"url":"https:\/\/twitter.com\/wardbstudios"},{"category":4,"url":"https:\/\/www.facebook.com\/wardbstudios"},{"category":1,"url":"https:\/\/www.wardb.com\/aftermath1945"}]}