{"id":13183,"name":"Guild Wars 2: Heart of Thorns","slug":"guild-wars-2-heart-of-thorns","url":"https:\/\/www.igdb.com\/games\/guild-wars-2-heart-of-thorns","created_at":1444168005812,"updated_at":1547449959684,"summary":"The first expansion pack for Guild Wars 2. \nJourney deeper into the heart of the Maguuma Jungle to discover new challenges, adventures, and ancient civilizations. Unlock the ability to use the new profession that channels legends from the Mists: the Revenant. Learn new abilities through the account-wide mastery system and further train your characters with new elite specializations to gain access to new weapons, skills, and traits.","storyline":"The story of Guild Wars 2: Heart of Thorns™ takes place in the Heart of Maguuma, the deep jungle where Pact forces crashed on their way to confront the Elder Dragon Mordremoth. Discover the secrets of the Maguuma Jungle, meet the new cultures and races who live there, and explore the vastly vertical maps as you progress your characters through this new region. \n \nThe jungle dragon, Mordremoth, is one of six Elder Dragons that threaten all life on Tyria with their corrupting influence and insatiable hunger for magic. Twisted by Mordremoth, the sylvari Scarlet Briar devastated the city of Lion's Arch and disrupted a magical ley line, awakening the dragon. Now it begins to send its minions, the Mordrem, forth to establish its hold on Tyria—and to bring the sylvari race under its control. \n \nYou'll journey through four of the largest, most diverse and replayable maps ever built in the world of Guild Wars®; maps in Guild Wars 2: Heart of Thorns are designed as three-dimensional volumes rather than traditional flat planes. You'll have more to explore as you travel through the jungle biomes, from the canopy heights to the jungle floor and deep below into the jungle roots.","collection":172,"rating":80.14146844861929,"popularity":9.666666666666666,"aggregated_rating":85,"aggregated_rating_count":2,"total_rating":82.57073422430965,"total_rating_count":17,"rating_count":15,"game":1183,"games":[19698,47823,54775,59427,23651,35450,64061,103303,68393,18398],"tags":[17,268435468,536871208,536871453,536871812,536871818,536872449,536875453,536876544,536877057,536878216,536881345,1073741826],"developers":[255],"publishers":[256],"game_engines":[17,454],"category":2,"player_perspectives":[2],"game_modes":[5],"keywords":[296,541,900,906,1537,4541,5632,6145,7304,10433],"themes":[17],"genres":[12],"first_release_date":1445558400000,"pulse_count":1,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1445558400000,"region":2,"human":"2015-Oct-23","y":2015,"m":10},{"category":0,"platform":6,"date":1445558400000,"region":8,"human":"2015-Oct-23","y":2015,"m":10}],"alternative_names":[{"name":"HoT"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/oycwleirmxfrdb7cvmdj.jpg","cloudinary_id":"oycwleirmxfrdb7cvmdj","width":1440,"height":810},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/fsrtglrmuj7qdupbasvj.jpg","cloudinary_id":"fsrtglrmuj7qdupbasvj","width":1440,"height":810},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nq7fxcfbkqv6ursg1caj.jpg","cloudinary_id":"nq7fxcfbkqv6ursg1caj","width":1440,"height":810},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k3ziienfqegw6ioftcyq.jpg","cloudinary_id":"k3ziienfqegw6ioftcyq","width":1440,"height":810},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/njzdi9vpw65o0lbfswkc.jpg","cloudinary_id":"njzdi9vpw65o0lbfswkc","width":1920,"height":1080}],"videos":[{"name":"Trailer","video_id":"GpeLj-fDK-4"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/anlhng3hrzhyiqjt7r4z.jpg","cloudinary_id":"anlhng3hrzhyiqjt7r4z","width":527,"height":750},"esrb":{"synopsis":"This is a massively multiplayer online (MMO) role-playing game in which players perform quests while exploring the fantastical world of Tyria. Players interact with numerous creatures and characters, perform various tasks, and engage in melee-style combat. Players use swords, firearms, explosives, and magic attacks to battle soldiers and enemy creatures (e.g., minotaurs, giant insects, golems). Skirmishes depict enemies getting shot by arrows, slashed by swords, lit on fire, or struck down by lightning bolts; some underwater attacks result in blood-cloud effects, and stylized blood effects are sometimes depicted in cutscenes. Some sequence depict alcohol use: players can earn achievements by consuming alcoholic drinks—the screen appears blurry to denote drunkenness; in a “drinking competition” mini-game, characters drink ale from mugs—the sequence ends when a challenger's health reaches zero. The words “a*s” and “bastard” can be heard in the dialogue.","rating":5}}