{"id":1483,"name":"Salamander 2","slug":"salamander-2","url":"https:\/\/www.igdb.com\/games\/salamander-2","created_at":1349642512997,"updated_at":1515721520924,"summary":"Like the original Salamander, and as opposed to the Life Force releases, Salamander 2 abandons the selection-bar based power-up system, in favor for a simplified system that focuses on powering weapons up based on specific icons. For example, the player cannot increase his ship speed until a speed icon is picked up; additional speed icons further increase the ship velocity. \n \nSeveral weapons, when additionally upgraded, turn into a 'super' weapon for approximately ten seconds. If the player has the ripple laser, and then gets another icon for it, the player will receive the high-powered Buster ripple for a short period of time. Options have been slightly changed with the arrival of 'option seeds', which are small options that orbit the ship firing only the basic initial shot. Two option seeds can combine into one full option. Moreover, options can also be sacrificed to utilize a short-term homing beam weapon. \n \nSeveral enemy bosses typical to Gradius games return, including the Brain Golem (the first level boss) and the Tetran (the second level boss). There are a total of six levels. Since the game is similar to its prequel, Salamander 2 does not use the Revival Start feature from Gradius (which pushes the player back to a pre-determined checkpoint if a life is lost), many people consider this title to be easier than other titles in the Gradius series due to this. Once the game has been completed, it starts its second-loop at a much higher difficulty. The music is also changed to remixed versions of Salamander's music in some stages. The first player's ship is called Vic Viper while the second player's ship is Super Cobra.","collection":311,"popularity":1.333333333333333,"games":[10209,55038,68287,10212,10213,10211,10210,28029,78770,36950],"tags":[18,268435461,536871078,536871882,536877435],"category":0,"keywords":[166,970,6523],"themes":[18],"genres":[5],"first_release_date":828230400000,"platforms":[52,32,7,38],"release_dates":[{"category":0,"platform":7,"date":836611200000,"region":5,"human":"1996-Jul-06","y":1996,"m":7},{"category":0,"platform":38,"date":1182729600000,"region":5,"human":"2007-Jun-25","y":2007,"m":6},{"category":3,"platform":52,"date":828230400000,"region":5,"human":"1996-Q1","y":1996,"m":3},{"category":0,"platform":32,"date":835142400000,"region":5,"human":"1996-Jun-19","y":1996,"m":6}],"alternative_names":[{"name":"沙羅曼蛇2"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/u55fz8goooprd05tjqty.jpg","cloudinary_id":"u55fz8goooprd05tjqty","width":1516,"height":1802}}