{"id":25683,"name":"StarCraft: Remastered","slug":"starcraft-remastered","url":"https:\/\/www.igdb.com\/games\/starcraft-remastered","created_at":1478703733790,"updated_at":1546861603233,"summary":"StarCraft: Remastered is a reverently crafted modernization of Blizzard Entertainment’s original sci-fi real-time strategy game. StarCraft: Remastered will offer a full graphical overhaul of the original StarCraft and the StarCraft: Brood War expansion, bringing a modern look and feel to the timeless classic with widescreen UHD support for up to 4K resolution.  \n  \nStarCraft: Remastered will include all of StarCraft’s and Brood War’s campaign missions with enhanced storytelling via new comic-book style interludes. While this rejuvenated version of StarCraft is locked and loaded for the modern era, the gameplay and balance have been precisely preserved, for an experience that will feel identical to veteran players.  \n  \n4K Ultra HD Graphics and Upgraded Audio: StarCraft: Remastered will include high-resolution unit models, buildings, doodads, and tilesets, as well as high-fidelity music and sound effects to bring the original game into the modern era, while retaining the classic StarCraft style.  \n  \nSame Timeless Gameplay: The gameplay balance and idiosyncrasies have been painstakingly preserved from the original game. Mutalisk stacking, magic-boxing, unit pathfinding, control-group limitations, and more will all remain intact, allowing veteran players to enjoy playing and watching high-level competitive matches as before.  \n  \nIncludes Original and Expansion Campaigns: Return to the planetary battlefields of the war-torn Koprulu Sector and command the forces of the terran, zerg, and protoss across more than 50 story-driven single-player missions.  \n  \nFall in Love Again: Relive the epic saga of some of gaming’s most memorable and beloved heroes and villains, including Marshal Jim Raynor, Lieutenant Sarah Kerrigan, and Praetor Fenix.  \n  \nEnhanced Storytelling: Original cinematics will be improved to 1080p resolution, while mission interludes and introductions will feature new comic-book style illustrations.  \n  \nBlizzard’s Gaming Network Brings a Bevy of Features: In addition to accurate matchmaking and enhanced ladder functionality, players will also be able to stay in touch with and chat with friends playing other Blizzard games. The classic functionality of named custom games and custom game lobbies will be retained, for the familiarity of long-time StarCraft players.  \n  \nLocalized in 13 Languages: English, German, French, Brazilian Portuguese, Spanish (LatAm), Spanish (European), Polish, Italian, Russian, Korean, Simplified Chinese, Traditional Chinese, and Japanese.","collection":52,"hypes":4,"rating":90.6666666666667,"popularity":4,"aggregated_rating":85,"aggregated_rating_count":3,"total_rating":87.83333333333334,"total_rating_count":9,"rating_count":6,"version_parent":230,"version_title":"Remastered","games":[83844,55029,68,8773,2015,11205,25311,11666,24411,17130],"tags":[18,268435467,268435471,536870915,536871886,536872235,1073741827],"developers":[51],"publishers":[51],"category":0,"player_perspectives":[3],"game_modes":[1,2],"keywords":[3,974,1323],"themes":[18],"genres":[11,15],"first_release_date":1502668800000,"pulse_count":41,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":1502668800000,"region":8,"human":"2017-Aug-14","y":2017,"m":8},{"category":0,"platform":14,"date":1502668800000,"region":8,"human":"2017-Aug-14","y":2017,"m":8}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lnyh6uw0a2l2ivtfvvtb.jpg","cloudinary_id":"lnyh6uw0a2l2ivtfvvtb","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/esedwopebyr1pzd9aoir.jpg","cloudinary_id":"esedwopebyr1pzd9aoir","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gaid2sc8mmwi5pgszmtk.jpg","cloudinary_id":"gaid2sc8mmwi5pgszmtk","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/m194ggvs4d31b3qinlpb.jpg","cloudinary_id":"m194ggvs4d31b3qinlpb","width":1920,"height":1200},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nfynfyb8s5tbfxundnsb.jpg","cloudinary_id":"nfynfyb8s5tbfxundnsb","width":1920,"height":1200}],"videos":[{"name":"Announcement Trailer","video_id":"r6GSwC6dln0"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/olxaetlbkdsagzvd4s4t.jpg","cloudinary_id":"olxaetlbkdsagzvd4s4t","width":528,"height":754},"websites":[{"category":9,"url":"https:\/\/www.youtube.com\/user\/starcraft"},{"category":5,"url":"https:\/\/twitter.com\/starcraft"},{"category":4,"url":"https:\/\/www.facebook.com\/Starcraft"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/StarCraft:_Remastered"},{"category":1,"url":"https:\/\/starcraft.com"}]}