{"id":4083,"name":"Red Faction II","slug":"red-faction-ii","url":"https:\/\/www.igdb.com\/games\/red-faction-ii","created_at":1390521790752,"updated_at":1544047281597,"summary":"Twenty-second century Earth. Five years after the rebellion on Mars. \nFor the last 15 years, Sopot, the corrupt dictator, has oppressed the people of the Commonwealth. His relentless pursuit of unification with the neighboring United Republic has left the country soaked in unnecessary bloodshed and poverty. Propaganda is plastered throughout communities and a Public Information Building, built as a tribute to the self-centered chancellor, spews news broadcasts with claims of victory as more and more soldiers fall victim. Fed up after years on the front lines, a group of super-soldiers injected with nanotechnology vow to replace the dictator and restore peace. \nDefend your country as Alias, a demolitions expert, with the help of your five squad members, each specializing in their own method of destruction. Fight through diverse levels using vehicles, an arsenal of specialized weapons and massive explosives in your rampage to overthrow the government. \n \nRevamped Geo-Mod™ engine — the only FPS with real-time, arbitrary geometry modification \n \nAll new storyline & characters — fight as a member of an elite squad of six \n \nEnhanced graphics and pre-rendered cut scenes for a completely immersive experience \n \nUtilize four varied vehicles in combat including a tank, hover flyer and submarine \n \nAcquire superior firepower from multiple boss battles \n \nFourteen specialized weapons of mass destruction including dual-handed combinations \n \nAll new inventory of useful items - health kits, night vision, numerous grenades and more \n \nStealth, puzzle solving and action oriented objectives \n \nAdvanced AI behavior - AI works in squads and reacts realistically to each combat situation \n \nExperience alternate endings based on style of combat - good or bad \"karma\"","storyline":"On Mars in the year 2080, five years after the events of Red Faction, the nanotechnology developed by Axel Capek, the head scientist of the Ultor Corporation prior to its fall, has been claimed by the Earth Defense Force (EDF). With this technology, the EDF commences a reorganization of the Ultor Corporation with a particular focus on enhanced supersoldiers and suitable weaponry. However, the research that was done by Capek in his laboratories has been consequently stolen by other militant groups and assorted terrorist organizations. This has gone on for years; the research has changed hands in the criminal underworld many times. The player is introduced to their role as an explosives expert (codenamed \"Alias\") as he embarks on a special operations mission to claim the research data for the Republic of the Commonwealth. \n \nEventually, the research is successfully claimed by the elite forces of Victor Sopot, Chancellor of the dystopic military state known as The Commonwealth. Sopot uses the nanotechnology to enhance his already formidable military forces, and successfully creates the first supersoldiers with the research data. However, fearing the potential of his new supersoldiers, he orders them all to be hunted down, executed, and replaced with far less intelligent, mutated horrors known as \"The Processed\". Collectively betrayed by their leader, the player's squad flees underground and ally themselves with the Red Faction as mercenaries. The Red Faction at this point in the story is an organized resistance movement that is strongly opposed to the rule of Sopot and the skewed political tenets of The Commonwealth. The squad eventually pursues Sopot and neutralizes all opposition in their way as the Red Faction takes the conflict to the streets in a joint uprising against the rule of The Commonwealth. During the initial stages of the game, the Red Faction and the squad mutually support each other as they overcome shared objectives such as sabotaging propaganda installations. The uprising culminates in successfully trapping Sopot in his missile silo and executing him. \n \nAlias returns to the makeshift base of operations only to discover that all of the Red Faction resistance members present have been brutally slaughtered. The squad's leader, Molov, remarks that with Sopot dead and with the nanotech research in his possession, the Commonwealth's military forces have voluntarily pledged allegiance to him. He declares Alias and Tangier, a fellow squadmember, to be enemies of the state for supporting the Red Faction. Tangier helps Alias escape, and shortly after fleeing to safety, Alias lends aid to surviving Red Faction members who are defending themselves from the enemy. Alias and Echo, another squadmember, meet up in a secret location to discuss an alternate strategy to stop Molov, and Echo is killed in action during a firefight with Quill, a former squadmember. Tangier radios Alias soon afterward, and the two agree to shut down Molov's commandeered nanotech laboratory located within the colossal statue of Sopot. Inside the laboratory, Alias triumphs over Repta, a former squadmember, and destroys the nanotech laboratory's power generators. Alias's explosives weaken the foundation of the statue and render it unstable. Alias encounters Repta again and once again triumphs over him, causing the energy field within Repta to reach critical mass. \n \nAlias and Tangier meet up and pursue Molov, who is scaling Sopot's statue with the nanotech cell – the culmination of Capek's research – and awaiting extraction from Shrike, Molov's subordinate. Shrike betrays his commanding officer, and Tangier manages to reclaim the nanotech cell from Molov's possession. Molov, desperate to eliminate his enemies, climbs aboard a nearby battle armor and launches a frenzied assault against Alias. Using the destructible environment to his advantage, Alias manages to evade Molov's fire and launches a counterattack that not only kills Molov, but also destroys the statue. As the statue crumbles, Shrike swoops in with his close air support craft to extract Alias. From this point, the story ends in one of four possible ways, depending on the player's Heroics score.","collection":100,"rating":71.0015314216446,"popularity":3,"aggregated_rating":80.5,"aggregated_rating_count":4,"total_rating":75.7507657108223,"total_rating_count":31,"rating_count":27,"games":[495,231,26401,241,1886,3113,5812,5730,7351,316],"tags":[1,18,268435461,268435471,536870913,536870933,536870937,536870981,536871072,536871079,536871365,536871378,536871478,536871835,536871882,536871937,536872039,536872070,536872225,536872234,536872358,536872375,536872439,536872956,536873810,536873973,536874398,536874539,536874694,536874743,536874900,536875056,536875062,536875162,536875171,536875199,536875242,536875257,536875358,536875464,536875483,536875488,536875491,536875531,536875572,536875642,536875804,536875814,536875902,536875910,536875941,536876068,536876181,536876221,536876250,536876261,536876262,536876331,536876364,536876365,536876378,536876391,536876397,536876545,536876569,536876687,536876712,536876857,536876910,536877142,536877173,536877208,536877226,536877234,536877264,536877283,536877286,536877289,536877309,536877537,536877628,536877666,536877740,536877799,536877929,536877938,536877950,536877966,536878002,536878004,536879705,536879707,536879765,536879973,536880223,536880290,536880441,536880639,536880684,536880805,536881514,536882865,536883035,536884207,536884357,536884359,536884917,536885541,1073741825],"developers":[507,2010,505],"publishers":[197,4027],"game_engines":[135],"category":0,"player_perspectives":[1],"game_modes":[1,4],"keywords":[1,21,25,69,160,167,453,466,566,923,970,1025,1127,1158,1313,1322,1446,1463,1527,2044,2898,3061,3486,3627,3782,3831,3988,4144,4150,4250,4259,4287,4330,4345,4446,4552,4571,4576,4579,4619,4660,4730,4892,4902,4990,4998,5029,5156,5269,5309,5338,5349,5350,5419,5452,5453,5466,5479,5485,5633,5657,5775,5800,5945,5998,6230,6261,6296,6314,6322,6352,6371,6374,6377,6397,6625,6716,6754,6828,6887,7017,7026,7038,7054,7090,7092,8793,8795,8853,9061,9311,9378,9529,9727,9772,9893,10602,11953,12123,13295,13445,13447,14005,14629],"themes":[1,18],"genres":[5,15],"first_release_date":1034640000000,"pulse_count":1,"platforms":[45,6,11,21,8],"release_dates":[{"category":0,"platform":45,"date":1337040000000,"region":2,"human":"2012-May-15","y":2012,"m":5},{"category":0,"platform":6,"date":1049846400000,"region":2,"human":"2003-Apr-09","y":2003,"m":4},{"category":0,"platform":8,"date":1034640000000,"region":2,"human":"2002-Oct-15","y":2002,"m":10},{"category":0,"platform":11,"date":1049068800000,"region":2,"human":"2003-Mar-31","y":2003,"m":3},{"category":0,"platform":21,"date":1049068800000,"region":2,"human":"2003-Mar-31","y":2003,"m":3},{"category":0,"platform":8,"date":1037318400000,"region":1,"human":"2002-Nov-15","y":2002,"m":11},{"category":0,"platform":21,"date":1054857600000,"region":1,"human":"2003-Jun-06","y":2003,"m":6},{"category":0,"platform":11,"date":1054857600000,"region":1,"human":"2003-Jun-06","y":2003,"m":6},{"category":0,"platform":6,"date":1056672000000,"region":1,"human":"2003-Jun-27","y":2003,"m":6},{"category":0,"platform":6,"date":1249430400000,"region":8,"human":"2009-Aug-05","y":2009,"m":8}],"alternative_names":[{"name":"Red Faction 2","comment":"Other"},{"name":"红色派系2","comment":"Chinese title"},{"name":"RF2","comment":"Acronym"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zmnabh1mweshqgvcwxa8.jpg","cloudinary_id":"zmnabh1mweshqgvcwxa8","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k1wsjlxinesuaciyoyaj.jpg","cloudinary_id":"k1wsjlxinesuaciyoyaj","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zpmjeix4sqnz1lscenrn.jpg","cloudinary_id":"zpmjeix4sqnz1lscenrn","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o3z5af9v72tp6e9nhvwn.jpg","cloudinary_id":"o3z5af9v72tp6e9nhvwn","width":1024,"height":768},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/nu6loyeoddrdfxjzadtt.jpg","cloudinary_id":"nu6loyeoddrdfxjzadtt","width":1024,"height":768}],"videos":[{"name":"Trailer","video_id":"WqqF-Cak7y8"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/hgiap7tge3b146bv1xhe.jpg","cloudinary_id":"hgiap7tge3b146bv1xhe","width":706,"height":905},"esrb":{"rating":6},"pegi":{"synopsis":"The content of this game is suitable for persons aged 16 years and over only.\r\n\r\nIt contains: Realistic looking violence.","rating":4},"websites":[{"category":1,"url":"http:\/\/www.redfaction.com"},{"category":13,"url":"https:\/\/store.steampowered.com\/app\/20550"},{"category":3,"url":"https:\/\/en.wikipedia.org\/wiki\/Red_Faction_II"},{"category":2,"url":"http:\/\/redfaction.wikia.com\/wiki\/Red_Faction_2"}],"external":{"steam":"20550"}}