{"id":48383,"name":"TwinBee 3: Poko Poko Daimaō","slug":"twinbee-3-poko-poko-daimao","url":"https:\/\/www.igdb.com\/games\/twinbee-3-poko-poko-daimao","created_at":1499965122611,"updated_at":1513003501697,"summary":"TwinBee 3: Poko Poko Daimaō (ツインビー３ ポコポコ大魔王 Tsuinbī Surī?, \"The Great Demon King Poko Poko\") is a vertical-scrolling shoot 'em up video game produced by Konami originally released for the Famicom in 1989. It was the third game in the TwinBee series released for the Famicom, following the home version of the original TwinBee and the Famicom-exclusive Moero TwinBee. Unlike Moero, which was released in North America as Stinger, TwinBee 3 was a Japan-only release. It was re-released on April 14, 2006 as part of the i-Revo downloadable game service. \n \nTwinBee 3 ditches the side-scrolling stages from Stinger and only features top-scrolling ones similar to the original. Moreover, the game lacks the 3-Player mode from Moero, allowing only up to two players. The game is considerably easier than its predecessors due to an option mode that allows players to adjust the difficulty and number of ships, as well as the inclusion of the new \"soul reviving system\", which allows players to recover their power-ups after losing a ship. \n \nThe game uses digitized PCM voice samples, particularly when the conga music in one stage chants \"Poko Poko\", and in the beginning of each stage, in which a voice proclaims the name of the stage.","collection":2830,"popularity":1.666666666666667,"games":[46892,41258,76246,19341,28029,32902,97018,96550,93794,88910],"tags":[268435461],"category":0,"keywords":[166,296,9282],"genres":[5],"first_release_date":625622400000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":625622400000,"region":8,"human":"1989-Oct-29","y":1989,"m":10}],"alternative_names":[{"name":"Twinbee 3: Poko Poko Daimaō","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gzj48gc67udgutu1cewm.jpg","cloudinary_id":"gzj48gc67udgutu1cewm","width":293,"height":400}}