{"id":75983,"name":"Melolune","slug":"melolune","url":"https:\/\/www.igdb.com\/games\/melolune","created_at":1510879023565,"updated_at":1510918170108,"storyline":"You are Achaius, an enthusiastic and kind human boy. At one time, you lived peacefully with your mother, father, older sister, and twin brother Caleigh in a world where people were classified primarily by their inborn professions. After a catastrophic event takes your parents’ lives, you become separated from your twin due to various circumstances. “The Blue Star” focuses on the life of Achaius several years after his separation from Caleigh. \n \nTime has brought you to a village filled with small cat-like creatures with wings and long tails known as Leebles. These creatures have essentially adopted you into their tribe, and you consider them your family. Your two best friends are a Leeble named Aero, and the only other human in the village, Dominic. The three of you work hard to protect the village, and help with everything from gathering food to watching over the young Leebles. Recently, soldiers from the “Ciro Order,” a large faction from the world’s central continent of Ciro have set up camp near the forest. Their presence has been increasingly stressful for the village due to safety concerns and strained resources. After a Leeble child has been critically wounded by a Ciro Soldier, the village chief realizes they will inevitably lose their lives if they don’t relocate. After confessing about his former life as a Ciro soldier, Dominic volunteers to travel back to Ciro’s lands to ask the military council not to hurt the Leeble Village. Achaius and Aero also agree to go. \n \nTogether, Achaius, Aero, and Dominic begin their journey to the continent of Ciro with the purpose of saving the village. All the while, Achaius’ desire to find his twin and understand the meaning behind their separation has been growing stronger. Throughout their travels the group will join up with characters whose lives have also been affected by the Ciro Order, discover conflicts that are affecting their world, and attempt to untangle secrets about their pasts.","popularity":1.666666666666667,"developers":[13902],"game_engines":[334],"category":0,"game_modes":[1],"genres":[32],"first_release_date":1257206400000,"platforms":[6],"release_dates":[{"category":0,"platform":6,"date":1257206400000,"region":8,"human":"2009-Nov-03","y":2009,"m":11}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/gtbwqyri2b59z2pp7cjp.jpg","cloudinary_id":"gtbwqyri2b59z2pp7cjp","width":550,"height":413},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vn9eo1rpjpoxhwojp3mj.jpg","cloudinary_id":"vn9eo1rpjpoxhwojp3mj","width":550,"height":413},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/btzgyht7myb9wz3fvfer.jpg","cloudinary_id":"btzgyht7myb9wz3fvfer","width":550,"height":413},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kpbcj7cjgoffjx4aulbd.jpg","cloudinary_id":"kpbcj7cjgoffjx4aulbd","width":550,"height":413},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/vb6u9vci4hbwcxxe8p2k.jpg","cloudinary_id":"vb6u9vci4hbwcxxe8p2k","width":640,"height":480}],"videos":[{"name":"Trailer","video_id":"N3sxtQE4g1w"}],"websites":[{"category":1,"url":"https:\/\/leebleforest.wordpress.com\/"}]}