{"id":86683,"name":"Yatzy: Classic Dice Game","slug":"yatzy-classic-dice-game","url":"https:\/\/www.igdb.com\/games\/yatzy-classic-dice-game","created_at":1518600223228,"updated_at":1518700988699,"summary":"Yatzy is one of those strange addictions that is better experienced than explained. It's hard to discover what makes rolling those dice over and over again so fun, but it's beyond delight when you finally see those sixes line up. \n\nYatzy is a simple brain game that trains analytical thinking. It's a classic dice game.\n\nThe objective of Yatzy is to score the highest possible score within the 13 rounds of the game. Players roll five dice in order to make the desired combinations, which have different fixed or variable point values. The results of each turn are recorded on a special score sheet.\n\nYatzy is played with five dice. This popular game, lasts for 13 rounds as the players roll the dice and attempt to complete various combinations. The rules of yatzy are simple, and the game remains popular among people of all ages. Simply roll the dice, make your choices and score some points. At the end of the 13 turns, the player with the highest point total wins the game\n\nDo the best dice combination in the this multiplayer Yatzy game. Half of the fun of this game is to yell out the game's name if and when you roll one. A Yahtzee occurs when a player rolls and all five dice are the same number. Rolling five \"sixes\" is the best roll in the game. \n\nSpecial Yatzy rule is, the first time you get a yatzy in a game it is worth 50 points (if you use it in the yatzy slot). If you roll another yahtzee after you have already got the 50 points (i.e., you didn’t take a zero), you will get a 100 point bonus.\n\nThe Yatzy scorecard contains 13 scoring boxes divided between two sections: \n1) Upper section \n2) Lower section\n\nIt is a game of great chance, luck and also of smart thinking and strategy. If you are a Yatzy addict then this is the best game for you.\n\nDownload and play Yatzy and enjoy all the fun strategy elements that come along with this classic dice game.\n\n**** Yatzy Features ****\n\n* Easy to Learn\n* Addictive gameplay\n* Multiplayer Support\n\nPlease rate and give your feedback for Yatzy for further improving the game.\n\nWe will be grateful to hear your opinions and improve - whenever needed - in future versions.","rating":80,"popularity":1,"total_rating":80,"total_rating_count":0,"rating_count":0,"games":[23867,14047,101953,101565,101095,100955,100938,100850,100799,89010],"tags":[536872273,536872843],"category":0,"keywords":[1361,1931],"first_release_date":1513036800000,"platforms":[14],"release_dates":[{"category":0,"platform":14,"date":1513036800000,"region":8,"human":"2017-Dec-12","y":2017,"m":12}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qphjdgzuuucqk2ij2ofq.jpg","cloudinary_id":"qphjdgzuuucqk2ij2ofq","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/laeqalzqkrleh6p2lyfj.jpg","cloudinary_id":"laeqalzqkrleh6p2lyfj","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/jla2cy61exwvsv0vqfjs.jpg","cloudinary_id":"jla2cy61exwvsv0vqfjs","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/slxpp6radkdobklkckqb.jpg","cloudinary_id":"slxpp6radkdobklkckqb","width":800,"height":500},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/k1esddr5tnudbmeg6r1u.jpg","cloudinary_id":"k1esddr5tnudbmeg6r1u","width":800,"height":500}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/p6lzv0ujg7f4coaw1eij.jpg","cloudinary_id":"p6lzv0ujg7f4coaw1eij","width":512,"height":512}}