{"id":11682,"name":"The Dark Eye","slug":"the-dark-eye","url":"https:\/\/www.igdb.com\/games\/the-dark-eye","created_at":1439629071948,"updated_at":1548408925750,"summary":"The Dark Eye is a computer game of the horror genre, released in 1995 for the PC by the now-defunct software company Inscape. Upon its release the game attracted little attention from either critics or consumers, though it has received some attention since and, arguably, cult status.\n\nThe game featured combined 3-D graphics, stop motion animation and video segments. With its unconventional interface, storyline, and characters, the game's peculiarity became its selling point. The characters are largely lifelike in appearance except for their clay-modeled faces, which are often distorted or feature grotesquely exaggerated features. This near-realism, sometimes referred to as the uncanny valley, contributed to the game's ambience of unease and anxiety.\n\nThe character animation is stop-motion. Inscape did the art design of the puppets (lead artist Bruce Heavin) and had a Hollywood house actually make them. Inscape then hired two stop-motion animators and Russell Lees spent many, many hours in a hot, dark warehouse directing the animations. The working hours were from 7 am to 7 pm for about a month. They created computer-generated screenshots of the environments and shot against blue-screen, and they had a director of photography light them to match the environment.\n\nAlso notable was the use of author William S. Burroughs as a voice actor: Burroughs provided not only the voice for the character of Edwin, but also voiceovers of two slide-show sequences illustrating the short story \"The Masque of the Red Death\" and the poem \"Annabel Lee\". Another story, \"The Premature Burial\", can be found while reading the newspaper during \"The Tell-Tale Heart\", and the poem \"To Helen\" can be read while playing the victim in \"Berenice\".\n\nThomas Dolby composed the game's music.\n-------------------\nStructurally, the game was a point-and-click adventure fueled by the macabre stories of Edgar Allan Poe. The player could experience three of the stories (\"The Cask of Amontillado\", \"The Tell-Tale Heart\", and \"Berenice\") from the perspectives of both murderer and victim.\n\nThe game presented no choices to make, no life-or-death decisions, and no points; similar to other point-and-click adventures like Myst, the game simply waited for the player to find the next hotspot or location, at which point another video would play to advance the plot. During the portions that were direct interpretations of Poe's stories, the player was constrained to follow the actions of the stories' characters. The player could carry only one item at a time. Much of the animation in The Dark Eye consisted of QuickTime movies, either full-screen or smaller looping segments framed by a static background.\n-------------------------","storyline":"The plot principally revolves around \"performances\" and recitations of Poe's stories, with a new plotline used as a framing device. The game is divided into a \"realistic\" mode in which the framing plot occurs and a \"nightmarish\" mode in which Poe's stories are reenacted or narrated.\n\nThe game does not specify the year in which it is set, but based on clothing and technology it appears to be in the late 1800s. The player character, whose name is never divulged, is visiting his uncle Edwin. The player first meets Edwin's assistant and then Edwin himself. He later meets Henry, the protagonist's brother, a young businessman who desires the hand of Elise, in marriage. Your character then starts to take ill effects from the paint thinner Edwin was using while painting, and the player character passes out and has a nightmarish dream.\n\nAfter the protagonist wakes, Henry relates his desperate situation: Edwin deeply disapproves of his love for Elise. Another nightmare follows, after which the protagonist encounters Elise, who asks her to give Henry a note. After another nightmare, the player learns that Elise has taken ill. The protagonist sees Henry and gives him Elise's note, then follows him to find that Elise has died. Edwin explains that the ground is too marshy for a proper burial, so Henry, Edwin, and Edwin's Assistant take her body into the basement of the house. Henry requests that a lantern be left nearby in case she revives.\n\nEdwin takes the player aside and states that Henry is mentally unstable. Edwin forges a note from Elise asking Henry meet her on the cliff outside of the house. The protagonist hands it to Henry, who then dashes out of the house. As Henry stands on the cliff, yelling for Elise, an enormous wave hits him. Watching from afar, the player can see that he is unharmed, although Edwin's assistant approaches Henry and starts a scuffle. In the course of the fight, the assistant shoves Henry off the cliff and into the sea.\n\nEdwin lays the blame for all these events upon the player character, causing him to spiral down into a fit of insanity. Upon returning to reality, the protagonist discovers that Elise, still alive, has broken out of her coffin and gouged out her own eyes. This gruesome sight destroys the protagonist's sanity, and the game ends.","popularity":1.333333333333333,"aggregated_rating":54,"aggregated_rating_count":2,"total_rating":54,"total_rating_count":2,"games":[18011,13189,11296,25222,51524,56033,25646,18020,54678,21641],"tags":[19,268435458,268435465,268435487,536871068,536871133,536871876,536871939,536871944,536872032,536872407,536872630,536872631,536872632,536872633,536873889,536875239,536875242,536875243,536875310,536877551,536883868],"developers":[6167],"publishers":[2346,6168],"category":0,"game_modes":[1],"keywords":[156,221,964,1027,1032,1120,1495,1718,1719,1720,1721,2977,4327,4330,4331,4398,6639,12956],"themes":[19],"genres":[2,9,31],"first_release_date":815097600000,"platforms":[6,14],"release_dates":[{"category":0,"platform":6,"date":815097600000,"human":"1995-Oct-31","y":1995,"m":10},{"category":0,"platform":14,"date":815097600000,"human":"1995-Oct-31","y":1995,"m":10}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/esuhiay30mjcy7tivytq.jpg","cloudinary_id":"esuhiay30mjcy7tivytq","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/ojfvi0ctbvfdjejf9uo9.jpg","cloudinary_id":"ojfvi0ctbvfdjejf9uo9","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/radnncsg94zolyhrxgbu.jpg","cloudinary_id":"radnncsg94zolyhrxgbu","width":800,"height":600},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/lrrh1ktquhgkqyxkitnx.jpg","cloudinary_id":"lrrh1ktquhgkqyxkitnx","width":640,"height":480},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/iw5jdynrlbbs3z8etmcd.jpg","cloudinary_id":"iw5jdynrlbbs3z8etmcd","width":800,"height":600}],"videos":[{"name":"Gameplay video","video_id":"TXgNZewhJ4Q"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/zcy5x4tvemgwcnisz3eu.jpg","cloudinary_id":"zcy5x4tvemgwcnisz3eu","width":256,"height":281}}