{"id":53282,"name":"Mafia II: Collector's Edition","slug":"mafia-ii-collectors-edition","url":"https:\/\/www.igdb.com\/games\/mafia-ii-collectors-edition","created_at":1501595013647,"updated_at":1515493947902,"summary":"Born the son of a poor immigrant, Vito is a beaten down Italian American who is trying to secure his piece of the American Dream. Looking to escape the life of poverty that consumed his childhood, Vito is soon swayed by the lure of power and wealth that a life of Organized Crime can bring. A petty criminal his whole life, Vito, along with his childhood friend, Joe, will descend into the world of Organized Crime. Together, they will work to prove themselves to the Mob as they try to make their names on the streets of a cold and unforgiving city. \n \nMafia 2 immerses you in the mob underworld of a fictitious late 1940's \/ early 1950's scenario. The game engages you in a cinematic Hollywood movie experience in a living, breathing city, fusing high-octane gunplay with white knuckle driving and an engaging narrative. \n \nThe Collector's Edition features a collectible SteelBook Casing, access to the in-game downloadable Made Man Pack, an artbook, the Mafia II Orchestral Soundtrack and a map of Empire Bay. \n \nCollector's Edition - Collectible SteelBook Casing - Brushed metallic SteelBook hard case with debossed logo containing two pieces of art featuring Vito and Joe, the stars of Mafia II. Made Man Pack - Free access to in-game downloadable pack that lets you get behind the wheel of two different luxury automobiles modeled after cars from the period. In addition, Vito will look the part with two new made man suits, including a vintage tux. Hardcover Art Book - Get to know the families of Empire Bay with a 100-page photo album-style art book that takes fans through the artistic design process of the game. Mafia II Orchestral Soundtrack - Immerse yourself in Empire Bay's symphonic masterpiece with the Mafia II score recorded by the Prague FILMHarmonic Orchestra on CD.","collection":562,"popularity":1.333333333333333,"version_parent":40,"version_title":"Collector's Edition","games":[37088,47823,16468,1221,23175,36950,26848,59848,59516,24048],"tags":[1,17,22,33,268435461,268435487],"category":0,"themes":[1,17,22,33],"genres":[5,31],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/o0cfhbvy0c3vwfsov6nr.jpg","cloudinary_id":"o0cfhbvy0c3vwfsov6nr","width":1500,"height":856}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/kzmr9vefvt4k37t5h8jo.jpg","cloudinary_id":"kzmr9vefvt4k37t5h8jo","width":1500,"height":1495},"multiplayer_modes":[{"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}