{"id":13514,"name":"Convoy Raider","slug":"convoy-raider","url":"https:\/\/www.igdb.com\/games\/convoy-raider","created_at":1444763455699,"updated_at":1500285492866,"summary":"Your country is at war and as a Captain of a Battleship you must patrol an inner sea to find and destroy aircraft, missiles, ships and submarines. The main playing screen gives you various options and these include three radars, a map screen, status screen and three types of mini-game icons. The three radars are to track either aircraft, ships or submarines and these are represented by a white dot when they are within range. \n \nThe map screen has two maps, one a map of the whole area and the other one showing a closer look at your location. On this screen you can control the speed of your ship and steer it with black dots showing the enemy forces. The status screen shows a profile of your ship and any damage is shown as red and if the whole ship is red then it is damaged and the game is over. \n \nWhen an attack is imminent then a gauge besides one of the mini-game icons turns yellow before turning red and that game can be played. If an aircraft is attacking then the game has you controlling a gun to shoot down the planes viewed from a 1st person perspective. You can move the gun left or right and move it up or down to hit the planes before they drop bombs on your ship. This screen is also used for any missile attack. \n \nIf any convoy's of ships are attacking then you must fire a missile at the convoy by first lining up a sight that keeps moving while a timer counts down. When the time reaches zero and the sight is red then it will hit a ship but if it doesn't turn red then you have missed. \n \nThe final game is when a submarine is attacking and the game switches to a 3D side view showing above and below the water. You control a helicopter above the water while the submarine is below. You can move the helicopter left or right, and in and out of the screen. A cursor of the left of the screen moves up and down and when fire is pressed this drops a depth charge which also stops the cursor and this shows the depth your depth charge will explode.","popularity":1.333333333333333,"games":[9760,76229,28029,100366,72458,43029,17242,14309,14236,13580],"tags":[39,268435461,1073741828,1073741825,1073741827],"publishers":[3212],"category":0,"player_perspectives":[1,3,4],"game_modes":[1],"themes":[1,39],"genres":[5],"first_release_date":567907200000,"platforms":[15,26,25],"release_dates":[{"category":2,"platform":26,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":15,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12},{"category":2,"platform":25,"date":567907200000,"region":1,"human":"1987","y":1987,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dfjfrz7uqhctrlwmavd9.jpg","cloudinary_id":"dfjfrz7uqhctrlwmavd9","width":1000,"height":1291}}