{"id":27014,"name":"FIFA 98","slug":"fifa-98","url":"https:\/\/www.igdb.com\/games\/fifa-98","created_at":1485874502341,"updated_at":1547306074768,"summary":"FIFA: Road to World Cup 98 (commonly abbreviated to FIFA 98) is an association football video game developed by EA Canada and published by Electronic Arts. It was the fifth game in the FIFA series and the second to be in 3D on the 32-bit machines. A number of different players were featured on the cover, including David Beckham in the UK, Roy Lassiter in the USA and Mexico, David Ginola on the French cover, Raúl on the Spanish cover, Paolo Maldini on the Italian and Andreas Möller on the German cover. FIFA 98 was the last FIFA game released for the Mega Drive in Europe.[citation needed] \n \nThe game includes an official soundtrack and had a refined graphics engine, team and player customisation options, 16 stadiums, improved artificial intelligence and the popular \"Road to World Cup\" mode, with all 172 FIFA-registered national teams. No subsequent edition of the FIFA series had attempted to replicate FIFA 98's inclusion of every FIFA national team, up until 2014 FIFA World Cup Brazil which included all 203 FIFA nations that took part in qualifying. With the new graphical improvements, players were able to have individual faces. \n \nFIFA 98 even features many accurate team rosters, including national reserves for national call-up when playing in the round-robin qualification modes. In addition, eleven leagues were featured, containing 189 clubs. The game also featured a popular five-a-side indoor mode and was the first FIFA game to contain an in-game player\/team editor. \n \nFor the first time in a FIFA game, the offside rule is properly implemented. In previous games, when a player was in an offside position doing anything except running, that player was penalised for offside even when the ball was passed backwards. The 32-bit version of FIFA 98 corrects this so that the game would only award a free kick for offside if the ball was passed roughly to where the player in the offside position was.","collection":91,"rating":87.58997941647189,"popularity":2,"total_rating":87.58997941647189,"total_rating_count":21,"rating_count":21,"games":[4643,49195,698,4642,71398,699,4645,4345,704,49300],"tags":[268435469,268435470,536870938,536871049,536872637,536873715,536874813,536875054,536875073,536875138,536875140,536875186,536875271,536875282,536875430,536875433,536875562,536875659,536875749,536875941,536876190,536876259,536876546,536877432,536877491,536877953,536878090,536878109,536878110,536878111,536878112,536878125,536880425,536880441,536880765,536880831,536882361,536886167,1073741828,1073741827],"category":0,"player_perspectives":[3,4],"game_modes":[1,2],"keywords":[26,137,1725,2803,3901,4142,4161,4226,4228,4274,4359,4370,4518,4521,4650,4747,4837,5029,5278,5347,5634,6520,6579,7041,7178,7197,7198,7199,7200,7213,9513,9529,9853,9919,11449,15255],"genres":[13,14],"first_release_date":883526400000,"pulse_count":1,"platforms":[6],"release_dates":[{"category":2,"platform":6,"date":883526400000,"region":8,"human":"1997","y":1997,"m":12}],"videos":[{"name":"Gameplay video","video_id":"84ds3alX5JY"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/awb1xqaon2awaptqc5oq.jpg","cloudinary_id":"awb1xqaon2awaptqc5oq","width":500,"height":435}}