{"id":39414,"name":"Warriors of Fate","slug":"warriors-of-fate","url":"https:\/\/www.igdb.com\/games\/warriors-of-fate","created_at":1498127349188,"updated_at":1515801077522,"summary":"Warriors of Fate is a beat'em up with nine stages. Each contains large mobs including spearman, archers, strongmen, bomb-wielding opponents, and at least one boss. Using two buttons, Attack and Jump, the characters all have standard moves typical of Capcom side-scrollers of the day. \n \nThere is also a variety of weapons in the game which can be picked up. As with most side-scrollers, food is used to replenish health and can be found in various breakable containers in the game level. One notable feature of the game is the ability to summon a warhorse which adds more attacks to the characters, generally involving pole-arms. Most characters are given a special wrestling throw of their own, like in Final Fight and The Punisher. \n \nIn the Japanese version, the game follows Liu Bei's plight in Jingzhou from the Romance of the Three Kingdoms, a history-based novel from China, set in the Three Kingdoms period as Cao Cao sets to invade his lands. In the English adaptation, however, the Three Kingdoms theme was lost, and most names have been changed to names of Mongolian origin.","collection":3556,"popularity":1.333333333333333,"games":[71455,19333,41828,10039,23193,21642,48650,76888,60367,46996],"tags":[268435460,268435481,536870973,536871894,536872211,536873064,536873473,536875198,536875699,536875792,536875891,536876237,536877922],"category":0,"keywords":[61,982,1299,2152,2561,4286,4787,4880,4979,5325,7010],"genres":[4,25],"first_release_date":723168000000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":723168000000,"region":8,"human":"1992-Dec-01","y":1992,"m":12}],"alternative_names":[{"name":"Tenchi wo Kurau II: Sekiheki no Tatakai","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/wuqzt8hdxyybtkk3hmkm.jpg","cloudinary_id":"wuqzt8hdxyybtkk3hmkm","width":222,"height":316}}