{"id":40214,"name":"Kaitei Takara Sagashi","slug":"kaitei-takara-sagashi","url":"https:\/\/www.igdb.com\/games\/kaitei-takara-sagashi","created_at":1498476398568,"updated_at":1516575000287,"summary":"Use the 2-way joystick to direct the boat across the surface of the ocean, then press the button to lower the diver down to the bottom of the ocean while watching out for the sharks swimming across the screen. During this time, you can hold the button to pause the diver's descent and push the joystick in either direction to fire a harpoon at the sharks for 30-300 points apiece. Once the diver has reached the bottom of the ocean, push the joystick in either direction to make him walk towards either of the two treasure caches that are closest to him (the boat will automatically follow his movements at this point). When the diver is directly over a treasure cache, the boat will lower him into it. The amount of points you will receive when you make it back onto the surface of the ocean, which can range from 50-250, will then appear on the screen, and the boat will raise the diver back up to the surface of the ocean. Once again, you can hold the button to pause the diver's ascent, and push the joystick in either direction to fire a harpoon at the sharks. Once you have made it back up to the surface of the ocean, you will have to repeat the entire process for each of the four remaining treasure caches before the game proceeds to the next round.","popularity":1.333333333333333,"games":[34919,36608,16468,23175,59516,28029,40524,55289,68324,25646],"tags":[1,536871315,536875641,536879094,536879177,536879178],"category":0,"keywords":[403,4729,8182,8265,8266],"themes":[1],"first_release_date":318211200000,"platforms":[52],"release_dates":[{"category":0,"platform":52,"date":347068800000,"region":5,"human":"1980-Dec-31","y":1980,"m":12},{"category":0,"platform":52,"date":318211200000,"region":8,"human":"1980-Feb-01","y":1980,"m":2}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/irow6rp9dzkqcobsijfw.jpg","cloudinary_id":"irow6rp9dzkqcobsijfw","width":1080,"height":1080}}