{"id":45514,"name":"Blazing Dragons","slug":"blazing-dragons","url":"https:\/\/www.igdb.com\/games\/blazing-dragons","created_at":1499509222911,"updated_at":1524737532573,"summary":"A video game based on the television series was created for the Sega Saturn and PlayStation consoles. In a twist on the legend of King Arthur, the player controls Flicker, who lives in Camelhot castle and is in love with Princess Flame, but is not eligible to ask for her hand in marriage because he is not a knight. However, the King has announced a dragon tournament, where the winner will not only win the princess but also become the new king. \n \nAs a young Flicker, the player must collect various objects and interact with an eccentric cast of dragon and human characters in order to solve puzzles. The player's overall quest is to become a dragon knight to compete in the grand tournament and win the heart of Princess Flame. However, the player discovers an evil human plot to take over the kingdom by kidnapping the princess. \n \nAs is the case with many other graphic adventure games, the player can never die in the game or reach a point in the game where a puzzle cannot be solved. The humour in the game is heavily influenced by the British comedy of Monty Python (the game starring former Monty Python actor Terry Jones) and thus includes plenty of mild sexual innuendos, and other shenanigans. \n \nWhile the video game leaves open the possibility for a sequel, no sequel for the game was planned.","popularity":1.333333333333333,"games":[25222,18011,24426,60,20342,8762,15911,11367,15537,35371],"tags":[22,27,268435465,268435487,536871063,536871262,536871939,536872328,536873787,536875831,536877295,536883622,536884377],"category":0,"keywords":[151,350,1027,1416,2875,4919,6383,12710,13465],"themes":[22,27],"genres":[9,31],"first_release_date":846720000000,"platforms":[32,7],"release_dates":[{"category":0,"platform":7,"date":846720000000,"region":2,"human":"1996-Oct-31","y":1996,"m":10},{"category":0,"platform":7,"date":846806400000,"region":1,"human":"1996-Nov-01","y":1996,"m":11},{"category":0,"platform":32,"date":849398400000,"region":8,"human":"1996-Dec-01","y":1996,"m":12}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/emzsmchswa3dcpzubokc.jpg","cloudinary_id":"emzsmchswa3dcpzubokc","width":1569,"height":2156}}