{"id":48514,"name":"Deep Dungeon III: Yuushi heno Tabi","slug":"deep-dungeon-iii-yuushi-heno-tabi","url":"https:\/\/www.igdb.com\/games\/deep-dungeon-iii-yuushi-heno-tabi","created_at":1499966583764,"updated_at":1516757925221,"summary":"Deep Dungeon III: Yūshi he no Tabi (ディープダンジョンIII 勇士への旅?, lit. Deep Dungeon III: The Journey to the Hero) is the third installment in the Deep Dungeon series and the first to be released on the Famicom. This is the first Deep Dungeon title to offer the player a world to explore spanning multiple dungeons and multiple towns. It also allows the player to create their own party with up to three companions in addition to the hero character, with a choice of ranger, magician or priest for each character. Though the player can dismiss a character once the game has started, they will only be able to replace that character if they meet another pre-created playable character in one of the dungeons. However, the game will still end as soon as the protagonist \"swordsman\" character is defeated. This game retains the player-adjustable level-up stats from the first game, as well as the feature that removes randomized encounters if the player is at a significantly higher experience level than needed for their current location. One exclusive and rather annoying feature of this game engine is that sometimes the player character will fumble (remove) their equipped weapon, wasting that character's turn. If the player wishes to re-arm their weapon, it will cost the player another turn. This is the only game in the series to award the player money (Gold) when defeating enemies. All other games will force the player to re-enter maps to collect respawning chests for money or items (for resale) if they want to gold farm.","collection":3383,"popularity":1.333333333333333,"games":[26766,36926,12632,36534,18398,19698,47823,17583,25300,55092],"tags":[268435468,536871208,536871501,536871599,536871938,536872425,536875075,536875242,536875472,536875735,536877554],"category":0,"keywords":[296,589,687,1026,1513,4163,4330,4560,4823,6642],"genres":[12],"first_release_date":579484800000,"platforms":[18],"release_dates":[{"category":0,"platform":18,"date":579484800000,"region":5,"human":"1988-May-13","y":1988,"m":5},{"category":0,"platform":18,"date":582163200000,"region":8,"human":"1988-Jun-13","y":1988,"m":6}],"alternative_names":[{"name":"Deep Dungeon 3","comment":"Other"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/dsfamcuopteb3edrh0uw.jpg","cloudinary_id":"dsfamcuopteb3edrh0uw","width":579,"height":800}}