{"id":5514,"name":"Mystery Case Files: Dire Grove","slug":"mystery-case-files-dire-grove","url":"https:\/\/www.igdb.com\/games\/mystery-case-files-dire-grove","created_at":1394050493584,"updated_at":1545970143554,"summary":"Mystery Case Files: Dire Grove is an interactive movie puzzle adventure game developed by Big Fish Studios, and distributed by Big Fish Games. It is the sixth installment in the Mystery Case Files series. The game is available exclusively at Big Fish Games website. The Mystery Case Files franchise is the number one brand in casual games and has sold more than 2.5 million units to date.","storyline":"This story takes place directly after the events in Mystery Case Files: Return to Ravenhearst. The player is driving through a decrepit town called Dire Grove, which appears to be deserted. The weather forecast has predicted a heavy snowstorm and the player has no other option but to explore the deserted town for shelter. The player sees an abandoned car and finds a camcorder in it. The footage shows a teenaged girl crying and pleading the player to save them. The player also finds a cryptic note: \"She is real. The legend is real.\".\nAs the player explores the surrounding, they realize that all the villagers have evacuated due to the snowstorm, so the player has to do everything by themself. The player learns that the girl in the footage is Alison Sterling, a collegiate who has chosen the Celtic legend of the Banshee as a subject for research. She arrived here with 3 friends and all four of them are missing. The player also learns that Dr. Patricia Anderson, an archaeologist had unearthed some relics only some days ago.\nThe player eventually learns about the legend of the Banshee. Apparently a farmer, a fisherman, a hunter and a blacksmith performed a ritual 1000 years ago to open a portal to talk to their kin in the spirit world. When the dead started attacking the living, they offered a young woman to appease the ghosts and close the portal. This woman became the Banshee and is trying to come back. The player also find that all the students have been subdued and hypnotized by the Banshee. Dr. Anderson's recording proves that the relics unearthed by her are maybe the keys to the portal.\nThe player is left with only one option: open the portal and send the Banshee back to the spirit world. Only after opening the portal the player realizes that the Banshee has tricked them into freeing her spirit. The player races against time, trapping the Banshee's spirit again and saved the students. In the end, Alison gives a lecture about the events at Dire Grove, where she is given by a big applause by a huge number of audience, including her friends. An audience member asks her about your identity, but she says: \"That person has asked to remain nameless, but I can give you their business card.\"\nShe flashes a card, and a Mystery Case Files logo is seen and the credits start rolling.","collection":747,"rating":91.0112359550562,"popularity":2,"total_rating":91.0112359550562,"total_rating_count":5,"rating_count":5,"games":[25222,18011,56033,20342,24426,54678,26223,20329,55173,65503],"tags":[268435465,268435487,536871939,536873787,536875046,536875429,536876663,1073741827,1073741825],"developers":[2452],"publishers":[2245],"category":0,"player_perspectives":[1,3],"game_modes":[1],"keywords":[1027,2875,4134,4517,5751],"genres":[9,31],"first_release_date":1259107200000,"platforms":[6,39,14,37],"release_dates":[{"category":0,"platform":37,"date":1397088000000,"region":1,"human":"2014-Apr-10","y":2014,"m":4},{"category":0,"platform":37,"date":1396483200000,"region":2,"human":"2014-Apr-03","y":2014,"m":4},{"category":0,"platform":6,"date":1259107200000,"human":"2009-Nov-25","y":2009,"m":11},{"category":1,"platform":14,"date":1267401600000,"human":"2010-Mar","y":2010,"m":3},{"category":0,"platform":39,"date":1321488000000,"human":"2011-Nov-17","y":2011,"m":11},{"category":2,"platform":37,"date":1419984000000,"human":"2014","y":2014,"m":12}],"alternative_names":[{"name":"MCF: Dire Grove"}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/tzqudrgsbk2v0vm64ul4.jpg","cloudinary_id":"tzqudrgsbk2v0vm64ul4","width":400,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/isiah4fpq12cd5razlda.jpg","cloudinary_id":"isiah4fpq12cd5razlda","width":400,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/srdyaldowefcqhkokjli.jpg","cloudinary_id":"srdyaldowefcqhkokjli","width":400,"height":512},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/rs4a5orhfvk9aoo3nxix.jpg","cloudinary_id":"rs4a5orhfvk9aoo3nxix","width":400,"height":512}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/mqydanntyoxuu6mlokie.jpg","cloudinary_id":"mqydanntyoxuu6mlokie","width":250,"height":111},"esrb":{"rating":4},"websites":[{"category":1,"url":"http:\/\/www.mysterycasefiles.com\/"}]}