{"id":8414,"name":"SkyNET","slug":"skynet","url":"https:\/\/www.igdb.com\/games\/skynet","created_at":1419982823291,"updated_at":1534356485066,"summary":"SkyNET is Bethesda's last game based on the Terminator franchise. Originally developed as an expansion pack to Terminator: Future Shock, SkyNET eventually became its own standalone product. Its major features are an updated version of the Xngine allowing for play in the sharper 640x480 resolution (and the ability to update Future Shock to the same), a new single-player campaign, and a new multiplayer deathmatch component. \n \nIn the single-player game, you must stop the machines from launching a recovered nuclear weapon. The story takes place over seven missions broken into various sections and \"levels,\" with night progressing into daylight as the game goes on. The locations are also more varied and interactive than those featured in the first game, with levels like the basement of the Cyberdyne building, and a sinking nuclear submarine. Driving and flying levels return from Future Shock, as do the mission briefings, which are now handled entirely in FMV. The game seems to act as a prequel to Future Shock, with the most advanced technology and player weapons from that game not appearing in the course of the single-player missions in SkyNET. \n \nThe multiplayer game allows for eight players over a LAN and two over IPX. The levels are contained recreations of sections or ideas in the single-player game, like a block of cityscape, a shattered freeway, or an open valley, and many can be played at either dawn or dusk. Vehicles are available in most levels, and unlike in single-player, can be entered and exited freely. You also have the option to play as a Terminator, with reduced movement speed, a little more toughness, and the classic red-tinted vision with information overlays.","collection":4129,"franchise":248,"franchises":[248],"popularity":1.333333333333333,"games":[68287,27011,36950,27314,27208,27186,142,673,509,37016],"tags":[1,18,268435461,536870981,536871365,536871378,536871835,536871882,536871937,536872009,536872179,536873999,536874947,536875242,536875483,536875492,536875572,536876028,536877443,536879870,536885929,1073741825],"developers":[28],"publishers":[28],"game_engines":[92],"category":0,"player_perspectives":[1],"game_modes":[1,2],"keywords":[69,453,466,923,970,1025,1097,1267,3087,4035,4330,4571,4580,4660,5116,6531,8958,15017],"themes":[1,18],"genres":[5],"first_release_date":832896000000,"platforms":[13],"release_dates":[{"category":0,"platform":13,"date":832896000000,"region":2,"human":"1996-May-24","y":1996,"m":5},{"category":2,"platform":13,"date":851990400000,"region":1,"human":"1996","y":1996,"m":12}],"alternative_names":[{"name":"The Terminator: SkyNET","comment":"European title"}],"videos":[{"name":"Trailer","video_id":"Lj6adjtUmdE"}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/qzesffxej8rvvb8n2gaa.jpg","cloudinary_id":"qzesffxej8rvvb8n2gaa","width":600,"height":721},"esrb":{"rating":6}}