{"id":92814,"name":"Striker '95","slug":"striker-95","url":"https:\/\/www.igdb.com\/games\/striker-95","created_at":1521205066375,"updated_at":1547501511670,"summary":"Striker ’95 is the another entry in the popular Striker series. However, this sequel manages to improve on its predecessors almost in every area by featuring a more fluid and friendly gameplay, an expert in-match commentary or the customization support to edit the teams’ default settings. It also has FMV clips. \n \nFirst you’ll get a lot of choices in the main menu. You can decide you if you want to play a Friendly match (for a short game), Practice (the best way for rookies to learn how to play), and competitions (where you get different options, like Championship, league, Knockout and world cup). \n \nIn the main menu you also have the options to edit teams! Yes you can edit your country name, and can put in your favorite names for the players on your team, an option that very few games offered at that time. You can also change the colors of your team’s uniforms, and choose the best tactic (to play in a 4-2-2 or 3-5-2 formation and such). You can even change the face of your players. Fantastic, isn’t it?! And another great option of this game is that all players have their unique statistics. But the possibilities don’t end here. You even get to choose between an indoor and a traditional outdoor tournament. The indoor tournaments (as you may know) are actually a whole different game of soccer. The ball can never be out of the field, your players run faster, and there are many more differences that make separate this game from the traditional game. \n \nYou can play with comments, like the British style that you can see on TV, and with or without music. You can define the time for every match (it can be between 2 and 10 minutes) and you can play either with the keyboard, or with a joystick. \n \nThe graphics are good for the time of game’s release, at the same style is similar to Vr Soccer, they use a 3D environment, that gives you more realistic movements of the players, which gives a more realistic feel while playing soccer. This game also has an option for two players, playing in the same team or one against the other. The music is good, but after a while it can get too repetitive, but since this is a soccer game you can turn the music off.","collection":2381,"popularity":1,"games":[100359,106814,103377,18681,15851,3134,4648,2484,30830,701],"tags":[268435470,536870938,536870939,1073741826,1073741828,1073741827],"developers":[543],"publishers":[2346],"category":0,"player_perspectives":[2,3,4],"game_modes":[1],"keywords":[26,27],"genres":[14],"first_release_date":796608000000,"platforms":[13],"release_dates":[{"category":3,"platform":13,"date":796608000000,"region":8,"human":"1995-Q1","y":1995,"m":3}],"screenshots":[{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5xll.jpg","cloudinary_id":"sc5xll","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5xlk.jpg","cloudinary_id":"sc5xlk","width":640,"height":400},{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/sc5xlj.jpg","cloudinary_id":"sc5xlj","width":640,"height":400}],"cover":{"url":"\/\/images.igdb.com\/igdb\/image\/upload\/t_thumb\/co1imr.jpg","cloudinary_id":"co1imr","width":300,"height":379},"multiplayer_modes":[{"platform":13,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":true,"dropin":false,"offlinemax":2},{"platform":13,"offlinecoop":false,"onlinecoop":false,"lancoop":false,"campaigncoop":false,"splitscreenonline":false,"splitscreen":false,"dropin":false}]}